{"appId":"w:ABB.i_busTool","appShortcutName":"i-bus Tool","appDisplayName":"i-bus Tool","authorId":"w:winget","releaseTagName":"winget-1.9.56.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://library.e.abb.com/public/f90ee553e01949d8b29f66bd73baf8df/i-bus%20Tool%201.9.56.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A professional service tool for KNX system integrators and installers\n\nThrough the i-bus® Tool, ABB provides a fully innovative software concept for supporting KNX system integrators. The i-bus® Tool accesses an ABB KNX device via a standardized KNX interface (USB, IP) with the assistance of the physical address. The integrator can trigger the desired functions, read values, simulate states and make settings for the connected device. Internal information and states of the device hardware and applications, which were not available to the integrators or only available after considerable effort, are now available in a transparent manner and can be specifically retrieved and partly influenced. The information from status bytes can, for example, be represented as plain text. An important principle is that no divergences to the ETS project can result through the i-bus® Tool.\nThe supported KNX IP devices can be accessed via the IP network, and it's possible to use functions such as Discovery, Firmware Update, etc.\nABB provides a unique user interface within the i-bus® Tool, a so-called plug-in, for every supported device. The device-specific information is displayed via this user interface and the required settings can be made.\nThe i-bus® Tool is being expanded continuously with new functions and supported devices. The expansions are automatically made available by an online update and can be installed as required.\nThe i-bus® Tool is optional, i.e. the ABB i-bus® KNX devices can still be commissioned using just the ETS.\nThe i-bus® Tool is free of charge and can be downloaded at http://www.abb.com/knx.\nWhen the i-bus Tool is connected to a KNX device, the device-specific plug-in displays the functions that are possible for this device type.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.9.56.0","version":0,"site":"https://global.abb/","source":"ABB","license_or_tos":"Proprietary","resources":null,"verified":false}