{"appId":"w:AdGuard.AdGuard","appShortcutName":"AdGuard","appDisplayName":"AdGuard","authorId":"w:winget","releaseTagName":"winget-7.22.5257.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"AdGuard is a unique adblock program for Windows that has all the necessary features for the best web experience.\n\nAdGuard is a unique desktop program that has all the necessary features for the best web experience.\nThe software combines the world's most advanced ad blocker for Windows, a whole privacy protection module, and a parental control tool — all working in any browser or app.\nThis is one of those moments where a patch deserves the same attention as a full release: v7.22.4 introduces SockFilter, a new, experimental lightweight network driver for AdGuard for Windows. While still far from perfect (you will probably find a few bugs here and there), we’re confident in its potential to make AdGuard better in the future.\nWhy introduce a new driver at all?\nUntil now, AdGuard for Windows relied mostly on a WFP driver. WFP is powerful, but it also comes with complexity, compatibility challenges, and stability issues.\nThe TDI driver used to be an alternative, and while it is still available, it’s an outdated solution and may lead to filtering issues in some versions of Google Chrome. A temporary workaround exists, but it’s not a reliable long-term solution.\nThe conclusion was simple: it was time for a change. That’s why we’re introducing SockFilter — it brings a different approach that works especially well for ad blocking, plus it’s the solution we’ve been waiting for to finally put these problems behind us.\nThe advantages of SockFilter\nWhen fully tested and implemented, SockFilter has the potential to bring several advantages over other drivers. Right now, it’s still experimental and unstable, so you might not see all the benefits yet. But here’s a look at what’s possible in the future:\nBetter interaction with other network apps: SockFilter is designed to cooperate smoothly with VPNs, firewalls, and antivirus software. By avoiding clashes over network control, it can help prevent connection issues and make everything work together more reliably.\nLower risk of system crashes: SockFilter works in a safer part of Windows networking, which can help it avoid deep system errors that can sometimes cause sudden blue-screen crashes. In practice, this can result in better stability and fewer chances of your system unexpectedly crashing while AdGuard is running.\nOn track for better stability: SockFilter works closer to how apps normally use the Internet, instead of dealing with low-level network data, resulting in the potential to reduce complexity behind the scenes and making AdGuard more reliable in everyday use.\nKnown issues\nSo far, a small number of users have reported an issue with SockFilter: the new driver appears to interfere with voice and video calls on Discord. The problem was described on GitHub.\nOur QA team has successfully reproduced the issue and is actively working on a fix. If you notice any related problems or have additional details to share, please let us know. Your feedback helps us resolve this faster.\nHow to start using it\nOther issues may appear when using SockFilter, after all, Experimental mode means that it’s ready for testing and that there may be bugs. We’d love your help in finding them!\nTo test it, go to Settings → Network → Traffic filtering, enable traffic filtering, and select SockFilter (Experimental) from the list of available options. If you notice anything unusual, unexpected, or just plain broken, you can switch back to TDI or WFP at any time. In that case, please report the issue on GitHub — your feedback directly helps shape the future of AdGuard for Windows.\nChangelog\nImprovements\nAdded SockFilter driver #5780","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.22.5257.0","version":0,"site":"https://adguard.com/","source":"Adguard Software Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}