{"appId":"w:ADInstruments.LabChart.Extension.NICO","appShortcutName":"ADInstruments Non-Invasive Cardiac Output","appDisplayName":"ADInstruments Non-Invasive Cardiac Output","authorId":"w:winget","releaseTagName":"winget-1.1.0400","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Non-Invasive Cardiac Output Add-On enables real-time estimation of Cardiac-Output from an NIBP (Non-Invasive Blood Pressure) channel.\n\nThe Non-Invasive Cardiac Output Add-On enables real-time estimation of Cardiac-Output from an NIBP (Non-Invasive Blood Pressure) channel. It implements published and widely accepted algorithms and can estimate the following parameters: CO (Cardiac Output), SV (Stroke Volume) and TPR (Total Peripheral Resistance).\nIt requires an ADInstruments or FMS NIBP device (such as the INL382 Human NIBP Nano System).\n- Added a new ‘Apply finger pulse correction’ option to the setup. This applies a low-pass filter to attempt to compensate for amplification of peak pressure as the pulse propagates down the brachial artery to the finger. This, along with other improvements in the algorithm, results in significantly larger estimated Cardiac Output values. Note: Non-Invasive Cardiac Output is still best suited to relative Cardiac Output measurements on the same subject rather than absolute measurements across subjects.\n- The ‘Find from ECG Signal’ beat detection option has been removed because any delay between the EGC events and the NIBP signals would affect the results.\n- Fixed an issue where the Total Peripheral Resistance calculation failed to produce valid data.\n- The Liljestrand and Estimated Flow calculations now produce correct results in files containing data sampled at different rates.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.0400","version":0,"site":null,"source":"ADInstruments","license_or_tos":"Proprietary","resources":null,"verified":false}