{"appId":"w:aelassas.Servy","appShortcutName":"Servy","appDisplayName":"Servy","authorId":"w:winget","releaseTagName":"winget-6.8","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/aelassas/servy/releases/download/v6.8/servy-6.8-x64-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Servy lets you run any app as a native Windows service with full control over working directory, startup type, process priority, logging, health checks, pre-launch scripts and parameters.\n\nServy lets you run any app as a native Windows service with full control over the working directory, startup type, process priority, logging, health checks, environment variables, dependencies, pre-launch and post-launch hooks, pre-stop and post-stop hooks, and parameters. It's designed to be a full-featured alternative to NSSM, WinSW, and FireDaemon Pro.\n\nServy is digitally signed using a trusted code-signing certificate provided by the SignPath Foundation. This ensures that all Servy executables and installers are verified and secure, giving you peace of mind when using the tool.\n\nServy offers a desktop app, a CLI, and a PowerShell module that let you create, configure, and manage Windows services interactively or through scripts and CI/CD pipelines. It also includes a Manager app for easily monitoring and managing all installed services in real time. The service dependency tree visualization is the cherry on top for enterprise users who manage complex stacks where the order of failure matters.\n\nFeatures:\n- Clean, simple UI\n- Monitor and manage all installed services with Servy Manager\n- Real-time CPU and RAM monitoring with live performance graphs for installed services\n- Real-time service stdout and stderr output preview in Servy Console\n- Service dependency tree visualization with status indicators\n- CLI and PowerShell module for full scripting and automated deployments\n- Run any executable as a Windows service\n- Set service name, description, startup type, priority, working directory, environment variables, dependencies, and parameters\n- Environment variable expansion supported in environment variables, process parameters, process paths and startup directories\n- Run services as Local System, local or domain accounts, Active Directory accounts, or gMSAs\n- Redirect stdout/stderr to log files with automatic size-based and date-based rotations\n- Run pre-launch hook before starting the service, with retries, timeout, logging and failure handling\n- Run post-launch hook after the application starts successfully\n- Run pre-stop and post-stop hooks before the application stops and after the application stops\n- Supports Ctrl+C for command-line apps, close-window for GUI apps, and force kill if unresponsive\n- Prevent orphaned/zombie processes with improved lifecycle management and ensuring resource cleanup\n- Health checks and automatic service recovery\n- Browse and search logs by level, date, and keyword for faster troubleshooting from Servy Manager\n- Export/Import service configurations\n- Service Event Notification alerts on service failures via Windows notifications and email\n- Compatible with Windows 7-11 x64 and Windows Server editions\n\nWho is it for?\n- Developers: Run development servers, scripts, or custom tools as services without extra setup.\n- Sysadmins & IT professionals: Ensure critical background processes stay alive, monitored, and properly logged.\n- Teams or organizations: Automate background services reliably across multiple machines.\n- perf(core): optimize encryption with modern high-performance crypto APIs\n- perf(manager): optimize Services tab performance\n- perf(manager): move console log sorting off the UI thread\n- fix(desktop): improve layout sizing on small displays\n- fix(desktop): update pre-launch help text and clarify pre-launch and pre-stop timeouts\n- fix(manager): set minimum width for Select All column\n- fix(dev): correct wrapper service path resolution in Debug mode\n- chore(deps): update dependencies\n- docs(wiki): add Kopia service sample to Examples & Recipes docs (#41)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.8","version":0,"site":"https://github.com/aelassas","source":"Akram El Assas","license_or_tos":"MIT","resources":null,"verified":false}