{"appId":"w:AGSProjectTeam.AdventureGameStudio","appShortcutName":"Adventure Game Studio","appDisplayName":"Adventure Game Studio","authorId":"w:winget","releaseTagName":"winget-3.6.2.14","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Adventure Game Studio (AGS) provides the tools to make your own adventure, for free!\n\n\nThis is a 3.6.2 Patch 4.\nEditor:\n- Make Font's OutlineFont property provide a drop-down list with fonts.\n- Restrict Room's BackgroundAnimationDelay property to a range of 0-255 (engine's limitation).\n- Fixed Character's animating preview not updating if a View is being edited at the same time.\n- Fixed Font preview scrolling too far down, and sometimes causing some letters to cut off.\n- Fixed View Editor reacting to shortcuts such as F or Delete when the input focus is set to a selected Frame's properties.\n- Fixed Editor reporting \"the script name in use\" errors for Room Objects and Hotspots that don't have any script name set.\n- Fixed Editor Preferences resetting Android JDK and SDK path if one was typed or pasted directly into the text box rather than selected using a Folder browse dialog.\n- Fixed Editor displaying an \"unhandled exception\" if an older file cannot be deleted while rebuilding the game. Should be recording such error and display as a regular message box or in the output panel.\nEngine:\n- Returned \"Linear\" filter for Software renderer. It was temporarily cut during development of version 3.6.0, but we forgot to bring it back.\n- Do not enable \"infinite FPS mode\" if game script calls SetGameSpeed with a value 1000 or higher.\n  The problem is that the script API does not have any means to turn this mode off, so game will be stuck in \"maxed FPS\". The remaining method is Ctrl+E hotkey used to toggle \"infinite FPS\" if the game is run with \"--fps\" command line argument.\n- Do not apply disabled effect on a Button which runs a blocking animation. Also do not hide its parent GUI if game options tells that GUIs should be hidden when the interface is disabled.\n- Changes to the current room's masks will now be remembered in game saves.\n  (This only refers to he current room; the mask changes are still reset when player leaves the room, just like the changes to room backgrounds.)\n- Dynamically update debug overlay with a room mask on it if a room mask is being drawn upon.\n- Do not quit if failed to run PlaySilentMIDI(), log a warning instead.\n- Do not try animating a cursor if the assigned view is invalid or contains no frames in loop 0.\n- Don't log warnings for File.Exists and Game.GetSaveSlotDescription when a file was not found, as these functions are meant to test a file existence.\n- Fixed engine's general misbehavior occuring if any Character, GUI or AudioClip does not have any ScriptName assigned.\n- Fixed \"Box Out\" room transition not using a color set with SetFadeColor() when running with a Software renderer (this behavior was implemented in 3.6.2).\n- Fixed room background animation running too fast if the BackgroundAnimationDelay was set to a value > 127.\n- Fixed Character.FaceDirection() and similar commands not resetting idle state.\n- Fixed Character.WalkStraight for games with legacy \"low-res\" coordinates setting.\n- Fixed severe performance drop when dialog options are displayed (regression in 3.6.2).\n- Fixed dialog options were rendering twice per game frame (this did not cause any graphical glitches, but could cause extra performance issues).\n- Fixed that room objects may not get drawn during dialog options if they are started right at entering the room, and running game loops is disabled when options are shown.\n- Fixed video playback in Software renderer mode displaying frames in a wrong order.\n- Fixed PlayVideo() does not clear the screen before playing a video in Software render mode, which could result in having traces of previous scene staying on screen.\n- Fixed a DynamicSprite not updated on screen after CopyTransparencyMask() call (except when running with a Software renderer).\n- Fixed that disabled Buttons may not have their looks updated if GUI disabled style was changed in script (\"OPT_WHENGUIDISABLED\").\n- Fixed wrong text color used for a speech with \"Sierra with background\" style when no GUI is assigned as a text window and speech is displayed in a standard box.\n- Fixed automatic font outline could miss some pixels around the first and last letter of the text string if the font's glyphs contain pixels with negative offsets.\n- Fixed Overlays with the matching z-order not always sorted in the order of their creation (regression in 3.6.2).\n- Fixed SeekMIDIPosition() and GetMIDIPosition() crashing the game if a \"silent MIDI\" is playing.\n- Fixed NumPad key presses doubling up when NumLock is on in a \"old key-handling mode\".\n- Fixed Wait(0) call still suspending the game until the next update, should exit instantly.\n- Fixed WaitInput() with infinite timeout suspending forever in a skipped cutscene.\n- Fixed wrong palette used when loading secondary 8-bit backgrounds in a 16/32-bit game.\n- Fixed that \"unhandled_event\" would be called only starting with the second object interaction if that object has a function name assigned for that interaction, but the actual function is not found in script.\n- Fixed that \"interface_click\" not getting called if a GUI click event's function is missing in a designated script module, but is present elsewhere (although that function will be never run).\n- Fixed mouse clicks could stop working after a call to a InventoryScreen() function, if player character does not have any items.\n- Fixed Software renderer could potentially crash when the sprite cache reaches its limit and there's an overlay displayed on screen.\n- Fixed a \"division by zero\" crash occuring when the engine is precaching a View without frames.\nCompatibility:\n- If PlayVideo() is used to play a non-OGV file, then engine will lookup to a OGV file of the same name to play instead. This is made to let game authors or players of old games to convert wmv/avi video assets to ogv without recompiling game scripts.\n- Fixed loading games made by v2.56 editor which contain custom properties.\nPlugins:\n- Fixed a crash in AGSBlend plugin, occuring if DrawSprite function was called with transparency parameter = 100 (fully transparent).","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.6.2.14","version":0,"site":"https://www.adventuregamestudio.co.uk/","source":"AGS Project Team","license_or_tos":"Artistic License 2.0","resources":null,"verified":false}