{"appId":"w:AGSProjectTeam.AdventureGameStudio","appShortcutName":"Winget Application","appDisplayName":"Adventure Game Studio","authorId":"w:winget","releaseTagName":"winget-3.6.1.32","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Adventure Game Studio (AGS) provides the tools to make your own adventure, for free!\n\n\nThis is a 3.6.1 Patch 10.\nEditor:\n- Fixed a check for an imported room mask size did not correctly account for the room's mask resolution setting (it worked, but mishandled some edge cases).\n- Fixed exceptions occuring when reimporting a sprite or a audio clip from source, if the source filename string was wrapped in double quotes.\n- Fixed script variables generation could sometimes produce a non-latin character in a variable name if the Editor is running on a system with non-English current locale.\n- Fixed '\\n' linebreaks not saved correctly in dialog option strings.\n- Fixed translation compiler mistreating escaped opening bracket in a text line (\"\\[\");\nit must keep it as-is, because \"[\" char is a old-style line break in AGS.\n- Fixed LogPanel not applying filter settings right after they were changed.\nEngine:\n- Fixed a AudioChannel did not report a correct Position right after a AudioClip.PlayFrom() call.\n- Fixed Button resizing to sprite 0 size if NormalGraphic is set to 0 (default button look).\n- Fixed Character movement recalculation when changing move speeds while walking, and movement path contains 45-degrees diagonal segments.\n- Fixed a solid Character (serving an obstacle) can get ignored by a walking Character, if the obstacle character's position appears within the walking character's own blocking zone.\n(This seems to be a redundant condition introduced very long time ago in the engine by mistake.)\n- Fixed object's look not updated after it was assigned a dynamic sprite, redrawn, sprite deleted, object redrawn without a sprite (used a placeholder), and then another dynamic sprite assigned with coincidentally the same number.\n- Fixed font outline index limited to 127 (although we theoretically support higher font numbers).\n- Fixed font outline parameters not initialized correctly if engine is built by a system that treats \"char\" as unsigned 8-bit type.\n- Fixed a crash which occured when script mistakenly tried to call RunInteraction() for a inventory item 0.\n- Fixed loading translation entries larger than 1024 bytes.\n- Fixed SDL log level was defaulting to \"verbose\" if not read from config (should be \"info\").\nWinSetup:\n- Fixed \"Save and Run\" command sometimes caused 2 engine processes, one of which terminated later.\nThis did not prevent a game from running, but could result in temporary CPU and memory overload.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.6.1.32","site":"https://www.adventuregamestudio.co.uk/","source":"AGS Project Team","license_or_tos":"Artistic License 2.0","resources":null,"verified":false}