{"appId":"w:AGSProjectTeam.AdventureGameStudio","appShortcutName":"Adventure Game Studio","appDisplayName":"Adventure Game Studio","authorId":"w:winget","releaseTagName":"winget-3.6.2.15","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Adventure Game Studio (AGS) provides the tools to make your own adventure, for free!\n\n\nThis is a 3.6.2 Patch 5.\nEditor:\n- Fixed 8-bit sprite import with \"Leave as-is\" option when image file does not use a transparent color. This resulted in regular color in slot 0 becoming a transparent instead.\n- Fixed Callstack panel not getting cleared when the game is shutdown, and clicking on its items could bring Editor into the wrong state.\n- Fixed crash occuring under some conditions when the Editor is trying to display a tooltip with the struct's member in script.\n- Fixed Autocomplete not displaying members of dynamic array's elements (was displaying dynamic array's \"Length\" property instead).\n- Fixed Autocomplete mistakes related to multidimensional arrays declared in script. (Although v3.* script compiler does not support multidimensional arrays, this fix prevents strange results if user have these in script for some reason.)\n- Fixed Autocomplete displaying generated types (dynamic array types), which it should not show to the user.\n- Fixed Autocomplete not displaying parent type's extender methods for child types.\n- Fixed script tooltip displaying extra pair of brackets for dynamic array variables.\nEngine:\n- Fixed Slider unexpectedly incremented MaxValue if it appears equal to MinValue.\n- Fixed Character's speech text's behavior being modified by a non-blocking voice clip run by a Game.PlayVoiceClip() call.\n- Fixed Game.PlayVoiceClip() not supporting narrator's voice.\n- Fixed voice clips played by Game.PlayVoiceClip() not resuming after restoring a save.\n  (This is an old mistake present since the PlayVoiceClip function was introduced.)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.6.2.15","version":0,"site":"https://www.adventuregamestudio.co.uk/","source":"AGS Project Team","license_or_tos":"Artistic License 2.0","resources":null,"verified":false}