{"appId":"w:AltSnap.AltSnap","appShortcutName":"AltSnap","appDisplayName":"AltSnap","authorId":"w:winget","releaseTagName":"winget-1.66","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Easily drag windows when pressing the alt key.\n\nMaintained fork of AltDrag for Windows which allows you to move and resize windows by using the Alt key and clicking wherever on the window instead of relying on very precise clicking.\nThis behavior is very common on Linux distributions and is not actually hard to implement on Windows.\nIt is oriented towards all Windows users from Windows NT 4 to Windows 11, even though it is mostly tested on Windows XP and Windows 10.\nMain differences: To simplify the code greatly the Hooks windows feature was removed; it allowed you have windows snapping while dragging them normally. It required however to inject a dll in every application and induced thus an obvious security risk. The amount of mess added to the code just for this feature was substantial and in addition forced to have both a 32bits and a 64bits version of the program running at the same time.\nThis version injects nothing into other applications. This means you do not have to worry whether you have a 32 or a 64bit operating system.\nAnother feature that was disabled is focus on typing, that was too much unusable for me to even start testing, so I removed it.\nOtherwise this has a much simpler source code, added a few extra options, such as transparent windows dragging, Maximize action, pause process options, more blacklists for finer control of AltSnap etc.\nWhat's Changed\n- Add the MenuZoom option in the [Advanced] section of the ini to set zoom factor in percentage for the windows list menu.\n- Simplify resources #619\n- 1.65 zh_CN Translation by @yatli in #624\n- Fix NSI installer with new translations #634, #635\n- Use HungWindowFromGhostWindow() in the Kill action, #134, #637\n- Add next/previous layout actions N/P/NPLayout #632, #638\n  Also Show preview on layout change, use the ShowZonesOnChange variable\n  in the [Zones] section of the ini file to set the preview time in tenth\n  of seconds. set 0 to disable preview (default).\n- fix UWP apps identification #645, #646\n- Correction traduction FR by @TroudhuK in #649\n- Fix typo in AltSnap.dni after #533 for LoL by @sequencerr in #657\n- Add instructions for building on Windows on ARM64. @andrewachen, #659\n- Different actions for Wheel Up and Down #654, #658. Use the ScrollUp\n  and HScrollUp .ini entries to override Up actions only\nNew Contributors\n- @andrewachen made their first contribution in #659\nFull Changelog: 1.65...1.66","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.66","version":0,"site":"https://github.com/RamonUnch","source":"Raymond Gillibert","license_or_tos":"GPL-3.0","resources":null,"verified":false}