{"appId":"w:AmarBego.Rscoop","appShortcutName":"rscoop","appDisplayName":"rscoop","authorId":"w:winget","releaseTagName":"winget-1.4.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/AmarBego/Rscoop/releases/download/v1.4.1/rscoop_1.4.1_x64_en-US.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Modern, Powerful GUI for Scoop\n\nRscoop (rust-scoop) is the ultimate graphical user interface for the Scoop package manager on Windows. Rscoop isn't just a pretty face; it's a powerhouse of functionality designed to be a complete replacement for the command line. Its intuitive, modern UI is incredibly easy to grasp, making package management a breeze for both new and experienced users.\nRelease Notes\nAdded\n- MSI Installation Support: The app now detects when you install via the Windows .msi installer and shows a helpful notice with simple instructions to relaunch for full functionality.\n- Proper App Close: Fixed the app close button to work reliably.\nImproved\n- Cleaner Logging: Simplified backend logging for easier troubleshooting.\n- Faster Startup: Optimized the cold-start initialization process.\n- Better User Experience: App no longer attempts to run in a limited state—just ask you to restart, which takes about a second.\nFixed\n- MSI Installation Issue: When you install Rscoop via the .msi installer, Windows temporarily runs it in a restricted mode. The app now detects this and politely asks you to close and reopen it from the Start Menu for normal functionality.\nDocumentation\n- Updated guides to reflect the improved .msi installation experience.\n- Cleaned up outdated notes about restart requirements.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.4.1","version":0,"site":"https://github.com/AmarBego","source":"rscoop","license_or_tos":"MIT","resources":null,"verified":false}