{"appId":"w:AmarBego.Rscoop","appShortcutName":"rscoop","appDisplayName":"rscoop","authorId":"w:winget","releaseTagName":"winget-1.4.6","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/AmarBego/Rscoop/releases/download/v1.4.6/rscoop_1.4.6_x64_en-US.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Modern, Powerful GUI for Scoop\n\nRscoop (rust-scoop) is the ultimate graphical user interface for the Scoop package manager on Windows. Rscoop isn't just a pretty face; it's a powerhouse of functionality designed to be a complete replacement for the command line. Its intuitive, modern UI is incredibly easy to grasp, making package management a breeze for both new and experienced users.\nRelease Notes 1.4.6\nNew Features\n- Light Theme Support: Rscoop now fully supports a beautiful Light Theme! It can be manually toggled in settings.\n- Start Page Configuration: You can now choose which page Rscoop opens on launch (Search, Installed, Settings, etc.) via the new \"Default Launch Page\" setting.\nImprovements\n- Massive Frontend Refactor:\n  - Code Simplification: I've significantly cleaned up the codebase, removing redundancy and improving maintainability.\n  - Reusable Components: Introduced a suite of reusable UI components for a more consistent look and feel across the entire application.\n  - UI Consistency: Standardized spacing, colors, and typography throughout the app for a polished, professional experience.\n- Better Modals: Modals (Bucket Info, Package Info) have been standardized and improved for better readability and interaction.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.4.6","version":0,"site":"https://github.com/AmarBego","source":"rscoop","license_or_tos":"MIT","resources":null,"verified":false}