{"appId":"w:AmarBego.Rscoop","appShortcutName":"rscoop","appDisplayName":"rscoop","authorId":"w:winget","releaseTagName":"winget-1.4.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/AmarBego/Rscoop/releases/download/v1.4.0/rscoop_1.4.0_x64_en-US.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Modern, Powerful GUI for Scoop\n\nRscoop (rust-scoop) is the ultimate graphical user interface for the Scoop package manager on Windows. Rscoop isn't just a pretty face; it's a powerhouse of functionality designed to be a complete replacement for the command line. Its intuitive, modern UI is incredibly easy to grasp, making package management a breeze for both new and experienced users.\nRelease Notes\nAdded\n- Debug mode with floating debug button for accessing system information, logs, and troubleshooting tools (toggle in Settings).\n- New debug commands (get_debug_info, get_app_logs, read_app_log_file) for detailed system diagnostics.\nImproved\n- Drastically reduced log volume through intelligent caching and debouncing:\n  - Cold-start now logs efficiently with early-break optimization (no retry spam).\n  - Installed packages scan uses fingerprint-based caching with 1-second debouncing to eliminate rapid re-scans.\n  - Held packages lookup includes memoization checks to prevent redundant filesystem walks.\n  - Linker version enumeration uses package version cache to avoid directory walking on every call.\n  - LNK shortcut parsing reduced from per-file logging to single summary line.\n  - External crate logging (lnk, reqwest, tauri_plugin_updater) now gated at appropriate levels.\n- Cold-start initialization now parallel-prefetches installed packages and manifest cache without blocking delays.\n- App state refactored with encapsulated scoop_path() getter/setter and refresh-time tracking for debouncing.\n- Package versions cache architecture similar to installed packages cache, tied to installed packages fingerprint.\n- Eliminated blocking retry loops during cold-start; .msi symlink settling is handled gracefully via fallback to latest version directory.\n- Manifest cache warming during cold start ensures first search is instant without re-scanning buckets.\n- Search command now reports cache status and timing information for better observability.\n- Cold-start now completes faster by removing synchronous sleep delays that were blocking the parallel package scan.\nDocumentation\n- Removed a README notice describing the known update/fresh-install bug (as its now fixed on .msi installers).\n- Comprehensive troubleshooting guide for debug information and log inspection.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.4.0","version":0,"site":"https://github.com/AmarBego","source":"rscoop","license_or_tos":"MIT","resources":null,"verified":false}