{"appId":"w:Amazon.Kiro","appShortcutName":"Kiro","appDisplayName":"Kiro","authorId":"w:winget","releaseTagName":"winget-0.6.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://prod.download.desktop.kiro.dev/releases/stable/win32-x64/signed/0.6.0/kiro-ide-0.6.0-stable-win32-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An agentic IDE that helps you do your best work with features such as specs, steering, and hooks.\n\nKiro is an agentic IDE that helps you go from prototype to production with spec-driven development. From simple to complex tasks, Kiro works alongside you to turn prompts into detailed specs, then into working code, docs, and tests—so what you build is exactly what you want and ready to share with your team. Kiro’s agents help you solve challenging problems and automate tasks like generating documentation and unit tests. With Kiro, you can build beyond prototypes while being in the driver’s seat every step of the way.\nThis release adds support for enterprise billing where administrators can onboard large teams to Kiro, provides the capability to revert to the results of a previous conversation through checkpointing, adds support for multi-root workspaces, and introduces property-based testing with Kiro.\nSpec correctness with property-based tests\nIntroduces property-based testing (PBT) to generate evidence for verification of spec requirements. Unlike unit tests, PBTs run hundreds of times with randomly generated inputs to detect edge cases.\nEnterprise support\nLaunches support for enterprise users in Kiro IDE. Profile selection when multiple profiles are configured (auto-select default profile if only one profile exists), new dashboard for enterprise users, in-chat alerts, usage metering and summaries, enterprise governance of telemetry and MCP settings.\nKiro CLI\nIntroducing the Kiro CLI. Kiro CLI leverages the Auto agent to deliver results in your terminal, and takes you from natural language, to code, to deployment. Kiro CLI supports different agent modes, MCPs, steering files, and custom agents. Install on macOS or Linux:\ncurl -fsSL https://cli.kiro.dev/install | bash\nMulti-root workspace support\nWith multi-root workspace support, a single Kiro workspace can have multiple roots, e.g., a single workspace that contains both /users/bob/my-project and /shared/utils/auth as top-level folders.\nCheckpointing\nSupport for checkpointing which allows users to revert to the results of a previous conversation in Kiro. This feature enables developers to undo changes made by AI agents and return to a previous state of their workspace, while providing visibility into what changed and guidance on next steps.\nSettings for context providers\nAdds experimental settings to control the Codebase (#codebase) allowing users to opt-in to this CPU-intensive indexing feature.\nChat file context line ranges\nAdds capabilities to the chat context provider for files to use line ranges in order to focus context to either a single line in a file or line range.\nKiro web dashboard\nAccess app.kiro.dev to manage your account, track usage statistics, and modify subscription settings through the web interface.\nImprovements (5)\n- Spec Workspace Folders - Fixes issue with spec context menu handling multi-root workspaces and align steering context menu descriptions\n- Toolbar Button Contrast - Fixes issue with toolbar button contrast where inactive buttons had poor visibility against the toolbar background\n- Modal Improvements - Fixed an issue where button styles were very inconsistent across the modal components and removal of excess border from header-only modals\n- Deny list for Terminal Commands - Added check for denylist match at the beginning if a command can be auto-accepted\n- Debugging - Include machine id in GitHub issues created through Kiro\n- Steering Files - Improve steering file adherence to prevent guideline drift in long conversations by re-injecting always-included steering documents at regular intervals and refactor refine steering workflows\nFixes (7)\n- Chat messages disappearing - Fixed issue where chat disappears and doesn't load anymore when the extension host reloads (which can happen through extension updates)\n- MCP - Prevent URL double-encoding in MCP authorization redirect, update MCP features when Enterprise MCP disabled.\n- Performance Improvements - Disable codebase indexing on startup that caused resources exhaustion, enhanced telemetry around agent event consumption, improved performance for file and folder context provider\n- File-tree tool - Fixed issue where the file tree tool response was being removed when getting messages from previous execution\n- Agent Workflow - Fixes an issue where messages are deleted if an exception is thrown while invoking agent, and fixed an issue where accept command failed didn’t work\n- Windows - Prevent agent from writing into protected paths on Windows (example .vscode folder)\n- Steering Files - Refactor refine steering workflows to single steering file","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.6.0","version":0,"site":"https://kiro.dev/","source":"Amazon Web Services","license_or_tos":"Proprietary","resources":null,"verified":false}