{"appId":"w:Amazon.CloudWatchAgent","appShortcutName":"Winget Application","appDisplayName":"Amazon CloudWatch Agent","authorId":"w:winget","releaseTagName":"winget-1.300054.0b1074","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://amazoncloudwatch-agent.s3.amazonaws.com/windows/amd64/1.300054.0b1074/amazon-cloudwatch-agent.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Collect metrics, logs, and traces with the Amazon CloudWatch agent\n\nThe Amazon CloudWatch Agent enables you to do the following:\n- Collect more system-level metrics from Amazon EC2 instances across operating systems. The metrics can include in-guest metrics, in addition to the metrics for EC2 instances. The additional metrics that can be collected are listed in Metrics Collected by the CloudWatch Agent.\n- Collect system-level metrics from on-premises servers. These can include servers in a hybrid environment as well as servers not managed by AWS.\n- Retrieve custom metrics from your applications or services using the StatsD and collectd protocols. StatsD is supported on both Linux servers and servers running Windows Server. collectd is supported only on Linux servers.\n- Collect logs from Amazon EC2 instances and on-premises servers, running either Linux or Windows Server.\n- Collect Open Telemetry and AWS X-Ray traces\nAmazon CloudWatch Agent uses open-source projects telegraf and opentelemetry-collector as its dependencies. It operates by starting an opentelemetry collector and is capable of operating pipelines consisting of both telegraf and opentemetry components in addition to customized components.\nFeatures:\n* [EFA] Added Elastic Network Interface (ENI) ID as a dimension to EFA (Elastic Fabric Adapter) metrics\n\nEnhancements:\n* [ContainerInsights] Switched to using EndpointSlices instead of Endpoints for improved performance in large EKS clusters\n* [Logs] Added option to trim timestamp from log messages if enabled by customer\n* [EC2Tagger] Set separate refresh intervals for tags (default 0) and volumes (default 5 minutes if VolumeId configured)\n\nBug Fixes:\n* [CloudWatch Exporter] Fixed issue with nil metric values by dropping metrics with nil values\n* [Logs] Implemented fixed-size buffer to handle file descriptors in log tailer, controlled by a feature flag\n* [Logs] Added 'backpressure_drop' feature flag for granular control of log handling during file rotation\n* [Kubernetes] Implemented dynamic CA certificate handling for kubelet connections\n* [Kubernetes] Use Kubernetes Secret File for Bearer Token in Prometheus API Access","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.300054.0b1074","site":"https://aws.amazon.com/","source":"Amazon.com, Inc.","license_or_tos":"MIT","resources":null,"verified":false}