{"appId":"w:Amazon.SSMAgent","appShortcutName":"Amazon SSM Agent","appDisplayName":"Amazon SSM Agent","authorId":"w:winget","releaseTagName":"winget-3.3.3598.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3.amazonaws.com/ec2-downloads-windows/SSMAgent/3.3.3598.0/windows_amd64/AmazonSSMAgentSetup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An agent to enable remote management of your EC2 instances, on-premises servers, or virtual machines (VMs).\n\nAWS Systems Manager Agent (SSM Agent) is Amazon software that runs on Amazon Elastic Compute Cloud (Amazon EC2) instances, edge devices, on-premises servers, and virtual machines (VMs). SSM Agent makes it possible for Systems Manager to update, manage, and configure these resources. The agent processes requests from the Systems Manager service in the AWS Cloud, and then runs them as specified in the request. SSM Agent then sends status and execution information back to the Systems Manager service by using the Amazon Message Gateway Service (ssmmessages). (In AWS Regions launched before 2024, status and execution information might also be sent back by the Amazon Message Delivery Service (service prefix: ec2messages).)\nIf you monitor traffic, you will see that your managed nodes communicate with ssmmessages.* endpoints and possibly ec2messages.* endpoints. For more information, see Reference: ec2messages, ssmmessages, and other API operations. For information about porting SSM Agent logs to Amazon CloudWatch Logs, see Logging and monitoring in AWS Systems Manager.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.3.3598.0","version":0,"site":"https://aws.amazon.com/","source":"Amazon Web Services","license_or_tos":"Apache-2.0","resources":null,"verified":false}