{"appId":"w:Amazon.Kiro","appShortcutName":"Kiro","appDisplayName":"Kiro","authorId":"w:winget","releaseTagName":"winget-0.7.45","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://prod.download.desktop.kiro.dev/releases/stable/win32-x64/signed/0.7.45/kiro-ide-0.7.45-stable-win32-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An agentic IDE that helps you do your best work with features such as specs, steering, and hooks.\n\nKiro is an agentic IDE that helps you go from prototype to production with spec-driven development. From simple to complex tasks, Kiro works alongside you to turn prompts into detailed specs, then into working code, docs, and tests—so what you build is exactly what you want and ready to share with your team. Kiro’s agents help you solve challenging problems and automate tasks like generating documentation and unit tests. With Kiro, you can build beyond prototypes while being in the driver’s seat every step of the way.\nIncludes 0.7.34 patch.\n\nThis release introduces Powers for dynamic MCP tool loading, conversation summarization to manage context windows, and slash commands for quick access to hooks and steering files.\nPowers\nIntroducing Powers, a new way to give Kiro's agent instant expertise for any framework or tool. Powers package MCP servers, steering files, and hooks into reusable bundles that activate on-demand based on your conversation context. Instead of loading all MCP tools upfront and overwhelming your context window, powers load dynamically when you mention relevant keywords. Browse curated powers from launch partners including Datadog, Dynatrace, Figma, Neon, Netlify, Postman, Supabase, Stripe, and more—or create your own.\nSummarization\nAdds automatic conversation summarization to manage long conversations. When your conversation reaches 80% of the model's context window limit, Kiro automatically summarizes previous messages to bring context usage back below the limit. A new context usage meter in the chat panel shows what percentage of the model's context is being used.\nSlash commands\nIntroducing slash commands for quick access to hooks and steering files directly from the chat input. Type / to see available commands and execute them instantly. Hooks with manual triggers and steering files configured with manual inclusion appear in the slash command menu, letting you run tests, sync documentation, or pull in specific guidance on demand.\nPatches (3)\n- 0.7.5: Fixed Powers installation failing when mcp.json contains comments\n- 0.7.21: Added workspace trust check enforcement before loading context providers\n- 0.7.34: Fixed authentication with socks proxies, chat session errors when opening folders, and MCP connectivity issues for IDC users during token refresh","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.7.45","version":0,"site":"https://kiro.dev/","source":"Amazon Web Services","license_or_tos":"Proprietary","resources":null,"verified":false}