{"appId":"w:Amazon.Kiro","appShortcutName":"Kiro","appDisplayName":"Kiro","authorId":"w:winget","releaseTagName":"winget-0.10.32","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://prod.download.desktop.kiro.dev/releases/stable/win32-x64/signed/0.10.32/kiro-ide-0.10.32-stable-win32-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An agentic IDE that helps you do your best work with features such as specs, steering, and hooks.\n\nKiro is an agentic IDE that helps you go from prototype to production with spec-driven development. From simple to complex tasks, Kiro works alongside you to turn prompts into detailed specs, then into working code, docs, and tests—so what you build is exactly what you want and ready to share with your team. Kiro’s agents help you solve challenging problems and automate tasks like generating documentation and unit tests. With Kiro, you can build beyond prototypes while being in the driver’s seat every step of the way.\nNew Spec Workflows, Hunk-Based Edits, Task Hooks, and MCP Prompts\nThis release introduces new spec workflows that let you design features architecture-first and fix bugs with structured root cause analysis. Supervised mode now lets you review changes at the hunk level for precise control. New hook triggers automate work around spec tasks, and MCP servers can now surface prompts, templates, and elicitation support directly in chat.\nDesign-First Feature Specs\nA new Design-First workflow lets you start a feature spec from technical architecture instead of requirements. Provide a high-level or low-level design, pseudocode, or system diagram and Kiro derives feasible requirements from it. This is ideal when you have strict non-functional constraints, an existing design to port, or want to think through the architecture before defining user-facing behavior. Learn more ->\nBugfix Specs\nSpecs now include a dedicated Bugfix workflow. Describe the issue you're seeing and Kiro walks you through root cause analysis, fix design, and regression prevention. The result is a `bugfix.md` that captures current behavior, expected behavior, and what must remain unchanged, giving the agent clear guardrails before it writes a single line of code. Learn more ->\nHunk-Based Review in Supervised Mode\nSupervised mode now presents file changes as individual hunks instead of full-file diffs. Each hunk is a logical group of related lines that you can independently accept, reject, or discuss with inline chat. You can also accept changes at the file level or accept all changes at once. This gives you precise control over exactly which parts of a change to keep. Learn more ->\nPre and Post Task Execution Hooks\nTwo new hook triggers let you automate work around spec task execution. Pre Task Execution fires before a task begins, so you can run setup scripts or validate prerequisites. Post Task Execution fires after a task completes, letting you run tests, linting, or notify external systems automatically. Combine these with the existing hook actions to build end-to-end automation around your spec workflows. Learn more ->\nMCP Prompts, Resource Templates, and Elicitation\nMCP servers can now provide prompts and resource templates that appear in the context provider (#) menu in chat. Select a prompt to insert pre-built instructions, or fill in a resource template's parameters to pull in specific content as context. During tool execution, servers can also request additional input from you through elicitation. Kiro supports elicitation so servers can request the information they need without interrupting your workflow. Learn more ->\nImprovements\n\nFixes\n\nPatches","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.10.32","version":0,"site":"https://kiro.dev/","source":"Amazon Web Services","license_or_tos":"Proprietary","resources":null,"verified":false}