{"appId":"w:Amazon.Kiro","appShortcutName":"Kiro","appDisplayName":"Kiro","authorId":"w:winget","releaseTagName":"winget-0.9.40","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://prod.download.desktop.kiro.dev/releases/stable/win32-x64/signed/0.9.40/kiro-ide-0.9.40-stable-win32-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An agentic IDE that helps you do your best work with features such as specs, steering, and hooks.\n\nKiro is an agentic IDE that helps you go from prototype to production with spec-driven development. From simple to complex tasks, Kiro works alongside you to turn prompts into detailed specs, then into working code, docs, and tests—so what you build is exactly what you want and ready to share with your team. Kiro’s agents help you solve challenging problems and automate tasks like generating documentation and unit tests. With Kiro, you can build beyond prototypes while being in the driver’s seat every step of the way.\nExternal Identity Provider Support for Kiro IDE\nThis release adds support for signing in to Kiro IDE with Okta or Microsoft Entra ID credentials.\nEnterprise SSO with Okta and Entra ID\nVideo unavailable\nEnterprise teams can now connect Okta or Microsoft Entra ID alongside AWS IAM Identity Center, giving organizations flexibility in how they manage user access. Developers sign in to the IDE with their existing corporate credentials. User and group synchronization happens automatically through SCIM provisioning. Configure your IdP once and it works across both Kiro IDE and CLI. Learn more ->","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.9.40","version":0,"site":"https://kiro.dev/","source":"Amazon Web Services","license_or_tos":"Proprietary","resources":null,"verified":false}