{"appId":"w:Anki.Anki","appShortcutName":"Winget Application","appDisplayName":"Anki","authorId":"w:winget","releaseTagName":"winget-25.02.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ankitects/anki/releases/download/25.02.1/anki-25.02.1-windows-qt6.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Powerful and intelligent flash cards.\n\nAnki is a program which makes remembering things easy.\nBecause it's a lot more efficient than traditional study methods, you can either greatly decrease your time spent studying, or greatly increase the amount you learn.\nAnyone who needs to remember things in their daily life can benefit from Anki.\nSince it is content-agnostic and supports images, audio, videos and scientific markup (via LaTeX), the possibilities are endless.\nThis is a security-focused update. If you use any shared decks, updating is strongly recommended.\n- The review screen had protections in place to prevent shared decks from accessing other data on your computer, but these proved to be insufficient. A big thank you to Michael Lappas for the report.\n- JavaScript references such as onclick handlers are now stripped from field content when editing it. Most users are unlikely to see a change here, but it may result in breakages if you're using a shared deck that placed such content into individual fields against our recommendations.\nOne non-security change was also slipped in:\n- If your collection size is over the AnkiWeb limit, you'll now receive a message at the start of the sync, instead of the sync failing later.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"25.02.1","site":"https://github.com/ankitects/anki","source":"Anki","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}