{"appId":"w:AntibodySoftware.WizTree","appShortcutName":"WizTree","appDisplayName":"WizTree","authorId":"w:winget","releaseTagName":"winget-4.27","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://diskanalyzer.com/files/wiztree_4_27_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"WizTree is a hard drive disk space analyser similar to WinDirStat but is MUCH faster.\n\n\n- Seer / QuickLook integration added\n  Seer and QuickLook both provide a quick and easy way to preview files by simply pressing the space bar when a file is selected in Windows File Explorer. If you have either Seer or QuickLook active (running in the background), press space to quickly view the contents of the currently selected file within WizTree. Press space again to close the view.\n\n- Filtering/searching by time now supported\n\n  Example 1: To find files modified at exactly 1pm (any day):\n  =13:00:00\n  or use am/pm like this:\n  =1:00pm\n\n  Example 2: To find files modified at 3am or earlier (any day):\n  <=3am\n\n  Use the \"NOW\" filter variable for the current date/time.\n\n  Example 3: To find files modified in the last 5 minutes, use filter:\n  >NOW-5\n  (find all files with modified date greater than time now minus 5 minutes)\n  Use a 's', 'm' (default) or 'h' suffix to indicate seconds, minutes or hours.\n\n  Example 4: To find files modified in the last 1 hour:\n  >NOW-1h\n\n  Example 5: Find files modified more than one hour ago, but less than 4 hours ago:\n  <NOW-1h &ht;NOW-4h\n\n  Similar results can be achieved by subtracting seconds, minutes or hours from the \"TODAY\" filter variable:\n  >TODAY-5m\n  This will show all files modified in the last 5 minutes. Use an 'h', 'm' or 's' suffix to indicate hours, minutes or seconds\n\n- WizTree would incorrectly display \"internal corruption detected\" error if running from a path containing non ansi characters (e.g. Chinese or Japanese) - fixed\n- Config folder override registry setting was not working when WizTree not running in admin mode - fixed\n- CSV export can now be configured to export UTC date/times instead of local system date/times. Use command line parameter:\n  /exportUTCTime=1\n- Setting the license key (supporter code) and configuring auto update checking via the installer will now work for all users on the PC regardless of which user ran the installer. Previously these settings were user specific which could cause confusion\n- Fixed allocated size calculation bug that could occur on drives formatted with large cluster sizes\n- Most of WizTree's configuration options can now be set via the registry - useful for mass deployments (installed version only)\n  Add settings to the HKEY_LOCAL_MACHINE\\Software\\Antibody Software\\WizTree\\ConfigOverride\\frmWizTreeMain key.\n  Setting names should match those used in the WizTree3.ini file and all value types should be of type \"REG_SZ\" (string).\n  e.g. to set the \"run as admin\" option to false create a \"REG_SZ\" value named \"actRunAsAdmin_Checked\" in the\n  HKEY_LOCAL_MACHINE\\Software\\Antibody Software\\WizTree\\ConfigOverride\\frmWizTreeMain registry key and set the value to \"FALSE\"\n  To make a setting \"read only\", prefix the name in the registry with an exclamation point (!), e.g. !actRunAsAdmin_Checked\n  When the installed version of WizTree starts (does not matter which user is logged in), it will first look to the registry and set its settings accordingly. If WizTree is being run by a user with admin rights, it will also update these registry settings when it's closed unless the registry setting is \"read only\" (!).\n  From WizTree 4.27 onwards, the installer will automatically create the necessary registry entries if it's run with command line parameters /supportercode=xxxx-xxxx-xxxx-xxxx, /runasadmin=TRUE/FALSE, or /checkforupdates=TRUE/FALSE\n  To set runasadmin / checkforupdates to read only, use:\n  /!runasadmin=TRUE/FALSE, or /!checkforupdates=TRUE/FALSE","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.27","site":"https://antibody-software.com/","source":"Antibody Software","license_or_tos":"Proprietary","resources":null,"verified":false}