{"appId":"w:AnyTXT.AnyTXTSearcher","appShortcutName":"AnyTXT Searcher","appDisplayName":"AnyTXT Searcher","authorId":"w:winget","releaseTagName":"winget-1.3.2477","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"AnyTXT Searcher is a free powerful local document & text search application\n\nAnyTXT Searcher is a powerful file content search application, just like a local disk Google search engine, and much faster than Windows search and Windows findstr command. Anytxt is your best desktop file content full-text search engine and the best Google Desktop Search alternative.\n\nAnyTXT Searcher has a powerful document parsing engine, which extracts the text of commonly used documents without installing any other software and combines the built-in high-speed indexing system to store the text’s metadata. You can quickly find any words on your computer with Anytxt. It works perfectly on Windows 11, 10, 8, 7, Vista, XP, 2003, 2008, 2012, 2016, 2019, 2022, etc.\n\nYour time is too valuable to be wasted on inefficient and ineffective searches-use Anytxt for fast and effective full-text file and document searches. Desktop search solutions can find all the necessary information for you in record time. No matter where it is stored, Anytxt can instantly find every file, every snip, and every text.\n\nFormats Supported:\n- Plain Text Format (txt, java, html, etc.)\n- Microsoft Outlook (eml) (beta)\n- Microsoft Word (doc, docx)\n- Microsoft Excel (xls, xlsx)\n- Microsoft PowerPoint (ppt, pptx)\n- Portable Document Format, including scanned PDF Document (pdf)\n- Microsoft OneNote (one)\n- eBook Formats (mobi, epub, azw, djvu, LaTex, etc.)\n- Microsoft Compiled HTML Help (chm)\n- WPS Format (wps, et, dps)\n- Amazon Kindle Format (azw, azw3)\n- Mind Map Format (lighten, mmap, emmx, mm, xmind etc.)\n- Open Fixed-layout Document Format (ofd)\n- WizNote (ziw)\n- Edraw Max (eddx)\n- OCR. Text In Any Image (png, jpg, bmp, scanned pdf etc.)\n- Binary File (exe, dll, so)\n- More Document Types are coming\nAdded indexing progress display with details on hover;\nAdded support for RPM and DEB packages;\nAdded the feature of filtering search results by filename;\nFixed the issue where the OCR feature was not working in V1.3.2034;\nFixed other known issues;","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.3.2477","version":0,"site":"https://anytxt.net/","source":"CBEWIN Tech Co.","license_or_tos":"Shareware","resources":null,"verified":false}