{"appId":"w:Apple.QuickTime","appShortcutName":"QuickTime","appDisplayName":"QuickTime","authorId":"w:winget","releaseTagName":"winget-7.79.80.95","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A powerful multimedia technology with a built-in media player, QuickTime lets you view Internet video and personal media in a wide range of file formats. And it lets you enjoy them in remarkably high quality.\n\nA powerful multimedia technology with a built-in media player, QuickTime lets you view Internet video and personal media in a wide range of file formats. And it lets you enjoy them in remarkably high quality.\nIt’s a multimedia platform.\nVideo from your digital camera or mobile phone. A movie on your Mac or PC. A media clip on a website. No matter what you're watching or where you're watching it, QuickTime technology makes it all possible.\nIt’s a sophisticated media player.\nWith its simple design and easy-to-use controls, QuickTime Player makes everything you watch even more enjoyable. Its clean, uncluttered interface never gets in the way of what you’re watching. Want to speed through a movie or slow things down? A handy slider lets you set playback from 1/2x to 3x the normal speed. And you can search through individual movie frames quickly.\nIt’s advanced video technology.\nQuickTime features advanced video compression technology called H.264 to deliver brilliant, crisp HD video using less bandwidth and storage. So you’ll experience pristine video quality wherever you watch your videos.\nIt’s a flexible file format.\nQuickTime lets you do more with your digital media. With QuickTime 7 Pro, you can convert your files to different formats and record and edit your work. Third-party plug-ins extend QuickTime technology in many different directions. And QuickTime streaming solutions let you stream your media across the Internet.\nQuickTime 7.7.9 improves security and is recommended for all QuickTime 7 users on Windows. The QuickTime web browser plug-in is no longer installed by default and is removed if you have a previous version of QuickTime on your PC. If you still need this legacy plug-in, you can add it back using the custom setup option in the installer.\nFor information on the security content of this update, please visit this website: http://support.apple.com/kb/HT201222.\nImportant Notice to QuickTime 6 Pro Users\nInstalling QuickTime 7 or later will disable the QuickTime Pro functionality in prior versions of QuickTime, such as QuickTime 6. If you are a QuickTime 6 Pro user, see this article: http://support.apple.com/kb/HT201691#compatibility before proceeding with this installation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.79.80.95","version":0,"site":"https://www.apple.com/","source":"Apple Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}