{"appId":"w:Apryse.XodoPDFReader","appShortcutName":"Xodo PDF Reader","appDisplayName":"Xodo PDF Reader","authorId":"w:winget","releaseTagName":"winget-2025.3.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://getpdfstudio.xodo.com/xodopdfreader/XodoPDFReader_win64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Xodo PDF Reader is a fast, free, and highly-rated cross-platform PDF application for viewing, annotating, editing, and collaborating on PDF documents.\n\nTransform how you work with PDF files using Xodo PDF Reader. Our free, cross-platform reader lets you effortlessly open, navigate, highlight, and manage your documents.\n\nWhether you're a student reviewing lecture notes, a professional analyzing reports, or an architect measuring blueprints, Xodo makes handling PDFs easier and more efficient than ever.\n\nBreak free from the limitations of other PDF readers and experience the flexibility of Xodo, seamlessly adapting to your needs across Windows, Mac, and Linux.\n\nStreamline your PDF tasks with intuitive features:\n* Seamlessly open and view your PDF files on Windows, macOS, and Linux devices.\n* Add text and comments, insert notes and highlights, and draw directly on your PDF.\n* Quickly complete and save your interactive PDF forms to easily share them with others.\n* Apply digital signatures, and eSign important documents through Xodo Sign integration.\n* Quickly find specific words, measure distances and print your documents with ease.\n* Save and access your PDFs in Xodo Drive, Google Drive, Dropbox and OneDrive.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.3.0","version":0,"site":"https://apryse.com/","source":"Apryse Software Corp.","license_or_tos":"Freeware","resources":null,"verified":false}