{"appId":"w:Archi.Archi","appShortcutName":"Archi","appDisplayName":"Archi","authorId":"w:winget","releaseTagName":"winget-5.7.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/archimatetool/archi.io/releases/download/5.7.0/Archi-Win64-Setup-5.7.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Open Source modelling toolkit for creating ArchiMate models and sketches.\n\nArchi® is a free, open source, cross-platform tool and editor to create ArchiMate models.\nThe Archi® modelling tool is targeted toward all levels of Enterprise Architects and Modellers. It provides a low cost to entry solution to users who may be making their first steps in the ArchiMate modelling language, or who are looking for a free, cross-platform ArchiMate modelling tool for their company or institution and wish to engage with the language within a TOGAF® or other Enterprise Architecture framework.\nArchiMate® is an open and independent Enterprise Architecture modelling language that supports the description, analysis and visualization of architecture within and across business domains. ArchiMate is one of the open standards hosted by The Open Group and is fully aligned with TOGAF®.\nNew\n- Add a preference to highlight the primary selected connection (Preferences -> Connections)\n- Add “Select Objects of Same Type” context menu action in Views\n- [Models Tree] Add an option for incremental tree node display (Preferences -> General)\n- [Models Tree] Add key binding support for Expand/Collapse All\n- Add key binding support for CSV Import/Export, XML Exchange Import/Export, and Model Import\nImprovements\n- Connection bend point creation and move handles are now more distinctive\n- CSV Import/Export, XML Exchange Import/Export, and Model Import now use command handlers\n- All Import and Export Model bundles are now lazily loaded on demand\n- Use a better png image for the Palette View\n- [Help] Explain the format of imported CSV files\n- Improved handling of multiple workbench window shells\n- Optimisations to Navigator and Validator trees\n- Set the “Delete from Model” default key binding context to “In Archi Diagrams”\n- Don’t add the name of objects to Undo/Redo commands to avoid expanding menu width\n- The status bar displays the primary selected object in diagrams\n- Deprecate third-party Model Import and Export interfaces in favour of using Commands, Handlers and Menus\nFixes\n- Fix black search text when using the dark theme\n- Some fixes to managing drop-ins\n- Other internal improvements and fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.7.0","version":0,"site":"https://www.archimatetool.com/","source":"Phillip Beauvoir & Jean-Baptiste Sarrodie","license_or_tos":"MIT","resources":null,"verified":false}