{"appId":"w:Archi.Archi","appShortcutName":"Archi","appDisplayName":"Archi","authorId":"w:winget","releaseTagName":"winget-5.6.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.archimatetool.com/downloads/archi/560/Archi-Win64-Setup-5.6.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Open Source modelling toolkit for creating ArchiMate models and sketches.\n\nArchi® is a free, open source, cross-platform tool and editor to create ArchiMate models.\nThe Archi® modelling tool is targeted toward all levels of Enterprise Architects and Modellers. It provides a low cost to entry solution to users who may be making their first steps in the ArchiMate modelling language, or who are looking for a free, cross-platform ArchiMate modelling tool for their company or institution and wish to engage with the language within a TOGAF® or other Enterprise Architecture framework.\nArchiMate® is an open and independent Enterprise Architecture modelling language that supports the description, analysis and visualization of architecture within and across business domains. ArchiMate is one of the open standards hosted by The Open Group and is fully aligned with TOGAF®.\nNew\n- Add key binding support for Text Alignment and Position\n- Set Concept Type now calculates invalid relations after all element types have been set\n- Bundled Java Runtime is now version 21\nImprovements\n- Enable “Default” on color chooser widget is now calculated on all selected objects not the first selected object\n- [Model Checker] Check concepts and views are in correct folders and the model has an ID\n- Add tooltips to recent files menu to show full path of file\n- Use the correct ArchiMate Collaboration palette icons at @2x size\n- ACLI Optimisations\n- Update Jasper Reports ECJ library to version 3.21.0\n- Update Apache Commons CLI library to version 1.9.0\n- Update Apache Commons CSV to version 1.14.0\nFixes\n- Fix Visualiser setting node positions to 0,0 in some cases\n- Fix objects not able to be moved if they were selected using one of the palette’s “touched” marquee selection tools\n- Fix Palette Note/Group key binding conflict\n- Fix Print diagram not scaling correctly on Windows/Linux\n- Fix exception when changing an element type if the element has a circular relationship\n- Fix ampersands in relationship text not displayed in Properties title label\n- Other internal improvements and fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.6.0","site":"https://www.archimatetool.com/","source":"Phillip Beauvoir & Jean-Baptiste Sarrodie","license_or_tos":"MIT","resources":null,"verified":false}