{"appId":"w:ArcticLine.JetScreenshot","appShortcutName":"Jet Screenshot","appDisplayName":"Jet Screenshot","authorId":"w:winget","releaseTagName":"winget-3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Share screenshots via Internet in seconds: take a shot, edit it quickly and send to the Internet, to get a link which you can immediately provide to anyone\n\nJet Screenshot is a service enabling you to share screenshot via the internet in seconds. It allows you to take a screen snap, edit it and send it to the Web, so that you can immediately provide anyone with a link to the image. Such an approach allows you to speed up sharing of ideas, facilitating further discussion. It's ideal for remote work of programmers, designers, QA testers, bloggers, technical assistance specialists, sales managers, etc...\nSupport of Windows 8 has been added.\nNow Jet Screenshot can make a screenshot of long scrollable pages. If you want to make a screenshot of a web-page which doesn’t fit in one screen, now it’s not a problem. (Capture scrollable window feature is available only in Pro version).\nNew advanced \"Ruler\" tool has been added. It allows you to measure any distance in pixels on your screenshot. This tool will be especially useful for people who design interfaces or check a work of UI designers. (Ruler is available only in Pro version).\nNew advanced \"123\" tool has been added. It adds sequence number on your screenshot in one click. If you make instructions, now it’s very easy for you to show an order of steps that must be done.\nNow you can add a timestamp on each of your screenshots. All you need to do it's to put an appropriate checkbox in the settings window of Jet Screenshot. (Timestamp feature is available only in Pro version).\nNew advanced \"Color Picker\" tool has been added. It allows you to choose a color of any dot on the screenshot and after that you can paint with this color.\nWe've improved the work with links when a screenshot is sent to FTP. Now when you sent to FTP, Jet Screenshot propose you three variants of links: a direct link, a link for the forum or a HTML link for the blog.\nWe've added an informing module in Jet Screenshot. Now you will know about all special offers available for Jet Screenshot's users.\nNow you can move the drawn objects pressing arrow keys on your keyboard. It allows you to draw objects on your screenshot within pixel accuracy.\nNow proxy server setting works not for FTP only, but also for any Share Option. It's not a problem for Jet Screenshot if you have a corporate proxy server.\nNow Jet Screenshot allows you to add visual marks on your screenshots which don't fit on the screen.\nBug-fix: Fixed bug \"Socket Error #11004\".\nOther minor improvements of interface and usability.\nOther minor changes and bug-fixes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.1","version":0,"site":"https://jetscreenshot.com/","source":"ArcticLine Software","license_or_tos":"Proprietary","resources":null,"verified":false}