{"appId":"w:ArminOsaj.AutoDarkMode","appShortcutName":"Auto Dark Mode","appDisplayName":"Auto Dark Mode","authorId":"w:winget","releaseTagName":"winget-11.0.0.54","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/AutoDarkMode/Windows-Auto-Night-Mode/releases/download/11.0.0.54/AutoDarkMode_11.0.0.54_ARM64.exe"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":{"assetId":0,"exec":null,"scope":"User","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Switches between the dark and light theme of Windows at scheduled times.\n\nTired of looking at dark content while the sun is shining brightly? But at night everything is suddenly too bright? Auto Dark Mode is the solution for you!\nAndroid, iOS and MacOS already offer the possibility of changing the system design based on the time of the day. We're bringing this feature to Windows on a larger scale.\nAuto Dark Mode helps you to be more productive. Because you shouldn't care about changing Windows settings several times a day. As soon as the sun goes down, we'll take care of your eyes.\nBecause a simple design change would be too boring, Auto Dark Mode is packed with useful functions. For example, we can also change your desktop wallpaper or run custom scripts.\nOver the past nine months we worked hard to deliver you the most beautiful version of Auto Dark Mode yet. We completely revamped the user interface, which is now based on the modern technologies of the Windows App SDK. This means that Auto Dark Mode fits perfectly into the design language of Windows 11. This significant change to the codebase let us increase the major version number from 10 to 11. Yep, it's time for Auto Dark Mode 11!\nHowever, this update is not only about the looks - although they alone would be enough to catch everyone. The theme switch has also been improved to mitigate many issues. Along with our work on making the wallpaper switch more reliable, this is probably the the most robust theme switch ever. So, not only the looks are awesome, the character is too. What a perfect GitHub profile! Hopefully this will be a match.\nUnlike your dating matches, you can always expect a reply from the Auto Dark Mode team. Due to the extensive rewrite required for the upgrade to the Windows App SDK, some aspects of the user interface may not fit every scenario. If you encounter something that you don't like or doesn't work as expected, please open a GitHub issue.\n\nNew Features:\n- New user interface based on Windows App SDK and WinUI 3. Touch interactions are now supported. Also the scrolling speed with notebook touchpads is no longer excessively fast.\n- Auto Dark Mode can now handle custom themes, for example from Recitfy11.\n\nImprovements:\n- Activation of the color filter has been improved. Rather than relying on a keyboard shortcut, we now use a native method. This makes activation much more reliable.\n- We made significant improvements to the user interface for editing keyboard shortcuts.\n- Wallpaper switch has been improved. Auto Dark Mode will now attempt to correct invalid wallpaper configurations. Additionally, the issue of wallpapers switching back when changing themes should be resolved.\n- Theme switching now additionally uses window broadcasts to allow for a smoother experience. If you still encounter issues, you can enable a more resilient theme switching method in the settings. It's called \"More aggressive DWM refresh\".\n- Changes to the currently active theme will now be applied even if theme switching is postponed.\n- Accent color for taskbar and window borders has been reworked and is now more reliable.\n- Auto Dark Mode now runs on .NET 9.\n\nFixes:\n- Geolocation will correctly show the region name again, using an offline, fully-local GIS database instead of relying on Microsoft services.\n- The service no longer crashes when a slideshow cannot be forwarded.\n- Script execution will not be blocked anymore if one of the scripts fails.\n\nKnown Issues:\n- Jump list doesn't work. This is a limitation of Windows App SDK. We recommend using the contextmenu of the tray icon instead.\n- Some strings aren't translated.\n- Next update on the time page doesn't update in real time.\n- Auto Dark Mode is not notifying you if it doesn't get location service access.\n- The process list on the condition page isn't filtering processes while typing.\n\nSpecial thanks:\nDonators: Thanks to corndog2000 and Chris for helping to bring this ADM release to you! ❤️ You get a once time shoutout in the next release note, if you donate 25 USD or more and providing a name for the changelog.\nContributors: Thanks to @ChenYiLins and @Jay-o-Way for building the new user interface 🏅","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.0.0.54","version":0,"site":"https://github.com/AutoDarkMode","source":"Armin Osaj & Samuel Schiegg","license_or_tos":"GPL-3.0","resources":null,"verified":false}