{"appId":"w:Astronet.Scholaread","appShortcutName":"Scholaread","appDisplayName":"Scholaread","authorId":"w:winget","releaseTagName":"winget-1.1.59","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.scholaread.com/assets/pc-releases/1.1.59/com/Scholaread-win-x64-1.1.59.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"AI-powered Research, Insights at Your Fingertips\n\nScholaread is committed to creating a premier academic reading experience, helping every scholar enhance the value of their time.\nAmidst the sea of knowledge, countless papers and scholarly works serve as lighthouses guiding our intellectual journey. We aim to reshape academic reading, enabling scholars to navigate more smoothly and sail towards a broader and more distant future.\nBy utilizing advanced PDF layout parsing algorithms, we convert complexly formatted literature into clean, screen-friendly formats, allowing reading to transcend device limitations, and ensuring text, graphics, formulas, and tables are displayed with clarity. Our paragraph-by-paragraph full-text translations not only make reading more fluid but also allow the transfer of knowledge to transcend language barriers. We firmly believe that every paper has its value, and every piece of research deserves recognition. We hope that scholars around the globe can overcome linguistic obstacles and collectively contribute to the advancement of the world.\nIn the future, Scholaread will also provide a more comprehensive literature management solution, ensuring an efficient linkage between reading and writing so that every ounce of effort in scientific research is preserved and reflected.\nThe path to scientific discovery, though rugged and lengthy, can be made broader and brighter with technological innovation. Scholaread aspires to be an indispensable tool for scholars worldwide, ensuring that every precious minute is spent productively.\nWe sincerely welcome you and your colleagues, peers, study groups, and anyone interested to share in the Scholaread experience!\n- New: AI Paper Search for fast and precise discovery.\n- Fixed: Resolved citation recommendation and reflow display issues.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.59","version":0,"site":"https://www.scholaread.com/","source":"Astronet Technology PTE LTD","license_or_tos":"Proprietary","resources":null,"verified":false}