{"appId":"w:Atomi.ActivePresenter","appShortcutName":"ActivePresenter","appDisplayName":"ActivePresenter","authorId":"w:winget","releaseTagName":"winget-9.4.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.atomisystems.com/apdownloads/ActivePresenter_v9.4.0_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The World-class Authoring Tool for eLearning Design\n\nActivePresenter is a world-class eLearning authoring tool designed for creating professional, interactive content with ease. It supports a range of functionalities, including converting PowerPoint presentations into HTML5 or eLearning formats, building interactive simulations with smart screen-capture technology, and developing assessments or gamified educational experiences without requiring coding skills. The software also offers powerful video recording and editing tools, along with responsive design support for various screen sizes. With its user-friendly interface, ActivePresenter is perfect for creating slide-based courses, interactive simulations, and video-based lessons across different devices, making it a versatile choice for educators and professionals alike.\nNew Features:\n- Publish to uPresenter.\nBugs Fixed:\n- Video orientation is not detected correctly for some videos.\n- Objects with retain state display incorrectly when revisiting slides in certain cases.\n- Case-insensitive Text Entry Questions fail when using special characters in some languages.\n- The Adjust Variable action cannot assign empty values to text variables.\n- The Wipe exit effect direction is incorrect when opening projects created in version 8.\n- Video proxy file settings are not saved properly.\n- The program crashes when deleting slides containing specific action conditions.\nDeprecated Features:\n- Publish to LMS (replaced by Publish to uPresenter).","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.4.0","version":0,"site":"https://atomisystems.com/","source":"Atomi Systems, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}