{"appId":"w:Audacity.Audacity","appShortcutName":"Audacity","appDisplayName":"Audacity","authorId":"w:winget","releaseTagName":"winget-3.7.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/audacity/audacity/releases/download/Audacity-3.7.5/audacity-win-3.7.5-64bit.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/audacity/audacity/releases/download/Audacity-3.7.5/audacity-win-3.7.5-arm64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Audacity is the world’s most popular free software for recording and editing audio.\n\nAudacity is the world’s most popular free software for recording and editing audio. So if you're producing music, a podcast, or just playing around with audio, Audacity is for you.\n\nAudacity is for anyone who wants to get creative with sound. It’s also the perfect tool for anyone who needs to quickly edit or export audio, for any reason.\n\nCross-platform: Runs on all major operating systems – Windows, MacOS and Linux.\nImport, export, convert: Audacity supports all major audio formats, allowing you to convert WAV to MP3, FLAC, Ogg and much more.\nPlugin support: Elevate your productions with a vast selection of third-party plugins, including VST3, Nyquist and more.\nDeep audio analysis: Visualize frequencies in Audacity's Spectogram view or use scientific Vamp analyzers to make discoveries.\nWindows ARM64 beta\nIn this release, we added support for Windows ARM64. At this time, it comes with the following caveats:\n- Audacity for WoA requires Windows 11 or later. Windows RT is not supported.\n- Plugins (VST, OpenVINO, etc.) are not supported.\n- It requires an WoA-version of FFmpeg, the regular installer does not work.\n- It was not thoroughly tested with all features and workflows due to a lack of devices – your feedback is welcome.\nOther changes:\n- #8942 Windows on ARM support (Thanks, Vasanth K (@vask2108) and Linaro!)\n- #9121 FLAC importer now supports 32-bit PCM (Thanks, Dr. K. D. Murray (@kdm9)!)\n- #8851 Fixed crash when rendering spectrum view (Thanks, Hailey Somerville (@haileys)!)\n- #9097 Fixed lost focus when registration window was closed\n- #8932 Fixed crash on wav import (when audio file is up to 7 ms long)\n- #4444 Fixed crash when using Macro Wizard\n- #9100, #8890 Updated libopus to 1.5.2, updated libcurl to 8.12.1, updated libpng to 1.6.50","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.7.5","version":0,"site":"https://www.audacityteam.org/","source":"Audacity Team","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}