{"appId":"w:Auslogics.BoostSpeed","appShortcutName":"Auslogics BoostSpeed","appDisplayName":"Auslogics BoostSpeed","authorId":"w:winget","releaseTagName":"winget-14.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Being a comprehensive suite of powerful computer maintenance tools, Auslogics BoostSpeed 14 can help optimize your PC to run just the way you like.\n\nAusLogics BoostSpeed is the perfect solution to your computer optimization problem and a powerful tool to tune your system optimally, clean your registry and disk, and optimize your programs.\n\nIt is a program that allows you quickly and efficiently tune your system for maximum performance. The built-in System Adviser will check your system settings through 50 different tests and give you recommendations for each test.\n\nThe program checks your system in real-time and if it finds that any of the parameters can be optimized, it will inform you.\n\nThe program allows you to:\n- speed up your Internet connection with the Internet Optimization Wizard;\n- Significantly speed up the loading of pages thanks to DNS caching;\n- Set up Internet Explorer, Mozilla, and Opera for maximum performance;\n- Activate the Banner Killer feature, which blocks ads from loading;\n- optimize Windows with a number of the kernel, file system, and service settings;\n- clean the registry and hard drive of unnecessary information;\n- optimize Windows look and feel for maximum performance;\n- speed up Windows startup by using the Startup Editor and advanced settings;\n- Comprehensive optimization of Microsoft Office, Internet Explorer, Mozilla, and Opera;\n- Optimize some Windows components, namely Windows Media Player and DirectX;\n- Manage all installed programs with the help of Uninstall Wizard;\n- Optimize the memory of your computer with the powerful optimization function;\n- Comprehensively check the optimization of your system with a System Adviser.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"14.1.0.0","version":0,"site":"https://www.auslogics.com/en/about/","source":"Auslogics","license_or_tos":"Proprietary","resources":null,"verified":false}