{"appId":"w:Auslogics.VideoGrabber","appShortcutName":"Auslogics Video Grabber","appDisplayName":"Auslogics Video Grabber","authorId":"w:winget","releaseTagName":"winget-1.0.0.12","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Video Grabber — Download Any Video in a Click. Whether you’re looking to download YouTube videos to a PC, save videos from Twitter, Facebook, Yahoo, or simply download a video from a website\n\nAuslogics Video Grabber lets you download videos from any website quickly and safely. The program has all the features you need to add tons of new videos to your collection and enjoy hours of quality video content offline. Whether you’re looking to download YouTube videos to a PC, save videos from Twitter, Facebook, Yahoo, or simply download a video from a website, our video grabber software ensures you get the best quality in a few clicks.\n\nWith Auslogics Video Grabber, you can download videos from any website and store them locally for offline use. Whether it’s a 4K video from YouTube or a tutorial video from Yahoo, you’ll be able to save it in the best available resolution. Our software offers support for all popular platforms, making it one of the best video downloaders for all your needs.\n\nAuslogics Video Grabber can download several videos simultaneously to save your time. You can keep adding links to the download list without having to wait for previous downloads to complete. Video Grabber is smart enough to recognize that you have copied a link and to automatically paste it into the “Add URL” field, so you will make fewer clicks.\n\nUnlike some other downloaders, Video Grabber will not restrict download speed, so you can get your videos onto your device in less time. Whether you need a downloader for YouTube or Facebook, Video Grabber will provide the best speed, no matter what.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0.0.12","version":0,"site":"https://www.auslogics.com/en/about/","source":"Auslogics","license_or_tos":"Proprietary","resources":null,"verified":false}