{"appId":"w:Auslogics.DriverUpdater","appShortcutName":"Auslogics Driver Updater","appDisplayName":"Auslogics Driver Updater","authorId":"w:winget","releaseTagName":"winget-2.0.1.4","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Auslogics Driver Updater 2.0 doesn’t just update drivers. It will optimize your hardware, protect it from heat-induced damage, check the safety of installed driver updates, and improve overall PC performance.\n\nAuslogics Driver Updater doesn’t just update drivers. It will optimize your hardware, protect it from heat-induced damage, check the safety of installed driver updates, and improve overall PC performance.\n\nIssues such as choppy audio, distorted video, dropping network, unrecognized devices, or frequent system crashes can often signal that your drivers are out of date or faulty. The app will pinpoint outdated, corrupted, or missing device drivers and provide a report on anything it detects. You will see the release dates of your currently installed drivers and the recommended versions available for installation. With a database that includes over 60 million drivers, Driver Updater helps resolve sound, video, network, and other issues, covering an incredibly wide range of devices and configurations.\n\nClick just one button below the scan results, and the app will automatically install all the updates recommended for your Windows computer. You will also have the option to choose just one or several drivers to update by checking the boxes next to them. Our quick driver updater matches more than 837,000 drivers every hour, ensuring you always have the latest, most compatible driver updates.\n\nDriver Updater supports drivers from over 20,880 hardware and software vendors, including an extensive selection for major manufacturers like Intel (400,000+ drivers), Realtek (250,000+), and Microsoft (200,000+). Auslogics’ intelligent algorithms identify just the right driver version for each of your devices, installing only official, manufacturer-recommended updates. The app will also suggest the most stable driver update when the newest version is known to be buggy.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0.1.4","version":0,"site":"https://www.auslogics.com/en/about/","source":"Auslogics","license_or_tos":"Proprietary","resources":null,"verified":false}