{"appId":"w:Auslogics.RegistryCleaner","appShortcutName":"Auslogics Registry Cleaner","appDisplayName":"Auslogics Registry Cleaner","authorId":"w:winget","releaseTagName":"winget-11.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Auslogics Registry Cleaner is more than a simple registry repair tool. It performs a thorough scan and allows you to effortlessly fix registry issues, improving computer performance.\n\nAuslogics Registry Cleaner is more than a simple registry repair tool. It performs a thorough scan and allows you to effortlessly fix registry issues, improving computer performance.\n\nAuslogics Registry Cleaner identifies and repairs registry malfunctions that can cause system instability and crashes. The tool scans your Windows registry for issues, offering a safe and effective cleanup. Whether you’re using Windows 10, 11, or an earlier version, Registry Cleaner ensures that your system remains stable and reliable.\n\nIt may not be any of your fault, since oftentimes the reason is poorly written software code that does not ensure clean uninstalls. Auslogics Registry Cleaner is the best tool to clean out registry keys left by uninstalled applications to optimize Windows performance.\n\nYou can review the registry entries the program finds to be corrupted and exclude any that you may want to keep for whatever reason. On top of that, Auslogics Registry Cleaner allows you to back up your Windows registry, ensuring you can easily restore it if needed.\n\nA cluttered registry puts extra load on your computer. By optimizing your Windows registry and resolving registry issues, Auslogics Registry Cleaner helps improve PC performance, offering a great solution for system repair and performance boost.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.1.0.0","version":0,"site":"https://www.auslogics.com/en/about/","source":"Auslogics","license_or_tos":"Proprietary","resources":null,"verified":false}