{"appId":"w:Auslogics.DuplicateFileFinder","appShortcutName":"Auslogics Duplicate File Finder","appDisplayName":"Auslogics Duplicate File Finder","authorId":"w:winget","releaseTagName":"winget-11.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Auslogics Duplicate File Finder is a Windows tool that identifies and removes redundant copies of files across drives, folders, and cloud storage using byte-by-byte content comparison to ensure 100% accuracy beyond filename/size matching.\n\nAuslogics Duplicate File Finder is a Windows tool that identifies and removes redundant copies of files across drives, folders, and cloud storage using byte-by-byte content comparison to ensure 100% accuracy beyond filename/size matching.\n\nWith Duplicate File Finder, you can connect removable drives to your computer and easily delete duplicate files from them in a few clicks. Check USB drives, SD/flash cards, portable hard drives and more. Many of these drives may be small in size, so clearing space on them is especially important when you want to keep using the drive for saving data.\n\nWhen a scan completes, you see a list of duplicates organized by groups. The program lets you go through the list of detected duplicate files and manually choose unneeded copies. Alternatively, you can let the app automatically choose and mark copies for removal using its smart selection algorithm.\n\nFind duplicate files by setting various criteria for your search: look for images, audio, video, archives, apps or choose to look through all file types. Set file attributes to ignore, skip files that are too large or small if you like, enter file names or name parts, or let the program run a search with default settings.\n\nYou may choose duplicate files to be removed to Rescue Center or the Recycle Bin to leave a chance of getting them restored if needed.  If you are only clearing a specific set of duplicates and know they won’t be needed, choose to have them deleted permanently, so space is cleared immediately.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.1.0.0","version":0,"site":"https://www.auslogics.com/en/about/","source":"Auslogics","license_or_tos":"Proprietary","resources":null,"verified":false}