{"appId":"w:Auslogics.RegistryDefrag","appShortcutName":"Auslogics Registry Defrag","appDisplayName":"Auslogics Registry Defrag","authorId":"w:winget","releaseTagName":"winget-15.1.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Auslogics Registry Defrag a the safest and fastest way to compact your Windows registry and restore smooth and stable performance with a totally FREE registry defrag tool.\n\nAuslogics Registry Defrag a the safest and fastest way to compact your Windows registry and restore smooth and stable performance with a totally FREE registry defrag tool.\n\nMany computer users have heard about registry cleanup, while registry defragmentation is often overlooked as a way to additionally improve PC performance. Auslogics Registry Defrag puts an extra tool in your hands that will help your Windows work more efficiently.\n\nWith data being written to and deleted from your Windows registry all the time, this critical system database can get fragmented over time, just like a hard drive could. There may be gaps between registry keys that result in more memory being taken up by registry data. Registry Defrag will eliminate the gaps to make your Windows registry smaller and improve its efficiency.\n\nA heavily fragmented Windows registry may get various programs and system components taking longer to read the data they need for proper operation. When the registry is defragmented, reading the necessary keys or entries from it will take less time. This should help applications work a bit faster when accessing registry data.\n\nYour PC may be having intermittent freezes, slow application response or other stability problems. Combined with high memory usage, these issues may significantly reduce your computer's performance. Registry Defrag will defragment and compact your Windows registry to reduce the amount of memory it takes up and restore system stability, so you can once again enjoy a smooth user experience.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"15.1.0.0","version":0,"site":"https://www.auslogics.com/en/about/","source":"Auslogics","license_or_tos":"Freeware","resources":null,"verified":false}