{"appId":"w:Axosoft.GitKraken","appShortcutName":"GitKraken","appDisplayName":"GitKraken","authorId":"w:winget","releaseTagName":"winget-11.6.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://api.gitkraken.dev/releases/production/windows/x64/11.6.0/GitKrakenSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The legendary Git client with an ultra-intuitive GUI, a powerful terminal, and offers a seamless experience for Windows, Mac and Linux.\n\n\n“Shallow repos. It’s not that deep.”\nNew ✨\n- Experimental Feature – Git Executable:\n  - Shallow repo support is now in preview! If you have a shallowly-cloned repository, you can now open it inside of GitKraken Desktop, and most features will work as normal. If you run into any problems, please let us know!\n- GitKraken AI:\n  - Explain Working Changes: Select your unstaged edits and get a clear summary of what changed and why.\nImprovements 🙌\n- Merge Conflict Improvements\n  - AI conflict resolution is now synced to the exact code line so you can review and apply changes faster.\n- GitKraken AI:\n  - Added support for custom OpenAI, Anthropic & Gemini endpoint URLs.\n  - Added the ability to cancel the Commit Composer while the AI is still composing.\n  - Added preset instruction choices to custom instructions in preferences.\n- Experimental Feature – Git Executable:\n  - Bumped Bundled Git to v2.51.1.\n- Upgraded Electron to v38.\n- GitHub pull request templates now support organization-level templates.\n- Added a left-panel context menu option to checkout a tag’s commit directly.\n- Added HTML syntax highlighting for .vue files.\n- When the graph is focused, using the Select First keybind (Ctrl+Home/⌘+↑) will now select the WIP/conflict when present, instead of the most recent commit/stash.\nBug Fixes 🐛\n- Commit/Stash message generation no longer errors with Cannot read properties of undefined (reading ‘requestIdleCallback').\n- Skip Hooks now appears when committing from Git worktrees.\n- GitHub issues using <ul> and <li> now format correctly.\n- GitHub issues with descriptions will once again display tooltips on hover.\n  - Submodules\n    - Fixed failure when cloning unreachable submodules that could leave repos unstable.\n    - Fixed warnings in the Diff View that misattributed changes to uninitialized submodules, when the changes actually belonged to the parent repo.\n- Git notes no longer appear as commits in the graph.\n- Ambiguous branches, tags, and remotes no longer block branch deletion or cause other issues in the graph.\n- Prefetch and other non-standard branches are no longer displayed in the graph.\n- With Git Executable enabled, submodules in the left panel are now alphabetized.\nModernization Notice 🎨\n- Custom Themes\n  - As part of our UI modernization efforts, we will be sunsetting custom themes supported starting in 11.7. Light, dark, and high-contrast themes will remain available.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.6.0","version":0,"site":"https://www.axosoft.com/","source":"GitKraken","license_or_tos":"Proprietary","resources":null,"verified":false}