{"appId":"w:Axosoft.GitKraken","appShortcutName":"GitKraken","appDisplayName":"GitKraken","authorId":"w:winget","releaseTagName":"winget-11.7.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://api.gitkraken.dev/releases/production/windows/x64/11.7.0/GitKrakenSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The legendary Git client with an ultra-intuitive GUI, a powerful terminal, and offers a seamless experience for Windows, Mac and Linux.\n\n\n“Re-rebase (verb): To undo a rebase, only to redo it again.”\nNew ✨\n- Markdown File Preview:\n  - You can now preview markdown files directly in the file viewer! Toggle between Code and Preview modes using the new buttons in the file header.\n- Undo/Redo for Rebase Operations:\n  - Added support for undoing and redoing rebase operations, including Interactive Rebase, Multi-Commit Cherry Pick, dropping and rewording commits, and AI Commit Composer (Recompose with AI).\n- GitKraken AI:\n  - Explain Branch Changes: Right-click any branch to get a clear summary of what changed and why.\nBug Fixes 🐛\n- Fixed AI Commit Composer failing when composing commits that include empty new files, binary files, deleted or renamed files, or files with identical hunk headers.\n- F11 now toggles fullscreen on Windows and Linux, matching platform conventions.\n- “Revert Hunk” will no longer appear on working directory changes (“WIP”). “Discard Hunks” is still available for WIP changes.\n- Fixed blank UI when selecting too many options in Launchpad filters for Jira issues.\n- Fixed an issue where commit hook changes did not appear in the unstaged area.\n- Fixed an issue where Git commit options (“skip hooks” and “push after commit”) were not being honored when using the commit keyboard shortcut: Shift/Cmd + Enter.\nModernization Notice 🎨\n- Custom Themes: Custom themes will be sunset in 11.8.0 as we modernize the UI for better performance and maintainability. Our new architecture requires rebuilding theme support from the ground up. Light, dark, and high-contrast themes will remain available during the transition.\n  - We plan to restore custom theme support once the modernization is complete.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.7.0","version":0,"site":"https://www.axosoft.com/","source":"GitKraken","license_or_tos":"Proprietary","resources":null,"verified":false}