{"appId":"w:Axosoft.GitKraken","appShortcutName":"GitKraken","appDisplayName":"GitKraken","authorId":"w:winget","releaseTagName":"winget-11.5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://api.gitkraken.dev/releases/production/windows/x64/11.5.0/GitKrakenSetup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The legendary Git client with an ultra-intuitive GUI, a powerful terminal, and offers a seamless experience for Windows, Mac and Linux.\n\n\n“It was bothering us too.”\nPerformance ⚡️\nIn 11.5, GitKraken Desktop got faster across the board: large repo load times, stash refreshes, branch and tag updates, and even memory usage have all improved. More perf improvements to come in future releases!\n- Faster commits and checkouts! We saw >100% speed-up on both in the VS Code repository!\n  - This is thanks to faster branch and tag refreshes (up to 98% faster!), massively speeding up graph updates on repos with thousands of branches/tags.\n- Up to 480% faster opening of large repositories! We now perform git maintenance in the background on your open repository. After this completes, future opens will be dramatically faster.\n- Up to 100x faster loading of stashes, further improving repo open speeds on repositories with many local stashes.\n- Up to 20% less RAM use\nNew ✨\n- GitKraken AI:\n  - Users can now choose their preferred model from any provided by GitKraken AI, including our newly-added OpenAI GPT-5 models.\n  - GPT-5 is now available for those bringing their own OpenAI API key.\n  - Added a usage gauge in the profile menu for easy reference of your GitKraken AI token usage.\n- Added organization suggestions in Preferences > Members to help users discover and join relevant teams.\nImprovements 🙌\n- When creating a pull request, if only one PR template is available, it will be automatically selected.\n- Hovering an annotated tag in the left panel now shows its annotation.\n- Experimental Feature – Git Executable:\n  - Users who have opted out of the Git Executable (in the Experimental settings) should note that most of the performance gains in this release are only available with the Git Executable enabled.\n  - Added support for Reset branch (hard/mixed/soft) to commit.\n  - Added support for Undo checkout.\n  - Added support for submodules.\nBug Fixes 🐛\n- Fixed an issue where the Commit Detail panel was not refreshing after discarding unstaged renamed files or added staged files.\n- Fixed issue where undoing a checkout to a branch with submodules did not update the submodules, even with Keep submodules up to date enabled.\n- Fixed a visual issue in dropdowns where the selected content was misaligned in the Create Jira Issue panel.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.5.0","version":0,"site":"https://www.axosoft.com/","source":"GitKraken","license_or_tos":"Proprietary","resources":null,"verified":false}