{"appId":"w:BaldurKarlsson.RenderDoc","appShortcutName":"Winget Application","appDisplayName":"RenderDoc","authorId":"w:winget","releaseTagName":"winget-1.39.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://renderdoc.org/stable/1.38/RenderDoc_1.38_64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A stand-alone graphics debugging tool\n\nRenderDoc is a free MIT licensed stand-alone graphics debugger that allows quick and easy single-frame capture and detailed introspection of any application using Vulkan, D3D11, OpenGL & OpenGL ES or D3D12 across Windows, Linux, Android, or Nintendo Switch™.\nThis version contains a number of new bugfixes and some usability improvements.\nAs always binary builds with installers, zips and tarballs are available on renderdoc.org.\nPython API changes\n- No breaking changes to the Python API.\nFeatures/Improvements\n- UI: RGB casts of values in the Shader Debugger watch window or Buffer Viewer now treat values as linear, not sRGB.\n- UI: Constant buffer variables can now be shown with an RGB swatch using the [[rgb]] annotation.\n- UI: The texture goto-pixel window no longer closes when the mouse leaves the window, it closes when the window loses focus.\n- UI: Shader search paths now have a 'recursive' toggle which defaults to on. When unchecked, this path will never be searched recursively for files to locate missing separate debug information. This can be useful for slow shared drives or very large folders with many files, where exact filename matches are expected as standard.\n- AMD: Update version of GPUPerfAPI to 4.0.\n- Android: Add specific error message for broken devices.\n- D3D12: When reflection information is stripped from an SM5 shader and separate debug info is available in a pdb, try to regenerate best-effort reflection with the debug data available.\n- D3D12: Improve custom DXIL disassembly for resource/cbuffer array access.\n- D3D12: Improve matching of separate debug information and add some new heuristics to match PIX's undocumented search behaviour.\n- Vulkan & D3D12: Improve error messages when mesh shader output comes back as invalid, in case of application errors.\n- Vulkan: Remove change of pipeline cache UUID to allow applications to preserve pipeline cache between running with and without RenderDoc.\n- Vulkan: Implement support for extensions:\n  - VK_KHR_maintenance5\n  - VK_EXT_image_compression_control\n  - VK_EXT_image_compression_control_swapchain\nBugfixes\n- UI: Fixed Shader Debugger tooltips inconsistent behaviour for array variables .\n- UI: Ensure that copy-pasted strings in command line can't include newlines.\n- UI: Fix target control connections not being made successfully if remote server is using an alternate port.\n- D3D: Fix crash with out of bounds clamping behaviour when debugging SM5 shaders with loads/stores near the end of buffers.\n- D3D12: Fixed array variables being displayed as matrices when debugging SM6 shaders.\n- D3D12: Fix global array value loads retrieving the wrong values when debugging SM6 shaders.\n- D3D12: Fix initialiser values for mutable global variables not properly being set when debugging SM6 shaders.\n- D3D12: Fix some cases of debug data for complex types not being properly processed when debugging SM6 shaders.\n- D3D12: Fix shader debugging loads from UAVs created with UNKNOWN format when underlying resource format should be used when debugging SM6 shaders.\n- D3D12: Fix cases where source-level debugging would not properly be activated when source information is available in separated PDBs.\n- D3D12: Fix debugging pixel shaders failing when mesh shaders are in use.\n- D3D12: Fix extremely slow loading and debugging of SM5 shaders with arrays of structures in the debug data.\n- D3D12: Fix debug data being incorrect for array-of-struct variables in SM5 shaders.\n- D3D12: Fix calculation of derivatives after a discard when debugging SM6 shaders.\n- D3D12: Fix a crash when capturing application using sparse MSAA textures.\n- D3D12: Fix incorrect handling of resources with ALLOW_SIMULTANEOUS_ACCESS flag which are discarded.\n- D3D12: Improve handling of NULL initialisers when debugging SM6 shaders.\n- Vulkan: Fix dynamic storage buffers not properly reflecting dynamic offsets in pipeline state view.\n- Vulkan: Fix some situations where shader debugging would be wrong due to incorrect derivative readback.\n- Vulkan: Fix mesh output data being wrong when vertex attribute offset is larger than its stride.\n- Vulkan: Fix overlay usage when using EXT_shader_object.\n- Vulkan: Fix crash on Intel when running pixel history due to driver workaround.\n- Vulkan: Fix crash debugging pixel shader with 16-bit input.\n- Vulkan: Fix incorrect mesh data generated from vertex shader with 16-bit output.\n- Vulkan: Fix sparse buffers used only via bufferDeviceAddress having incorrect data.\n- Vulkan: Fix incorrect flags being used for internal pipelines when recompiling EXT_graphics_pipeline_library pipelines.\n- Vulkan: Fix centroid interpolator not being stripped for patched compute shader when fetching mesh output data.\n- Vulkan: Don't force buffer device address flags for image dedicated memory allocations.\n- Vulkan: Fix resource usage not being propagated for secondary command buffers if dynamic rendering is used.\n- Vulkan: Fix incorrect display of other instances/previous draws when selected if mesh shaders are used.\n- Vulkan: Fix image states not being correctly tracked in some case with secondary command buffers.\n- Vulkan: Fix crash when using manual swapchain image creation.\n- Vulkan: Fix crash displaying YUV textures when using remote replay (e.g. on Android).\n- Vulkan: Fix a case where a pNext chain is modified in user memory instead of locally patched memory.\n- Vulkan: Fix shader debugging when using class member functions.\n- Vulkan: Fix a case where if the same descriptor set is bound to compute and graphics with dynamic offsets the offsets could be applied twice when shader debugging.\n- OpenGL: Fix incorrect display for quad overdraw overlay when using renderbuffer for depth.\n- OpenGL: On windows try to prevent hooking problems if libraries are loaded and unloaded repeatedly.\n- OpenGL: Fix emulation of glCopyImageSubData failing for some compressed texture formats and dimensions.\n- OpenGL ES: Fix custom visualisation shaders not compiling.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.39.0","site":"https://renderdoc.org/","source":"Baldur Karlsson","license_or_tos":"MIT","resources":null,"verified":false}