{"appId":"w:BaldurKarlsson.RenderDoc","appShortcutName":"Winget Application","appDisplayName":"RenderDoc","authorId":"w:winget","releaseTagName":"winget-1.37.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://renderdoc.org/stable/1.37/RenderDoc_1.37_64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A stand-alone graphics debugging tool\n\nRenderDoc is a free MIT licensed stand-alone graphics debugger that allows quick and easy single-frame capture and detailed introspection of any application using Vulkan, D3D11, OpenGL & OpenGL ES or D3D12 across Windows, Linux, Android, or Nintendo Switch™.\nThis version contains primarily bugfixes after v1.36, but also includes some improvements and additional functionality support.\nAs always binary builds with installers, zips and tarballs are available on renderdoc.org.\nNote\nIn this release RenderDoc now is able to decode an undocumented previously unknown DXBC blob chunk which contains embedded shader source information when building with separate PDBs. If you were previously compiling shaders with -Qembed_source_in_debug to ensure shader source was available for RenderDoc this is no longer necessary and you may want to remove that flag to reduce the size of the separate PDBs.\nPython API changes\n- ReplayOutput.SetDimensions has been removed. This was only valid for headless windows, you should recreate the window directly.\nFeatures/Improvements\n- UI: Python extension registration has more error checking and is more robust to syntax errors during register/unregister functions.\n- UI: Try to preserve selected pipeline stage when switching between mesh and normal draws.\n- D3D12: Bitfield declarations are reflected from DXIL metadata for structure types.\n- D3D12: Add handling of undocumented chunk in DXBC containers that can include source code files.\n- D3D12: Improve detection of code scopes during DXIL shader debugging.\n- D3D12: Improve handling of debug info mapping source variables to information in DXIL.\n- D3D12: Do limited parse of DXBC container to determine state object entry points.\n- D3D12: Improve display of root buffer structured buffers.\n- Vulkan: Improved capture memory overhead for cases of many images aliased in one location with only a small number used.\n- Vulkan: Optimise repeated name-setting of objects to not record every name.\n- Vulkan: Improve speed of processing printf messages for large shaders.\n- Vulkan: Ignore certain WSI-only extensions for replay compatibility as they are unused.\n- Vulkan: Preserve selected stage where possible when switching between mesh-shader and normal draws.\n- Vulkan: Implement capture and replay support for a number of extensions (not including shader debugging):\n  - VK_KHR_shader_quad_control\n  - VK_KHR_shader_maximal_reconvergence\n  - VK_KHR_shader_expect_assume\n  - VK_KHR_shader_float_controls2\n  - VK_KHR_shader_subgroup_rotate\n  - VK_KHR_ray_tracing_position_fetch\n  - VK_KHR_ray_tracing_maintenance1\nBugfixes\n- All: Fix expansion of pre-processed shader debug source when #line directives are self-referential to a file.\n- All: Fix installer to hopefully work out of the box on windows 11 where vbscript has been disabled.\n- All: Fix remote-replay of integer textures which require a format-remap.\n- Linux: Fix a potential crash on startup accessing invalid memory.\n- Linux: Fix vkconfig not being correctly identified and warned about in some cases.\n- Linux: Fix failure to properly launch program if it contained r-xp in the binary path.\n- Linux: Fix a potential use-after-destroy with replay loop window.\n- UI: Fix the mesh viewer arcball/flycam controls getting out of sync when reloading captures.\n- UI: When exporting matrices in CSV, add quotes around the multiple lines.\n- GL: Add extra checking for MultiDraw functions to protect against crashes due to bad application data.\n- GLES: Fix an out of bounds write for non-standard ASTC dimensions.\n- D3D: Work around old fxc version bug with MSAA per-sample loads.\n- D3D: Prefer loading a new fxc version over an old fxc version, even if it means loading two into the same process.\n- D3D: Fix debugging of DXBC shaders in cases where the input signature is packed with multiple integer SV semantics such as SV_InstanceID and SV_PrimitiveID.\n- D3D11: Fix output targets being considered as used incorrectly and shown in pipeline state as if an error.\n- D3D12: Fix a case when debugging shaders where control flow was not identified correctly.\n- D3D12: Display the index-buffer strip cut value in the pipeline state view.\n- D3D12: Fix shader debugging when writing to UAVs on elements that go out of bounds on only some components.\n- D3D12: Fix a crash debugging a shader with an unbound SRV.\n- D3D12: Recalculate offsets for UAV structures manually to ignore incorrect offsets provided in DXIL reflection data.\n- D3D12: Fix shader debugging with shaders containing anonymous structs.\n- D3D12: Fix shader debugging with non-square temporary matrices.\n- D3D12: Fix tracking of sparse page tables not working in mip tails with wrapping binds.\n- D3D12: Fix a case where an empty d3d12sdklayers.dll would be attempted to be loaded if it wasn't available during capture.\n- D3D12: Fix a crash if an AS is specified with geometry with a vertex stride of 0.\n- D3D12: Fix a potential crash if ASs are built on a compute-only command buffer.\n- D3D12: Fix disassembly of constant buffers with a single scalar type.\n- D3D12: Fix debugging of shaders with SM6.6 direct heap access for buffers.\n- D3D12 & Vulkan: Fix handling of overlapping and nested GPU address ranges with aliased resources.\n- Vulkan: Work around AMD driver bug in vkGetAccelerationStructureBuildSizesKHR.\n- Vulkan: Mark mesh shaders using task payloads as unsupported for debugging.\n- Vulkan: Don't emit performance counter queries for events on compute/transfer queues.\n- Vulkan: Fix fossilize serialisation of mutable descriptors.\n- Vulkan: Fix handling of swapchains for Android devices that report an absurd minimum number of swapchain images.\n- Vulkan: Fix case where swapchain resizing could cause cascading errors and lead to a GPU crash/hang.\n- Vulkan: Fix a crash when RT is enabled and allocating memory on multiple threads.\n- Vulkan: Fix a crash freeing memory on multiple threads.\n- Vulkan: Fix adding duplicate structs to pNext chain when capturing a program that uses BDA capture/replay.\n- Vulkan: Display task and mesh shaders correctly when used with graphics pipeline libraries.\n- Vulkan: Fix a crash when loading captures that include waiting resolves of AS queries.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.37.0","site":"https://renderdoc.org/","source":"Baldur Karlsson","license_or_tos":"MIT","resources":null,"verified":false}