{"appId":"w:Bandisoft.BandiView","appShortcutName":"BandiView","appDisplayName":"BandiView","authorId":"w:winget","releaseTagName":"winget-7.21","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://bandisoft.app/bandiview/BANDIVIEW-SETUP-ALL.EXE"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://bandisoft.app/bandiview/BANDIVIEW-SETUP-X64.EXE"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A New Standard for Image Viewers\n\nBandiView is the succeeding image viewer to Honeyview, that inherits everything cool of its predecessor and also gets improved even further. Fast and easy to view images in a variety of formats, from the most common ones to the most professional ones.\n- Fixed a bug that the thumbnail preview on File Explorer does not work for HEIC and HEIF files\n- Added support for the thumbnail preview of HIF files on File Explorer\n- Improved the image group feature to handle the HIF format\n- Added -rect switch moving the app window to fit the defined rectangle\n- Added a feature adding an image to the current playlist by Shift + drag & drop\n- Added an option \"Fit to Height\" when resizing an image with the image converter\n- Added an option deleting the original file after conversion\n- Fixed a bug that \"Fix scroll position\" does not work correctly with the webtoon view mode\n- Added bv.exe (command-line image converter)\n- Added a feature to recognize or ignore specific extentsions as image files\n- Fixed a bug that the app cannot process some APNG files correctly.\n- Improved the image converter's UI\n- Added a feature to overwrite files when duplicate filenames occur during image conversion\n- Added a feature to specify transparency when \"Add padding\" is selected during image conversion\n- Added support for Ultra HDR JPEG format\n- Fixed a bug that the app cannot open some JPG files\n- Other modifications","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.21","site":"https://www.bandisoft.com/","source":"Bandisoft.com","license_or_tos":"Proprietary","resources":null,"verified":false}