{"appId":"w:BartelsMedia.ShareMouse","appShortcutName":"ShareMouse","appDisplayName":"ShareMouse","authorId":"w:winget","releaseTagName":"winget-6.0.65","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Share one Mouse and Keyboard with Multiple Computers\n\nShareMouse allows you to control multiple Macs or Windows computers with the mouse or keyboard of any other computer.\nMove the mouse to the screen of another computer and the mouse pointer jumps to that screen, allowing you to control the remote computer.\n\nYour keyboard works on the remote computer, too! ShareMouse transmits mouse/keyboard actions through your existing network connection to any computer you currently operate with the mouse.\n- Any computer can control the mouse & keyboard of any other computer in any direction.\n- You can drag & drop files and copy & paste the clipboard between Mac and Windows computers.\n- The physical display layout configured in the Display Manager for seamless mouse transitions.\n- ShareMouse creates profiles for each work place and automatically switches the display layout.\n- Unused displays can be optionally dimmed. Arrow trails help finding the mouse cursor in large display arrays.\n- Advanced options prevent accidental display switching, e.g. when operating near the edge of a display.\n- ShareMouse can synchronize screensavers, login/logout and shutdown between computers.\n- Multiple workplaces can be isolated with password protection and AES encryption.\n- Updated system components to maintain OS compatibility.\n- Support for displays with non-alphabetic identification strings.\n- SSL TLS 1.2 support","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.0.65","version":0,"site":"https://www.bartelsmedia.com/","source":"Bartels Media GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}