{"appId":"w:Basilisk.Basilisk","appShortcutName":"Basilisk","appDisplayName":"Basilisk","authorId":"w:winget","releaseTagName":"winget-52.9.2025.10.10","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://dl.basilisk-browser.org/basilisk-20251009121624.win64.installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A XUL-based web-browser built on top of the Unified XUL Platform (UXP). This browser is a close twin to pre-Servo Firefox in how it operates.\n\nBasilisk is a free and Open Source XUL-based web browser, featuring the well-known Firefox-style interface and operation. It is based on the Goanna layout and rendering engine (a fork of Gecko) and builds on the Unified XUL Platform (UXP), which in turn is a fork of the Mozilla code base without Servo or Rust.\nThis Basilisk release integrates all Pale Moon changes from 33.8.1 through 33.9.1, introducing major web platform improvements, enhanced standards compliance, Linux stability fixes, and multiple security patches.\n- Implemented CSS4 revert keyword and the clip keyword for overflow.\n- Implemented CSS axis-shorthand parsing of overflow, resolving unscrollable areas on some websites.\n- Implemented color-mix() (RGB and HSL color spaces).\n- Implemented @supports(selector(<complex selector>)) and CSS Cascade Layers via @layer.\n- Implemented clip-path:<geometry-box> usage without explicit paths.\n- Implemented overflow-inline and overflow-block properties.\n- Implemented :autofill and :focus-visible CSS pseudo-classes.\n- Implemented the prefers-reduced-motion media query.\n- Implemented a minimal visualViewport API.\n- Un-prefixed user-select, :read-only, and :read-write to align with the current CSS4 specification.\n- Improved parsing of X-Content-Type-Options: nosniff and corrected regressions from earlier updates.\n- Changed @import processing to follow order of appearance in stylesheets.\n- Aligned TypedArray constructors with the ECMAScript spec (invalid or undefined initializers now return empty arrays).\n- Improved multi-header Cache-Control parsing.\n- Address bar focus state now correctly resets when navigating to #fragment anchors.\n- Cookies without valid names are now rejected per RFC 6265; nameless cookies (beginning with =) are no longer accepted.\n- Added FFmpeg 7.0 / libavcodec 61 support for improved multimedia compatibility.\n- Fixed border-image sub-property update bug.\n- Fixed scrollbar-width inheritance handling.\n- Explicitly initialized fontconfig on Linux startup to fix missing font issues.\n- Fixed color-depth reporting inconsistencies on Linux.\n- Fixed VPX and ffvpx build issues on PowerPC and non-assembly architectures.\n- Fixed a memory safety issue in gradient color-stop handling.\n- Improved DevTools “Copy as cURL” reliability.\n- Adjusted CSP URI reporting and data-load restrictions for <object> elements to better follow modern web standards.\n- Fixed WebAssembly table size limit handling to align with other engines.\n- Fixed crashes and regressions introduced in prior <object> restriction code.\n- Fixed address bar dropdown highlight styling regression.\n- Numerous Defense-in-Depth and memory safety improvements across components.\n- Built on UXP commit: 545d52572d\n- Security issues addressed: CVE-2025-10536, CVE-2025-10533 (DiD), CVE-2025-9181, CVE-2025-8031, CVE-2025-8028 (DiD), CVE-2025-8037, CVE-2025-8029, and additional non-CVE fixes.\nImplementation notes\n- overflow: clip now fully conforms to the CSS specification. Clipped overflow is hidden and unscrollable. If only one axis is specified, the other remains visible but cannot be scrolled.\n- clip-path:<geometry-box> can now be used without a path definition, resolving prior cases where blank content appeared.\n- visualViewport is minimally implemented for desktop environments: fixed (0,0) origin, root scrollframe dimensions, and scale factor = 1.0.\n- TypedArrays with invalid or undefined initializers no longer throw; they return a zero-length array instead.\n- Cookies: nameless cookies (starting with =) are now rejected outright. Cookies without an equals sign are interpreted as valueless named cookies, improving RFC compliance and preventing malformed cookie injection.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"52.9.2025.10.10","version":0,"site":"https://www.basilisk-browser.org/","source":"Basilisk Development Team","license_or_tos":"MPL-2.0","resources":null,"verified":false}