{"appId":"w:Basilisk.Basilisk","appShortcutName":"Basilisk","appDisplayName":"Basilisk","authorId":"w:winget","releaseTagName":"winget-52.9.2026.01.23","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://dl.basilisk-browser.org/basilisk-20260123020224.win64.installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A XUL-based web-browser built on top of the Unified XUL Platform (UXP). This browser is a close twin to pre-Servo Firefox in how it operates.\n\nBasilisk is a free and Open Source XUL-based web browser, featuring the well-known Firefox-style interface and operation. It is based on the Goanna layout and rendering engine (a fork of Gecko) and builds on the Unified XUL Platform (UXP), which in turn is a fork of the Mozilla code base without Servo or Rust.\nUXP Changes:\n- Allow themes to detect Windows 11 usage.\n- Implemented WeakRef.\n- Implemented URL.canParse().\n- Implemented the inset-block and inset-inline CSS shorthands.\n- Added a preference (privacy.forgetaboutsite.clearPasswords) to control clearing of passwords when using \"forget about this site\" in the permissions manager, and disabled clearing of passwords by default, since it was considered unexpected behavior by the community.\n- Re-landed CSS Cascade Layers support after the previous back-out.\n- Re-landed CSS color-mix support after the previous back-out. RGB and HSL color spaces only, like previous.\n- Implemented viewport overflow propagation logic. See implementation notes.\n- Unprefixed CSS -moz-appearance; Basilisk now accepts the unprefixed CSS appearance keyword. For compatibility, -moz-appearance and -webkit-appearance (if enabled) have been retained.\n- Fixed an intermittent but fairly prominent crash-to-desktop due to JavaScript garbage collection on certain modern sites.\n- Fixed a crash on sites with certain types of CSP handling.\n- Fixed a crash in WASM.\n- Updated NSS to 3.90.9 (custom).\n- Updated ICU to v78.1.\n- Added support for building on Sparc64 hardware.\n- Added support for building for NetBSD on DEC Alpha.\n- Added basic support for building on Mac PowerPC (still a work in progress).\n- Added basic support for building on LoongArch64 hardware (龍芯 CPUs).\n- Added support for running on FreeBSD 15.\n- Removed automatic coloring of auto-filled login fields.\n- Restored support for in-process NPAPI plugins.\n- Improved JavaScript IonMonkey stability on ARM and Mac SoC hardware.\n- Built on UXP commit: f272382a9c\n- Security issues addressed: CVE-2025-13015, CVE-2026-0879 (DiD), CVE-2026-0880 (DiD), CVE-2026-0889 (DiD), CVE-2026-0883, CVE-2026-0886 (DiD), and several others without a CVE designation.\n\nBasilisk Changes:\n- Change dom.always_stop_slow_scripts pref to true by default\n- Implement internal polyfill loader based on Greasemonkey to help with compatibility when UXP does not support specific JS features.\n- Update PDF.js to v3.11.174.\n- Restore official branding files back to Basilisk repo.\n- Make List All Tabs button removable and always visible.\n- Implement Firefox's \"Container Tabs\" functionality.\n- Introduced LoongArch64 builds. These are built on Slackwareloong64.\n\nIncluded Polyfills:\n- This release includes the following polyfills:\n  - image.decode\n  - Intl.DisplayNames\n  - TextEncoderStream\n  - ReadableStream pipeTo\n  - ReadableStream pipeThrough\n  - FinalizationRegistry\n\nBasilisk Update Notes:\n- There may be situations in which the \"restore session\" functionality does not correctly assign restored tabs to the container in which they were used. If this happens to you please report the exact steps to reproduce.\n- PDF.js v3.11.174 was chosen because it is the last version not to use JS Modules.\n- PDF.js has the following changes applied:\n  - Fix for CVE-2024-4367 (isEvalSupported set to false by default).\n  - Disabled XFA by default.\n  - Disabled execution of arbitrary JavaScript in all PDF files by default. I was just as horrified as you are to learn that this exists and is an actual spec.\n  - CSS and JS fixes as needed to make it render and work correctly in UXP-based browsers.\n- Releases on all platforms other than Windows are now built with Clang + Thin LTO for improved performance.\n\nUXP Implementation Notes:\n- The WeakRef spec only allows code to hint/coerce and does not guarantee if or when dereferencing happens.\n- A number of sites have started using overflow-x: clip without overflow-y on full-document elements. While this makes little sense, our strict implementation previously resulted in unscrollable pages. There is special viewport overflow propagation logic in the relevant drafts which we have now implemented to avoid this behavior.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"52.9.2026.01.23","version":0,"site":"https://www.basilisk-browser.org/","source":"Basilisk Development Team","license_or_tos":"MPL-2.0","resources":null,"verified":false}