{"appId":"w:Beeftext.Beeftext","appShortcutName":"Beeftext","appDisplayName":"Beeftext","authorId":"w:winget","releaseTagName":"winget-16.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/xmichelo/Beeftext/releases/download/v16.0/Beeftext-16.0-Installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A text snippet management tool for Windows, inspired by TextExpander.\n\nAre you tired of repeatedly typing the same text over and over again?\n- The custom email signature you only use for your close friends.\n- The markdown snippet you use 5 times a day.\n- The text emoji you like so much (\\/) (°,,,°) (\\/).\nBeeftext is made for you. Beeftext allows you to define combos. A combo associates a short word that you are unlikely to type in a normal situation (a keyword) with a piece of long or complex text you often need to type (a snippet). From now on, every time you type the keyword, in any text area of any application that supports copy/paste (99.9% of them do), the combo is triggered and Beeftext automatically replaces the keyword with its associated snippet. Thanks to Unicode encoding, this text can be in any language, using any kind of characters, even exotic ones.\n- Fixed crash on Windows 11 if an image is in the clipboard (issue #548).\n- Added option to disable restoration of clipboard after combo substitution (issue #550).\n- Beeftext now uses regular Windows line-ending (CR/LF) when pasting snippet (issue #537).\n- Re-ordered fields in combo dialog (issue #531).\n- If combo name is empty, a placeholder name is computed (issue #529).\n- Removed error in log if process list file does not exists (issue #545).","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"16.0","version":0,"site":"https://michelon.ch/","source":"beeftext.org","license_or_tos":"MIT","resources":null,"verified":false}