{"appId":"w:Beeper.Beeper","appShortcutName":"Beeper","appDisplayName":"Beeper","authorId":"w:winget","releaseTagName":"winget-4.1.250","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://beeper-desktop.download.beeper.com/builds/Beeper%20x64%204.1.250.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"All your chats in one app. Yes, really.\n\nA single app to chat on iMessage, WhatsApp, and 13 other chat networks. You can search, snooze, or archive messages. And with a unified inbox, you’ll never miss a message again.\nNew\nDisappearing Messages indicators show on messages and in the chat’s header\nCreate New Groups on Matrix with CMD+SHIFT+N / CTRL+SHIFT+N\nOn-Device Instagram: Added support for receiving typing indicators for other users\nTurn spell checking on or off under Settings > Appearance > Composer > Enable spellcheck\nFixed & Improved\nFixed an issue that caused On-Device Twitter connections to be disconnected\nFixed chats sometimes not staying in Low Priority or Pinned\nFixed “Disable emoji autocomplete” setting\nFixed some instances of profile picture not syncing\nFixed auto-linking of email addresses in messages\nFixed message forwarding not working for messages with attachments\nFixed instances of chats opening at the wrong scroll position\nFixed an issue with On-Device Instagram and Facebook bridges where incoming messages could be missed\nFixed messages failing to send with a \"bridge is not started\" error after logging out of one of several accounts on the same On-Device connection\nFixed a crash that can occur when logging out\nEnsure quick reactions honor your chosen skin tone\nEnsured link previews are sent with scheduled messages\nPrevent iMessage search results showing when you’ve filtered to a different account\nAddressed high CPU usage in certain bridges\nSeveral other small UI/UX improvements\nSeptember 16, 2025 - Beeper Android - 4.32.1","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.1.250","site":"https://www.beeper.com/","source":"Beeper Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}