{"appId":"w:Beeper.Beeper","appShortcutName":"Beeper","appDisplayName":"Beeper","authorId":"w:winget","releaseTagName":"winget-4.2.330","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://beeper-desktop.download.beeper.com/builds/Beeper%20x64%204.2.330.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"All your chats in one app. Yes, really.\n\nA single app to chat on iMessage, WhatsApp, and 13 other chat networks. You can search, snooze, or archive messages. And with a unified inbox, you’ll never miss a message again.\nNew\nCustomize your preset times for Reminders under Settings > General > Time Suggestions\nCustomize what happens when you double-click a chat under Settings > Appearance > Chat List > On double-clicking a chat…\nDouble-click messages to add a reaction with Settings > General > On double-clicking a message > React with…\nGroup chats now have a Notes section in the Chat Info sidebar\nMatrix invites are grouped in a new Requests section\nNew Command Bar (CMD+J / CTRL+J) options to “Copy current chat ID” and “Copy invite link” (on supported chats)\nInstagram no longer syncs view-once media. Please use the native Instagram app to view.\nFixed & Improved\nFixed certain audio messages not transcribing correctly\nFixed the UI bouncing back and forth when you edit a very tall message\nImproved performance when sending messages to Signal groups and added support for sending typing notifications to Signal groups\nFixed another issue where muting On-Device WhatsApp conversations would not work\nFixed a bug where disabled accounts wouldn't get recalculated when an account is removed in some cases\nImproved grouping of disappeared messages\nFixed issue that sometimes caused chats to be stuck unread\nFixed the account connect/reconnect window sometimes appearing blank\nFixed chats sometimes showing a reminder when the reminder has already been cleared\nFixed chat avatars sometimes showing the wrong image\nFixed rich text support in Discord\nPrevent WhatsApp connections from breaking after a temporary WhatsApp outage\nImprove recovery in poor network conditions\nYour preferred emoji skin tone syncs across devices and is used more consistently\nShow Messenger stickers at the same size as they appear on Messenger, instead of gigantic\nShow the thumbs-up message consistently as an emoji rather than sometimes an emoji and sometimes a (gigantic) sticker\nSeveral more UX improvements","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.2.330","version":0,"site":"https://www.beeper.com/","source":"Beeper Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}