{"appId":"w:BenjaminLSR.HandheldCompanion","appShortcutName":"Winget Application","appDisplayName":"Handheld Companion","authorId":"w:winget","releaseTagName":"winget-0.22.0.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Valkirie/HandheldCompanion/releases/download/0.22.0.5/HandheldCompanion-0.22.0.5.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ControllerService\n\nA touch optimized GUI to increase your handheld gaming computer experience.\nA 2025 new year build which implements a lot of bug fixes and greatly improved controller management. Please take a moment to read the below.\nSystem Hibernation, The Sleep Demon\nResuming from system sleep and hibernation has been an absolute pain since we started working on Handheld Companion. Especially because of the lack of Microsoft transparency in the way it handles controllers slot attribution but also because of the strain resuming from sleep puts on objects and memory management. Across the last few releases we've been slowly improving memory management and the overall robustness of all task managers. With 0.22.0.5 we might finally have found a way to hold into virtual controller slot on system resume, preventing users from having to restart the app for a stable experience.\nNew Layout Action: Inherit\nNeedless to say we're reading most of your comments and suggestions on both Patreon, Discord and Github. Three weeks ago, SgtSweetieBelle made a Github post about the complexity of keeping several game profiles up-to-date, which are typically slight variations of your Default profile. However, updating the Default profile requires manually applying the same changes to all other profiles, which is time-consuming and tedious. SgtSweetieBelle suggested implementing a \"Transparent\" option for buttons, allowing them to inherit the Default profile's binding. Updates to the Default binding would automatically apply to profiles with \"Transparent\" settings. Additionally, new profiles should default all bindings to \"Transparent,\" letting users customize overrides as needed for specific apps. We delivered!\nWhat's Changed\nDevice Support\n- ONEXPLAYER Fly F1 Pro\n- GPD Win Max 2 (2025) - HX370\n- GPD Win 4 (2025) - HX370\n- Antec Core HS\n- AYANEO (all devices), implemented charging bypass, thanks to <@274238246500696065>.\n- All devices, implemented AMD Strix Point CPU support.\nImprovements\n- Improved overall software stability, performance and resource management.\n- Improved controller management, with ability to restore virtual controller to its previous slot when resuming from hibernation and early automatic external controller selection.\n- Implemented new layout action: Inherit, will mimic Default profile action for this button. Inherit will be the new default action for every profile from now on. As per SgtSweetieBelle request: #1181.\n- Implemented new application settings: Process priority, used to help HC inputs latency in CPU constrained environment and Steam Deck vibration interval.\n- Improved GPU management, making it more stable but also preventing crash on startup when ADLX library can't be loaded (OEM drivers suxx).\n- Improved settings management,\nBugfixes\n- Fixed an issue causing a crash when trying to kill a disposed process.\n- Fixed an issue causing a crash when manipulating screen framerate limits.\n- Fixed an issue where PrimaryDesktop screen wouldn't be updated on time.\n- Fixed an issue causing HC to start with status SystemPending on rare occasion.\n- Fixed an issue preventing GPU from being properly initialized due to race condition with other managers.\n- Fixed an issue affecting devices with two screens with identical FriendlyName.\n- Fixed an issue with multi-screen support due to async managers handling.\n- Fixed an issue where the virtual controller was disconnected and reconnected once again when not required.\n- Fixed an issue affecting GPU Execute function on device initialization.\n- Fixed an issue that caused QuickOverlayCommands to report an incorrect state.\n- Fixed an issue causing a crash on controller disconnect.\n- Fixed an issue where Dynamic Lighting settings wouldn't be applied on cold boot.\n- Fixed an issue preventing power profile name/description edits from being saved.\n- Fixed an issue affecting UI resolution and frequency updates.\n- Fixed an issue causing a crash when manipulating Hotkeys list.\n- Fixed an issue affecting settings: Desktop profile on start.\n- Fixed an issue affecting AutoTDP limit value updates.\n- Fixed an issue where reading steam settings changes could cause a crash.\n- Fixed an issue preventing HC from capturing inputs from the target controller on system resume from hibernation.\n- Fixed an issue preventing InputsManager from capturing keyboard keys on system resume, affecting OEM keys.\n- Fixed an issue causing a crash on null target controller when updating layout Inherit actions.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.22.0.5","site":"https://github.com/Valkirie","source":"BenjaminLSR","license_or_tos":"CC-NC-SA 4.0 License","resources":null,"verified":false}