{"appId":"w:BenjaminLSR.HandheldCompanion","appShortcutName":"Handheld Companion","appDisplayName":"Handheld Companion","authorId":"w:winget","releaseTagName":"winget-0.28.3.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ControllerService\n\nA touch optimized GUI to increase your handheld gaming computer experience.\nHandheld Companion – Release Notes\n0.28.3.3\nHighlights\n- UI/UX overhaul (Profiles + Layout): Redesigned pages for simpler navigation and reduced loading times, plus improved controller-first navigation across the app.\n- NavigationView improvements: Main window navigation is now horizontal (use L1/R1), and embedded NavigationViews (as seen on the Layout page) now support L2/R2 navigation.\n- Update interval (advanced latency tuning): New setting for advanced users to manipulate the controller update rate. Default is now 125 Hz (8 ms) instead of 100 Hz (10 ms), with options up to 1000 Hz (1 ms).\n- Controller order management (better out-of-the-box experience): Controller order adjustment is now manual by default, with clear UI feedback (toast + icon) if your virtual controller is not on slot 1—helping avoid “why is my controller unresponsive?” situations.\nUI/UX improvements\n- Profiles page: Full UI refresh aimed at faster load and simpler day-to-day navigation.\n- Layout page: Revamped layout experience and navigation, including easier access to advanced action configuration.\n- Controller management UI polish: Controller management should behave the same as before, but now includes clearer interface text and notifications (updated across all supported languages), and a more understandable user flow around controller order and slot state.\n- Quality-of-life: Added a library shortcut to edit controller layout when pressing the X button.\nNavigationView controls:\n- Main window: L1/R1 navigation (horizontal logic).\n- Embedded views (Layout page): L2/R2 navigation.\nUpdate interval (advanced latency tuning)\nWe’re adding a new setting for advanced users who want to manipulate the controller update rate. The new default is 125 Hz (8 ms), replacing the previous 100 Hz (10 ms).\nAvailable options:\n- 125 Hz ≈ 8.00 ms: very common for Xbox/XInput-class wireless + many older controllers\n- 250 Hz ≈ 4.00 ms: very common for PlayStation over USB, and many wired third-party pads\n- 500 Hz ≈ 2.00 ms: less common; some wireless/dongle implementations\n- 1000 Hz ≈ 1.00 ms: common on competitive/PC-focused wired pads; some dongles\nHigher rates may slightly increase CPU usage, but the goal is to give latency-focused users a straightforward, supported way to tune responsiveness.\nStability & Fixes\n- Fixed a crash when calling ControllerManager.GetDefault().\n- Fixed a crash when cloning an unsynced Layout (Clone()).\n- Fixed SensorsManager suspend/resume handling across sleep.\n- Fixed a race-condition crash in TimerManager.\n- GPD Win 5: Added OEM buttons mapping support.\nLibrary updates\n- SDL: updated gamecontrollerdb and SDL 3.3.6.\nSpecial thanks to\n- @P3P0 (new layout functions + layout UI revamp)\n- @mistakeplays (support to validate and land proper GPD Win 5 mapping)\nFull Changelog: 0.28.3.1...0.28.3.3","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.28.3.3","version":0,"site":"https://github.com/Valkirie","source":"BenjaminLSR","license_or_tos":"CC-NC-SA 4.0 License","resources":null,"verified":false}