{"appId":"w:Bforartists.Bforartists","appShortcutName":"Bforartists 4","appDisplayName":"Bforartists 4","authorId":"w:winget","releaseTagName":"winget-4.3.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Bforartists is a fork of the popular 3D software Blender, with the goal to improve the UI.\n\n\nHotfix for Colored Collection Rows Release\nBforartists 4 3 3 - Splash Large\nBforartists 4 3 3 Screenshot\nThis is a hotfix and commulative stability release with 7 show-stopper bug fixes, including the missing Last Operator panel, HIP support, and theme saving.\nThis is part of an exciting release with all the latest from Blender 4.3 and 4.4 to the date - with a chunk of 176 pieces of love from us this cycle.\nWhat's new with the 4.3 series!\nAdditionally includes:\n- Horizontal walk navigation lock\n- Smarter Smart delete in Mesh Edit mode (removes isolated geometry now)\n- New Colored Collection Rows highlights\n- New Grease Pencil Nodegroups in the Default Library\n- New Silhouette toggle for the 3D View with the Power User Tools\n- New Asset Shelf category defaults and tag filtering, with additional thumbnail quick size buttons\n- Refined Grease Pencil 3 interface and UX\n- General maintenance, details, tooltips and refinement to everything new coming in from Blender\nIncluded new features from Blender are:\n- New editing of Text Strips in the Preview of the Sequencer editor\n- New Geometry Nodes: Find in String, Collection and Object Input\n- New Geometry Nodes \"For Each\" zone, Grease Pencil nodes, and much more\n- New method to swap and resize areas\n- New Metal BSDF\n- Videos can now render in 10bit\n- New Animation Slots to assign multiple objects to the same Action Clip\n- And much more\n- And much more.\nDownloads available from both Github, the official Website, Windows store and Blender Launcher v2\n📥 Download Free\n🌍 Official Website\n🪟 Windows App\n🧡 Blender Launcher\n📝 Release Notes\nhttps://www.bforartists.de/release-notes/\n🧰 Source Code\nhttps://github.com/Bforartists/Bforartists\nSplashscreen is kindly provided by Ethan Avila, the honorable runner up up of the last Splashscreen competition hosted in the Discord server.\nThanks again for all your artwork, feedback and extra love! And a very special thanks to the volunteer developers for working this project.\nDraise, Reiner, Blenux (Juso), Eyad, Znight (Trung Pham), Quackers, Mahid, Sean and all you arty people\nWhat's Changed\nBforartists 4.3.3\n7 Tasks","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.3.3","version":0,"site":"https://www.bforartists.de/","source":"Bforartists","license_or_tos":"GPL-2.0","resources":null,"verified":false}