{"appId":"w:BiniSoft.WindowsFirewallControl","appShortcutName":"Malwarebytes Windows Firewall Control","appDisplayName":"Malwarebytes Windows Firewall Control","authorId":"w:winget","releaseTagName":"winget-6.23.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Windows Firewall Control is a powerful tool which extends the functionality of Windows Firewall and provides new extra features which makes Windows Firewall better.\n\nWindows Firewall Control is a powerful tool which extends the functionality of Windows Firewall and provides new extra features which makes Windows Firewall better. It runs in the system tray and allows the user to control the native firewall easily without having to waste time by navigating to the specific part of the firewall. This is the best tool to manage the native firewall from Windows 11, 10, 8.1, 8, 7, Server 2025, 2022, 2019, 2016, 2012.\n\nWindows Firewall Control offers four filtering modes which can be switched with just a mouse click:\n* High Filtering - All outbound and inbound connections are blocked. This profile blocks all attempts to connect to and from your computer.\n* Medium Filtering - Outbound connections that do not match a rule are blocked. Only the programs that you allow can initiate outbound connections.\n* Low Filtering - Outbound connections that do not match a rule are allowed. The user can block the programs he doesn't want to allow initiating outbound connections.\n* No Filtering - Windows Firewall is turned off. Avoid using this setting unless you have another firewall running on your computer.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.23.0.0","version":0,"site":"https://www.binisoft.org/","source":"BiniSoft.org","license_or_tos":"Freeware","resources":null,"verified":false}