{"appId":"w:BioSilico.IdeaMapper","appShortcutName":"Idea Mapper","appDisplayName":"Idea Mapper","authorId":"w:winget","releaseTagName":"winget-4.2.0007","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.ideamapper.com/4.2.0007/windows/setup_ideamapper_4_2_0007.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ideamapper is a powerful mind mapping, visual learning, and writing tool designed to produce well-structured documents.\n\n\nWhich editions are affected?\n1. All editions: IdeaMapper Desktop Cloud, IdeaMapperPro, IdeaMapperK12, IdeaMapperHigherEd and EssayWriter.\nHow to get this release?\n1. For desktop installations: Go to https://ideamapper.com, follow HelpDesk and download links for your platform, download the installer file, then install. The previous version will be upgraded.\n2. For the webapp: Clear the browser cache, then go to https://webapp.ideamapper.com, and log in with the same credentials.\nWhat’s New?\n- There is now only a single homepage window, this has a number of consequences:\n- The application starts much quicker because it no longer creates a new blank document in the background.\n- The application also now no longer tries to verify whether a printer is available. This also speeds up the startup.\n- Improved \"Application Quit\" behaviour. When you click on Homepage->Quit the app will close documents in a particular sequence:\n- First files that are dirty and unnamed, options “Save”, “Discard” or “Cancel”\n- Then files that are dirty and named, options “Save All”, “Save”, “Discard” or “Cancel”\n- Then the application will close all clean files.\n- For the IdeaMapperPro Desktop edition you can now connect to an AI LLM and various AI functions are now enabled. To use this go to the Tools->Options and navigate to \"AI Options\". Here you can then choose which Provider to use (supported are currently OpenAI and Anthropic or a local AI based on Ollama). Then you need to choose the model to be used. Note that not all models will produce relevant results. Please refer to the separate FAQ which describes how to enable the AI functionality in IdeaMapperPro.\n- You can now save files with encryption, use \"Save As...\" and select the \"Encrypted Ideamapper Document\" format. We use AES-256 encryption.\n- The application user interface can be changed to run without the window title bar (Options->General Options->User Interface).\n- The licensing wizard will now automatically resize to fit the screen, this fixes a problem where the buttons at the bottom of the wizard were invisible.\n- You can now have multiple windows showing the same document, just go to the \"View\" tab and click on \"New Window\". This allows you to do things like having one screen with the ideamap and another screen with the text view.\n- Windows: The installer will now also install a shell extension which will enable Windows Explorer to display the preview of the files as thumbnails.\n- Update to Qt 6.8.5 for Windows and Linux, Qt 6.7.3 for MacOS\n- Windows Installer: Now installs the latest Visual Studio C++ redistributable.\n- Windows: Update to OpenSSL 3.6.0\nBug Fixes?\n- Having a single homepage window fixed the issue where the homepage was only showing in part of the window.\n- In the homepage, when there are multiple open maps, when double-clicking on any open map, it would always show the first one.\n- When opening a document the app would always, for about 0.5 seconds, show a black area where the ribbon is supposed to be. This is fixed now.\n- Minor fixes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.2.0007","version":0,"site":"https://www.biosilico.com/","source":"BioSilico Limited","license_or_tos":"Proprietary","resources":null,"verified":false}