{"appId":"w:BitSum.ProcessLasso","appShortcutName":"Process Lasso","appDisplayName":"Process Lasso","authorId":"w:winget","releaseTagName":"winget-17.0.1.18","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://dl.bitsum.com/files/processlassosetup64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Real-Time CPU Optimization and Automation\n\nProcess Lasso is Windows process automation and optimization software. From tuning algorithms like ProBalance to user-created rules and persistent settings such as CPU affinities and priority classes, Process Lasso enables you full control over running applications!\nOur famous ProBalance algorithm maintains system responsiveness during high CPU loads. This proprietary algorithm dynamically adjusts the priorities of running programs so that some are given higher priority access to the CPU(s) than others. With ProBalance, no longer will single, or multiple, processes be able to bring your system to a virtual stall. Process Lasso will let you keep interacting with your computer, even when it is under a heavy CPU load. Try our CPUEater Demo to experience ProBalance for yourself.\nProcess Lasso also allows users to automate and tweak how applications are run through a number of unique and helpful functions. These include persistent priority classes, persistent CPU affinities, disallowed processes, per-process power profiles, a process watchdog for advanced rules, process instance count limits, instance or app balancing and much more! These features give you the ability to control how programs utilize your computer’s resources based on automatically applied settings. With Process Lasso, you can decide exactly how you want your processes to run.\nMany additional functions such as power plan automation, a system responsiveness metric and process activity logging are also available.\nFor minimal resource use, all algorithms and process rules are enforced by a stand-alone background service called the Process Governor. The GUI is entirely optional.\n- Add menu to Edit Rules\n- Minor fixes and enhancements\n(1) GUI: Fix process tooltips appearing underneath main window when “Always on top” was enabled\n(3) GUI: Enable dark mode support to Named Config Profile dialogs\n(3) GUI: Add menu to Edit Rules with config profile and file import/export actions\n(11) GUI: Show active config profile in Edit Rules when applicable\n(15) GUI: Adjust order of config profile menu items\n(17) GUI: Copyrights to 2026\n(17) GUI: Translation updates","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"17.0.1.18","version":0,"site":"https://bitsum.com/","source":"Bitsum","license_or_tos":"Proprietary","resources":null,"verified":false}