{"appId":"w:BitSum.ProcessLasso","appShortcutName":"Process Lasso","appDisplayName":"Process Lasso","authorId":"w:winget","releaseTagName":"winget-17.0.0.132","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://dl.bitsum.com/files/processlassosetup64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Real-Time CPU Optimization and Automation\n\nProcess Lasso is Windows process automation and optimization software. From tuning algorithms like ProBalance to user-created rules and persistent settings such as CPU affinities and priority classes, Process Lasso enables you full control over running applications!\nOur famous ProBalance algorithm maintains system responsiveness during high CPU loads. This proprietary algorithm dynamically adjusts the priorities of running programs so that some are given higher priority access to the CPU(s) than others. With ProBalance, no longer will single, or multiple, processes be able to bring your system to a virtual stall. Process Lasso will let you keep interacting with your computer, even when it is under a heavy CPU load. Try our CPUEater Demo to experience ProBalance for yourself.\nProcess Lasso also allows users to automate and tweak how applications are run through a number of unique and helpful functions. These include persistent priority classes, persistent CPU affinities, disallowed processes, per-process power profiles, a process watchdog for advanced rules, process instance count limits, instance or app balancing and much more! These features give you the ability to control how programs utilize your computer’s resources based on automatically applied settings. With Process Lasso, you can decide exactly how you want your processes to run.\nMany additional functions such as power plan automation, a system responsiveness metric and process activity logging are also available.\nFor minimal resource use, all algorithms and process rules are enforced by a stand-alone background service called the Process Governor. The GUI is entirely optional.\n- Add “Edit Rules” consolidated view\n- Extend dark mode support\n- Minor fixes and enhancements\n(5) GUI: Add a consolidated Edit Rules dialog where all rules can be managed\n(5) GUI: Prune some unused resources\n(11) GUI: Add “Edit Rules” button to main window\n(15) GUI: Shorten “Abandon changes?” messages\n(17) GUI: Add dedicated dialog to input process match phrase\n(19) GUI: Add running processes and installed games selections to rule creation dialog\n(23) GUI: Have existing rule config browse buttons to new selection dialog\n(23) GUI: Add browse/select buttons to all rule config dialogs\n(35) GUI: Add dark mode to approximately 30 additional dialogs\n(35) GUI: Remove a redundant control from the Instance Count Limits dialog that was inappropriately visible\n(35) GUI: Make priority selection in Watchdog dialog action a droplist instead of dropdown\n(41) Tools: Fix an issue in some external tools with the CPU affinity selection dialog and named affinities\n(43) Tools: Update stand-alone CPUEater demo\n(67) GUI: Don’t allow by-registry priorities with ineligible match strings to be saved on the back-end\n(71) GUI: In Edit Rules show ‘Create’ popup menu if user right-clicks in an empty region\n(79) GUI: Add ‘delay for’ option to CPU affinity selection dialog where appropriate\n(81) GUI: Fix to Instance Count Limit rules removal under some circumstances\n(81) GUI: Fix a renamed default config profile could show on graph without a preceding space\n(83) GUI: Fix a crash while restarting an unelevated process under certain rare conditions\n(83) GUI: For unelevated process restarts, fallback to traditional method if shell interface is fails\n(85) GUI: Fix JSON import of certain types of Instance Balancer dynamic core count rules\n(89) GUI: Begin deprecation of IE restriction feature\n(91) GUI: Add message to use Options menu to edit select complex rule types\n(91) GUI: In game selection dialog add note that not all installed games may be automatically detected\n(103) Core: Have foreground boosting, when enabled, take precedence over CPU and GPU priority rules\n(119) GUI: Exclude some game processes from ProBalance despite the foreground exclusion normally handling that\n(119) GUI: Translation updates","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"17.0.0.132","version":0,"site":"https://bitsum.com/","source":"Bitsum","license_or_tos":"Proprietary","resources":null,"verified":false}