{"appId":"w:BitSum.ProcessLasso","appShortcutName":"Process Lasso","appDisplayName":"Process Lasso","authorId":"w:winget","releaseTagName":"winget-16.1.0.46","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://dl.bitsum.com/files/processlassosetup64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Real-Time CPU Optimization and Automation\n\nProcess Lasso is Windows process automation and optimization software. From tuning algorithms like ProBalance to user-created rules and persistent settings such as CPU affinities and priority classes, Process Lasso enables you full control over running applications!\nOur famous ProBalance algorithm maintains system responsiveness during high CPU loads. This proprietary algorithm dynamically adjusts the priorities of running programs so that some are given higher priority access to the CPU(s) than others. With ProBalance, no longer will single, or multiple, processes be able to bring your system to a virtual stall. Process Lasso will let you keep interacting with your computer, even when it is under a heavy CPU load. Try our CPUEater Demo to experience ProBalance for yourself.\nProcess Lasso also allows users to automate and tweak how applications are run through a number of unique and helpful functions. These include persistent priority classes, persistent CPU affinities, disallowed processes, per-process power profiles, a process watchdog for advanced rules, process instance count limits, instance or app balancing and much more! These features give you the ability to control how programs utilize your computer’s resources based on automatically applied settings. With Process Lasso, you can decide exactly how you want your processes to run.\nMany additional functions such as power plan automation, a system responsiveness metric and process activity logging are also available.\nFor minimal resource use, all algorithms and process rules are enforced by a stand-alone background service called the Process Governor. The GUI is entirely optional.\n- Add config profiles to tray menu\n- Add import/export of all config profiles as a zip archive\n- Additional improvements to named config profiles\n- Minor fixes and enhancements\n(5) Core: Fix an issue where Foreground Boosting wouldn’t fully apply if a process had entered the foreground while under active ProBalance restraint\n(9) GUI: Improve error message when user enters an activation code of the wrong length\n(9) GUI: Increase maximum limit of named config profiles\n(9) GUI: Change tray submenu “Active Power Profile” to “Power Profile” for brevity\n(9) GUI: Add config profile selection and management submenu to tray for easy access\n(9) GUI: List the default profile in the config profile manager\n(13) GUI: Improve behavior when extraneous files are found in a config profile folder being deleted\n(15) GUI: Cosmetic improvements to Config Profile Switcher dialog\n(19) GUI: Re-order config profile submenu to improve accessibility\n(23) GUI: Add rename button to Config Profile Manager dialog\n(23) GUI: Allow default config profile to be renamed\n(27) GUI: Add specific error message on attempted creation of a config profile that already exists\n(27) GUI: Append “(default)” to default configuration profile name in menus and management dialog\n(27) GUI: Adjustments to tray menu ordering and separators\n(29) GUI/Installer: Add ability to import and export all configuration profiles as a zip archive\n(31) GUI: Have import and export open and save dialogs default to user Documents folder\n(33) GUI: Cosmetic improvements to create and rename profile dialogs\n(35) GUI: Improve handling when encountering a malformed Config Profile Switcher datastore\n(35) GUI: Minor performance optimizations\n(35) GUI: Show default profile name on the graph if it has been customized\n(37) GUI: Add syslink for Config Profile Switcher to Config Profile Management dialog\n(45) GUI: Translation updates","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"16.1.0.46","version":0,"site":"https://bitsum.com/","source":"Bitsum","license_or_tos":"Proprietary","resources":null,"verified":false}