{"appId":"w:BlueStack.BlueStacks","appShortcutName":"BlueStacks","appDisplayName":"BlueStacks","authorId":"w:winget","releaseTagName":"winget-5.22.91.1029","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://ak-build.bluestacks.com/public/app-player/windows/nxt/5.22.91.1029/ecc188d15e2d9bda64e7812a2b4d75e4/FullInstaller/x64/BlueStacksFullInstaller_5.22.91.1029_amd64_native.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Play Android games on PC or try instantly from our cloud\n\n\n1. We’ve made it easier to switch between control schemes without interrupting your gameplay on BlueStacks 5. Simply press Ctrl + Shift + Q to instantly toggle to the next available control scheme without leaving the game.\nYou can also customize this shortcut by heading to BlueStacks Settings and assigning a key combination that best fits your playstyle.\n2. Gear up for smoother, more responsive gameplay in Free Fire Max (x86 version) as you can now adjust mouse sensitivity directly from the Controls editor for more precise aiming.\nWe've also optimized jump and shoot actions to eliminate delay, letting you react instantly in high-pressure moments. Take full control of every move, every shot.\n3. You can now chat freely with fellow champions once again in RAID: Shadow Legends (com.plarium.raidlegends) on Android 13.\n4. Enjoy uninterrupted superhero action in MARVEL Mystic Mayhem (com.netease.mmm & com.netease.mmm.tw) as the game will no longer freeze during gameplay on Android Pie.\n5. Play Age of Ashes: Dark Nuns (com.lngame.lmgp) without the game freezing during gameplay on Android Pie. Smoother battles and exploration await!\n6. The gameplay in RuPaul's Drag Race Match Queen (com.eastsidegames.rupaulmatch) is now free from flickering graphics on Android Pie, giving you a more polished match-3 experience.\n7. You’ll no longer see a white screen at launch in Crazy Defense Heroes - TD Game (com.animocabrands.google.CrazyDefenseHeroes) after the recent update. This issue has been fixed on Android Pie and Android 11, so you can dive into tower defense battles without any delay.\n8. You can now use WeChat (com.tencent.mm) seamlessly as there’s now proper sound output during calls, and the camera orientation during video calls is no longer upside down on Android Pie.\n9. Fight freely without interruptions in DRAGON BALL LEGENDS (com.bandainamcoent.dblegends_ww) as crashes during gameplay have been fixed on Android 11.\n10. Mine nonstop in Gold and Goblins (com.redcell.goldandgoblins) as the game will no longer crash during gameplay on Android 11.\n11. You can now play Three Kingdoms Tactics (com.qookkagame.sgzzlb.gp.jp & com.qookkagame.sgzzlb.gp.kr) without crashes on Android Pie, and enjoy a stable and immersive strategy experience.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.22.91.1029","site":"https://www.bluestacks.com/","source":"now.gg, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}