{"appId":"w:BrickLink.Studio","appShortcutName":"Studio","appDisplayName":"Studio","authorId":"w:winget","releaseTagName":"winget-2.26.1_1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://studio.download.bricklink.info/Studio2.0/Archive/2.26.1_1/Studio+2.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Build with virtual parts, render designs and create instructions.\n\nStudio is an all-in-one desktop app for Windows and Mac that lets you build with virtual parts, render designs and create instructions.\n\nWhat can I do with Studio?\nBuild\nYou can build your own virtual creations! Start a project from scratch, import a saved LEGO® Digital Designer file, upload a picture to make a mosaic, or just use your imagination and see what happens when you put the pieces together.\nTest a design\nBy testing your design, you can find out if it can be built with real LEGO bricks.\nCreate or browse instructions\nUse Instruction Maker to create step-by-step instructions for your designs\nRender designs\nGenerate photorealistic images and short videos of your designs\nShare on the Studio Gallery\nUpload your designs on My Studio and publish them on Studio Gallery\nUse the BrickLink catalog\nCheck if the parts in your design are available and how much they cost.\nFixed an issue where decals were cut off when exporting curved parts using the Part Designer.\nFixed incorrect collider for parts: 56908c01 and 30841.\nFixed an issue where decals were lost on import when exporting LEGO minifigure legs or curved parts with decals from Part Designer.\nFixed an issue where, in Flexible Part Edit Mode, dragged points did not move to the intended position when viewed from the side.\nAdded New Colors: Blue Violet and Warm Pink.\nUpdated Blue-Violet to Royal Blue (Old Blue-Violet).\nUpdated Dark Blue-Violet to Dark Royal Blue.\nAdded 319 new parts.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.26.1_1","version":0,"site":"https://www.bricklink.com/","source":"BrickLink Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}