{"appId":"w:BrickLink.Studio","appShortcutName":"Studio","appDisplayName":"Studio","authorId":"w:winget","releaseTagName":"winget-2.25.11_1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://studio.download.bricklink.info/Studio2.0/Archive/2.25.11_1/Studio+2.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Build with virtual parts, render designs and create instructions.\n\nStudio is an all-in-one desktop app for Windows and Mac that lets you build with virtual parts, render designs and create instructions.\n\nWhat can I do with Studio?\nBuild\nYou can build your own virtual creations! Start a project from scratch, import a saved LEGO® Digital Designer file, upload a picture to make a mosaic, or just use your imagination and see what happens when you put the pieces together.\nTest a design\nBy testing your design, you can find out if it can be built with real LEGO bricks.\nCreate or browse instructions\nUse Instruction Maker to create step-by-step instructions for your designs\nRender designs\nGenerate photorealistic images and short videos of your designs\nShare on the Studio Gallery\nUpload your designs on My Studio and publish them on Studio Gallery\nUse the BrickLink catalog\nCheck if the parts in your design are available and how much they cost.\nFixed a bug where locking a page in Instruction maker in one project affected locked pages in other open projects.\nFixed case-sensitivity issue when matching custom parts to missing parts while importing a set.\nSpelling for Orthognal View updated in the tooltips.\nFixed a bug where part outlines did not move when user uses select by connect and splits and merges parts.\nFixed a bug where, after a user cloned a submodel and changed its color, using Undo would revert the color to the current color.\nFixed a bug that caused embedded custom part decals to be lost upon opening instruction mode.\nFixed an issue where Eyesight render had blurry textures or decals randomly.\nFixed a graphical glitch in the Step Editor.\nFixed the multi-connect tool not properly aligning the part rotation.\nFixed stability simulator reverting the visual state when changing back to stability mode.\nFixed an issue where using the hinge tool caused too many parts to be rotated and selected.\nFixed an issue where Studio silently crashed when saving after using the page editor in the Instruction Maker.\nFixed an issue where a previous patch broke the executable permission on macOS.\nFixed an issue where users were unable to delete images or text using the Delete key or the Delete option in the context menu.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.25.11_1","version":0,"site":"https://www.bricklink.com/","source":"BrickLink Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}