{"appId":"w:BrightSign.BAconnected","appShortcutName":"BA connected","appDisplayName":"BA connected","authorId":"w:winget","releaseTagName":"winget-1.67.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.bsn.cloud/BA%20connected%20Setup%201.67.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"BA connected allows users to link their digital signage authoring to a robust networking management solution\n\n\nImprovements\n- BCN-18069: (DWS) Added the ability to download the microSD card image as a .zip file.\n- BCN-18166: Updated the brightAuthor connected logo to reflect the lowercase word “connected”.\n- BCN-18231: Added support for model UH1145.\n- BCN-18336, BCN-18402: Enabling the Local Diagnostic Web Server in a Setup now requires a password. Options for “default password” and “no password” have been removed. If modifying an existing Setup that is set to no password or default password, text will appear informing the user of the prior password setting and then prompt for a password. Password must be at least 8 characters long and include at least one uppercase letter, one lowercase letter, one number, and one special character.\n- BCN-18389: Previously, the Local Diagnostic Web Server (LDWS) provided the option to change the password or to remove the password entirely. The ability to remove the password has been removed. In addition, password validation will occur to ensure that they be at least 8 characters long and include at least one uppercase letter, one lowercase letter, one number, and one special character.\n- BCN-18390: Removed the ability to enable the Local Diagnostic Web Server from the Remote Diagnostic Web Server.\n- BCN-18398: Removed the Telnet option from the Diagnostic Web Server and added validation for the SSH password. Password must be at least 8 characters long and include at least one uppercase letter, one lowercase letter, one number, and one special character.\n- BCN-18401: Added a button to the Diagnostic Web Server to enable resetting of SSH host keys.\n- BCN-18435: Enabling the Local Web Server now requires a username and password. Password must be at least 8 characters long and include at least one uppercase letter, one lowercase letter, one number, and one special character.\n- BCN-18444: Added a button to the Diagnostic Web Server to enable resetting of the default DWS certificates.\nBug Fixes\n- BCN-18094: Support for \"5120x2160x60p\" video mode in presentations targeting XT5 and XC5 players was incorrectly unavailable. It is now available.\n- BCN-18097: The autorun would crash when using a CNN MRSS feed containing more than 86 items.\n- BCN-18122: When adding an Advanced command to conditional logic, the “Switch to Presentation” option was incorrectly grayed out and thus unavailable.\n- BCN-18130: Editability of the password field in the Player Properties panel of the Local DWS was incorrect. The “Password” field should not be editable when the “Enable Diagnostic Web Server” checkbox is unchecked, and it should be editable when the “Enable Diagnostic Web Server” checkbox is checked.\n- BCN-18148: Fixed an issue affecting UV5N models where an error message appears when trying to add an H.265 4K video to the presentation canvas.\n- BCN-18218: Fixed an issue where a maximum of 100 players would load in the Local Playlist player List even when there are more players. A \"Load All\" button has been added which enables all players to be listed.\n- BCN-18248: Fixed an issue where the cache of the player list for a Local Playlist does not properly clear. As a result, the player list continues to accumulate players, resulting in an inaccurate list of players. The list should clear and reload when opening new presentations or switching networks.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.67.0","site":"https://www.brightsign.biz/","source":"BrightSign","license_or_tos":"Proprietary","resources":null,"verified":false}