{"appId":"w:BrightSign.BAconnected","appShortcutName":"Winget Application","appDisplayName":"BA connected","authorId":"w:winget","releaseTagName":"winget-1.59.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.bsn.cloud/BA%20connected%20Setup%201.59.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"BA connected allows users to link their digital signage authoring to a robust networking management solution\n\n\nImprovements\n- BCN-17523: Added a FLASH tab in the DWS for systems capable of using onboard / built-in storage instead of having to rely on external storage.\n- BCN-17601: Fixed the broken link for the tooltip on the Setup screen and moved the tooltip icon to a more sensible location.\n- BCN-17665: Improved terminology consistency in the Network tab (Player ID → Serial No., Setup Type → Publishing Mode, Partner application → Partner App, Firmware → OS); changed references for support@brightsign.biz to support.brightsign.biz.\n- BCN-17654: Removed warning dialogs for non-Chrome browsers when using the web interface. The web interface now supports Edge, Safari, Firefox, Opera, and most Chromium-based browsers.\n- BCN-17847: Updated the BA:connected application icon.\nBug Fixes\n- BCN-15905: Fixed a broken link on the HTML5 Widget Enable Javascript Console tooltip.\n- BCN-17351: Fixed an issue in which descenders (the part of the lowercase letter that extends below the baseline of the font) in the Content Library were cropped.\n- BCN-17684: Removed Size \"Width\" and \"Height\" from the Super State Properties.\n- BCN-17705: Fixed an issue where the Presentation Properties would display the key (software variable) instead of the label (UI text).\n- BCN-17716: Fixed an issue where adding video or audio media to a canvas would result in failure.\n- BCN-17725: Fixed an issue where the desktop app would hang during the upgrade from v1.49.1 to v1.55.1.\n- BCN-17730: Fixed an issue where dragging and dropping media from the Mac or Windows desktop into a zone would result in a fatal error.\n- BCN-17731: Fixed an issue where adding a player already in a network would result in that player being duplicated in the provisioning list.\n- BCN-17798: Fixed an issue where descenders (the part of the lowercase letter that extends below the baseline of the font) on the Admin > Provision > Error dialog were cropped.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.59.0","site":"https://www.brightsign.biz/","source":"BrightSign","license_or_tos":"Proprietary","resources":null,"verified":false}