{"appId":"w:BRL_CAD.brlcad","appShortcutName":"BRLCAD","appDisplayName":"BRLCAD","authorId":"w:winget","releaseTagName":"winget-7.42.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/BRL-CAD/brlcad/releases/download/rel-7-42-0/BRL-CAD_7.42.0_win64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"BRL-CAD is a powerful cross-platform open source combinatorial solid modeling system.\n\n\n--- 2025-08-11 Release 7.42.0 ---\nPolygonal BoT ray tracing is now dramatically faster. Integration of\na new spatial partition acceleration method (HLBVH) into librt's BoT\nray tracing pipeline yields substantial speedups, better multicore\nscaling, and reduced memory overhead across all BRL-CAD ray tracing of\nscenes with BoTs. In general, new overall performence is typicaly in\nthe 2-25x range depending on the model, scene, and other factors. The\nculmination of many efforts, the improvement was verified, validated,\nand performance tested against numerous real and test models to\nconfirm gains and assert correctness. As a result, users no longer\nneed to tune TIE or ADRT-specific settings as both are fully obsoleted\nand replaced.\nThis release expands Arbitrary Polyhedron support with 8 vertices\n(i.e., ARB8-only, not ARB7/6/5/4) to include concave definitions.\nSurfaces must (still) be planar and not self-intersect, but polyhedral\nedges creating concavities are now supported for ray tracing.\nMGED's nirt command use of .mgedrc qray settings was restored, which\naffects output styling (e.g., showing/hiding attributes). To restore\ndefault behavior, delete .mgedrc in your home directory or remove\nexisting qray settings manually.\n- increased app parallelism ceiling to 4096 threads - Sean Morrison\n- removed obsolete nirt -T BoT spatial partition option - Cliff Yapp\n- added support for concave arb8 primitive definitions - Sean Morrison\n- added example geometry model showcasing all types - Mitchell Roberts\n- fixed mged crash when switching databases after rt - Sean Morrison\n- mitigated multithreading contention on >32 core cpus - Sean Morrison\n- clarified material_name not found warning in rtweight - Cliff Yapp\n- fixed stat command crash with invalid path specifiers - Cliff Yapp\n- improved search std attr table in man page - Cliff Yapp\n- updated MGED nirt man page to reference cmdline version - Cliff Yapp\n- fixed raytracing crash with empty BoT solid in tree - Cliff Yapp\n- cleaned up nirt -L format listing output - Cliff Yapp\n- fixed MGED nirt command's use of .mgedrc qray formats - Cliff Yapp\n- improved MGED nirt cmd handling for large object lists - Cliff Yapp\n- removed requirement to launch nirt with objects listed - Cliff Yapp\n- improved k-g LS-DYNA keyword file geometry importer - Ali Haydar\n- added bot support for plate mode thickness get/set cmds - Cliff Yapp\n- fixed dbconcat treatment of a '/' prefix character - Cliff Yapp\n- fixed bb '-o' oriented bounding box option in MGED - Chris McGregor\n- added manual page for pixcmp, bwish, btclsh - Sean Morrison\n- fixed \"ted\" text edit and \"make_pnts\" GED commands - Cliff Yapp\n- renamed MGED x command to solid_report for clarity - Sean Morrison\n- fixed Archer \"Center View\" button and vslew GED command - Cliff Yapp\n- added support for console text editing on Windows - Cliff Yapp\n- added bb '-m' option for outputting midpoint - Chris McGregor\n- fixed sed crash when editing a brep object in MGED - Cliff Yapp\n- fixed primitive & matrix edit GUIs in MGED (\"x -1\") - Sean Morrison\n- added (align, dir and print) subcommands to 'view' - Chris McGregor\n- added (autoview, lookat, saveview) to 'view' - Chris McGregor\n- fixed mged 'process' command on read-only databases - Sean Morrison\n- replaced ADRT with HLBVH-acclerated BoT tracing - Timothy Reynolds\n- accelerated BoT ray tracing HLBVH integration across all librt apps\n  - Timothy Reynolds, Connor McLean, Ian Beckett, Samuel Reed,\n  - Gaultier Debarre, Sean Morrison, Chris McGregor, Cliff Yapp\n- various manpage and help text updates - Josh Baker\n- fixed -exec behavior with 'flat' search in mged - Chris McGregor\n- improved logging behavior from multiple threads - Kenneth Davis\n- removed libgdiam dependency - Chris McGregor\n- updated strclear dependency to latest bsd upstream - Cliff Yapp\n- updated Assimp to v5.4.3, with patch for CVE-2025-2151 - Cliff Yapp\n- updated OpenNURBS dependency to v8.10.24228.13001 - Cliff Yapp\n- updated GeometricTools dependency to 7adae93f8 - Cliff Yapp\n- updated GDAL dependency to v3.9.2 - Cliff Yapp\n- updated PROJ dependency to v9.5.0 - Cliff Yapp\n- updated SQLite dependency to v3.46.1 - Cliff Yapp\n- updated lmdb dependency to 9c9d345 - Cliff Yapp\n- updated libtiff dependency to v4.7.0 - Cliff Yapp\n- updated netpbm dependency to v10.86.42 - Cliff Yapp\n- updated LIEF dependency to v0.15.1 - Cliff Yapp\n- updated libpng dependency to v1.6.44 - Cliff Yapp","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.42.0","version":0,"site":"https://github.com/BRL-CAD","source":"BRL-CAD Development Team","license_or_tos":"LGPL License","resources":null,"verified":false}