{"appId":"w:BrunnerBI.MeasureKiller","appShortcutName":"Measure Killer","appDisplayName":"Measure Killer","authorId":"w:winget","releaseTagName":"winget-2.9.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.measurekiller.com/downloads/2.9.2/Measure_Killer_Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An external tool for Power BI & Microsoft Fabric\n\nMeasure Killer can help you clean and optimize your tenant and datasets. This can drastically reduce dataset refresh times and thus lower the memory and CPU usage of your Premium capacity. Since we use the XMLA connection, the dataset can remain in the service. Additionally, we only analyze the metadata, we do not read the actual data in your dataset.\nIn this 5th mode of Measure Killer, we will be able to give an overview of the whole tenant and show e.g. which reports are using custom visuals or have report-level measures. Additionally, we will be able to provide an overview of all datasets and reports incl. number of pages, visuals etc.\nMeasure Killer can delete unused measures on its own if the user chooses so. Alternatively it can generate a C# script for the measures to be deleted via Tabular Editor manually.\nDeleting unused columns will also improve performance since less RAM will be consumed.\nMeasure Killer will generate an M-Code to delete unused columns. This code can be pasted into Power Query's Advanced Editor to remove these columns from the model.\nFor every report analyzed, Measure Killer will generate a comprehensive Excel file to show where an artifact is used. This can be in: Measures, Visuals, Filters, Conditional Formatting, Joins in Power Query, or other parts of a Power BI Report such as Relationships.\nFurthermore, Measure Killer can generate a chart to show the number of unused and used columns and measures.\n[FEATURES]\n- Compare multiple reports in your tenant with the new Report Similarity feature.\n- You can now see where hierarchies are used across reports.\n- Table relations: inspect all possible relationship paths connecting two tables.\n- Execute DAX queries against any semantic model, including models in Pro workspaces.\n- New suggestion: Review whether auto-detected relationships are actually required.\n- New suggestion: Remove artifacts used only in filters without a filter query and not activated by a bookmark.\n- New report best practice rule: avoid using implicit measures.\n- Added Notebooks export in Tenant Analysis.\n- Enhanced DAX duplicate detection, including treating: CALCULATE ( Expression ( [Column] ) ) as a duplicate of Expression ( [Column] ).\n- Added Excel export with all uses to the table context menu (suggested by Justin).\n- You can now provide the format string for the rule \"Provide format string for \"Date\" columns.\"\n\n[BUG FIXES]\n- Fixed missing quotes in DAX expressions when using Enhanced Text Search.\n- Best practice rules no longer run on ignored artifacts when using Partial Analysis (reported by AlwaysNewDepth5 in the feedback section).\n- Fixed error in 1-click cleanup: 'NoneType' object has no attribute 'save_model_changes'.\n- Removing DAX artifacts no longer continues execution after a connection error.\n- Fixed Lineage tab crash caused by circular references exceeding maximum recursion depth.\n- Resolved CurrentModel attribute error (reported by Justin via the feedback section).\n- Trial licenses now correctly disable exports in free modes.\n- Fixed issue where # characters were removed from M queries in the UI and exports.\n- Resolved visual error: cv_visual_display_name attribute missing (reported by Pascal).\n- Fixed DateTime API fallback failures during license activation.\n- False negative for a column in Power Query when creating a chain of references and removing the original column from the original table in a intermediary table (Reported by Carlos)\n- Circular reference for downstream semantic models using direct query in Limited Tenant Analysis\n\n[MISC]\n- Improved error handling for all context menu (right-click) actions.\n- Translations, annotations, data categories and descriptions are now preserved when restoring artifacts.\n- Added more actions to the Notebooks context menu.\n- New columns added to the DAX tab: lineageTag, displayFolder, and description (suggested by Nick in the feedback section).\n- Improved violator descriptions for several best practice rules.\n- Improved paginated report dependencies behavior in the UI","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.2","version":0,"site":"https://en.brunner.bi/","source":"Brunner BI GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}