{"appId":"w:BrunnerBI.MeasureKiller","appShortcutName":"Measure Killer","appDisplayName":"Measure Killer","authorId":"w:winget","releaseTagName":"winget-2.9.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.measurekiller.com/downloads/2.9.1/Measure_Killer_Setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An external tool for Power BI & Microsoft Fabric\n\nMeasure Killer can help you clean and optimize your tenant and datasets. This can drastically reduce dataset refresh times and thus lower the memory and CPU usage of your Premium capacity. Since we use the XMLA connection, the dataset can remain in the service. Additionally, we only analyze the metadata, we do not read the actual data in your dataset.\nIn this 5th mode of Measure Killer, we will be able to give an overview of the whole tenant and show e.g. which reports are using custom visuals or have report-level measures. Additionally, we will be able to provide an overview of all datasets and reports incl. number of pages, visuals etc.\nMeasure Killer can delete unused measures on its own if the user chooses so. Alternatively it can generate a C# script for the measures to be deleted via Tabular Editor manually.\nDeleting unused columns will also improve performance since less RAM will be consumed.\nMeasure Killer will generate an M-Code to delete unused columns. This code can be pasted into Power Query's Advanced Editor to remove these columns from the model.\nFor every report analyzed, Measure Killer will generate a comprehensive Excel file to show where an artifact is used. This can be in: Measures, Visuals, Filters, Conditional Formatting, Joins in Power Query, or other parts of a Power BI Report such as Relationships.\nFurthermore, Measure Killer can generate a chart to show the number of unused and used columns and measures.\n[FEATURES]\n- New end to end data lineage tab (source -> report) + export option\n- User-defined functions (UDFs) are now supported in Measure Killer.\n- Notebooks and Org Apps in Tenant Analysis\n- Text search with highlighting for DAX/M expressions and Fabric content.\n- Added best practice violations for Measures and calculated columns individually as well\n- Added detection for unused DAX variables.\n- Added # of M:N relationships in Tenant Analysis semantic model window\n- You can now see exactly where an artifact is used in a visual (Y-axis, categories, conditional formatting etc.).\n- New “Locate visual on page” diagram via right-click on visuals\n- Users can now export the Duplicate DAX results.\n- Added publisher info for all custom visuals.\n\n[BUG FIXES]\n- Fixed issue where table Row Level Security was flagged as Object Level Security and its columns were not removed.\n- XMLA actions for SSAS Offline Mode are now disabled for Enterprise Limited licenses.\n- Corrected selection behavior for Partial Analysis when selecting tables.\n- Fixed empty capacity table in the pre-filters window.\n- Square brackets and special characters now correctly displayed in the DAX expression view context menu.\n- Resolved dependencies attribute error when analyzing model usage in Limited Tenant Analysis.\n- Fixed the “Check if bi-directional and many-to-many relationships are valid” rule.\n- M functions without the let/in keywords were incorrectly classified as Parameters\n- Power BI ports were not detected on some servers and cloud PCs\n- Fixed SQLite objects threading issue in Tenant Analysis (Activity Logs and Usage Metrics).\n- Lineage fixed for Generation 2 CI/CD dataflows in Limited Tenant Analysis.\n- DAX Duplicates were (ironically, lol) displayed twice.\n- Fixed “Unused Hidden Visual” suggestion for PBIR report files.\n- Empty pre-filters table in Tenant Analysis when switching modes.\n- Plots and model state are now correctly registered and displayed in the UI.\n- Fixed the “unknown” data type for Report Level Measures.\n\n[MISC]\n- Model similarity improvements.\n- Added Request IDs from Power BI and Fabric API calls to the logs.\n- You can now open the logs folder directly from the tool.\n- Disabled tabs now display a tooltip explaining why they are disabled.\n- Report-level measures are now ignored when using Partial Analysis.\n- Dataflows Gen2 and Gen2 CI/CD are now displayed as separate entities in the Tenant Summary.\n- Artifact descriptions added to all relevant Excel and JSON exports.\n- Links used in Apps or Org Apps are now parsed.\n- Current selected tab is now highlighted.\n- Filters and sorting are now preserved after re-running or repopulating tables.\n- Added warning when trying to remove a table that is used but has no used columns.\n- DAX duplicate detection is no longer case sensitive.\n- Hint tooltips added across all modes.\n- The authenticated user is now displayed in the tool’s window title for relevant modes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.1","version":0,"site":"https://en.brunner.bi/","source":"Brunner BI GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}