{"appId":"w:BrunnerBI.MeasureKiller","appShortcutName":"Winget Application","appDisplayName":"Measure Killer","authorId":"w:winget","releaseTagName":"winget-2.6.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.measurekiller.com/downloads/2.6.2/Measure_Killer_Setup.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An external tool for Power BI & Microsoft Fabric\n\nMeasure Killer can help you clean and optimize your tenant and datasets. This can drastically reduce dataset refresh times and thus lower the memory and CPU usage of your Premium capacity. Since we use the XMLA connection, the dataset can remain in the service. Additionally, we only analyze the metadata, we do not read the actual data in your dataset.\nIn this 5th mode of Measure Killer, we will be able to give an overview of the whole tenant and show e.g. which reports are using custom visuals or have report-level measures. Additionally, we will be able to provide an overview of all datasets and reports incl. number of pages, visuals etc.\nMeasure Killer can delete unused measures on its own if the user chooses so. Alternatively it can generate a C# script for the measures to be deleted via Tabular Editor manually.\nDeleting unused columns will also improve performance since less RAM will be consumed.\nMeasure Killer will generate an M-Code to delete unused columns. This code can be pasted into Power Query's Advanced Editor to remove these columns from the model.\nFor every report analyzed, Measure Killer will generate a comprehensive Excel file to show where an artifact is used. This can be in: Measures, Visuals, Filters, Conditional Formatting, Joins in Power Query, or other parts of a Power BI Report such as Relationships.\nFurthermore, Measure Killer can generate a chart to show the number of unused and used columns and measures.\n[BUG FIXES]\n- Fixed errors with special characters in workspace and semantic model names.\n- Report-level measures were not showing up after loading a file.\n- Report dependencies were missing after saving a .pibp file with the new PBIR format enabled as .pbix.\n- Fixed issue with empty text boxes causing a 'NoneType' object has no attribute 'get' error.\n- Resolved empty report bug in Tenant Analysis for cases where the definition API fails.\n- Fixed shared model error in admin mode when a model contains only paginated reports.\n- Granting access in admin mode ignored the 200-workspace limit, causing errors.\n- Disabled duplicate DAX expression buttons in Tenant Analysis.\n- Fixed GCC High error for U.S. Government cloud users.\n- Corrected classification of some custom visuals that were incorrectly categorized as native visuals.\n\n[MISC]\n- Improved logger entries for paginated reports.\n- Enhanced error handling for workspace scans in admin mode.\n- Added Excel export functionality to the RLS tab in Tenant Analysis.\n- The Access tab in Tenant Analysis now starts with a default selection.\n- Added an option in the pre-filter window of Tenant Analysis to include reports in apps.\n- Improved context menu (right-click options) for paginated reports.\n- The Search all levels option for tables is now enabled by default.\n- Removed default system columns from the dependencies Excel export.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.6.2","site":"https://en.brunner.bi/","source":"Brunner BI GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}