{"appId":"w:BrunnerBI.MeasureKiller","appShortcutName":"Measure Killer","appDisplayName":"Measure Killer","authorId":"w:winget","releaseTagName":"winget-2.9.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.measurekiller.com/downloads/2.9.0/Measure_Killer_Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An external tool for Power BI & Microsoft Fabric\n\nMeasure Killer can help you clean and optimize your tenant and datasets. This can drastically reduce dataset refresh times and thus lower the memory and CPU usage of your Premium capacity. Since we use the XMLA connection, the dataset can remain in the service. Additionally, we only analyze the metadata, we do not read the actual data in your dataset.\nIn this 5th mode of Measure Killer, we will be able to give an overview of the whole tenant and show e.g. which reports are using custom visuals or have report-level measures. Additionally, we will be able to provide an overview of all datasets and reports incl. number of pages, visuals etc.\nMeasure Killer can delete unused measures on its own if the user chooses so. Alternatively it can generate a C# script for the measures to be deleted via Tabular Editor manually.\nDeleting unused columns will also improve performance since less RAM will be consumed.\nMeasure Killer will generate an M-Code to delete unused columns. This code can be pasted into Power Query's Advanced Editor to remove these columns from the model.\nFor every report analyzed, Measure Killer will generate a comprehensive Excel file to show where an artifact is used. This can be in: Measures, Visuals, Filters, Conditional Formatting, Joins in Power Query, or other parts of a Power BI Report such as Relationships.\nFurthermore, Measure Killer can generate a chart to show the number of unused and used columns and measures.\n​\n[BUG FIXES]\n- Fixed issue where Capacity was incorrectly flagged as not active in error messages.\n- Corrected detection of inactive relationships being used in calculation items.\n- \"View Artifacts\" context menu option for tables is now working correctly.\n- Improved throttling handling when adding users to personal workspaces as admin.\n- Several save/load fixes\n- Other small UI fixes\n​\n[MISC]\n- User-configurable TOP setting for GET Workspaces API calls (for large tenants).\n- Bookmark groups added to the report results tab.\n- Option to show/hide tabs in Tenant Analysis by right-clicking tab names.\n- All searches now automatically trim leading and trailing spaces.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.0","version":0,"site":"https://en.brunner.bi/","source":"Brunner BI GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}