{"appId":"w:buchen.portfolio","appShortcutName":"Portfolio Performance","appDisplayName":"Portfolio Performance","authorId":"w:winget","releaseTagName":"winget-0.81.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/portfolio-performance/portfolio/releases/download/0.81.1/PortfolioPerformance-0.81.1-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Track and evaluate the performance of your investment portfolio across stocks, cryptocurrencies, and other assets.\n\n\n-  New: Added unit risk line visualization to the returns/volatility chart.\n-  New: Added a PDF importer for Bank Norwegian.\n-  Improvement: Improved warning messages for transactions that cannot be imported automatically due to missing information such as exchange rates, taxes, or fees.\n-  Improvement: Enhanced PDF importers for Renault Bank Direkt, Scalable Capital, flatexDEGIRO, C24 Bank, and Raiffeisenbank Bankgruppe.\n-  Improvement: Added a setting to deactivate cell editing on double-click.\n-  Improvement: CSV import now supports the yyyy.MM.dd and dd-MMM-yyyy date formats.\n-  Improvement: Interactive Brokers Flex Query (IBFlex) now supports multi-account imports with automatic account matching by alias and currency, and handles GBP/GBX currency conversion.\n-  Improvement: Accounts and portfolios are now sorted alphabetically in drop-down boxes for in-place editing.\n-  Improvement: Improved duplicate transaction detection during imports, enabling cross-account matching between transfers and deposits or withdrawals.\n-  Fix: Fixed currency instantiation for locales that specify a region instead of a country.\n-  Fix: Fixed grouped accounts not updating their base currency when switching.\n-  Fix: Fixed chart ranges when adjusting them by pressing '0' in the historical prices chart.\n-  Fix: Fixed taxonomy or filter names containing '@' not displaying correctly in menu items.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.81.1","version":0,"site":"http://abuchen.name","source":"Andreas Buchen","license_or_tos":"EPL-1.0","resources":null,"verified":false}