{"appId":"w:Burnaware.BurnAwarePro","appShortcutName":"BurnAware Professional","appDisplayName":"BurnAware Professional","authorId":"w:winget","releaseTagName":"winget-18.9","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.burnaware.com/downloads/burnaware_pro_18.9_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Top DVD burning software Super-intuitive user interface Blu-ray XL and M-Disc support.\n\nBurnAware is a full-fledged, easy-to-use burning software which allows users to write all types of files such as digital photos, archives, documents, music and videos to CDs, DVDs and Blu-ray Discs, including BDXL and M-Disc. With BurnAware, you also be able to create boot or multisession discs, high-quality Audio CDs and Video DVDs, make and burn ISO images, copy and backup discs, extract audio tracks, verify and recover data from multisession or unreadable discs.\n\n• Burn Data and Multisession CD, DVD, Blu-ray discs, including M-Disc\n• Burn Audio CDs, Video DVDs, Blu-ray Video discs and MP3 discs\n• Extract files and folders from ISO images, burn Disc Images\n• Copy Data and Audio discs, save discs to ISO and BIN disc images\n• Burn files and folders across multiple discs (disc spanning)\n• Recover data from damaged and unreadable discs, grab audio tracks\n• Write ISO images to multiple recorders simultaneously\n\nFree 7-day trial\nEnhancements\n• Updated disc burning SDK.\n• Compatibility improvements for latest release of Windows 11.\nBug fixes\n• Resolved issue with program getting stuck at 50% during two-stage disc copying.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.9","version":0,"site":"https://www.burnaware.com/","source":"Burnaware","license_or_tos":"Proprietary","resources":null,"verified":false}