{"appId":"w:BUT.NetfoxDetective","appShortcutName":"Netfox.Detective","appDisplayName":"Netfox.Detective","authorId":"w:winget","releaseTagName":"winget-2.1.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://netfox.fit.vutbr.cz/Downloads/Netfox.Detective.2.1.0.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A novel Network forensic analysis tool that implements methods for extraction of application content from communication using supported protocols.\n\nNFX Detective is a novel Network forensic analysis tool that implements methods for extraction of application content from communication using supported protocols. The implemented functionality includes:\n- Analysis project management that enables to analyze multiple PCAPs in a single session. Support for large PCAP files, up to GBs.\n- Advanced visualization using different views of various levels of detail - from overivew to detailed information about every single packet.\n- A collection of persers and content extraction methods for the most used application protocols.\n- Filtering and full-text search in captured traffic.\nNFX Detective is an extensible platform that can be customized to individual requirements:\n- Possibility to create a new extraction moduls for other application protocols. This can be done using protocol specification language and implementation of data transoformation and new user view to presented extracted data.\n- Extension of the system with user defined analyical methods. NFX Detective employs open data model that can be accessed or easily modified.\n- Definition of new uviews on the data. Data are stored in a No-SQL database and can be efficiently accessed through well-defined interface.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.1.0.0","version":0,"site":"https://netfox.fit.vutbr.cz/","source":"My Company Legal Name","license_or_tos":"MIT","resources":null,"verified":false}