{"appId":"w:ByteDance.Feishu","appShortcutName":"Feishu","appDisplayName":"Feishu","authorId":"w:winget","releaseTagName":"winget-7.56.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://sf3-cn.feishucdn.com/obj/ee-appcenter/d62b19a8/Feishu-win32_x64-7.56.5-signed.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A new way to collaborate\n\nEmpowering teams by messenger, meetings, calendar, docs, and emails. It's all in one place.\nDocs\n- Docs introduces a new permission management tool that allows you to filter your documents by security level, number of collaborators, and permission. This helps you review whether your information is distributed reasonably, and modify the access as needed.\nBase\n- You can now build business systems with Base apps through simple drag and drop, no technical expertise needed. Anyone can quickly build interactive pages and workflows tailored to their actual business needs.\n- You can interact with Base AI through the sidebar, from which you can directly input your questions or needs. The AI will respond with answers, help complete tasks, and enable you to work more efficiently with Base's features.\n- You can describe the workflow you want to build or change in the AI sidebar. The AI can create and configure workflows based on your requirements, update existing workflows, populate individual nodes, or summarize existing workflows.\n- The Base dashboard has been comprehensively upgraded in 2025, delivering even more powerful data analysis capabilities and a more professional visual experience. With features like slicers, pivot tables, and row/column switching, you can dig deeper into your data for more insights. The new canvas, configuration panel, and themes make dashboard layout and presentation more efficient and intuitive, ideal for a wide range of use cases, from daily operations monitoring to management reporting.\n- You can add Outlook as a trigger or action node in automations and workflows to automatically monitor new emails or send emails, improving cross-platform collaboration.\n- You can use the AI Agent node in Feishu workflows to efficiently handle complex business tasks with AI. The AI Agent node can use various tools, such as sending messages, adding records, drawing raffles, generating random numbers, and more. You can also equip the AI Agent node with additional tools by creating custom MCP (Model Context Protocol) tools.\n- Node shortcuts in Base embed the capabilities of field shortcuts into workflows, allowing you to quickly configure workflow nodes without writing any code or manually adjusting every parameter.\n- You can customize the layout and style of the record details page in Base to suit your needs. The details page can be reorganized using blocks such as tab pages, horizontal layouts, and vertical layouts, as well as changing the display method of fields.\n- Seedream 4.0 is now available in the field shortcuts center, which gives users the ability to quickly generate images in Base, transforming the creative process.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.56.5","version":0,"site":"https://www.feishu.cn/en/","source":"Beijing Feishu Technology Co., Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}