{"appId":"w:ByteDance.Lark","appShortcutName":"Lark","appDisplayName":"Lark","authorId":"w:winget","releaseTagName":"winget-7.51.11","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://sf16-sg.larksuitecdn.com/obj/lark-artifact-storage/643772a8/Lark-win32_x64-7.51.11-signed.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Next-Gen Collaboration Suite\n\nLark is a next-generation office suite that integrates messaging, schedule management, collaborative documents, video conferencing, and many more applications in a single platform.\nBase\n- AI field shortcuts allow you to create specialized fields for common business scenarios in Base, which can help you quickly translate, classify, summarize, and extract content, or generate new content based on the information in the table.\n- Use AI-generated formulas in Base to quickly create and apply formulas for easy data processing.\n- Use AI to quickly generate options for single-option and multiple-option fields.\n- Use AI to apply colors based on the conditions you set.\n- Use the smart toolbar to generate, polish, translate, or summarize the content of cells in text fields.\n- Automation and workflow actions now have the new option of AI-generated text. It can use data from the base or data generated in the preceding automated steps to optimize, summarize, and generate a paragraph of text based on your prompt. The generated text can also be used as input for subsequent automated steps.\n- Use a Lark message to trigger automations or workflows in Base. When the Base bot receives a message that meets the specified criteria in a group or private chat, the actions you configured will be performed.\n- Use the Switch node in Base workflows to create multiple branch paths that perform different actions. You can specify the conditions, and the branch that meets the criteria will be used, similar to the IFS function. The Switch node can be used for scenarios that require multi-condition evaluation or where workflow branches eventually merge (multiple branches share the same subsequent steps).\n- AI Q&A is an AI-powered feature that allows users to query data in the base. This feature utilizes natural language processing technology to convert your questions into data queries and give clear, easy-to-understand answers.\n- Smart analysis of charts and smart summaries of the dashboard help you quickly understand and gain insight into the data in the charts. You can also send a smart summary of the entire dashboard, along with an image of the dashboard, through automations.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.51.11","site":"https://www.larksuite.com/en_us/","source":"Lark Technologies Pte. Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}