{"appId":"w:Cairo.Cairo","appShortcutName":"Cairo Desktop Environment","appDisplayName":"Cairo Desktop Environment","authorId":"w:winget","releaseTagName":"winget-0.4.407","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/cairoshell/cairoshell/releases/download/v0.4.407/CairoSetup_64bit.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/cairoshell/cairoshell/releases/download/v0.4.407/CairoSetup_ARM64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A customizable, intuitive desktop environment for Windows.\n\nCairo is a desktop environment for Windows.\nOur goal is to develop a desktop experience that increases productivity and advances current technology standards.\nWith a focus on stability, performance, and productivity, Cairo aims to deliver an interface that exceeds expectations and delivers superior ease of use.\nTip\nDownload the installer from the Assets section below (since it isn't signed, Windows Defender will likely require you to choose \"more info,\" then \"run anyway\"). Not sure which one to download? Try 64-bit.\nChanges since 0.4.370\n- Window minimize/restore animations now use the Cairo taskbar button location (#881)\n  - If the button is on multiple taskbars, the primary is used\n- When running Cairo as shell, you can now disable the Windows key from opening the Programs menu (#713)\n- Fixed several taskbar issues:\n  - Fixed taskbar not displaying the correct tasks when switching virtual desktops (#398)\n  - Fixed closing a task from the taskbar not bringing prompts (i.e. for unsaved data) to the foreground\n  - Fixed disabled windows, which can't be restored, being allowed to minimize\n  - Fixed first selected window un-maximizing\n  - Fixed focus issue when minimizing a window using the taskbar\n  - Fixed some tasks not being removed from the taskbar when requested\n  - Fixed Start menu window showing in the taskbar in early versions of Windows 10\n  - Fixed tasks sometimes showing on the wrong taskbar after adding/removing a monitor\n- Fixed App Grabber window size when opened on a secondary display (#872)\n- Fixed auto-hide menu bars and taskbars on a secondary screen with high DPI opening off-screen\n- Fixed Cairo behaving improperly after restarting Explorer (#861)\n- Fixed Cairo sometimes missing newly added monitors on Windows 11 (#886)\n- Fixed crash when the log file cannot be written\n- Fixed Explorer crash loop after restarting Explorer while Cairo is running on Windows 11\n- Fixed hidden files being visible in situations when they should not be\n- Fixed inability to restore the default file manager in Cairo Settings (#871)\n- Fixed many situations where Cairo would cover full-screen apps\n- Fixed menu bar and taskbar sometimes being positioned incorrectly depending on display setup\n- Fixed menu bar and taskbar sometimes duplicating when changing screen settings (#852)\n- Fixed some conditions where Cairo could steal focus\n- Fixed some non-full-screen-able windows going in front of Cairo like a full-screen window\n- Fixed \"Start Cairo when logging in\" option not working properly (#857)\n- Fixed updater pulling x64 builds on ARM64 (#859)\n  - Note: This means if you're currently using Cairo on ARM, you should download this release from GitHub to get the correct version. The updater will then work properly going forward.\n- Improved performance on Windows 8 and newer\n- Removed restriction preventing enabling the notification area while the taskbar is disabled (#749)\n- Added translations:\n  - Chinese (Traditional) (#867, thanks @new1271!)\n- Improved translations:\n  - Brazilian Portuguese (#865, thanks @E-rick23!)\n  - German (#840, thanks @uDEV2019!)\n  - Russian (#843, thanks @vanja-san!)\n- Misc under-the-hood improvements","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.4.407","version":0,"site":"https://cairodesktop.com/","source":"Cairo Development Team","license_or_tos":"Apache-2.0","resources":null,"verified":false}