{"appId":"w:calibre.calibre","appShortcutName":"calibre","appDisplayName":"calibre","authorId":"w:winget","releaseTagName":"winget-9.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/9.0.0/calibre-64bit-9.0.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- A new Bookshelf view with your books arranged on shelves showing their spines.\n  Click the Layout button in the bottom right corner of the calibre window to switch to Bookshelf view.\n- Viewer: Add an \"Edit book\" button to the viewer controls to edit the current book when the current book is in an editable format such as EPUB, AZW3 or KEPUB. It opens the editor at the approximate location that is currently being viewed.\n- Linux: Add momentum based scrolling for the book list when using high resolution scroll devices like touchpads\n- TXT Output: Add an option to replace images by their alt attribute text\n  Closes tickets: 2137504\n- EPUB: Support reading cover images from so called \"Open Manga Format\" non-conformant EPUB files produced by some Japanese publishers.\n- Add a tweak to change the font size of the AI chat widget\n  Closes tickets: 2138862\n- E-book viewer: Allow typing in a page number to go to instead of forcing the user to scroll through existing page numbers\n- Kobo driver: Support for updated firmware\nBug fixes\n- KEPUB Output: Add some CSS to fix rendering of tate-chu-yoko text on Kobo devices\n- Only show the Sort button on the search bar if the Sort By action has not been added to the search bar by the user\n  Closes tickets: 2138770\n- EPUB3 metadata: Handle identifiers that use HTTP URLs without the url: prefix\n  Closes tickets: 2137122\n- Edit book: Check book: Fix spurious unreferenced warnings for SMIL media overlay audio files\n- Edit book: Reports: Have pressing enter do the same action as double clicking the current entry\n  Closes tickets: 2138179\n- E-book viewer: Improve export of SVG images\n- Disable GPU acceleration for Qt WebEngine by default to prevent crashes on some older systems. Can be re-enabled via Preferences->Tweaks\n- Speedup calibre shutdown time by a couple of seconds\nImproved news sources\n- Times Literary Supplement\n- Private Eye\n- New Yorker","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.0.0","version":0,"site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}