{"appId":"w:calibre.calibre","appShortcutName":"calibre","appDisplayName":"calibre","authorId":"w:winget","releaseTagName":"winget-9.4.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/9.4.0/calibre-64bit-9.4.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- E-book viewer: Add \"reading stats\" to show reading progress\n  Closes tickets: 2142715\n- Edit book: Nicer UI for changing the entries in the insert tag menu\n- Cover grid: Option to draw emblems on top of cover in Preferences->Look & feel->Cover grid->Emblems\n- Cover grid: Add option to draw text flush with bottom of rendered cover\nBug fixes\n- DOCX Input: Fix paragraph/list margins in documents created by LibreOffice that do not have Word 2007 compatibility\n  Closes tickets: 2142611\n- ODT Input: Fix a regression in the previous release that broke conversion of images\n  Closes tickets: 2142345\n- Content server: When banning IPs for repeated login is enabled, only use the IP address not any HTTP headers as the ban key (CVE-2026-27824)\n- Content server: Sanitize content disposition received as query parameter (CVE-2026-27810)\nImproved news sources\n- WIRED Daily\n- TOI Print Edition","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.4.0","version":0,"site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}