{"appId":"w:calibre.calibre","appShortcutName":"calibre","appDisplayName":"calibre","authorId":"w:winget","releaseTagName":"winget-9.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/9.3.1/calibre-64bit-9.3.1.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- Windows installer: Detect running calibre processes and ask user to shutdown calibre before proceeding with installation to avoid reboots post installation\n- Improve Preferences->Tweaks getting rid of the need for double apply\n- KEPUB Output: When converting to KEPUB preserve cover aspect ratio regardless of the setting for it in the EPUB Output to match the behavior of KEPUB files from Kobo\n  Closes tickets: 2141251\nBug fixes\n- Make the new pages column value available in save to disk/send to device templates\n  Closes tickets: 2141151\n- Hanvon N10 device driver: Fix calibre unable to put its metadata files onto the device\n  Closes tickets: 2141625\n- Amazon metadata download plugin: Fix incorrect series index from amazon.com\n- Fix a regression in calibre 9.0 that broke output to PDB/TCR/zTXT files\n  Closes tickets: 2142195\n- Windows: Fix calibre not exiting on quit when the wireless device driver is used in calibre 9\n  Closes tickets: 2141994\n- Fix error in page counting when using the calibredb command to add a book\n- Completion: When sorting completion matches in contains mode ensure matches are sorted first by distance from beginning and then sub-sorted alphabetically\n  Closes tickets: 2141170\n- Windows: Fix a regression in calibre 9 that caused tooltips to not follow the color scheme\n  Closes tickets: 2141766\n- PDF Input: Fix PDF Outline not being converted to Table of Contents in output document when using the calibre engine\n  Closes tickets: 2141197\n- ODT Input: Ensure images are extracted within container (CVE-2026-26064)\n- PDB Input: Ensure extracted images are within the container (CVE-2026-26065)\n- Fix a regression in calibre 9.0 that caused a spurious large books merge warning when merging books in the cover grid view\n- Windows: Fix harmless error popup if user tries to launch calibre multiple times in quick succession\n- Version 9.3.1 fixes a regression in the previous release that caused a spurious error message to show when merging books and a regression in calibre 9.0 that broke using textures as the Cover grid background when using the system theme on Windows\n  Closes tickets: 2142318, 212296\nImproved news sources\n- Financial Times\n- The Asahi Shimbun\n- Todoist","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.3.1","version":0,"site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}