{"appId":"w:calibre.calibre","appShortcutName":"calibre","appDisplayName":"calibre","authorId":"w:winget","releaseTagName":"winget-9.2.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/9.2.0/calibre-64bit-9.2.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- ZIP Output: Change the template engine used for HTML templating from templite to Mustache, for greater safety and performance. Note that this is a breaking change if you use custom templates with ZIP output (CVE-2026-25731)\n- Check library: Add an option to rebuild the annotations search index\n  Closes tickets: 2139555\nBug fixes\n- CHM Input: Ignore internal files that have paths that end up outside the container. Prevents path traversal attacks with malicious CHM files (CVE-2026-25635)\n- EPUB Input: Ensure font obfuscation processing happens only on files from the EPUB, preventing path traversal attacks from malicious EPUB files (CVE-2026-25636)\n- Windows: Workaround for bug in Qt 6.10 causing Read Aloud in the E-book viewer to crash when stopped and restarted\n  Closes tickets: 2139521\n- Fix drag and drop of books into bookshelf view not working\n  Closes tickets: 2139529\n- Bookshelf: Fix bookshelf view blank on some macOS systems\n  Closes tickets: 2139403\n- E-book viewer: Fix a regression in calibre 9.0 that broke the Go to page function\n  Closes tickets: 2139576\n- E-book viewer: Fix google dictionary lookup results not legible\n  Closes tickets: 2140541\n- E-book viewer: Fix PageUp/PageDown keys needing to be pressed repeatedly at internal HTML file boundaries in flow mode\n- Bookshelf: Avoid rendering during initial show while the view is still being resized\n- Fix a regression in calibre 9.0 that caused mouse wheel to scroll a full row at a time in the Cover grid\n- News download: Fix a regression in 8.11 that broke automatic cleanup of downloaded HTML","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.2.0","version":0,"site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}