{"appId":"w:calibre.calibre","appShortcutName":"calibre","appDisplayName":"calibre","authorId":"w:winget","releaseTagName":"winget-8.16.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/8.16.2/calibre-64bit-8.16.2.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- Allow asking AI questions about any book in your calibre library. Right click the \"View\" button and choose \"Discuss selected book(s) with AI\"\n- AI: Allow asking AI what book to read next by right clicking on a book and using the \"Similar books\" menu\n- AI: Add a new backend for \"LM Studio\" which allows running various AI models locally\nBug fixes\n- Use a named local timezone for better display of historical dates in the local timezone\n  Closes tickets: 2133435\n- PDF Input: Fix a regression in the new PDF input engine that caused HTML markup to not be always escaped\n  Closes tickets: 2133846\n- Get books: Update amazon.it store plugin\n  Closes tickets: 2132253\n- Fix addition of format specific options when using calibredb catalog with command line flags\n- calibredb catalog: Fix generation of language field in BiBTeX catalogs\n  Closes tickets: 2133134\n- Fix incorrect series index when downloading metadata from amazon.co.jp\n  Closes tickets: 2132182\n- Fix a regression in the previous release that caused the case change menu to not be present in the comments editor.\n- Fix a bug in 8.16.0 that prevented the Ask AI what to read next feature from working\n  Closes tickets: 2133932\n- Fix a crash in 8.16.0 that caused using the \"Close\" button in Ask AI to crash calibre on some systems\n  Closes tickets: 2133992","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.16.2","version":0,"site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}