{"appId":"w:Canonical.Multipass","appShortcutName":"Winget Application","appDisplayName":"Multipass","authorId":"w:winget","releaseTagName":"winget-1.15.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/canonical/multipass/releases/download/v1.15.1/multipass-1.15.1+win-win64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A lightweight VM Manager that supports cloud-deployment simulation\n\nMultipass is a lightweight VM manager for Linux, Windows and macOS.\nIt's designed for developers who want a fresh Ubuntu environment with a single command.\nIt uses KVM on Linux, Hyper-V on Windows and HyperKit on macOS to run the VM with minimal overhead.\nIt can also use VirtualBox on Windows and macOS.\nMultipass will fetch images for you and keep them up to date.\nMultipass version 1.15.1\nWe're pleased to announce Multipass 1.15.1, a bug fix release addressing various issues across platforms. Thanks to our contributors for their efforts in addressing these issues.\nHighlights\n- Mounts:\n  - “permission denied” errors were returned when editing, adding, or removing files. (#3834)\n  - Mount target and sources are now properly checked to prevent code injection (#3759)\n- GUI\n  - Corrected incorrect CPU and memory reporting (#3838)\n  - Resolved an intermittent “Connection is being forcefully terminated\" due to a premature disposal of RPC streams (#3829)\nWindows-specific fixes\n- Correctly restore console output settings after CLI test run that prevented remaining tests to use the console (#3788)\n- Fixed cursor color in Windows console (#3840)\n- Fixed GUI crash on close (#3910)\nAnd more\n- Error handling: Unified return codes for invalid states (#3764)\n- ARM64 support: Fixed a build failure on Ubuntu ARM64 due to missing dependencies (#3739)\n- Documentation: Clarified and updated the launch command help text (#3833)\n- Update the version in the GUI automatically (#3806)\n- Updated Multipass references to point to the correct website (#3839)\nExpanded changelog: v1.15.0...v1.15.1","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.15.1","site":"https://canonical.com/","source":"canonical","license_or_tos":"GPL-3.0","resources":null,"verified":false}