{"appId":"w:Carbide3D.CarbideCreate","appShortcutName":"Carbide Create","appDisplayName":"Carbide Create","authorId":"w:winget","releaseTagName":"winget-8.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://carbide-downloads.website-us-east-1.linodeobjects.com/cc/stable/838/CarbideCreate-838.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"CAD/CAM Software for CNC Routers\n\nCarbide Create is a simple to use yet very powerful CAD/CAM software. It allows you to design, program, and export operations for your CNC with full 3D simulation built in.\nCarbide create uses a context sensitive user interface that only shows you the options that are relevant to your currently selected objects. This means that you are never left with a cluttered interface that has extra options that are not applicable to the task you are trying to perform.\nThis also means that you may not see all options available in Carbide Create while navigating through the software at first glance. This is on purpose to allow newcomers to the CAD/CAM hobby to easily complete simple tasks.\nIf you are looking for more advanced operations such as boolean tools, vector path grouping, or vector node editing, simply use the shift key to select more than one vector path, or create a vector path, select it, and see what new options appear.\n- (FIX) Show an error when trying to load a file with a command running.\n- (FIX) Try to fix a crash in the layer window.\n- (FIX) Rare crash in the Create Curve command.\n- (FIX) Crash when closing the program with an edit toolpath command open.\n- (FIX) Debug assertion from Qt when there are degenerate vectors.\n- (FIX) Try to fix a rare crash in the Model pane.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.0","version":0,"site":"https://carbide3d.com/","source":"Carbide 3D LLC","license_or_tos":"Proprietary","resources":null,"verified":false}