{"appId":"w:Carrier.HourlyAnalysisProgram","appShortcutName":"Hourly Analysis Program","appDisplayName":"Hourly Analysis Program","authorId":"w:winget","releaseTagName":"winget-6.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.shareddocs.com/hvac/docs/1004/public/00/EDG-HAP620/1/EDG-HAP620.EXE"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Building load calculation & energy-modeling software\n\nHAP is designed for consulting engineers, design/build contractors, HVAC contractors, facility engineers and other professionals involved in the design and analysis of commercial building HVAC systems. The program is a powerful tool for designing systems and sizing system components as well as modeling annual energy performance and energy costs.\nHAP v6.2 contains the following changes:\n1. Building Modeling\n   Added an “Import gbXML” option to facilitate integration between HAP and CAD or BIM tools.\n2. LEED v4\n   Added features for conducting a Standard 90.1 Appendix G performance rating analysis and then generating a LEED v4 Summary report.\n3. Calculation Engine\n   Updated the calculation engine to EnergyPlus version 23.2 which resolves certain problems, updates calculations, and in some cases delivers a calculation speed increase.\n4. Energy Prices\n   Implemented the most recent US state average electricity and natural gas prices published by the US Energy Information Administration (EIA)\n5. Other Enhancements\n   Made other enhancements involving project data management, building modelling, space models, air systems, plants, and documentation.\n6. Problem Fixes\n   Corrected problems in HAP v6.1.\nFurther information is provided in the HAP v6.2 New Features Document and in the program Help system in section 1.2.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.2","site":"https://www.carrier.com/commercial/","source":"Carrier","license_or_tos":"Proprietary","resources":null,"verified":false}