{"appId":"w:CCL.NetLogo","appShortcutName":"NetLogo","appDisplayName":"NetLogo","authorId":"w:winget","releaseTagName":"winget-7.0.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://ccl.northwestern.edu/netlogo/7.0.2/NetLogo-7.0.2-64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A multi-agent programmable modeling environment.\n\nNetLogo is a programmable modeling environment for simulating natural and social phenomena. It was authored by Uri Wilensky in 1999 and has been in continuous development ever since at the Center for Connected Learning and Computer-Based Modeling.\nNetLogo is particularly well suited for modeling complex systems developing over time. Modelers can give instructions to hundreds or thousands of “agents” all operating independently. This makes it possible to explore the connection between the micro-level behavior of individuals and the macro-level patterns that emerge from their interaction.\nNetLogo lets students open simulations and “play” with them, exploring their behavior under various conditions. It is also an authoring environment which enables students, teachers and curriculum developers to create their own models. NetLogo is simple enough for students and teachers, yet advanced enough to serve as a powerful tool for researchers in many fields.\nNetLogo has extensive documentation and tutorials. It also comes with the Models Library, a large collection of pre-written simulations that can be used and modified. These simulations address content areas in the natural and social sciences including biology and medicine, physics and chemistry, mathematics and computer science, and economics and social psychology. Several model-based inquiry curricula using NetLogo are available and more are under development.\nNetLogo is the next generation of the series of multi-agent modeling languages including StarLogo and StarLogoT. NetLogo runs on the Java Virtual Machine, so it works on all major platforms (Mac, Windows, Linux, et al). It is run as a desktop application. Command line operation is also supported.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.0.2","version":0,"site":"https://ccl.northwestern.edu/","source":"CCL","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}