{"appId":"w:CCL.NetLogo","appShortcutName":"Winget Application","appDisplayName":"NetLogo","authorId":"w:winget","releaseTagName":"winget-6.4.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://ccl.northwestern.edu/netlogo/6.4.0/NetLogo-6.4.0-64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A multi-agent programmable modeling environment.\n\nNetLogo is a programmable modeling environment for simulating natural and social phenomena. It was authored by Uri Wilensky in 1999 and has been in continuous development ever since at the Center for Connected Learning and Computer-Based Modeling.\nNetLogo is particularly well suited for modeling complex systems developing over time. Modelers can give instructions to hundreds or thousands of “agents” all operating independently. This makes it possible to explore the connection between the micro-level behavior of individuals and the macro-level patterns that emerge from their interaction.\nNetLogo lets students open simulations and “play” with them, exploring their behavior under various conditions. It is also an authoring environment which enables students, teachers and curriculum developers to create their own models. NetLogo is simple enough for students and teachers, yet advanced enough to serve as a powerful tool for researchers in many fields.\nNetLogo has extensive documentation and tutorials. It also comes with the Models Library, a large collection of pre-written simulations that can be used and modified. These simulations address content areas in the natural and social sciences including biology and medicine, physics and chemistry, mathematics and computer science, and economics and social psychology. Several model-based inquiry curricula using NetLogo are available and more are under development.\nNetLogo is the next generation of the series of multi-agent modeling languages including StarLogo and StarLogoT. NetLogo runs on the Java Virtual Machine, so it works on all major platforms (Mac, Windows, Linux, et al). It is run as a desktop application. Command line operation is also supported.\nA major change in this release the introduction of new features in BehaviorSpace\nBehaviorSpace New Features\n- A new syntax that allows parameter combinations to be run separately, rather than being expanded combinatorically.\n- Measurements can be conditionally recorded when a boolean reporter is true.\n- Commands can be run before the experiment begins.\n- Commands can be run after the experiment ends.\n- The mean and standard deviation of data from repetitions can be output to a file.\n- List data can be output to a file with one list element per cell.\n- Experiments can now be paused and resumed.\n- Experiments can now be exported to an XML file that can be used when running headlessly.\n- Experiments in an XML file can now be imported into a model.\n- There is a reduction in memory usage for experiments containing plots when Update plots and monitors is unchecked in the Run options dialog.\nLanguage Changes\nThe let and set primitives now support taking a list of variable names as the first argument and will assign values to those variables from a list of values given as the second argument. This is useful in many situations, but especially when you want to have a reporter procedure calculate and report multiple values to be used elsewhere.\nA new reporter primitive has been added, who-are-not. It takes an agentset as a lefthand side argument and an agent or another agentset as a righthand side argument and reports all agents in the former who are not in the latter. For example: let strangers turtles who-are-not link-neighbors.\nBug Fixes and Changes\n- The save dialog will no longer appear when clicking the close button on an already-saved includes file code tab.\n- When an includes code file is edited, compiled, and closed without saving, the model will correctly re-compile without the unsaved change.\n- When extensions are updated through the extensions manager, existing files and libraries for them will be removed so conflicts between versions cannot occur.\n- An error will no longer occur when opening a NetLogo model stored in the user’s home directory due to the extension locating code trying to search restricted folders.\n- Plotting now uses its own RNG that is cloned from the main RNG and updated when the main RNG changes. This means if plotting is enabled, it will be reproducible from the main RNG, but if plotting is disabled the behavior of the model will not change when using the same main RNG seed.\n- A failed compile of a string as a command with run could cause the same string to fail to run as a reporter using runresult later.\n- Patch colors can now be set to RGBA values with an alpha channel, the alpha channel is just ignored as there is nothing “behind” patches. Previously this would cause an error to occur.\n- Users can add symbolic links to their models library folders to point to other directories to have those models available for loading in the app. This had worked in a prior version of NetLogo, but was accidentally disabled with other bugfixes.\n- The link-neighbor? boolean reporter has had some small optimizations done to improve performance.\n- Agent labels now support linebreaks.\n- Errors that happen when NetLogo is starting but before the full interface appears should now be caught and displayed in a simple dialog. Previously to see such errors NetLogo would have to be started from a command line console.\n- The default maximum memory usage for NetLogo is now set to 50% of system memory instead of a static limit of 1 gigabyte. For systems with greater than 2 gigabytes of memory this should give improved performance and reduce the chance of getting out of memory errors during model runs.\n- When the extension manager is disabled via the Java environment property, no data will be fetched over the network. Previously the current extension listing would be fetched even though using the list in the manager was disabled.\n- The <breed>-at primitive now works properly in 3D. Previously it would function as the 2D version, only getting agents with z-coordinate of 0.\nBehaviorSpace Bug fixes and changes\n- 3D BehaviorSpace runs are now allowed.\n- BehaviorSpace no longer exits when there is a plot compilation error.\n- Error messages for BehaviorSpace variable errors have been improved.\n- BehaviorSpace output files no longer contain trailing spaces.\n- Headless console mode now has a --help flag.\n- The Experiment dialog makes use of tooltips and has a cleaner look.\n- Changes will not be saved if the close/X button of the Experiment dialog is hit.\n- The number of threads in the Run options dialog is now saved.\n- Experiments will not run if the close/X button of the Run options dialog is hit.\nExtension Updates\n- The Bitmap extension now supports reading images from base64-encoded strings and writing images out to base64-encoded strings.\n- The GIS extension has a couple of bug fixes: 1) its string-based search of features could include too many items, and 2) the code for creating turtles inside a polygon was executed for existing turtles outside that polygon.\nDocumentation Updates\n- The logical operator precedence for and and or is clarified in the docs as not exactly matching how other programming languages function.\n- Clarify that mouse-inside? only works when the mouse is in the world, not only in the view, which can happen with unwrapped worlds and use of the follow primitive.\n- Removed the -> variable, a leftover from the switch from the old anonymous task syntax.\n- Clarify that an extension must be installed for the extensions keyword to take effect.\nModels Library Changes\nNew Sample Models:\n- Food Reward Learning\n- Current in a Semiconductor\n- Radical Polymerization with Chains\n- Food Reward Learning\n- Baldwin Effect\nSample Model Changes\n- Fixed a minor issue in the Monte Carlo Lennard-Jones model.\n- Renamed Prisoner’s Dilemma models from “PD” to “Prisoner’s Dilemma” and clarified that “confess” means “defect” in the info tab.\n- Polymer dynamics model info tab was edited to indicate that this is not strictly speaking a cellular automata.\n- Wolf Sheep Predation was updated to include BehaviorSpace experiments that use the new BehaviorSpace features.\n- Anisogomy model was updated and improved.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.4.0","site":"https://ccl.northwestern.edu/","source":"CCL","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}