{"appId":"w:CCL.NetLogo","appShortcutName":"NetLogo","appDisplayName":"NetLogo","authorId":"w:winget","releaseTagName":"winget-7.0.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://downloads.netlogo.org/7.0.3/NetLogo-7.0.3-64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A multi-agent programmable modeling environment.\n\nNetLogo is a programmable modeling environment for simulating natural and social phenomena. It was authored by Uri Wilensky in 1999 and has been in continuous development ever since at the Center for Connected Learning and Computer-Based Modeling.\nNetLogo is particularly well suited for modeling complex systems developing over time. Modelers can give instructions to hundreds or thousands of “agents” all operating independently. This makes it possible to explore the connection between the micro-level behavior of individuals and the macro-level patterns that emerge from their interaction.\nNetLogo lets students open simulations and “play” with them, exploring their behavior under various conditions. It is also an authoring environment which enables students, teachers and curriculum developers to create their own models. NetLogo is simple enough for students and teachers, yet advanced enough to serve as a powerful tool for researchers in many fields.\nNetLogo has extensive documentation and tutorials. It also comes with the Models Library, a large collection of pre-written simulations that can be used and modified. These simulations address content areas in the natural and social sciences including biology and medicine, physics and chemistry, mathematics and computer science, and economics and social psychology. Several model-based inquiry curricula using NetLogo are available and more are under development.\nNetLogo is the next generation of the series of multi-agent modeling languages including StarLogo and StarLogoT. NetLogo runs on the Java Virtual Machine, so it works on all major platforms (Mac, Windows, Linux, et al). It is run as a desktop application. Command line operation is also supported.\n- When a runtime error was generated, the application was not jumping to the line of code that generated it\n- A slider widget could sometimes ignore its initial value\n- The “Jump sliders to click location” preference was preventing proper dragging of the “speed” slider knob\n- The “Jump sliders to click location” preference was canceling drags of slider widget knobs as soon as the mouse cursor went outside of the slider\n- Slider widgets were not correctly changing their dimensions when toggling the “vertical?” setting\n- Slider values could get rounded towards the slider’s increment, even when manually set to a specific value\n- user-yes-or-no? was raising an error when “Halt” was selected in the resultant dialog\n- Preferences were only toggleable by clicking their respective checkbox, instead of also allowing clicks on the text describing the preference\n- The “Auto-detect” option for the interface language preference was defaulting to the previously-selected language, instead of the system default one\n- The Extension Manager was not offering to automatically install libraries when it could easily do so\n- The GoGo extension was not loading all of its libraries correctly\n- The GoGo extension could leave an orphan process running after NetLogo closed\n- The block-comment/-uncomment functionality was not properly handling text selections where at least one line was entirely commented out and at least one line wasn’t\n- Extensions were not properly raising errors when they occurred within a separate thread\n- Multiple models had one or more improperly sized widgets, after their conversion to NetLogo 7’s new widget format\n- Compiling NetLogo code with the system locale set to Turkish could cause compilation errors\n- NetLogo 3D was not respecting non-default patch sizes\n- NetLogo 3D was failed to report turtle coordinates after setting them in turtle monitors\n- “Quick Help” would raise an error if used on a semi-colon (”;”)\n- “Edit” dialogs could sometimes have the wrong focus behavior\n- The .nlogox file icon was too narrow\n- In the Models Library dialog, the file selector’s border would glow in response to mouse clicks\n- The System Dynamics Modeler dialog was not being closed when Escape was pressed\n- The “Print” option was unconventionally appearing below “Quit” in the file menu\n- The “headless” version of NetLogo would hang after encountering errors\n- The analytics functionality was uploading values entered for the “Directory to store logs” preference. We did not previously realize that this information could be de-anonymizing, so we have now ceased collecting data about what that preference is set to. Only about one user per thousand had data for that preference uploaded to our data collection server, and the data has since been purged.\n- On Windows, __includes files were always displaying their full path, instead of just the file name\n- On Windows, __includes files would generate warnings and behave incorrectly if / was used as the path separator, instead of \\","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.0.3","version":0,"site":"https://ccl.northwestern.edu/","source":"CCL","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}