{"appId":"w:ChangemakerStudios.Papercut_SMTP","appShortcutName":"Papercut SMTP","appDisplayName":"Papercut SMTP","authorId":"w:winget","releaseTagName":"winget-7.6.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ChangemakerStudios/Papercut-SMTP/releases/download/7.6.2/PapercutSMTP-win-x64-stable-Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Simple Desktop Email Server\n\nPapercut SMTP is a 2-in-1 quick email viewer AND built-in SMTP server (designed to receive messages only). Papercut SMTP doesn't enforce any restrictions how you prepare your email, but it allows you to view the whole email-chilada: body, html, headers, attachment down right down to the naughty raw encoded bits. Papercut can be configured to run on startup and sit quietly (minimized in the tray) only providing a notification when a new message has arrived.\nRelease replaces 7.6.1 which had a major issue with email receiving in the UI.\nNew Features\n- Dark Theme Support - Added full dark theme support with automatic Windows dark mode detection and synchronization. Fixes #228 (Thanks, wonea!)\n  - System/Light/Dark base theme selection with accent color customization\n  - Automatic system dark mode detection with live theme updates\n  - AvalonEdit syntax highlighting supports both light and dark modes\n  - Theme-aware attachment icons and UI controls throughout the application\n- IP Allowlist Support - Added IP allowlist filtering for SMTP and HTTP connections with CIDR notation support. Fixes #333 (Thanks, mhkarimi1383!)\n  - Configurable via SmtpServer:AllowedIps setting\n  - Support for individual IPs (e.g., 192.168.1.100) and CIDR ranges (e.g., 192.168.1.0/24)\n  - Comprehensive unit tests for IP validation and range matching\n  - Fail-closed security - blocks all connections if validation fails\n- Dynamic Property Editor for Rules - Replaced legacy PropertyGrid with custom MahApps.Metro-compatible dynamic property editor\n  - Reflection-based property discovery using System.ComponentModel attributes\n  - Intelligent control selection (TextBox, NumericUpDown, ToggleSwitch, PasswordBox)\n  - Category-based property organization with smart ordering\n  - Resizable GridSplitter between rules list and property editor\n  - Full dark theme support in Rules Configuration dialog\nImprovements\n- .NET 9.0 Upgrade - Upgraded entire solution to .NET 9.0 for improved performance and latest framework features\n- Theme Consistency - Modernized UI to use dynamic theming with refreshed Options dialog and message list visuals\n- Tab Preservation - Selected message detail tab (Message/Body/Headers/Raw) now preserved when switching between messages\n- Code Quality - Fixed numerous compiler warnings and null-safety issues throughout the codebase\n- Resource Management - Fixed X509Certificate2Collection resource leak\n- Docker Improvements - Updated container and runtime images for .NET 9.0\nCode Quality\n- Comprehensive unit tests for IP allowlist validation\n- More flexible SMTP/server startup wiring and options\n- Internal robustness improvements with clearer initialization and lifecycle handling\n- Better error handling across core components\nContributors\nSpecial thanks to wonea for requesting dark theme support and mhkarimi1383 for requesting IP allowlist functionality!","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.6.2","version":0,"site":"https://changemakerstudios.us/","source":"PapercutSMTP","license_or_tos":"Apache-2.0","resources":null,"verified":false}