{"appId":"w:ChaosRecipeEnhancer.ChaosRecipeEnhancer","appShortcutName":"Chaos Recipe Enhancer","appDisplayName":"Chaos Recipe Enhancer","authorId":"w:winget","releaseTagName":"winget-3.26.1000","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/ChaosRecipeEnhancer/ChaosRecipeEnhancer/releases/download/3.26.1000/ChaosRecipeEnhancer-Setup.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Helps with Chaos recipes in GGG's Path of Exile\n\nThis app fetches your stash data from the PoE servers and shows which items you need to pick up to complete the chaos orb recipe. When you're ready to vendor a set, we'll highlight the item pick order, which is great when you're pulling from messy tabs. Optionally, it can also manipulate your offline loot filter, so you can fully streamline your farm.\nHowdy, hey! Happy pre-3.26 league launch!\nThe new installer should automatically replace older versions of the app. If you find it doesn't, you'll want to manually uninstall your previous CRE installation(s) and re-run this latest installer. All prior configurations should be retained between upgrades / reisntallations.\nAs always, the new leagues will populate on the League dropdowns automatically when the new leagues launch tomorrow. You can download this now, do your testing and customizations, and be ready to go when you hit late campaign / early maps tomorrow! 🟡📈🤠\nBug Fixes:\n- Fixed issue related to legacy (SessionID-based) auth mode; Fixes issues related to loading Guild Stash data (Also clarifying the purpose behind retaining this legacy auth mode as in the Advanced settings tab)\n  - This fix impacts less than 1% of users since most folks are on the new, more secure, OAuth mode. Once GGG creates an OAuth Guild Stash API endpoint, I will likely remove this option. Until then, it stays.\nimage\nimage\n(GitHub Generated Release Notes)\nWhat's Changed\n- Develop <- Release/v3.26.1000 Release by @HiMarioLopez in #657\n- Main <- Develop: v3.26.1000 Release by @HiMarioLopez in #658\nFull Changelog: 3.25.1002...3.26.1000","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.26.1000","site":"https://github.com/ChaosRecipeEnhancer/ChaosRecipeEnhancer","source":"CRE Team","license_or_tos":"GPL-3.0","resources":null,"verified":false}