{"appId":"w:ChaosRecipeEnhancer.ChaosRecipeEnhancer","appShortcutName":"Chaos Recipe Enhancer","appDisplayName":"Chaos Recipe Enhancer","authorId":"w:winget","releaseTagName":"winget-3.27.1000","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/ChaosRecipeEnhancer/ChaosRecipeEnhancer/releases/download/3.27.1000/ChaosRecipeEnhancer-Setup.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Helps with Chaos recipes in GGG's Path of Exile\n\nThis app fetches your stash data from the PoE servers and shows which items you need to pick up to complete the chaos orb recipe. When you're ready to vendor a set, we'll highlight the item pick order, which is great when you're pulling from messy tabs. Optionally, it can also manipulate your offline loot filter, so you can fully streamline your farm.\nHowdy, hey! Happy pre-3.27 league launch to us all. Can't wait for some async trading in PoE 1.\nThe new installer should automatically replace older versions of the app. If you find it doesn't, you'll want to manually uninstall your previous CRE installation(s) and re-run this latest installer. All prior configurations should be retained between upgrades / reinstallations.\nAs always, all variants of the new Keepers leagues will populate on the League dropdowns automatically when they launch on Friday, including any Private Leagues you join. You can download this now, do your testing and customizations, and be ready to go when you hit late campaign / early maps later this week! 🟡📈🤠\nThe open source .exe signing mechanism I was using expired earlier this year and I decided not to renew it since it's a paid service. This app is and will always be free. Just tightening my purse as I look to save for a house soon. So... best I can do is offer my word that the app continues to be safe, continues to be 100% ToS compliant, and is free of any malicious code - which will always remain available for review on this repository. Cheers.\nMario\n(GitHub Generated Release Notes)\nWhat's Changed\n- Fix: Prevent STA thread crashes when interacting with Fetch functionality and AutoFetch by @ChipsetZ in #663\n- Fix: Stash tab overlay DPI scaling and previously saved position by @JYChuah01 in #665\n- Develop <- Release/v3.27.1000 Release by @HiMarioLopez in #667\n- Main <- Develop: v3.27.1000 Release by @HiMarioLopez in #668\nNew Contributors\n- @ChipsetZ made their first contribution in #663\n- @JYChuah01 made their first contribution in #665\nFull Changelog: 3.26.1000...3.27.1000","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.27.1000","version":0,"site":"https://github.com/ChaosRecipeEnhancer/ChaosRecipeEnhancer","source":"CRE Team","license_or_tos":"GPL-3.0","resources":null,"verified":false}