{"appId":"w:ChefSoftware.Inspec","appShortcutName":"InSpec","appDisplayName":"InSpec","authorId":"w:winget","releaseTagName":"winget-6.8.24.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://packages.chef.io/files/stable/inspec/6.8.24/windows/8/inspec-6.8.24-1-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An open-source framework for testing and auditing your applications and infrastructure.\n\nChef InSpec is an open-source framework for testing and auditing your applications and infrastructure. It compares the actual state of your system with the desired state that you express in easy-to-read and easy-to-write Chef InSpec code. It detects violations and displays findings in the form of a report, but puts you in control of remediation.\nChef InSpec is a run-time framework and rule language used to specify compliance, security, and policy requirements. It includes a collection of resources that help you write auditing controls quickly and easily.\nNew Features\n- Deprecation notice about moving core resource packs to their individual gems after the next major release (#7219)\n- Added the --legacy flag to the inspec automate upload command. (#7200)\n  The inspec automate upload command runs inspec check and inspec export, which were updated in Chef InSpec 5.22.36. This update led to a bug with InSpec profiles with =begin =end.\n  Use the --legacy flag with profiles where the newer export and check methods may fail to parse older profiles correctly, particularly due to limitations in AST parsing.\nCVEs\n- Fixes HTTP Request Smuggling in ruby webrick CVE-2024-47220. (#7214)\n- Fixes the REXML denial of service vulnerability CVE-2024-43398. (#7199)\n- Fixes the REXML ReDoS vulnerability CVE-2024-49761. (#7199)\nImprovements\n- Use of a better cryptographic hashing algorithm on sensitive data. (#7261)\n- Improvements in the error handling of the plugin installation error. (#7161)\n- Fixed the encoding issues with special characters in passwords for Postgres Session resource (#7277)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.8.24.1","version":0,"site":"https://www.chef.io/","source":"\"Chef Software, Inc <maintainers@chef.io>\"","license_or_tos":"Proprietary","resources":null,"verified":false}