{"appId":"w:ChefSoftware.Workstation","appShortcutName":"Winget Application","appDisplayName":"Chef Workstation","authorId":"w:winget","releaseTagName":"winget-25.2.1075.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://packages.chef.io/files/stable/chef-workstation/25.2.1075/windows/8/chef-workstation-25.2.1075-1-x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Chef Workstation installs everything you need to get started using Chef products on Windows, Mac and Linux.\n\nStart your infrastructure automation with Chef Workstation. Chef Workstation gives you everything you need to get started with Chef - ad hoc remote execution, remote scanning, configuration tasks, cookbook creation tools as well as robust dependency and testing software - all in one easy-to-install package.\nChef Workstation includes:\n- Chef Infra Client\n- Chef InSpec\n- Chef Habitat\n- chef and knife command line tools\n- Testing tools such as Test Kitchen and Cookstyle\n- Everything else needed to author cookbooks and upload them to the Chef Infra Server\nChef Workstation replaces ChefDK, combining all the existing features with new features, such as ad-hoc task support and the new Chef Workstation desktop application.\nComponents\nKnife\nImportant Notice: Upcoming Omnitruck API Deprecation\nWe updated Knife from v18.6.2 to v18.6.13. This release introduces a warning message when running knife bootstrap that notifies users about the upcoming Omnitruck API deprecation.\nTo ensure uninterrupted downloads and remove this warning:\n- For connected environments: Activate your Chef license and Knife automatically uses the new download APIs.\n- For air-gapped environments: Set up a local Chef licensing service and configure the CHEF_LICENSE_SERVER environment variable to point to its URL. For more information, see the Chef Local License Service documentation.\nActivating your Chef license ensures a smooth transition to the new download mechanism before the Omnitruck API is deprecated.\nChef Habitat\n- Updated Chef Habitat from v1.6.1041 to v1.6.1243. See the Habitat release notes for more information.\nImprovements\n- To improve security and mitigate vulnerabilities, we replaced Kernel.open with File.open and IO.read with File.read.\nSecurity\nUpdated expat from v2.5.0 to v2.6.4 to resolve the following CVEs:\n- CVE-2023-52425\n- CVE-2023-52426\n- CVE-2024-45492","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"25.2.1075.1","site":"https://www.chef.io/","source":"\"Chef Software, Inc. <maintainers@chef.io>\"","license_or_tos":"Proprietary","resources":null,"verified":false}