{"appId":"w:ChefSoftware.InfraClient","appShortcutName":"Chef Infra Client","appDisplayName":"Chef Infra Client","authorId":"w:winget","releaseTagName":"winget-18.9.4.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://packages.chef.io/files/stable/chef/18.9.4/windows/10/chef-client-18.9.4-1-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An agent that runs locally on every node that’s under management by Chef Infra Server.\n\nChef Infra Client is an agent that runs locally on every node that’s under management by Chef Infra Server. When Chef Infra Client runs, it performs all of the steps required for bringing a node into the expected state, including:\n- Registering and authenticating the node with Chef Infra Server\n- Synchronizing cookbooks from the Chef Infra Server to the node\n- Compiling the resource collection by loading each of the required cookbooks, including recipes, attributes, and all other dependencies\n- Taking the appropriate and required actions to configure the node based on recipes and attributes\n- Reporting summary information on the run to Chef Automate\nChef Infra Client authenticates with the Chef Infra Server using RSA public key-pairs each time a Chef Infra Client needs access to data that is stored on the Chef Infra Server. This prevents any node from accessing data that it shouldn’t and it ensures that only nodes that are properly registered with the Chef Infra Server can be managed.\nNew features\n- Added the -a/--all-users flag to the knife user list command to display detailed user information, including email, display name, first name, and last name. (#15494)\nImprovements\n- The path property in resources is now read once and reused, avoiding repeated property‑handling overhead. This reduces unnecessary computation and speeds up resource processing. Thanks @dafyddcrosby! (#15485)\nPackaging\n- We’ve dropped support for building packages on macOS 12 and added support for macOS 13. (#15415)\nSecurity\n- Updated the rack gem to 3.2.4. (#15439)\n- Updated the resolv gem to 0.2.1. (#15459)\n- Removed vulnerable bundled versions of the rexml gem. (#15462)\n- Removed vulnerable bundled versions of the uri gem to address CVE-2025-27221. (#15475)\n- Improved how Chef Infra Client and Knife extract YAML documents. The new method is no longer vulnerable to malicious YAML files. (#15466)\n- Improved software bill of materials (SBOM) generation and security scanning in the CI pipeline to improve traceability, auditability, and transparency in dependency management. (#15502)\n- Updated OpenSSL library to 3.2.6 to address CVE-2025-9230\nDependency updates\n- Updated Ohai to 18.2.13 (#15520)\n- Removed direct dependency on activesupport (#15472)\n- Updated the multi_json gem to 1.17.0. (#15421)\n- Updated the chef gem to 18.8.54 in the knife lockfile. (#15490)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.9.4.1","version":0,"site":"https://www.chef.io/","source":"Chef Software, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}