{"appId":"w:ChefSoftware.InfraClient","appShortcutName":"Chef Infra Client","appDisplayName":"Chef Infra Client","authorId":"w:winget","releaseTagName":"winget-18.8.54.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://packages.chef.io/files/stable/chef/18.8.54/windows/10/chef-client-18.8.54-1-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An agent that runs locally on every node that’s under management by Chef Infra Server.\n\nChef Infra Client is an agent that runs locally on every node that’s under management by Chef Infra Server. When Chef Infra Client runs, it performs all of the steps required for bringing a node into the expected state, including:\n- Registering and authenticating the node with Chef Infra Server\n- Synchronizing cookbooks from the Chef Infra Server to the node\n- Compiling the resource collection by loading each of the required cookbooks, including recipes, attributes, and all other dependencies\n- Taking the appropriate and required actions to configure the node based on recipes and attributes\n- Reporting summary information on the run to Chef Automate\nChef Infra Client authenticates with the Chef Infra Server using RSA public key-pairs each time a Chef Infra Client needs access to data that is stored on the Chef Infra Server. This prevents any node from accessing data that it shouldn’t and it ensures that only nodes that are properly registered with the Chef Infra Server can be managed.\nImprovements\n- Chef Infra Client now has optimized property access with reduced instance variable name lookups for better performance. Thanks @dafyddcrosby! #15329\n- We've enhanced recipe loading capabilities by adding support for the include_recipes key in recipe hash processing. Thanks @dafyddcrosby! #15315\nResource updates\n- We enhanced resource stability by addressing edge cases that could cause failures when resources encounter unexpected data types. Thanks @fretb! #15373\nPackaging\n- We upgraded to chef-powershell 18.6.5 and mixlib-archive 1.3.3 for improved Windows PowerShell integration and better archive handling. #15410\n- We've updated Ohai to the latest version for enhanced system detection capabilities and improved hardware reporting. #15407","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.8.54.1","version":0,"site":"https://www.chef.io/","source":"Chef Software, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}