{"appId":"w:ChefSoftware.ChefDK","appShortcutName":"ChefDK","appDisplayName":"ChefDK","authorId":"w:winget","releaseTagName":"winget-4.13.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://packages.chef.io/files/stable/chefdk/4.13.3/windows/10/chefdk-4.13.3-1-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Chef Development Kit contains all the tools you need to develop and test your infrastructure, built by the awesome Chef community.\n\nChefDK, short for Chef Development Kit, is a package that contains everything that is needed to start using Chef:\n- Chef Infra Client\n- chef and knife command line tools\n- Testing tools such as Test Kitchen, ChefSpec, and Cookstyle\n- Chef InSpec\n- Everything else needed to author cookbooks and upload them to the Chef Infra Server\nNote: ChefDK will enter the end-of-life product phase on Dec 31st 2020. The 4.13 release of ChefDK is the last planned release and all users should upgrade to Chef Workstation, which offers significant improvements to all included tools.\nPackage Updates\nChefDK packages are no longer produced for Debian 8 and RHEL/CentOS 6, as these platforms are now both EOL.\nUpdated Components\nTest Kitchen\nTest Kitchen was updated from 2.7.2 to 2.8.0. This release improves how we execute commands on Windows hosts to avoid failures from executing commands that are too long for the Windows command line. Thanks for this fix @ramereth!\nKitchen Google\nThe Kitchen Google driver for Test Kitchen was updated from 2.0.3 to 2.1.0. This release adds a new network_ip config for an IPv4 internal IP address to assign to the instance. The driver automatically assigns an unused internal IP to an unconfigured network_ip. Thanks @eReGeBe for this new feature!\nKitchen Vagrant\nThe kitchen-vagrant plugin is updated from version 1.7.1 to 1.7.2 with a bug fix to no longer stop with an error when updating a Vagrant box that hasn’t yet been downloaded.\nKitchen Dokken\nKitchen Dokken has been updated to 2.11.2 to resolve failures from creating containers during the Test Kitchen converge. Thanks for reporting this issue @emeshuris!\nChef InSpec\nChef InSpec has been updated to 4.24.8, which includes the following improvements:\n- An unset HOME environment variable won’t cause execution failures\n- You can use wildcards in platform-name and release in InSpec profiles. Thanks for this improvement @yarick!\n- The WMI resource now returns an array to support returning multiple WMI objects\n- The package resource on Windows properly escapes package names. Thanks for this improvement @ramereth!\n- The grub_conf resource succeeds even if without a menuentry in the grub config\n- Loaded plugins won’t try to re-load themselves\n- Waiver expiration is now always populated\nchef-vault\nChef Vault has been updated to version 4.1, which properly handles escape strings in secrets and greatly improves performance for users with large numbers of secrets. Thanks for the performance work @Annih!\nknife-ec2\nThe knife-ec2 plugin has been updated to 2.1.0, which allows for the creation of instances with ST1 or SC1 EBS volume types\nSecurity\nopenSSL\nThe openSSL library has been updated to 1.0.2x to resolve CVE-2020-1971.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.13.3.1","version":0,"site":"https://www.chef.io/","source":"Chef Software, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}