{"appId":"w:Cisco.ChezScheme","appShortcutName":"Chez Scheme","appDisplayName":"Chez Scheme","authorId":"w:winget","releaseTagName":"winget-10.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/cisco/ChezScheme/releases/download/v10.3.0/ChezScheme.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Chez Scheme is both a programming language and an implementation of that language, with supporting tools and documentation.\n\nChez Scheme is both a programming language and an implementation of that language, with supporting tools and documentation.\nAs a superset of the language described in the Revised⁶ Report on the Algorithmic Language Scheme (R6RS), Chez Scheme supports all standard features of Scheme, including first-class procedures, proper treatment of tail calls, continuations, user-defined records, libraries, exceptions, and hygienic macro expansion.\nChez Scheme also includes extensive support for interfacing with C and other languages, support for multiple threads possibly running on multiple cores, non-blocking I/O, and many other features.\nThe Chez Scheme implementation consists of a compiler, run-time system, and programming environment. Although an interpreter is available, all code is compiled by default. Source code is compiled on-the-fly when loaded from a source file or entered via the shell. A source file can also be precompiled into a stored binary form and automatically recompiled when its dependencies change. Whether compiling on the fly or precompiling, the compiler produces optimized machine code, with some optimization across separately compiled library boundaries. The compiler can also be directed to perform whole-program compilation, which does full cross-library optimization and also reduces a program and the libraries upon which it depends to a single binary.\nThe run-time system interfaces with the operating system and supports, among other things, binary and textual (Unicode) I/O, automatic storage management (dynamic memory allocation and generational garbage collection), library management, and exception handling. By default, the compiler is included in the run-time system, allowing programs to be generated and compiled at run time, and storage for dynamically compiled code, just like any other dynamically allocated storage, is automatically reclaimed by the garbage collector.\nThe programming environment includes a source-level debugger, a mechanism for producing HTML displays of profile counts and program \"hot spots\" when profiling is enabled during compilation, tools for inspecting memory usage, and an interactive shell interface (the expression editor, or \"expeditor\" for short) that supports multi-line expression editing.\nThe R6RS core of the Chez Scheme language is described in The Scheme Programming Language, which also includes an introduction to Scheme and a set of example programs. Chez Scheme's additional language, run-time system, and programming environment features are described in the Chez Scheme User's Guide. The latter includes a shared index and a shared summary of forms, with links where appropriate to the former, so it is often the best starting point.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"10.3.0","version":0,"site":"https://cisco.github.io/ChezScheme","source":"Cisco Systems, Inc.","license_or_tos":"Apache-2.0","resources":null,"verified":false}