{"appId":"w:Citilab.S4A","appShortcutName":"S4A","appDisplayName":"S4A","authorId":"w:winget","releaseTagName":"winget-1.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Scratch modification that allows for simple programming of the Arduino open source hardware platform.\n\nS4A is a Scratch modification that allows for simple programming of the Arduino open source hardware platform. It provides new blocks for managing sensors and actuators connected to Arduino. There is also a sensors report board similar to the PicoBoard one.\nThe main aim of the project is attracting people to the programming world. The goal is also to provide a high level interface to Arduino programmers with functionalities such as interacting with a set of boards through user events.\nS4A:\n- Fixed issue on block watchers when displaying %t instead the sensor name\n- Fixed issue when analog input error not disappearing\n- Fixed bug when creating new Arduino object and selecting an existing connection (thanks to Vaner Anampa, Erik Bartmann and many more for reporting this bug)\n- Changed default pins and their order on Arduino blocks (as before)\n- Merged servo blocks, now pins 8, 7 and 4 can be used for standard and CR servomotors.\n- Added HTTP block (GET method) as requested by IMI (\"Institut Municipal d'Informatica\") of Barcelona\n- Updated some translation files. Thanks to:\n- Frederique Pinson - French (fr.po)\n- Miguel Bouzada - Galician (gl.po)\n- Fabio Albanese - Italian (it.po)\n- Sungkuk Lim - Korean (ko.po)\n- Jan Van den Bergh - Dutch (nl.po)\n- Vadim Litvenko - Russian (ru.po)\n- Johan Solve - Swedish (sv.po)\nFirmware:\n- Refactored reset pins\n- Merged code for standard and CR servos\n- Merged patch for Leonardo from Peter Mueller (many thanks for this!)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.6","version":0,"site":"https://www.citilab.eu/","source":"Citilab (Cornellà)","license_or_tos":"MIT","resources":null,"verified":false}