{"appId":"w:Cjwdev.ProcessPrompt","appShortcutName":"Process Prompt","appDisplayName":"Process Prompt","authorId":"w:winget","releaseTagName":"winget-1.1.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Prompt users to terminate specified processes before a software deployment task is executed\n\nWhen deploying software installations or updates, sometimes certain programs need to be closed first before the install/upgrade can complete successfully. However, most automated software deployment tools such as Microsoft SCCM (and other similar tools) have no option to take this in to account and so the deployment task will simply fail if a particular process was running at the time. Process Prompt was designed to be used with your existing deployment tool and will check to see if specified processes are running before attempting to run your software deployment task - if any of the specified processes are running then it will prompt users to close those programs and will wait until they have done so before it executes the software deployment task.\n\nFeatures\n- Check for any number of running processes before executing a specified installer or script\n- Set user friendly display names for each process so that the end user knows which programs they need to close\n- Specify a time limit that the end user must close the programs within (optionally force them to terminate if they have not been closed by this point)\n- Complete control over return codes from the process prompt executable for various scenarios\n- Choose whether or not the end user sees a progress window while the deployment task is executing and is notified when it has completed\n- All options are specified via XML file which is generated by the easy to use GUI config editor, which has detailed explanations of each setting\nEnvironmental variables are now expanded for task path and arguments\nTask Finished window automatically closes after 30 seconds","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.0","version":0,"site":"https://cjwdev.com/","source":"Cjwdev","license_or_tos":"Freeware","resources":null,"verified":false}