{"appId":"w:ClassicOldSong.Apollo","appShortcutName":"Winget Application","appDisplayName":"Apollo","authorId":"w:winget","releaseTagName":"winget-v0.2.9-alpha.8","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ClassicOldSong/Apollo/releases/download/v0.2.9-alpha.8/Apollo.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sunshine fork - The easiest way to stream with the native resolution of your client device.\n\nApollo is a self-hosted desktop stream host for Artemis(Moonlight Noir). Offering low latency,\nnative client resolution, cloud gaming server capabilities with support for AMD, Intel, and\nNvidia GPUs for hardware encoding. Software encoding is also available. A web UI is provided to\nallow configuration and client pairing from your favorite web browser. Pair from the local server\nor any mobile device.\nChange log\nv0.2.9-alpha.8\n1. Fix avcodec\nIf you have problems initializing a stream with previous versions with QuickSync, please update.\nWARNING: To other developers: DO NOT CHANGE THE MEMORY LAYOUT OF video::config_t and audio::config_t, they may be modified by some other pre-built binaries and they RELY ON THE LAYOUT. This took me a whole day to figure out since there's totally no warning laying around for this.\nv0.2.9-alpha.7\n1. Fix config API\nIf you have installed alpha.6, please update. If you have met any other issues in saving/changing configs, please make sure to report!\nv0.2.9-alpha.6\n1. Update dependencies\n2. Current running app is now visible in Application page (#328)\n3. Track upstream\n4. Merge Sunshine's hang workaround\nNote: This version has some pretty significant changes in configurations API. You may need to update your scripts if they're using HTTP APIs for config automation.\nv0.2.9-alpha.5\n1. Bug fixes for Input Only Mode\n2. Renamed Input Only entry to Remote Input\n3. Added a dedicated \"Terminate\" entry when using Remote Input\n4. Bug fix for double refresh rate mode when requested resolution is built-in\nv0.2.9-alpha.4\n1. Add Input Only mode (disabled by defalt, enable in Input tab)\n2. Add Double Refresh Rate mode, could improve stutter issue on some systems (disabled by default, enable in Audio/Video tab)\nv0.2.9-alpha.3\n1. Fix extra comma in default apps (Windows)\nv0.2.9-alpah.2\n1. Add option in Advanced tab for limiting captured frame rate (on by default)\n2. Restart immediately when detected a hang (workaround for stream freezes, at least it's better than hanging forever)\nv0.2.9-alpha.1\n1. Add command support for client connect/disconnect. Useful when you want to suspend your computer/game on disconnect. [detail]\n2. Trim app name input to prevent accidental space character remained when configuring MoonDeckStream\n3. Add per-app*per-client identity option\n4. Disable Advanced Display Device Config by default\n5. Log fail reason for pairing\n6. SudoVDA upgrade - might improve stutter problem on some systems\nIf you encounter display being toggled on and off constantly while using the latest versions, first quit Apollo (you can access the web UI from another device, by enter https://your.host.ip.address:[webuiPort] to your browser, then in Troubleshooting page tap Quit Apollo), then go to Apollo's install dir, under config dir remove display_device.state.\nWarning\nIt is highly recommend to remove any other virtual display solutions from your system and Apollo/Sunshine config, to reduce confusions and compatibility issues.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"v0.2.9-alpha.8","site":"https://github.com/ClassicOldSong","source":"Yukino Song","license_or_tos":"GPL-3.0","resources":null,"verified":false}