{"appId":"w:ClassicOldSong.Apollo","appShortcutName":"Winget Application","appDisplayName":"Apollo","authorId":"w:winget","releaseTagName":"winget-0.3.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ClassicOldSong/Apollo/releases/download/v0.3.4/Apollo.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sunshine fork - The easiest way to stream with the native resolution of your client device.\n\nApollo is a self-hosted desktop stream host for Artemis(Moonlight Noir). Offering low latency,\nnative client resolution, cloud gaming server capabilities with support for AMD, Intel, and\nNvidia GPUs for hardware encoding. Software encoding is also available. A web UI is provided to\nallow configuration and client pairing from your favorite web browser. Pair from the local server\nor any mobile device.\nChange log\n1. Adds an option to disable auto discovery (mDNS)\n2. Fixed bitrate calculation for Warp Mode and client side configured fractional refresh rate\n3. Fixed bitrate limiter for every encoder\n4. SudoVDA update: removed some built-in super high resolutions for VR headsets\n5. Track upstream\n   - (Linux) Fixed virtual desktop capturing for Wayland\nNOTE: Warp modes now uses the correct bitrate set from client. Lower your bitrate for Warp modes if your device or network can't handle the actual bitrate.\n🌟Best practices\n1. If your client support high refresh rate, always use high refresh rate. Combined with Artemis's Warp modes, this is basically a poorman's GSync/FreeSync.\n2. If you encounter weird stuttering problems, checkout Stuttering Clinic first.\nWarning\nIt is highly recommend to remove any other virtual display solutions from your system and Apollo/Sunshine config, to reduce confusions and compatibility issues.\nRemember to quit Apollo before upgrading.\nNote\nVirusTotal scan report for this build\nWhy Windows always report file as harmful?","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.3.4","site":"https://github.com/ClassicOldSong","source":"Yukino Song","license_or_tos":"GPL-3.0","resources":null,"verified":false}