{"appId":"w:Clickteam.InstallCreator","appShortcutName":"Install Creator","appDisplayName":"Install Creator","authorId":"w:winget","releaseTagName":"winget-2.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Install Creator 2 is a tool designed to quickly and easily build software installers, saving developers time.\n\n\nSpend your time developing your creations not building the installers. Download\nthe fully functional freeware version of Install Creator and create your first\ninstallation in less than one minute! Then you decide which way is better!\n\nThe free version of Install Creator is fully functional for both commercial and\nnon commercial products. Installers built with this version contain an extra\npage when the install is complete, linking back to Clickteam to spread the word\nabout Install Creator.\n\nThe registered version of Install Creator is the same as the freeware version,\nbut there is no Clickteam advertisement included. You can purchase a registered\nversion in our online store, and fax and postal mail registration are also\navailable.\n\nThe professional version of Install Creator is designed for professional usage.\nIt has powerful features to manage shareware and demo versions of software which\ncan be registered. It has the same basic interface as the Freeware and\nRegistered versions, but it allows you to bundle multiple versions of your\nproduct into one installer. You could create one version for unregistered users,\nand one version for registered users. Install Creator will handle the rest.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0","version":0,"site":"https://www.clickteam.com/about-clickteam","source":"Clickteam","license_or_tos":"Proprietary","resources":null,"verified":false}