{"appId":"w:clsid2.mpc_hc","appShortcutName":"MPC-HC","appDisplayName":"MPC-HC","authorId":"w:winget","releaseTagName":"winget-2.6.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/clsid2/mpc-hc/releases/download/2.6.2/MPC-HC.2.6.2.x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"MPC-HC is an extremely light-weight, open source media player for Windows. It supports all common video and audio file formats available for playback.\n\nMedia Player Classic - Home Cinema (MPC-HC) is a free and open-source video and audio player for Windows. It is famous and loved for its simple and effective user interface, providing an excellent user experience. It offers a huge amount of functionality. Being a DirectShow player, it also allows flexibility and extensibility through third party filters.\nDonations are appreciated. There is now a PayPal option.\nChanges from 2.6.1 to 2.6.2:\nUpdates:\n- Updated LAV Filters to version 0.81-5-g5aa4b\n- Updated MediaInfo DLL to version 26.01\nFixes:\n- Several small fixes and improvements.\nOpenSubtitles download error 406\nSubtitle downloads from OpenSubtitles may fail depending on time of day. This is due to our daily download quota being exceeded. Current amount of donations is barely enough to pay for the existing quota. So it is unlikely that quota can be increased and situation will get worse over time.\nIf you create an OpenSubtitles account and configure it in MPC-HC settings then you may be able to bypass the quota.\nOptions > Subtitles > Misc > Right-click on OpenSubtitles.com > Setup > Fill in username/password\nToolbars\nIf you want to create you own toolbar design, read this.\nTranslations\nYou can help improve and complete translations. See this topic for more info. There are several languages where recently added options have not yet been translated.\nOverview of features\nA lot of people seem to be unaware of some of the awesome features that have been added to MPC-HC in the past years. Here is a list of useful options and features that everyone should know about:\n- Play HDR video\n  This requires using either MPC Video Renderer (MPCVR) or madVR.\n  These renderers can be selected here:\n  Options > Playback > Output\n  With other video renderers, the colors will be wrong!\n  MPCVR is now included and is the recommended renderer for modern systems. MadVR needs to be installed separately. MPCVR also supports Dolby Vision. MadVR does not.\n  For optimal performance you should change the hardware decoder to D3D11 in LAV Video Decoder settings when using MPCVR on Windows 10/11, because this renderer uses DirectX11.\n- The installer of MPC-HC is very basic (and that will not change).\n  I therefore recommend using K-Lite Codec Pack. That includes MPC-HC and other essential components. It has a very advanced installation that can automatically create file associations, and helps you with easy configuration of important MPC-HC settings.\n  The Standard version should be sufficient for most people. Use Full version of you like to use MadVR.\n- Modern GUI Theme (Dark or Light)\n  Options > Player > User Interface\n  It is also possible to change the height of the seekbar and size of the toolbar buttons.\n- Video preview on the seekbar\n  Options > Player > User Interface > Hover type\n- Ability to search for subtitles\n  Press D for manual search.\n  Or enable automatic search in: Options > Subtitles > Misc\n- Adjust playback speed\n  Menu > Play > Playback rate\n  The buttons in the player that control playback rate take a 2x step by default. This can be customized to smaller values (like 10%):\n  Options > Playback > Speed step\n  Adjusting playback speed works best with the internal audio renderer. This also has automatic pitch correction.\n  Options > Playback > Output > Audio Renderer\n- MPC-HC can remember playback position, so you can resume from that point later\n  Options > Player > History\n- You can quickly seek through a video with Ctrl + Mouse Scrollwheel.\n- You can jump to next/previous file in a folder by pressing PageUp/PageDown.\n- You can perform automatic actions at end of file. For example to go to next file or close player.\n  Options > Playback > After Playback (permanent setting)\n  Menu > Play > After Playback (for current file only)\n- A-B repeat\n  You can loop a segment of a video. Press [ and ] to set start and stop markers.\n- You can rotate/flip/mirror/stretch/zoom the video\n  Menu > View > Pan&Scan\n  This is also easily done with hotkeys (see below).\n- There are lots of keyboard hotkeys and mouse actions to control the player. They can be customized as well.\n  Options > Player > Keys\n  Tip: there is a search box above the table.\n- You can stream videos directly from Youtube and many other video websites\n  Put yt-dlp.exe in the MPC-HC installation folder.\n  Then you can open website URLs in the player: Menu > File > Open File/URL\n  You can even download those videos: Menu > File > Save a copy\n  Tip: to be able to download in best quality with yt-dlp, it is recommended to also put ffmpeg.exe in the MPC-HC folder.\n  Several YDL configuration options are found here: Options > Advanced\n  This includes an option to specify the location of yt-dlp.exe in case you don't want to put it in MPC-HC folder.\n  Note 1: You also need to install Microsoft Visual C++ 2010 SP1 Redistributable Package (x86)\n  Note 2: yt-dlp nightly build (very latest version made daily)\n  Note 3: yt-dlp win7 compatible build\n- Besides all these (new) features, there have also been many bugfixes and internal improvements in the player in the past years that give better performance and stability. It also has updated internal codecs. Support was added for CUE sheets, WebVTT subtitles, etc.\nMPC Video Renderer\nFrequently Asked Questions","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.6.2","version":0,"site":"https://github.com/clsid2/mpc-hc","source":"MPC-HC Team","license_or_tos":"GPL-3.0","resources":null,"verified":false}