{"appId":"w:CollapseLauncher.Collapse","appShortcutName":"Winget Application","appDisplayName":"Collapse","authorId":"w:winget","releaseTagName":"winget-1.82.21","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Collapse was originally designed for Honkai Impact 3rd. However, as the project evolved, this launcher is now a game client for all currently released miHoYo Games.\n\n\n> We have just published our new landing page, which you can view at https://collapselauncher.com !\nServicing/Maintenance Mode Phase\nVersion 1.82.17 onwards will mark as the 1.82.xxx releases enters \"Servicing/Maintenance Mode\", meaning that 1.82.xxx releases will no longer get any improvements or new features, unless any urgent changes or bug fixes that need to be pushed or backported.\nWe are going to plan other new features, improvements and changes to be pushed in later release, 1.83.xxx.\nHit us on our Official Discord or Create an Issue if you have ideas what features or changes you want to have in later 1.83.xxx or future release.\nMore information regarding the changes can also be found in the changelog below👇\nWhat's changed? - 1.82.21 (9+10 Edition)\n- [Fix] Update .NET to 9.0.3 due to CVE-2025-24070, by @bagusnl\n  - We are not directly affected but due to the high score of the vuln, we have to update.\n  - Read more about the vuln here GHSA-2865-hh9g-w894\n- [Fix] Proxy with password always return invalid password, by @neon-nyan\n- [Fix] Duplicated entries in Zenless repair, by @neon-nyan\n- [Fix] Missing margin in HomePage's Additional Settings subpanel, by @shatyuka\n- [Fix] Taskbar progress bar did not reset after update is finished, by @shatyuka\n- [New] Anisotropic Filtering in Zenless game settings, by @Cryotechnic\n- [Fix] Playtime database did not sync if database stamp is null, by @bagusnl\nCode Signing Policy\n> Free code signing provided by SignPath.io, certificate by SignPath Foundation\n- This program will only transfer user data to user configured database server. Exception data will be sent to [Sentry.io] for error tracking purposes (user are able to disable the behavior in App Settings).\n- Read our full Privacy Policy\n- Also read our Third Party Notices for license used by third party libraries that we use.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.82.21","site":"https://github.com/CollapseLauncher","source":"neon-nyan","license_or_tos":"MIT","resources":null,"verified":false}