{"appId":"w:CometNetwork.BitComet","appShortcutName":"BitComet","appDisplayName":"BitComet","authorId":"w:winget","releaseTagName":"winget-2.17","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.bitcomet.com/achive/BitComet_2.17_setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free C++ BitTorrent Download Client\n\nBitComet is a free BitTorrent download client which is powerful, super-fast and easy-to-use.\nGUI Improved: The BT task properties dialog's advanced page adds a separate anti-leech option, which has a higher priority than the global settings.\nGUI Improved: The BT task properties dialog's advanced page adds a separate 'Enable tracker' option to control HTTP/UDP/WS trackers.\nGUI Improved: Added advanced setting: network.preferred_network_adapter\nGUI Improved: Add a rename shortcut F2 to the task list\nGUI Improved: For task lists and other sortable lists, add a 'Reset Sorting' feature to the header right-click menu.\nGUI Improved: After subscribing to the VIP membership in the Android app, the desktop version shows the VIP icon on the passport page at the bottom left corner. The progress bar bubble displays the points level, and the bubble with the level badge shows the valid level.\nWebUI：Add a video file preview button column and a file count column (hidden by default) to the task list\nWebUI：Add a video file preview button column to the file list\nWebUI：Add file download function to the file list context menu\nWebUI：Add online video playback function to the context menu of the file list\nWebUI：The video playback window supports loading subtitle files (vtt, srt, ass formats)\nWebUI：\"About\" dialog displays architecture information\nWebUI：Fix the issue where the task list selection is misaligned when there are too many tasks.\nCore Improved: WebUI connection adds ETag and Cache-Control caching mechanism\nCore Bugfix: DNS resolution issues are causing the program to fail to exit.\nCore Bugfix: When opening a torrent to create a BT task, the configuration file save location is incorrect.\nCore Bugfix: The HTTP server module returns incorrect data when handling a large number of concurrent short connections.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.17","version":0,"site":"https://www.bitcomet.com/en","source":"CometNetwork","license_or_tos":"Freeware","resources":null,"verified":false}