{"appId":"w:CometNetwork.BitComet","appShortcutName":"BitComet","appDisplayName":"BitComet","authorId":"w:winget","releaseTagName":"winget-2.18","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.bitcomet.com/achive/BitComet_2.18_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free C++ BitTorrent Download Client\n\nBitComet is a free BitTorrent download client which is powerful, super-fast and easy-to-use.\nGUI Improved: Remove code related to IE browser plugins\nGUI Improved: Remove the TCP/IP connection limit page in options dialog for Windows XP and Vista\nGUI Improved: Add a 'Untagged' button to the label toolbar above the task list\nGUI Improved: The IP filter page in options dialog has been changed to a tab layout\nGUI Improved: Added advanced setting: torrent_share.unload_memory_when_disabled\nGUI Bugfix: When the torrent list is disabled, clicking the corresponding item in the left tree list should not load data\nGUI Bugfix: When the task list is sorted by health, tasks that are seeding are not sorted correctly.\nGUI Bugfix: After the system resumes from Sleep, the main window's tray minimized state behaves abnormally.\nCore Improved: Upgrade dependencies boost and rapidjson\nCore Bugfix: When WebUI bans a peer, operations fail for peers with unknown listening ports.\nCore Bugfix: Downloading files with special characters in their names from the WebUI file list will fail.\nCore Bugfix: Restore support for the Windows XP platform\nWebUI：Add Ctrl+A to select all items in the task list\nWebUI：Add BT task settings page in the options window\nWebUI：Add Long-Term seeding settings page in the options window\nWebUI：Add Tracker settings page in the options window\nWebUI：The IP filter page in options window has been changed to a tab layout\nWebUI：Add disk cache settings page in the options window\nWebUI：Add Scheduler settings page in the options window\nWebUI：Add up and down move buttons to the client filter page in options window\nWebUI：Playing video files supports calling the local player\nPackage: Remove IE browser add-on options","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.18","version":0,"site":"https://www.bitcomet.com/en","source":"CometNetwork","license_or_tos":"Freeware","resources":null,"verified":false}