{"appId":"w:ComfortSoftwareGroup.HotAlarmClock","appShortcutName":"Hot Alarm Clock","appDisplayName":"Hot Alarm Clock","authorId":"w:winget","releaseTagName":"winget-6.4.1.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Hot Alarm Clock is super flexible and completely customizable software. You can set a single daily wakeup or configure multiple complex alarms triggering on certain days of weeks, calendar days, weeks, or months.\n\nHot Alarm Clock is super flexible and completely customizable software. You can set a single daily wakeup or configure multiple complex alarms triggering on certain days of weeks, calendar days, weeks, or months.\nThis alarm clock app can play your favorite music or online radio station, use fixed or increasing alarm volume, launch your favorite apps, and open Websites on wakeup. It'll even conserve your computer power by automatically waking it up from sleep mode and putting it back to sleep when needed.\n\nHot Alarm Clock has everything you need to follow the time, no matter how complex your schedule is. You can set a one-time or recurring alarm or use an arbitrary set of dates and times. Its rich settings will surely let you set an alarm that matches your needs.\nHot Alarm Clock lets you set any time interval for a countdown timer, including months or years. You can also create chains of timers, and the built-in metronome will notify you about the oncoming end of the countdown.\nStart multiple stopwatches in different windows or floating windows to keep track of numerous events simultaneously. You can customize the time display format and define the accuracy of counting the fractions of a second.\n\nThe trial version is fully functional but will only work for 30 days.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.4.1.0","version":0,"site":"https://www.comfortsoftware.com/","source":"Comfort Software Group","license_or_tos":"Proprietary","resources":null,"verified":false}