{"appId":"w:commercialhaskell.stack","appShortcutName":"Haskell Stack","appDisplayName":"Haskell Stack","authorId":"w:winget","releaseTagName":"winget-3.7.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/commercialhaskell/stack/releases/download/v3.7.1/stack-3.7.1-windows-x86_64-installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Stack is a cross-platform program for developing Haskell projects. It is aimed at Haskellers both new and experienced.\n\n\nSee https://haskellstack.org/ for installation and upgrade instructions.\nChanges since v3.5.1:\nOther enhancements:\n- Bump to Hpack 0.38.1.\n- The --extra-dep option of Stack's script command now accepts a YAML value specifying any immutable extra-dep. Previously only an extra-dep in the package index that could be specified by a YAML string (for example, acme-missiles-0.3@rev:0) was accepted.\nBug fixes:\n- stack script --package <pkg-name> now uses GHC's -package-id option to expose the installed package, rather than GHC's -package option. For packages with public sub-libraries, -package <pkg> can expose an installed package other than one listed by ghc-pkg list <pkg>.\n- Work around ghc-pkg bug where, on Windows only, it cannot register a package into a package database that is also listed in the GHC_PACKAGE_PATH environment variable. In previous versions of Stack, this affected stack script when copying a pre-compiled package from another package database.\n- On Windows, when decompressing, and extracting tools, from archive files, Stack uses the system temporary directory, rather than the root of the destination drive, if the former is on the destination drive.\nThanks to all our contributors for this release:\n- Max Ulidtko\n- Mike Pilgrem\n- Olivier Benz\n- Simon Hengel","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.7.1","version":0,"site":"https://haskellstack.org/","source":"commercialhaskell","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}