{"appId":"w:commercialhaskell.stack","appShortcutName":"Winget Application","appDisplayName":"Haskell Stack","authorId":"w:winget","releaseTagName":"winget-3.5.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/commercialhaskell/stack/releases/download/v3.5.1/stack-3.5.1-windows-x86_64-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Stack is a cross-platform program for developing Haskell projects. It is aimed at Haskellers both new and experienced.\n\n\nSee https://haskellstack.org/ for installation and upgrade instructions.\nChanges since v3.3.1:\nBehavior changes:\n- Stack will also warn (message S-8432) if there is any non-ISO/IEC 8859-1 (Latin-1) character in Stack's 'programs' path, as hsc2hs does not work if there is such a character in the path to its default template template-hsc.h.\n- Stack customizes setup using Cabal, so if a setup-depends field does not mention it as a dependency, Stack warns and adds the GHC boot package as a dependency. Previously, Stack would not do so but only warn that build errors were likely.\nOther enhancements:\n- Bump to Hpack 0.38.0.\n- In YAML configuration files, the install-msys key is introduced, to enable or disable the download and installation of Stack-supplied MSYS2 when necessary (subject to skip-msys: false). The default is the same as the install-ghc setting (including if that is set at the command line). Consequently, the default behaviour of Stack is unaffected.\n- Add the stack config set install-msys command to configure the install-msys option in YAML configuration files.\n- Option allow-newer-deps is no longer classified as experimental in documentation.\n- stack sdist and stack upload report the version of Cabal (the library) being used to check packages.\n- Add the stack config build-files command to generate (when applicable) a Cabal file from a package description in the Hpack format and/or a lock file for Stack's project-level configuration, without taking any other build steps.\nThanks to all our contributors for this release:\n- Mike Pilgrem\n- Olivier Benz","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.5.1","site":"https://haskellstack.org/","source":"commercialhaskell","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}