{"appId":"w:COPASI.COPASI","appShortcutName":"COPASI","appDisplayName":"COPASI","authorId":"w:winget","releaseTagName":"winget-Build-298","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/copasi/COPASI/releases/download/Build-298/COPASI-4.45.298-Windows.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Biochemical System Simulator\n\nCOPASI is a software application for simulation and analysis of biochemical networks and their dynamics.\nCOPASI is a stand-alone program that supports models in the SBML standard and can simulate their behavior using ODEs, SDEs, or Gillespie's stochastic simulation algorithm. Arbitrary discrete events can be included in such simulations. COPASI provides a set analysis methods and parameter estimation.\nNew Features since COPASI 4.44 (Build 295)\n- Graphical User Interface (CopasiUI)\n  - Added a new tool which attempts to convert ODEs into reactions.\n  - Added a menu entry which allows definition and subsequent execution of user defined tools.\n- Standards\n  - SBML Import added an option determining how to handle the import of initial values initial references.\nBug Fixes and Enhancements since COPASI 4.44 (Build 295)\n- Graphical User Interface (CopasiUI)\n  - Optimization and Parameter Estimation: Whether to display the population dynamics is now part of the problem specification.\n  - Fixed deletion of plots in the plot overview.\n  - Fixed issue where event targets where not longer added to plots, reports, and time series.\n  - Fixed crash occurring when switching the plot engine to: Qt DataVizualization (surface) for non surface plots.\n  - Improved labels for surface plots which where limited to 2 decimal digits.\n  - Fixed problem with notes of global quantities occurring when copying.\n  - Time course Method Hybrid (RK-45): Selecting the partitioning strategy: user defined and selecting the deterministic reactions caused a crash.\n  - Fixed delay during start on some Windows 11 installations caused while saving the known MIRIAM resources.\n  - Functions: It is not longer permitted to copy mass action kinetics.\n  - Fixed crash occurring when repeatedly deleting parameter sets.\n  - Fixed problem deleting multiple global quantities.\n  - Fixed crash when deleting interdependent global quantities.\n- Command Line (CopasiSE)\n  - The argument to the option --report-file is now taken relative to the current working directory.\n  - Steady-State: Added warning message indicating that no steady-state was found.\n- Simulation Engine\n  - MCA: Fixed scaling for small compartment volumes.\n  - Steady-State: Fixed occasionally occurring problem calculating the target criterions for models containing moieties, which lead to not finding a steady-state.\n  - Events: Fixed crash caused by invalid trigger expression.\n  - Time Course: Fixed output of all steps when the duration is negative.\n  - Parameter Estimation: Non existing constraint objects will lead to a warning message.\n- Standards\n  - SED-ML: Improved import of time course option initial time and number of points.\n  - SBML: Improved import of reaction IDs used in multiple assignments.\n  - SBML: Improved import of files containing reaction kinetics with missing parameters.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"Build-298","version":0,"site":"https://copasi.org/","source":"copasi.org","license_or_tos":"Artistic-2.0","resources":null,"verified":false}