{"appId":"w:COPASI.COPASI","appShortcutName":"COPASI","appDisplayName":"COPASI","authorId":"w:winget","releaseTagName":"winget-Build-300","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/copasi/COPASI/releases/download/Build-300/COPASI-4.46.300-Windows.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Biochemical System Simulator\n\nCOPASI is a software application for simulation and analysis of biochemical networks and their dynamics.\nCOPASI is a stand-alone program that supports models in the SBML standard and can simulate their behavior using ODEs, SDEs, or Gillespie's stochastic simulation algorithm. Arbitrary discrete events can be included in such simulations. COPASI provides a set analysis methods and parameter estimation.\nNew Features since COPASI 4.45 (Build 298)\n- Graphical User Interface (CopasiUI)\n  - Parameter Estimation: Start in Steady State can now be selected per experiment..\nBug Fixes and Enhancements since COPASI 4.45 (Build 298)\n- Graphical User Interface (CopasiUI)\n  - Parameter Overview: Fixed crash occurring when changing local reaction parameters.\n  - Optimization and Parameter Estimation: Fixed editing Display Population checkbox.\n  - Global Quantity: Fixed potential crash when copying of a global quantity with an assignment containing a piece wise expression.\n  - Load Parameter Sets: Fixed crash when loading additional parameter sets stored in a separate file.\n  - Reactions: Fixed mapping of 2 substrate kinetics for reactions of the form 2 * Y → ...\n  - Functions: Fixed copying of functions containing notes.\n- Simulation Engine\n  - Time Course: Fixed problem with event triggers evaluating to NaN.\n  - Time Course: Improved root finding to determine event firing.\n  - Time Course: Fixed initial event detection if the Start in Steady State is selected.\n  - Time Course: Fixed detection of non integer stoichiometry for stochastic or hybrid algorithms.\n  - Optimization and Parameter Estimation: Reaction parameters mapped to global quantities were not correctly loaded.\n  - Scan: Fixed behavior of Continue from Current State.\n  - JIT Compilation: Fixed crash occurring occasionally on Windows.\n- Standards\n  - COMBINE Archive: Fixed naming of experiment data files for Parameter Estimation.\n  - SBML: Assure that the selected render information is exported.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"Build-300","version":0,"site":"https://copasi.org/","source":"copasi.org","license_or_tos":"Artistic-2.0","resources":null,"verified":false}