{"appId":"w:CraftEdge.EasyCutStudio","appShortcutName":"Easy Cut Studio","appDisplayName":"Easy Cut Studio","authorId":"w:winget","releaseTagName":"winget-6.016","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.easycutstudio.com/EasyCutStudio6-64bit.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The world’s most-loved sign making and vinyl cutting software, developed to perfectly match your vinyl cutter and cutting plotter.\n\nThe world’s most-loved sign making and vinyl cutting software, developed to perfectly match your vinyl cutter and cutting plotter. Create designs and cut in one simple workflow. It gives you the ability to cut any font, AI, SVG, PDF, as well as your own original designs with your vinyl cutting plotter. This awesome vinyl cutter software even supports vectorize your images and built-in shape library includes hundreds of vectorial designs ready for cutting. With the intuitive user interface and robust toolset, Now anyone can cut designs like a pro with professional-grade features!\n\n- Cut any font already installed on your Windows and macOS.\n- Layout and special effects for your text and shapes.\n- Optimize cutting patterns and saving material with Nesting tool.\n- Assign layers to print only, cut only, draw only, or both print+cut.\n- Auto-fill function for laser engraving and diamond engraving.\n- Creates holes to be punched with a punch or piercing tool.\n- Multiple cutting option to cut easier thick and resistant materials.\n- Alter size, thickness and location of registration mark.\n- Create shadowed mat effects.\n- Text on arch tool and text on path tool.\n- Stencil function for bridging interior shapes.\n- Place text or objects on the Bezier paths.\n- Dual Head support.\n\nWorks with a wide range of vinyl cutters/plotters including Graphtec, GCC, Mimaki, Roland, Mutoh, Secabo, LOKLiK, HP Latex, Summa, Vevor, USCutter, UKCutter, Desay Master, Siser, JinKa, KNK, Silhouette, DGI, E-cut, Mycut, Refine, Saga, Teneth, Seiki, Foison, ROHS, Yinghe, Rabbit, Creation PCut, Ioline, GSN, DGI, BDF, KASA, Vinyl Systems, SkyCut, Workhorse, AnaGraph, ProCut, Jaguar, MUSE, Liyu, PixMax, Redsail, GoldCut, Vinyl Express machines and much more (700+). (No longer work with the Cricut cutting machines).\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.016","version":0,"site":"https://www.easycutstudio.com/","source":"Craft Edge","license_or_tos":"Proprietary","resources":null,"verified":false}