{"appId":"w:craftablescience.VPKEdit","appShortcutName":"VPKEdit","appDisplayName":"VPKEdit","authorId":"w:winget","releaseTagName":"winget-5.0.0.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A library and CLI/GUI tool to create, read, and write several pack file formats.\n\n\nVPKEdit 5.0 is coming soon! It brings with it a bunch of bug fixes and features. I want to delay the proper release to add more features and properly test everything that's changed, so in the meantime here's a beta release.\nTip\nRead the install guide for assistance installing VPKEdit.\nNote\nChanges made in this beta have an exclamation mark emoji (❗) and old changes may be struck out and replaced where applicable. This changelog is a collection of every beta release up to this point and will continue to be appended to until the final release. (This release is a re-release of beta 2 to fix plugins not loading.)\nGeneral Changes\n- ❗Add macOS as a supported platform (thanks @Charles-Bao and @EricZhang456!)\n- Update logo to New VPKEdit logo from Old VPKEdit logo\n  - ❗Add 16x16 variant for better scaling (thanks to The Pixel for the design!)\n- ❗Add support for SiN (SIN) pack file format\n- Add support for Xbox Zip (XZP) pack file format\n- Properly set RPATH on Linux for standalone builds\n- ❗Fix GCF checksum verification algorithm\n- ❗Add support for parsing contents of encrypted GCFs\nGUI Changes\n- ❗Create a plugin system to be able to load new previews not packaged with the program at runtime\n  - ❗Migrated DMX and MDL previews to new plugin system\n- Qt updates\n  - ❗Upgrade to Qt 6̶.̶8̶.̶2̶ 6.8.3 on Windows\n  - Use system Qt for Linux installers (third-party vendors are already doing this)\n    - Fixes system themes being inaccessible\n  - ❗D̶o̶w̶n̶g̶r̶a̶d̶e̶ ̶t̶o̶ ̶Q̶t̶ ̶6̶.̶4̶.̶2̶ Upgrade to Qt 6.8.2 for standalone Linux builds\n- Improve translations\n  - Add Vietnamese translation\n  - Update Japanese translation\n  - Update Spanish translation\n- Fix pack file name possibly being renamed to a translated text in the status bar\n- ❗Delay deletion of temporary files to when the program closes\n- Stop crashing when given a DMX file that fails to parse\n- Stop listing elements at the root of a DMX file if it has been referenced in a different element previously\n- Reorganize About dialog\n- Fix possibility of Steam library icons not being populated\n  - Used to use a heuristic, now it parses assetcache.vdf directly\n- ❗Fix top of text preview blocking mouse input\n- Add .vint_doc and .vint_proj to text preview\n- Add .qoi to image preview\n- Explicitly set GLSL profile in shaders to fix model preview breaking on some machines (thanks @Exotic0015!)\n- ❗Parse patch materials to find $basetexture in MDL preview\n- ❗Add support for $translucent, $alphatest, and $alphatestreference to MDL preview renderer\n- ❗Use strictly core OpenGL 3.3 profile features in MDL preview's renderer\n- ❗Add panning to texture preview (thanks @JJL772!)\n- ❗Add a more natural zoom curve to texture preview\n- ❗Add support for .xtf textures (from Half-Life 2's Xbox port) to texture preview\n- ❗Modify cursor to grabby hand when panning or rotating in MDL preview and texture preview\n- ❗Fix DXT1 textures with punchthrough alpha not being treated as having alpha in texture preview\n- ❗Remove VTF mimetype on Linux now that MareTF is a better VTF viewer (thanks @HurricanePootis!)\n- ❗ Remove audio preview (it will be replaced in a future beta, it was simply too buggy to keep)\n- ❗ Double-clicking entries in the entry tree will now open that file in the associated external program\n- ❗Use Ko-fi logo for donation menu action\n- More to come...\nCLI Changes\n- Allow the editing commands (add/remove file/directory) to be repeated\n- ❗Implement response file support (thanks @sour-dani!)\nInstaller Changes\n- Add Fedora and Fedora-based distro support (RPM installer)\n- ❗Add macOS support (DMG installer)\n- Stop shipping the Qt image format plugins on Windows and in standalone builds, they are not needed anymore\n- Bake Qt base translations into the executable rather than installing as unpacked files\n- Become a more normal application on Linux - depend on system Qt, install to /usr/bin instead of /opt, and start following convention\n  - Standalone builds are unchanged\n- Merge standalone CLI and GUI builds into one zip, should make install process slightly easier to figure out\n- Fix program icon install directory on Linux + some mimetypes being incorrectly formatted (thanks @HurricanePootis!)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.0.0.3","version":0,"site":"https://github.com/craftablescience","source":"craftablescience","license_or_tos":"MIT","resources":null,"verified":false}