{"appId":"w:craftablescience.VPKEdit","appShortcutName":"VPKEdit","appDisplayName":"VPKEdit","authorId":"w:winget","releaseTagName":"winget-5.0.0.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A library and CLI/GUI tool to create, read, and write several pack file formats.\n\n\nVPKEdit 5.0 is coming soon! It brings with it a bunch of bug fixes and features. I want to delay the proper release to add more features and properly test everything that's changed, so in the meantime here's a beta release.\nI have very limited time these days, and I want to add some big features to VPKEdit like a plugin API for previews, tools, etc. as well as improve some pain points like load time. The 5.0 update is probably a few months out at minimum, but I didn't want to wait that long to make a release. This release should be just as stable as 4.4.2. The 4.x series will no longer be receiving updates.\nTip\nRead the install guide for assistance installing VPKEdit.\nGeneral Changes\n- Update logo to New VPKEdit logo from Old VPKEdit logo\n  - This is much nicer to look at :3\n- Add support for Xbox Zip (XZP) pack file format\n- Properly set RPATH on Linux for standalone builds\nGUI Changes\n- Qt updates\n  - Upgrade to Qt 6.8.2 on Windows\n  - Use system Qt for Linux installers (third-party vendors are already doing this)\n    - Fixes system themes being inaccessible\n  - Downgrade to Qt 6.4.2 for standalone Linux builds\n- Improve translations\n  - Add Vietnamese translation\n  - Update Japanese translation\n  - Update Spanish translation\n- Fix pack file name possibly being renamed to a translated text in the status bar\n- Stop crashing when given a DMX file that fails to parse\n- Stop listing elements at the root of a DMX file if it has been referenced in a different element previously\n- Reorganize About dialog\n- Fix possibility of Steam library icons not being populated\n  - Used to use a heuristic, now it parses assetcache.vdf directly\n- Explicitly set GLSL profile in shaders to fix model preview breaking on some machines (thanks @Exotic0015!)\n- Add .vint_doc and .vint_proj to text preview\n- Add .qoi to image preview\n- More to come...\nCLI Changes\n- Allow the editing commands (add/remove file/directory) to be repeated\nInstaller Changes\n- Add Fedora and Fedora-based distro support (RPM installer)\n- Stop shipping the Qt image format plugins on Windows and in standalone builds, they are not needed anymore\n- Bake Qt base translations into the executable rather than installing as unpacked files\n- Become a more normal application on Linux - depend on system Qt, install to /usr/bin instead of /opt, and start following convention\n  - Standalone builds are unchanged\n- Merge standalone CLI and GUI builds into one zip, should make install process slightly easier to figure out\n- Fix program icon install directory on Linux + some mimetypes being incorrectly formatted (thanks @HurricanePootis!)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0.0.1","site":"https://github.com/craftablescience","source":"craftablescience","license_or_tos":"MIT","resources":null,"verified":false}