{"appId":"w:craftablescience.VPKEdit","appShortcutName":"VPKEdit","appDisplayName":"VPKEdit","authorId":"w:winget","releaseTagName":"winget-5.0.0.4","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A library and CLI/GUI tool to create, read, and write several pack file formats.\n\n\nVPKEdit 5.0 is coming soon! It brings with it a bunch of bug fixes and features. I want to delay the proper release to add more features and properly test everything that's changed, so in the meantime here's a beta release.\nTip\nRead the install guide for assistance installing VPKEdit.\nNote\nChanges made in this beta have an exclamation mark emoji (❗) and old changes may be struck out and replaced where applicable. This changelog is a collection of every beta release up to this point and will continue to be appended to until the final release.\nGeneral Changes\n- Add macOS as a supported platform (thanks @Charles-Bao and @EricZhang456!)\n  - ❗Change macOS code signing process to reduce install friction\n- Update logo to New VPKEdit logo from Old VPKEdit logo\n  - Add 16x16 variant for better scaling (thanks to The Pixel for the design!)\n- ❗Add create/read/write support for FGP pack file format\n- Add read/write support for SiN (SIN) pack file format\n- Add read support for Xbox Zip (XZP) pack file format\n- ❗Add read support for Xbox Zip v2 (XZP2) pack file format\n- ❗Fix baking PAK/SIN formats by ensuring directory is written to the end of the file and filenames are always null-terminated\n- ❗Accelerate BSP/XZP2/ZIP read/write times by 3x in uncompressed scenarios\n- Properly set RPATH on Linux for standalone builds\n- Fix GCF checksum verification algorithm\n- Add support for parsing contents of encrypted GCFs\nGUI Changes\n- ❗Greatly accelerate pack file load time\n  - ❗In my Windows 10 VM the speedup was 20x, but I have heard reports of lower end systems which took minutes to open certain pack files now opening them near instantly\n- Create a plugin system to be able to load new previews not packaged with the program at runtime\n  - ❗Add plugin information dialog to show metadata of active plugins\n  - Migrate DMX and MDL previews to new plugin system\n  - ❗Migrate ICE encyption context menu entries to VCrypt plugin\n- Qt updates\n  - Upgrade to Qt 6.8.3 on Windows\n  - Use system Qt for Linux installers (third-party vendors are already doing this)\n    - Fixes system themes being inaccessible\n  - U̶p̶g̶r̶a̶d̶e̶ ̶t̶o̶ ̶Q̶t̶ ̶6̶.̶8̶.̶2̶ ̶f̶o̶r̶ ̶s̶t̶a̶n̶d̶a̶l̶o̶n̶e̶ ̶L̶i̶n̶u̶x̶ ̶b̶u̶i̶l̶d̶s̶ Rolled back after bugs with Qt on some distros\n- Improve translations\n  - Add Vietnamese translation\n  - ❗Add Slovenian translation\n  - Update Japanese translation\n  - Update Spanish translation\n- Fix pack file name possibly being renamed to a translated text in the status bar\n- Delay deletion of temporary files to when the program closes\n- Reorganize About dialog\n  - ❗Fix being unable to click any links in the About dialog\n- ❗Add \"Mark Modified\" button to mark the current pack file as savable without editing the contents\n- Fix possibility of Steam library icons not being populated\n  - Used to use a heuristic, now it parses assetcache.vdf directly\n- ❗Fix Steam library icons not being populated if the user had used multiple languages for their Steam install\n- ❗Search bar now uses a regex filter instead of a keyword search\n- ❗Apply contents of search bar automatically when the contents change instead of requiring an Enter keypress\n- ❗Add basic sort capability to folder preview to allow sorting the table by a given column\n- Fix top of text preview blocking mouse input\n- Add .vint_doc and .vint_proj to text preview\n- Add .qoi to image preview\n- Stop crashing when given a DMX file that fails to parse\n- Stop listing elements at the root of a DMX file if it has been referenced in a different element previously\n- ❗DMX preview now shows attributes inline with the element contents similar to KV2's structure\n- ❗DMX preview can now handle legacy binary versions, newer Source 2 versions\n  - ❗DMX preview can now handle srctools' Unicode formats (thanks @TeamSpen210!)\n- ❗Show a preview for ICE and VFONT-encrypted files hinting at decryption support\n- ❗Add .ekv as a registered extension for VCrypt ICE encryption/decryption support\n- ❗Add support for VFONT encryption/decryption to VCrypt plugin\n- Explicitly set GLSL profile in shaders to fix model preview breaking on some machines (thanks @Exotic0015!)\n- Parse patch materials to find $basetexture in MDL preview\n- Add support for $translucent, $alphatest, and $alphatestreference to MDL preview renderer\n- Use strictly core OpenGL 3.3 profile features in MDL preview's renderer\n  - ❗Fix usage of some compatibility features in the shaders. This fixes models rendering pure black on NVidia hardware, thank you @normalpersonininternet and @lenship2 for testing!\n- Add panning to texture preview (thanks @JJL772!)\n- Add a more natural zoom curve to texture preview\n- Add support for .xtf textures (from Half-Life 2's Xbox port) to texture preview\n- ❗Fix texture preview not previewing mip levels below 4x4 correctly\n- Modify cursor to grabby hand when panning or rotating in MDL preview and texture preview\n- Fix DXT1 textures with punchthrough alpha not being treated as having alpha in texture preview\n- Remove VTF mimetype on Linux now that MareTF is a better VTF viewer (thanks @HurricanePootis!)\n- Remove audio preview (it will be replaced in a future beta, it was simply too buggy to keep)\n- Double-clicking entries in the entry tree will now open that file in the associated external program\n  - ❗Fix this behavior on Windows\n- Use Ko-fi logo for donation menu action\n- More to come...\nCLI Changes\n- Allow the editing commands (add/remove file/directory) to be repeated\n- Implement response file support (thanks @sour-dani!)\nInstaller Changes\n- Add Fedora and Fedora-based distro support (RPM installer)\n- Add macOS support (DMG installer)\n- Stop shipping the Qt image format plugins on Windows and in standalone builds, they are not needed anymore\n- Bake Qt base translations into the executable rather than installing as unpacked files\n- Become a more normal application on Linux - depend on system Qt, install to /usr/bin instead of /opt, and start following convention\n  - Standalone builds are unchanged\n- Merge standalone CLI and GUI builds into one zip, should make install process slightly easier to figure out\n- Fix program icon install directory on Linux + some mimetypes being incorrectly formatted (thanks @HurricanePootis!)\n- ❗Fix GMA mimetype on Linux","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.0.0.4","version":0,"site":"https://github.com/craftablescience","source":"craftablescience","license_or_tos":"MIT","resources":null,"verified":false}