{"appId":"w:Creality.CrealityPrint","appShortcutName":"Creality Print","appDisplayName":"Creality Print","authorId":"w:winget","releaseTagName":"winget-6.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/CrealityOfficial/CrealityPrint/releases/download/v6.3.0/CrealityPrint_6.3.0.3420_Release.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A self-developed Fused deposition modeling slicing software produced by Creality.\n\nCreality Print is a self-developed Fused deposition modeling slicing software produced by Creality. It’s a practical and easy-to-use tool that can help you remote control and monitor your 3D printer and help print directly from your computer.\nV6.3.0.3420 Software Update Notes:\n\n1. Added Solid Top Fill parameter for improved top surface quality.\n\n2. Added three TPMS infill types to support gradient density, enhancing model stability and material efficiency.\n\n3. Improved height-based speed and acceleration settings interface.\n\n4. Hidden or disabled high-risk/system-managed parameters for safer operation.\n\n5. Added dual hotkey schemes for customizable user workflow.\n\n6. Optimized rendering performance on the Prepare and Preview pages, significantly improving smoothness and visual clarity when working with large or complex scenes.\n\n7. Optimized material waste reduction and improved print time and material usage estimation accuracy.\n\n8. Resolved slicing crashes, preview errors, text rendering issues, and large file handling problems.\n\n9. Fixed device related issues, including Sermoon D3 Pro preset and CFS information display.\n\n10. Corrected multiple translation errors and improved font/UI display for clearer, smoother experience.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.3.0","version":0,"site":"https://www.creality.com/","source":"Creality","license_or_tos":"AGPL-3.0","resources":null,"verified":false}