{"appId":"w:Creality.CrealityPrint","appShortcutName":"Creality Print","appDisplayName":"Creality Print","authorId":"w:winget","releaseTagName":"winget-7.0.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://file-cdn.creality.com/file/29f312503aed0fa78edd18e3d7c5a8b1/CrealityPrint_7.0.1.4212_Release%20(1).exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A self-developed Fused deposition modeling slicing software produced by Creality.\n\nCreality Print is a self-developed Fused deposition modeling slicing software produced by Creality. It’s a practical and easy-to-use tool that can help you remote control and monitor your 3D printer and help print directly from your computer.\nV7.0.1.4212 Software Update Notes:\n\n1. Added support for connecting printers via Fluidd, improving remote device access and management.\n\n2. New “Back Alignment” seam placement option, providing better control of visible seam positioning.\n\n3. Fixed an illegal access error when selecting sequential (by-object) printing parameters.\n\n4. Fixed Google account login failures.\n\n5. Optimized travel path handling when internal bridge flow ratio is set to 0.\n\n6. Fixed embossed text display issues and model shifting outside the build plate when undoing actions.\n\n7. Fixed macOS issues including preset import failures, language reset after restart, and UI scaling incompatibilities.\n\n8. Fixed unknown error prompts after installation and missing login prompts in Creality Cloud grouping when not signed in.\n\n9. Fixed slicing anomalies including tree support not generating under percentage-based default line width mode and seam toggle issues in preview.\n\n10. Improved device detail page UI compatibility, filament deletion logic, slicing dialog interactions, and built-in model mesh resolution.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.0.1","version":0,"site":"https://www.creality.com/","source":"Creality","license_or_tos":"AGPL-3.0","resources":null,"verified":false}