{"appId":"w:Creality.CrealityPrint","appShortcutName":"Creality Print","appDisplayName":"Creality Print","authorId":"w:winget","releaseTagName":"winget-6.2.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/CrealityOfficial/CrealityPrint/releases/download/v6.2.2/CrealityPrint_6.2.2.3203_Release.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A self-developed Fused deposition modeling slicing software produced by Creality.\n\nCreality Print is a self-developed Fused deposition modeling slicing software produced by Creality. It’s a practical and easy-to-use tool that can help you remote control and monitor your 3D printer and help print directly from your computer.\nV6.2.2.3203 Software Update Notes:\n\n1. Optimized the UI of process parameter display in the right panel — more parameter settings can now be shown on the same screen.\n\n2. Fixed an error when running the Linux Flatpak version. #430\n\n3. Fixed an issue where the process would remain running after closing the software on Linux. #443\n\n4. Fixed an issue where usernames containing special characters could not log into Creality Cloud accounts. Thanks to @Aeath's Rock for the suggestion.\n\n5. Fixed the error boost::filesystem::status: file or directory is corrupted and unreadable. Thanks to @emoji-道顺 for the suggestion.\n\n6. Fixed an issue where enabling overhang optimization caused the path preview to show only support structures without the model.\n\n7. Fixed low-accuracy temperature calibration models that caused uneven surfaces after slicing.\n\n8. Fixed an issue where some areas could not be painted unless rotated multiple times. Thanks to @稷 for the suggestion.\n\n9. Fixed an issue where the object selection count box text was overlapping. Thanks to @maynar598 for the suggestion.\n\n10. Optimized K2 Plus preset parameters with 0.4mm and 0.6mm nozzles.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.2.2","site":"https://www.creality.com/","source":"Creality","license_or_tos":"AGPL-3.0","resources":null,"verified":false}