{"appId":"w:Creality.CrealityPrint","appShortcutName":"Creality Print","appDisplayName":"Creality Print","authorId":"w:winget","releaseTagName":"winget-7.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/CrealityOfficial/CrealityPrint/releases/download/v7.0.0/CrealityPrint_7.0.0.4127_Release.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A self-developed Fused deposition modeling slicing software produced by Creality.\n\nCreality Print is a self-developed Fused deposition modeling slicing software produced by Creality. It’s a practical and easy-to-use tool that can help you remote control and monitor your 3D printer and help print directly from your computer.\nV7.0.0.4127 Software Update Notes:\n\n1. Comprehensive print algorithm upgrades significantly improve surface quality and vibration artifacts.\n\n2. Introduce AI intelligent analysis to automatically check if the intelligent recognition model needs support.\n\n3. Added multiple engineering-grade sparse infill patterns balancing strength, speed, and stability.\n\n4. Major Prime Tower (wipe tower) enhancements improve multi-material print reliability.\n\n5. Upgraded device management and WAN printing, including remote camera preview support.\n\n6. K2 Plus–specific optimizations greatly improve print time and material usage estimation accuracy.\n\n7. Deeply integrated Creality Cloud ecosystem with online models, tutorials, and store access.\n\n8. Introduced LOD rendering to G-code preview for smoother interaction with complex models.\n\n9. Enhanced third-party 3MF import and automatic migration of 6.x user presets.\n\n10. Fixed bugs to significantly improve stability, compatibility, and localization quality.\n\nhttps://wiki.creality.com/en/software/6-0/release-notes-7-0-0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.0.0","version":0,"site":"https://www.creality.com/","source":"Creality","license_or_tos":"AGPL-3.0","resources":null,"verified":false}