{"appId":"w:CrystalRich.InternetOff","appShortcutName":"InternetOff","appDisplayName":"InternetOff","authorId":"w:winget","releaseTagName":"winget-3.0.1.68","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://crystalrich.com/internetoff/exe/internetoffsetup_3-0-1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Turn off or schedule your internet to avoid distractions.\n\nInternetOff is a free tool that allows you to quickly turn off\\on your internet connection from the system tray.\nWhy it's needed\nThe main and inherent problem with always being online is that you are too connected. Twitter, Facebook, YouTube video, answering email or IM message... And again from the start of the list. You only react on those \"incoming\" things instead of act. When you go offline all those distractions disappear. There's no Twitter. No chat. No web. Only you and your tasks. Since you cannot consume you have to create so that something happens.\nInternetOff allows you to quickly turn off the internet so that you can go offline. When you need the connection, you can enable the internet easily for some period (and it will be automatically turned off) or permanently in just two clicks. Besides the program lets you password protect and schedule access to the internet.\nThe new version InternetOff 3.0 is just released. It adds an ability to schedule an access to the internet, minor improvements and bug fix, support of Windows 10.\n\nWhat’s new?\nAn ability to schedule the connection\n\nNow you can setup the timetable for internet connection. This option is useful\nto restrict access to the internet in specific hours of week days. For\nexample you can disallow internet connection in the morning hours\nif you need to work without attractions.\nWindows 10 compatibility\n\nDespite the previous version worked with Windows 10 without issues,\nwe have thoroughly tested the new version on compatibility with the latest version of\nWindows. So now we officially say that its compatible with Win10.\nOther minor changes\n- Bug fixed: Icon in the system tray disappeared after crash of the Explorer\n- Bug fixed:”About program” form could be called multiple times and this could cause\n  displaying of errors\n- Other small improvements","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.0.1.68","version":0,"site":"https://crystalrich.com/","source":"Crystal Rich Ltd","license_or_tos":"Freeware","resources":null,"verified":false}