{"appId":"w:CrystalRich.USBSafelyRemove","appShortcutName":"USB Safely Remove","appDisplayName":"USB Safely Remove","authorId":"w:winget","releaseTagName":"winget-7.2.1.1330","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A unique tool to improve safe removal for USB and SATA gadgets\n\nHave you ever lost important data due to inappropriate removal of external drive? Windows doesn't allow you to stop a device? Accidentally stopped a drive you don’t aim to remove? USB Safely Remove solves these and other inconveniences of safe removal in Windows and offers much more features for convenient and secure work with external devices.\nKey Features:\nMuch more convenience: Safely remove a device via the convenient menu or a hotkey, remove unneeded devices from the menu, setup icons or names for the devices. Besides even if you stop a device accidentally you can return it in a click.\nSave data and devices: Even if the device cannot be safely removed the program will show you locking processes and allow you to forcibly stop it so that you avoid incorrect removal of the device. Besides the program can power off the devices on their stopping.\nAutomate and speed up work: Use command line tool in your scripts or a powerful autorun manager to automate backup to external drives, check for viruses and many more daily tasks.\nOrganize drive letters: Clean up your drive letter list by automatic hiding letters of unused card reader slots, fix drive letters to a specific device or even forbid some letters from assigning to external drives for backup purposes or thirdparty software.\nThis version includes improved support of High DPI screens, bug fix and lots of minor UI improvements.\n\nImproved High DPI support\nPrevious versions supported screen scaling. But once you set DPI above 150%, the interface started to look weird because they didn’t scale icons with the rest of the UI.\nIn the new version, this issue has been fixed, and the program now fully supports even the highest-DPI monitors\nIf you have Windows display scaling enabled for the program, don’t forget to turn it off. To do this, right-click the program’s shortcut, select “Properties”, go to the “Compatibility” tab, and click “Change High DPI settings” button. In the opened dialog uncheck all the boxes.\n\nShow more\n\nBug fix\n- The device menu could overlap other dialogs called from it (Options, Device Properties etc)\n- Disabled devices disappeared from the system after you delete the program settings\nImprovements\n- No more notifications while the system is in full-screen mode (e.g. playing a game, watching movie etc)\n- Default hotkey to call device menu changed from Ctrl+Shift+S to Ctrl+Win+G  (Because the previous key combination is used in many programs as the “Save As” action)\n- Many other minor GUI improvements\nHow to update from the previous version?\nJust download and install the required installer over the previous version. You do not need to uninstall the previous version. If your license upgrade period is over, feel free to purchase the renewal.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.2.1.1330","version":0,"site":"https://crystalrich.com/","source":"Crystal Rich Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}