{"appId":"w:CrystalRich.Zentimo","appShortcutName":"Zentimo PRO","appDisplayName":"Zentimo PRO","authorId":"w:winget","releaseTagName":"winget-3.2.1.1302","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A swiss army knife for your external drive needs\n\nZentimo offers a new way to manage your USB & eSATA devices. While it solves many external drive related problems in Windows, it also gives more control and makes working with external drives fun & pleasure.\nKey Features:\nFast & Reliable Safe Device Removal: Lets you stop a device, display locking processes, or reconnect a stopped device.\nPortable App Quick Launcher: Lets you launch any application located on your external drive with one click.\nPowerful Autorun: Can automatically mount\\dismount your TrueCrypt drive, launch a file manager, check flash drives for viruses and run anything else on device connection/disconnection.\nDrive Letter Management: The program hides drive letters of unused card reader slots, can assign drive letters to a specific device, and much more...\nHonest Drive Speed Test: Perform read/write speed tests for any attached drive.\nEncrypted Volumes Management: Work with an encrypted by TrueCrypt, CipherShed or VeraCrypt container as if it's a device volume.\nThis version includes improved support of High DPI screens, bug fix and lots of minor UI improvements.\n\nImproved High DPI support\nPrevious versions supported screen scaling. But once you set DPI above 150%, the interface started to look weird because they didn’t scale icons with the rest of the UI.\nIn the new version, this issue has been fixed, and the program now fully supports even the highest-DPI monitors\nIf you have Windows display scaling enabled for the program, don’t forget to turn it off. To do this, right-click the program’s shortcut, select “Properties”, go to the “Compatibility” tab, and click “Change High DPI settings” button. In the opened dialog uncheck all the boxes. Show more\n\nBug fix\n- The device menu could overlap other dialogs called from it (Options, Device Properties etc)\n- Disabled devices disappeared from the system after you delete the program settings\nImprovements\n- No more notifications while the system is in full-screen mode (e.g. playing a game, watching movie etc)\n- Default hotkey to call device menu changed from Ctrl+Shift+S to Ctrl+Win+G  (Because the previous key combination is used in many programs as the “Save As” action)\n- Many other minor GUI improvements\nHow to update from the previous version?\nJust download and install the required installer over the previous version. You do not need to uninstall the previous version. If your license upgrade period is over, feel free to purchase the renewal.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2.1.1302","version":0,"site":"https://crystalrich.com/","source":"Crystal Rich Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}