{"appId":"w:CrystalRich.USBSafelyRemove","appShortcutName":"USB Safely Remove","appDisplayName":"USB Safely Remove","authorId":"w:winget","releaseTagName":"winget-7.1.2.1327","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A unique tool to improve safe removal for USB and SATA gadgets\n\nHave you ever lost important data due to inappropriate removal of external drive? Windows doesn't allow you to stop a device? Accidentally stopped a drive you don’t aim to remove? USB Safely Remove solves these and other inconveniences of safe removal in Windows and offers much more features for convenient and secure work with external devices.\nKey Features:\nMuch more convenience: Safely remove a device via the convenient menu or a hotkey, remove unneeded devices from the menu, setup icons or names for the devices. Besides even if you stop a device accidentally you can return it in a click.\nSave data and devices: Even if the device cannot be safely removed the program will show you locking processes and allow you to forcibly stop it so that you avoid incorrect removal of the device. Besides the program can power off the devices on their stopping.\nAutomate and speed up work: Use command line tool in your scripts or a powerful autorun manager to automate backup to external drives, check for viruses and many more daily tasks.\nOrganize drive letters: Clean up your drive letter list by automatic hiding letters of unused card reader slots, fix drive letters to a specific device or even forbid some letters from assigning to external drives for backup purposes or thirdparty software.\nThis is a small but important update, consisting of minor improvements and bug fixes.\n\nImprovements\n- Unable to stop dialog: ability to copy processes info to the clipboard added\n- Additional debug information is sent in user bug reports when verbose logging is enabled (dump of all system devices and user settings)\n- The ‘Display all storage devices’ option is now enabled by default\n- Launching the program a second time brings the device menu to the front instead of the main dialog (consistent with the first launch behavior)\nBug fix\n- ‘Drive Letters’ tab in the program settings could be grayed out and locked on Win 11\n- Text in the troubleshoot service issues dialog was displayed incorrectly in English\n- Some JPEG images caused program errors when set as device icons\n- PNG images lost transparency when set as custom device icons\n- Change device image dialog didn’t preserve its dimensions\n- In some cases, the program might have prevented system shutdown\n  (afterward, the program became unstable and might have displayed errors)\n- Loading settings from file might not have worked correctly – some\n  settings could get duplicated, e.g., autorun settings\n- External storage devices without a drive letter weren’t displayed in the\n  device menu by default (they appeared in the hidden devices section)\n- The program might not detect or display certain types of storage devices\n- Device names might not be detected for some devices\nHow to update from the previous version?\nJust download and install the required installer over the previous version. You do not need to uninstall the previous version. If your license upgrade period is over, feel free to purchase the renewal.\nNote, licenses with one or two year of upgrades purchased after the date of the previous release (Nov 24th, 2023) are also eligible for this update.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.1.2.1327","version":0,"site":"https://crystalrich.com/","source":"Crystal Rich Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}