{"appId":"w:CrystalRich.Zentimo","appShortcutName":"Zentimo PRO","appDisplayName":"Zentimo PRO","authorId":"w:winget","releaseTagName":"winget-3.3.1.1303","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A swiss army knife for your external drive needs\n\nZentimo offers a new way to manage your USB & eSATA devices. While it solves many external drive related problems in Windows, it also gives more control and makes working with external drives fun & pleasure.\nKey Features:\nFast & Reliable Safe Device Removal: Lets you stop a device, display locking processes, or reconnect a stopped device.\nPortable App Quick Launcher: Lets you launch any application located on your external drive with one click.\nPowerful Autorun: Can automatically mount\\dismount your TrueCrypt drive, launch a file manager, check flash drives for viruses and run anything else on device connection/disconnection.\nDrive Letter Management: The program hides drive letters of unused card reader slots, can assign drive letters to a specific device, and much more...\nHonest Drive Speed Test: Perform read/write speed tests for any attached drive.\nEncrypted Volumes Management: Work with an encrypted by TrueCrypt, CipherShed or VeraCrypt container as if it's a device volume.\nThis is a small update that includes ability to reorder autorun items, displaying of more types of devices and bug fix.\n\nReorder autorun items\nNow it’s possible to change order of the autorun list items by dragging them with a mouse. Also you can copy an item instead of move by holding Ctrl button while you are dragging the item.\nMore types of devices is displayed\nNow the program displays additional types of devices, e.g. Thunderbolt eGPU\nBug fix\n- The program displayed fixed storage devices despite the option “Display all storage devices” is off\n- “Unable to stop” dialog displayed every time on device disabling, even when the action completed successfully\nOther improvements\n- Czech language support returned\nHow to update from the previous version?\nJust download and install the required installer over the previous version. You do not need to uninstall the previous version. If your license upgrade period is over, feel free to purchase the renewal.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.3.1.1303","version":0,"site":"https://crystalrich.com/","source":"Crystal Rich Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}