{"appId":"w:CrystalRich.Zentimo","appShortcutName":"Zentimo PRO","appDisplayName":"Zentimo PRO","authorId":"w:winget","releaseTagName":"winget-3.1.2.1301","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A swiss army knife for your external drive needs\n\nZentimo offers a new way to manage your USB & eSATA devices. While it solves many external drive related problems in Windows, it also gives more control and makes working with external drives fun & pleasure.\nKey Features:\nFast & Reliable Safe Device Removal: Lets you stop a device, display locking processes, or reconnect a stopped device.\nPortable App Quick Launcher: Lets you launch any application located on your external drive with one click.\nPowerful Autorun: Can automatically mount\\dismount your TrueCrypt drive, launch a file manager, check flash drives for viruses and run anything else on device connection/disconnection.\nDrive Letter Management: The program hides drive letters of unused card reader slots, can assign drive letters to a specific device, and much more...\nHonest Drive Speed Test: Perform read/write speed tests for any attached drive.\nEncrypted Volumes Management: Work with an encrypted by TrueCrypt, CipherShed or VeraCrypt container as if it's a device volume.\nThis is a small but important update, consisting of minor improvements and bug fixes.\n\nImprovements\n- Unable to stop dialog: ability to copy processes info to the clipboard added\n- Additional debug information is sent in user bug reports when verbose logging is enabled (dump of all system devices and user settings)\n- The ‘Display all storage devices’ option is now enabled by default\n- Launching the program a second time brings the device menu to the front instead of the main dialog (consistent with the first launch behavior)\nBug fix\n- ‘Drive Letters’ tab in the program settings could be grayed out and locked on Win 11\n- Text in the troubleshoot service issues dialog was displayed incorrectly in English\n- Some JPEG images caused program errors when set as device icons\n- PNG images lost transparency when set as custom device icons\n- Change device image dialog didn’t preserve its dimensions\n- In some cases, the program might have prevented system shutdown\n  (afterward, the program became unstable and might have displayed errors)\n- Loading settings from file might not have worked correctly – some\n  settings could get duplicated, e.g., autorun settings\n- External storage devices without a drive letter weren’t displayed in the\n  device menu by default (they appeared in the hidden devices section)\n- The program might not detect or display certain types of storage devices\n- Device names might not be detected for some devices\nHow to update from the previous version?\nJust download and install the required installer over the previous version. You do not need to uninstall the previous version. If your license upgrade period is over, feel free to purchase the renewal.\nNote, licenses with one or two year of upgrades purchased after the date of the previous release (Nov 24th, 2023) are also eligible for this update.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.1.2.1301","version":0,"site":"https://crystalrich.com/","source":"Crystal Rich Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}