{"appId":"w:CyberTimon.RapidRAW","appShortcutName":"RapidRAW","appDisplayName":"RapidRAW","authorId":"w:winget","releaseTagName":"winget-1.3.12","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/CyberTimon/RapidRAW/releases/download/v1.3.12/01_RapidRAW_v1.3.12_windows_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/CyberTimon/RapidRAW/releases/download/v1.3.12/01_RapidRAW_v1.3.12_windows-11-arm_arm64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A beautiful, non-destructive, and GPU-accelerated RAW image editor built with performance in mind.\n\nRapidRAW is a modern, high-performance alternative to Adobe Lightroom®. It delivers a simple, beautiful editing experience in a lightweight package (under 20MB) for Windows, macOS, and Linux.\n\nRapidRAW is for photographers who love to edit their photos in a clean, fast, and simple workflow. It prioritizes speed, a beautiful user interface, and powerful tools that let you achieve your creative color vision quickly.\n\nIt is not for users who seek absolute, perfect color accuracy. While the results are great for most purposes, the focus is on a fluid, creative process rather than perfect color precision.\n\nRapidRAW is still in active development and isn't yet as polished as mature tools like Darktable, RawTherapee, or Adobe Lightroom®. Right now, the focus is on building a fast, enjoyable core editing experience. You may encounter bugs - if you do, please report them so I can fix them :) Your feedback really helps!\nClipping Warnings\nYou can now toggle clipping warnings in the Curves tool to highlight overexposed areas in red and underexposed areas in blue.\n\nUpdate Notifier\nWith the new update notifier, you’ll never miss an update.\n\nOther Improvements\n- Updated all dependencies and migrated from Rust 2021 to Rust 2024 (thanks @RayJW).\n- Improved performance through updated dependencies.\n- Enhanced accuracy in the HSL panel.\n- Fixed the inverted tint slider (you may need to readjust existing edits).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.3.12","site":"https://github.com/CyberTimon","source":"Timon Käch","license_or_tos":"AGPL-3.0","resources":null,"verified":false}