{"appId":"w:CyberTimon.RapidRAW","appShortcutName":"RapidRAW","appDisplayName":"RapidRAW","authorId":"w:winget","releaseTagName":"winget-1.4.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/CyberTimon/RapidRAW/releases/download/v1.4.1/01_RapidRAW_v1.4.1_windows-11-arm_arm64.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/CyberTimon/RapidRAW/releases/download/v1.4.1/01_RapidRAW_v1.4.1_windows_x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A beautiful, non-destructive, and GPU-accelerated RAW image editor built with performance in mind.\n\nRapidRAW is a modern, high-performance alternative to Adobe Lightroom®. It delivers a simple, beautiful editing experience in a lightweight package (under 20MB) for Windows, macOS, and Linux.\n\nRapidRAW is for photographers who love to edit their photos in a clean, fast, and simple workflow. It prioritizes speed, a beautiful user interface, and powerful tools that let you achieve your creative color vision quickly.\n\nIt is not for users who seek absolute, perfect color accuracy. While the results are great for most purposes, the focus is on a fluid, creative process rather than perfect color precision.\n\nRapidRAW is still in active development and isn't yet as polished as mature tools like Darktable, RawTherapee, or Adobe Lightroom®. Right now, the focus is on building a fast, enjoyable core editing experience. You may encounter bugs - if you do, please report them so I can fix them :) Your feedback really helps!\nPerformance Hotfix\nVersion 1.4.1 addresses critical performance issues introduced in v1.4.0, where using local contrast tools could cause severe slowdowns and even crashes.\nI strongly recommend skipping v1.4.0 and upgrading directly to v1.4.1.\nSince many users haven’t updated yet, the full v1.4.0 release notes are included below for reference:\nRapidRAW v1.4.0 is finally available. This update introduces several new tools and foundational improvements to the software. Here’s a breakdown of what’s new:\nNew Features\nAuto Culling\nCulling is tedious. The new Auto Culling feature is designed to speed this up. It scans your selection for duplicates and blurry photos, then lets you flag or delete them in a batch:\nimage\nCollage Maker\nA collage maker has been integrated into the app. It provides multiple layouts and allows you to control spacing, border radius, and background color for creating custom compositions:\n─────────────┬──────────────\nCollage Maker│Example Output\n─────────────┼──────────────\nUI 1         │UI 2\n─────────────┴──────────────\nColor Calibration\nFor more fundamental control over color, I've added a Color Calibration panel. Unlike HSL, this tool lets you directly modify the hue and saturation of the primary RGB channels, enabling more significant and stylized color shifts:\nimage\nUniversal Preset Importer\nTo improve workflow flexibility, you can now import presets from other common photo editors. Note that due to different processing engines, the conversion is not 1:1, but it provides a solid starting point for your edits.\nimage\nAdjustments Visibility\nI'm committed to keeping the UI clean. As more niche tools are added, they can clutter the workspace. A new setting now lets you hide advanced adjustments you don't use, allowing you to maintain a simpler interface:\nimage\nSort Library by EXIF Data\nYou can now sort the photo library by EXIF data. Once enabled in the settings, you can organize your view by ISO, aperture, focal length, and other tags:\nimage Core Improvements\nReworked Local Contrast Tools\nThe previous implementation of local contrast tools (Sharpness, Clarity, Structure) was not up to my standard (affected exposure too much). I've re-engineered them to provide higher quality results and interact more predictably with other adjustments like exposure.\nOther Fixes & Enhancements\n- Improved performance when loading library folders (thanks to @riccio8)\n- Various shader optimizations and bug fixes\n- General improvements to application stability and logging\n- Brand new app icons & dark theme wallpaper\n- New logger\nSpecial Thanks\nA thank you to everyone who contributed between these versions. In particular:\n- @william-sy - for support with release planning and managing GitHub issues and discussions\n- @riccio8 - for improvements to folder loading performance\n- @RayJW - for implementing Flatpak support\nImportant: Action Required for Upgrading Users\nIn this update, I've had to change the application's internal identifier from com.rapidraw.app to io.github.CyberTimon.RapidRAW. This is a technical but important change that helps with long-term maintenance and ensures better compatibility going forward.\nUnfortunately, this means that when you first launch v1.4.0, it won't be able to find your existing user data. As a result:\n- Your AI models will need to be redownloaded.\n- Your library thumbnails will be regenerated.\n- Crucially, all of your saved presets will be gone.\n- Edits aren't effected, as they are stored in seperate sidecars.\nTo avoid losing your data, I've outlined two migration options below. Please choose one before you launch the new version for the first time. Keep in mind that edits are stored in sidecars and aren't affected by this migration.\nOption A: Full Migration (Recommended)\nThis method is the best option as it migrates everything: your settings, presets, and cached data. To do this, you'll need to manually rename the application's data folder.\n- Windows: Navigate to both %APPDATA% (in Roaming) and %LOCALAPPDATA% (in Local) and rename the com.rapidraw.app folder in each location to io.github.CyberTimon.RapidRAW.\n- macOS: Navigate to ~/Library/Application Support/ and rename the com.rapidraw.app folder to io.github.CyberTimon.RapidRAW. Example command: mv ~/Library/Application\\ Support/com.rapidraw.app ~/Library/Application\\ Support/io.github.CyberTimon.RapidRAW\n- Linux: The location can vary, but typically check ~/.config/ and ~/.local/share/. Rename the com.rapidraw.app folder in each relevant location to io.github.CyberTimon.RapidRAW.\nOption B: Migrate Presets Only\nIf you only care about saving your presets and don't mind re-caching thumbnails and models, this is a simpler alternative.\n1. In your old version of RapidRAW, export all your presets to a safe location.\n2. Install and open RapidRAW v1.4.0.\n3. Import your presets using the new Universal Preset Importer.\nI sincerely apologize for the inconvenience this one-time migration step causes. This change was a tough decision, but it sets the app up for a more stable and robust future. Thank you for your understanding!\nWhat to Download\n─────────────────────┬────────────┬──────┬──────────────────────────────\nOS                   │Architecture│Format│Download Link\n─────────────────────┼────────────┼──────┼──────────────────────────────\nWindows              │x64         │.exe  │RapidRAW for Windows\n─────────────────────┼────────────┼──────┼──────────────────────────────\nmacOS (Apple Silicon)│ARM64       │.dmg  │RapidRAW for macOS ARM\n─────────────────────┼────────────┼──────┼──────────────────────────────\nmacOS (Intel)        │x64         │.dmg  │RapidRAW for macOS x64\n─────────────────────┼────────────┼──────┼──────────────────────────────\nUbuntu 22.04         │x86_64      │.deb  │RapidRAW for Ubuntu 22.04\n─────────────────────┼────────────┼──────┼──────────────────────────────\nUbuntu 24.04         │x86_64      │.deb  │RapidRAW for Ubuntu 24.04\n─────────────────────┴────────────┴──────┴──────────────────────────────\nFor other platforms and formats (ARM builds, RPM, AppImage, etc.), check the full asset list below.\nRunning on macOS and Windows\nBecause RapidRAW is not yet code-signed, both macOS and Windows may show warnings when you try to run the app.\n- On macOS:\n  You’ll need to remove the quarantine flag after installation:\n  xattr -dr com.apple.quarantine /Applications/RapidRAW.app\n  Without this step, macOS may report the app as \"corrupted.\"\n- On Windows:\n  When launching the app, you may see a Windows Defender SmartScreen warning.\n  - Click \"More info\" → \"Run anyway\" to continue.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.4.1","version":0,"site":"https://github.com/CyberTimon","source":"Timon Käch","license_or_tos":"AGPL-3.0","resources":null,"verified":false}