{"appId":"w:CyberTimon.RapidRAW","appShortcutName":"RapidRAW","appDisplayName":"RapidRAW","authorId":"w:winget","releaseTagName":"winget-1.4.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/CyberTimon/RapidRAW/releases/download/v1.4.3/01_RapidRAW_v1.4.3_windows_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/CyberTimon/RapidRAW/releases/download/v1.4.3/01_RapidRAW_v1.4.3_windows-11-arm_arm64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A beautiful, non-destructive, and GPU-accelerated RAW image editor built with performance in mind.\n\nRapidRAW is a modern, high-performance alternative to Adobe Lightroom®. It delivers a simple, beautiful editing experience in a lightweight package (under 20MB) for Windows, macOS, and Linux.\n\nRapidRAW is for photographers who love to edit their photos in a clean, fast, and simple workflow. It prioritizes speed, a beautiful user interface, and powerful tools that let you achieve your creative color vision quickly.\n\nIt is not for users who seek absolute, perfect color accuracy. While the results are great for most purposes, the focus is on a fluid, creative process rather than perfect color precision.\n\nRapidRAW is still in active development and isn't yet as polished as mature tools like Darktable, RawTherapee, or Adobe Lightroom®. Right now, the focus is on building a fast, enjoyable core editing experience. You may encounter bugs - if you do, please report them so I can fix them :) Your feedback really helps!\nChanges in version v1.4.3\n\nNew Features\n- Pin Folders: Tired of constantly navigating between folders on different drives? Now you can right click any folder to pin it to a dedicated section in the sidebar for quick access.\n- Apply Presets To Masks: Apply any saved preset directly to a mask. This is a huge time saver for applying targeted adjustments like a \"Clarity Boost\" to a subject mask.\n- Centré Adjustment: A new slider that acts like an inverted vignette, subtly boosting clarity, brightness, and contrast in the middle of the frame to draw attention to your subject.\n- Whole Image Mask Type: Added a new mask type that covers the entire image, useful as a base for subtracting or inverting other mask components. This also lays the groundwork for future mask types without cluttering the UI.\n\nCore Improvements\n- Library thumbnail updating is now much smoother.\n- Rawler is now a submodule, thanks to @william-sy.\n- The logger has been improved to output the full traceback for better debugging.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.4.3","version":0,"site":"https://github.com/CyberTimon","source":"Timon Käch","license_or_tos":"AGPL-3.0","resources":null,"verified":false}