{"appId":"w:darktable.darktable","appShortcutName":"darktable","appDisplayName":"darktable","authorId":"w:winget","releaseTagName":"winget-5.4.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/darktable-org/darktable/releases/download/release-5.4.1/darktable-5.4.1-win64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Photography workflow application and raw developer\n\ndarktable is an open source photography workflow application and raw developer. A virtual lighttable and darkroom for photographers. It manages your digital negatives in a database, lets you view them through a zoomable lighttable and enables you to develop raw images and enhance them.\nThe Big Ones\nThe following is a summary of the main features added to darktable\n5.4. Please see the user manual for more details of the individual\nchanges (where available).\n- N/A\nUI/UX Improvements\n- N/A\nPerformance Improvements\n- N/A\nOther Changes\n- N/A\nBug Fixes\n- Fixed wrong handling of scaling factor during multi-preset export.\n- Fixed missing help URL, pointing to the online documentation, for\n  the new AgX module.\n- Fixed wrong handling of overwrite if changed in export.\n- Fixed images exported with wrong settings when using multi-preset\n  export.\n- Fixed wrong RAW specific auto-applied preset being applied to non\n  RAW images.\n- Fixed subtle color casts in bayer dual demosaicers.\n- RustiCL gets the default optimizing compiler flags as other\n  platforms.\n- Fixed loading some Olympus ORF files (e.g. E-410 and E-510)\n  due to a possible crash or memory corruption when parsing\n  highlight-preservation Exif tag.\n- Fixed the mask support in scale pixels module.\n- Fixed a possible crash when using workspace due to the non\n  deterministic ordering of the list of workspace read on disk.\n- The list of the allowed tags in the metadata editor preferences has\n  been restricted to tags which are supposed to be user-editable.\n- Fixed the thumbnail information update in the overlay or the tooltip\n  when some metadata variable are used. That is, when changing the\n  metadata we need to recompute the thumbnail information.\n- Fixed a possibly standstill while discarding history on fast\n  systems.\n- Fixed a possible crash in the way the Color Equalizer module GUI is\n  initialized.\n- Fixed an issue in culling layout where switching to the darkroom\n  sometimes failed with an error message.\n- Fixed an inconsistency in the styles module UI when shown in the\n  darkroom view. It is not possible to create a duplicate to which the\n  style is applied, and the setting of the corresponding checkbox has\n  just been ignored. To avoid confusion, the checkbox is now hidden in\n  the darkroom view.\n- Fixes resets to default OpenCL per device setting.\n- Fixed possibly outdated metadata when returning from darkroom. For\n  example if the image is cropped in darkroom, the metadata $(WIDTH.x)\n  and $(HEIGHT.x) where not correct on lighttable.\n- Fixed a missing thumbnail overlays with $(CATEGORY[n,m]) variables\n  update when a tag is assigned.\n- Fixed jumping of curvature slider when used on the mask manager.\n- Fixed a crash when mounting a camera from Darktable due to the\n  current locale. Mounting is now done using the C locale.\nLua\nAPI Version\n- API version is now 9.6.0\nNew Features\n- N/A\nBug Fixes\n- N/A\nAdd action support for Lua\nOther Lua changes\n- N/A\nNotes\n- When exporting to AVIF, EXR, JPEG XL, or XCF, selecting specific\n  metadata (e.g. geo-tag or creator) is not currently possible. For\n  AVIF, EXR, JPEG XL, and XCF formats, darktable will not include any\n  metadata fields unless the user selects all of the checkboxes in the\n  export module's preference options.\n- Starting with release 5.4, macOS versions older than 14.0 are no\n  longer supported on Apple Silicon Macs, nor older than macOS 15 on\n  Intel Macs.\nChanged Dependencies\nMandatory\n- N/A\nOptional\n- N/A\nRawSpeed changes\n- N/A\nCamera support, compared to 5.4.0\nBase Support\n- N/A\nWhite Balance Presets\n- N/A\nNoise Profiles\n- Canon EOS 10D\n- Sony ILCE-7CR\nMissing Compression Mode Support\n- Apple ProRAW DNGs\n- CinemaDNG lossless (Blackmagic, some DJI, etc.) and lossy (Blackmagic)\n- DNG 1.7 using JPEG XL (Adobe enhanced, Samsung Expert RAW)\n- Fujifilm lossy RAFs\n- Nikon high efficiency NEFs\n- Phase One other than IIQ L\n- Sony ARW 4.0/5.0 downsized lossless (\"M\" for full-frame, \"S\" for full-frame & APS-C) and ARW 6.0 lossy\nSuspended Support\nSupport for the following cameras is suspended because no samples are available on https://raw.pixls.us:\n- Creo/Leaf Aptus 22(LF3779)/Hasselblad H1\n- Fujifilm IS-1\n- Kodak EasyShare Z980\n- Leaf Aptus-II 5(LI300059)/Mamiya 645 AFD\n- Leaf Credo 60\n- Leaf Credo 80\n- Olympus SP320\n- Phase One IQ250\n- ST Micro STV680\nTranslations\n- Czech\n- German\n- European Spanish\n- Finnish\n- French\n- Hungarian\n- Italian\n- Japanese\n- Korean\n- Dutch\n- Polish\n- Brazilian Portuguese\n- Slovenian\n- Albanian\n- Swedish\n- Ukrainian\n- Chinese (Simplified)\n- Chinese (Traditional)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.4.1","version":0,"site":"https://www.darktable.org/","source":"the darktable project","license_or_tos":"GPL-3.0","resources":null,"verified":false}