{"appId":"w:DavidNorgren.Mine_imator","appShortcutName":"Mine-imator","appDisplayName":"Mine-imator","authorId":"w:winget","releaseTagName":"winget-1.2.9","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Create animated videos using blocks, items and the lovable characters from Minecraft.\n\n\nWorld importer\n- Added support for 1.18 worlds with default world height.\n- Added color preview for biomes. (Note: Biomes are not exported to Mine-imator.)\n- Added support for datapack dimensions.\n- Changed \"Loading region...\" message to be in the top-down viewport, added a new percentage.\n- Added a limit to water transparency, allowing for clearer oceans/rivers.\n- Certain blocks now have a color manually set. (Instead of generated from its texture.)\n- Certain tasks are now multi-threaded, giving a massive performance boost.\n- Side-view viewport now updates in realtime when changing block selection in the top-down view.\n- Filtering water blocks now removes \"waterlogged\" states from blocks\n- Fixed crash when loading chunks from different Minecraft versions in the same world.\n- Fixed most block variants not appearing.\nMinecraft support\n- Updated items & biomes to Minecraft 1.18.\n- Added \"Mojang Studios\" and \"Migrator\" capes.\n- Updated biome colors.\n- Enchanting tables now glow.\n- \"Vertical\" blocks from the workbench now adapt to their vertical \"repeat\".\n  - Includes: Kelp, Weeping Vines, Twisted Vines, Pointed Dripstone, Big Dripleaf & Cave Vines.\nChanges\n- Added \"Use x64 world importer\" program setting. (Launches a x64-bit version of the world importer for increased memory usage.)\nChanges\n- Removed \"Remove waterlogged water\" setting\n- Reduced smooth camera sliding.\n- Updated GameMaker runtime to 2.2.5.378 (Same as Modelbench), giving a faster startup.\nBugfixes\n- Fixed vertical repeat affecting random offset for certain blocks.\n- Fixed \"Mapped texture\" affecting other shape types when creating a shape in the workbench. (Would hide certain settings in the library.)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.9","version":0,"site":"https://www.stuffbydavid.com/","source":"David Norgren","license_or_tos":"Proprietary","resources":null,"verified":false}