{"appId":"w:DDEVFoundation.DDEV","appShortcutName":"DDEV","appDisplayName":"DDEV","authorId":"w:winget","releaseTagName":"winget-1.25.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ddev/ddev/releases/download/v1.25.0/ddev_windows_amd64_installer.v1.25.0.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ddev/ddev/releases/download/v1.25.0/ddev_windows_arm64_installer.v1.25.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"User","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Docker-based local PHP+Node.js web development environments\n\n\nInstallation\nSee the installation instructions for details, but it's easy:\n- macOS: brew install ddev/ddev/ddev or just brew upgrade ddev.\n- Linux: Use sudo apt-get update && sudo apt-get install ddev, see apt/yum installation\n- Windows and WSL2: Download the Windows Installer; you can run it for install or upgrade. winget install --interactive ddev works too.\n  ⚠️ Traditional Windows users (not WSL2): If needed, the installer will prompt you to uninstall the previous system-wide installation to avoid conflicts with the new per-user installation.\n- Consider ddev delete images or ddev delete images --all after upgrading to free up disk space used by previous Docker image versions. This does no harm.\n- Consider ddev config --auto to update your projects to current configuration.\nHighlights\nNew defaults\n- Debian Trixie is now the base image for ddev-webserver and ddev-ssh-agent (replacing Debian Bookworm). See Issues to be aware of for Trixie.\n  (Some projects with complex Dockerfiles or obsolete webimage_extra_packages may need to be updated.)\n- XHGui is now the default profiler (prepend mode remains available via ddev config global --xhprof-mode=prepend).\n- Node.js v24 is default in new projects (replacing Node.js v22)\n- PHP 8.4 is default in new projects (replacing PHP 8.3)\n- MariaDB 11.8 is default in new projects (replacing MariaDB 10.11)\nAdditional highlights\n- Completely revised Windows installer now uses per-user installation for WSL2 or traditional Windows (no admin account required)\n- Reworked configurable ddev share command with a new cloudflared share provider, see (draft) New ddev share Provider System Brings Free Sharing Options\n- Add ddev utility xdebug-diagnose command, see (draft) Xdebug in DDEV: Understanding, Debugging, and Troubleshooting Step Debugging\n- Add ddev utility mutagen-diagnose command, see (draft) Mutagen in DDEV: Functionality, Issues, and Debugging\n- ddev pantheon pull got new DDEV_PANTHEON_SITE, DDEV_PANTHEON_ENVIRONMENT, DDEV_USE_PANTHEON_BACKUP variables, see updated Pantheon Integration\n- ddev snapshot now uses zstd instead of gzip for significantly faster exports and restores, thanks to @deviantintegral\n- Add CodeIgniter project type, thanks to @Franky5831\n- Experimental support for Podman and Docker Rootless, see Podman and Docker Rootless in DDEV\n- ddev-frankenphp is an official add-on with many improvements, see updated (draft) Using FrankenPHP with DDEV\nFeatures\n- New Wagtail (Python, Generic) quickstart\n- Added Drupal 12 project type (development branch). Drupal 12 has not yet been released, but it's showing up in developer builds already.\n- New --no-cache flag for ddev start and ddev restart (as an alternative to ddev utility rebuild)\n- Improved support for non-Codespaces devcontainers\n- Refactored ddev add-on subcommands with a fallback mechanism to avoid GitHub API rate limits\n- Much faster ddev add-on list and ddev add-on search\n- Shell autocompletion for ddev add-on get <TAB>\n- SELinux enviroment detection (auto SELinux label for bind mounts)\n- Support for additional SSH config files (*.conf) in .ddev/homeadditions/.ssh/config.d (global or project-level), see SSH confugation, thanks to @codebymikey\n- More portable database collations. Databases imported and exported from newer MySQL and MariaDB are less likely to have problems with proprietary collations like utf8mb4_0900_ai_ci and utf8mb4_uca1400_ai_ci as they use more traditional collations in DDEV.\n- DBeaver support for traditional Windows, thanks to @ddubau\nTraefik Router Features, Fixes, and Breaking Changes\n- Project Traefik configuration is now standardized to a single file: .ddev/traefik/config/<projectname>.yaml (all other files are ignored). See issue #8047.\n- Add any global Traefik configuration inside the $HOME/.ddev/traefik/custom-global-config/ directory\n- Removed defaultRuleSyntax: v2 and ruleSyntax: v3 from Traefik configs. Traefik v3 syntax is now used by default.\n- Traefik configuration errors now show warnings instead of failing hard\n- Improved Traefik health checks for more reliable router verification\n- Prevent unnecessary router recreation when bound ports are unchanged\n- ddev-router is no longer stopped automatically when the last project is stopped, use ddev poweroff to fully stop the router\n- Traefik monitoring port is now bound to localhost only, thanks to @JUVOJustin\n- Paused or stopped projects are excluded from Traefik configuration\n- Bypass router port checks when all ports appear busy (for example, when endpoint security software intercepts localhost traffic)\nBreaking Changes / Removals\n- Default xhprof_mode changed from \"prepend\" to \"xhgui\" but you can easily change it back\n- Removed ddev utility capabilities, use ddev_version_constraint instead in add-ons.\n- Removed NFS support, use Mutagen\n- Removed ddev service, custom services can be installed/uninstalled via ddev add-on\n- Removed ddev nvm, install the ddev-nvm add-on if needed\n- Removed obsolete or non-functional commands and command aliases:\n  - ddev restore-snapshot\n  - ddev auth pantheon\n  - ddev config pantheon\n- Removed obsolete ddev config flags:\n  - --mutagen-enabled (use --performance-mode=mutagen)\n  - --upload-dir (use --upload-dirs)\n  - --db-image, --db-image-default (never documented or used)\n- Removed deprecated ddev config flag aliases:\n  - --http-port → --router-http-port\n  - --https-port → --router-https-port\n  - --mailhog-port → --mailpit-http-port\n  - --mailhog-https-port → --mailpit-https-port\n  - --projectname → --project-name\n  - --projecttype, --apptype → --project-type\n  - --sitename → --project-name\n  - --image-defaults → --web-image-default\n- Removed nginx.org repository from ddev-webserver, now using nginx from the Debian Trixie repository\n- Migrated all APT repositories in ddev-webserver from legacy *.list files to *.sources (deb822) format\nBug Fixes\n- Fixed ddev heidisql support for multiple databases\n- Fixed PostgreSQL builds when overriding the database username\n- Fixed Windows installer behavior on non-English Windows locales\n- Improved Bash detection for non-admin Windows installations\n- Fixed host.docker.internal IP detection for WSL2 mirrored mode with virtual adapters present\n- Fixed conflicts between HostWorkingDir and WebWorkingDir affecting ddev npm, thanks to @crowjake\n- Fixed support for PKCS#8 keys in ddev auth ssh\n- Fixed ddev snapshot command for postgres:9\n- Create Docker volumes only for the configured database type\n- Fixed ddev xdebug, ddev xhprof, and ddev blackfire handlers for the ddev-frankenphp add-on\n- Fixed ddev snapshot failure when run immediately after ddev snapshot restore\n- Always show the correct project name in ddev mutagen st, thanks to @agviu\n- Warn about non-persistent changes when using ddev composer self-update and ddev composer global\n- Added support for COMPOSER_NO_SECURITY_BLOCKING=1 in ddev composer\n- Run post-create-project-cmd for plugin events in ddev composer create-project\n- Improved log-stderr.sh reporting during ddev start\n- Skip poweroff prompts when containers are already stopped during version upgrades\n- Fixed database port type in TYPO3 settings, thanks to @BreathCodeFlow\n- Detect and warn about multiple global config directories during ddev start\nMinor Updates\n- PHP 8.3.30, 8.4.17, and 8.5.2\n- Docker Compose v5.0.2\n- Updated Generic webserver quickstart\n- Add APP_FULL_BASE_URL for CakePHP, thanks to @ajibarra\n- Updated Lagoon provider instructions with sync configuration, thanks to @froboy\n- Added Cloudflare WARP networking instructions, thanks to @lguigo22\n- Updated Ibexa DXP installation steps, thanks to @adriendupuis\n- Added troubleshooting guidance for endpoint security interfering with Xdebug, thanks to @joelpittet\n- Replaced github.com/docker/docker with github.com/moby/moby/client and github.com/moby/moby/api\nWhat's Changed\n- test: Allow overriding ignore expiring keys [skip buildkite] by @rfay in #7803\n- test: Improve TestHasConfigNameOverride so it doesn't leave projects after completion, fixes #7797 by @rfay in #7798\n- test: don't check for expiring keys in forks, for #7803 by @stasadev in #7831\n- build(deps): bump golangci/golangci-lint-action from 8 to 9 by @dependabot[bot] in #7832\n- fix(heidisql): use --databases flag only when needed, fixes #7829 by @stasadev in #7830\n- docs: add missing dot in .ddev/.env.* by @yanniboi in #7828\n- fix(postgres): use placeholder for username, fixes #7820 by @stasadev in #7827\n- docs: remove community examples link in documentation by @weitzman in #7834\n- refactor: improve ddev auth ssh readability and reuse cmd in tests by @stasadev in #7816\n- test(quickstart): check for new FrankenPHP headers by @stasadev in #7836\n- docs: Update Docker connection failure explanations with more on docker context ls by @rfay in #7833\n- chore(images): Remove image build for ddev-nginx-proxy-router by @rfay in #7818\n- chore: Remove ddev utility capabilities command completely, fixes #7174 by @Copilot in #7814\n- build: fix getopt detection on macOS by @deviantintegral in #7846\n- docs: Add Claude Code for Web environment configuration guide [skip ci] by @rfay in #7838\n- chore(traefik): Remove redundant Traefik rule syntax configuration, fixes #7822 by @rfay in #7823\n- chore: Remove NFS support for v1.25.0, remove unused CircleCI config, fixes #7810 by @Copilot in #7811\n- build: use debian:trixie as base for ddev-webserver by @rfay in #7649\n- fix(heidisql): add default --databases=db to postgres, for #7830 by @raphaelportmann in #7847\n- test(timezone): Windows may show 'Universal' instead of UTC by @rfay in #7848\n- build(deps): bump docker to v29 by @stasadev in #7835\n- test(share): Fix TestShareCmd to handle non-string types in JSON logs by @Copilot in #7851\n- fix: remove trailing comma from schema.json by @stasadev in #7850\n- fix: Disable 64-bit file system redirection in Windows installer Section to access wsl.exe by @rfay in #7839","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.25.0","version":0,"site":"https://github.com/ddev","source":"DDEV Foundation","license_or_tos":"Apache-2.0","resources":null,"verified":false}