{"appId":"w:den4b.ReNamer","appShortcutName":"ReNamer","appDisplayName":"ReNamer","authorId":"w:winget","releaseTagName":"winget-7.8","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A very powerful and flexible file renaming tool\n\nReNamer is a very powerful and flexible file renaming tool, which offers all the standard renaming procedures, including prefixes, suffixes, replacements, case changes, as well as removing contents of brackets, adding number sequences, changing file extensions, etc. For advanced users there is support for Regular Expressions and a PascalScript rule, which lets users program their very own renaming rule.\nProgram allows you to combine multiple renaming actions as a rule set, applying each action in a logical sequence, which can be saved, loaded, and managed within the program. In addition, it has an ability to rename folders, process regular expressions, Unicode capable, and supports variety of meta tags, such as: ID3v1, ID3v2, EXIF, OLE, AVI, MD5, CRC32, and SHA1.\nReNamer 7.8 has been released.\nThis is another big update that brings several new features and some under-the-hood improvements.\nNew features:\n1. Implement the Mapping rule. Use this rule to map old filenames to new filenames.\n2. Add an option to export names and new names to clipboard. These can be be loaded directly into a Mapping rule.\n3. Improvements for the Reformat Date rule: Unicode word boundaries, pass-through quoted text in date patterns, improved performance, add ISO date-time formats to the dropdown options.\n4. Display detailed information about the character at the caret position in the Analyze window.\nThe new Mapping rule allows you to map old filenames to new filenames, which can be externally managed and loaded into the rule via clipboard or CSV file. It also allows you to capture the current set of files and their generated new names as a rule set, which could then also be applied to a different set of files.\n\nFor example, imagine that you have a list of audio files from an album but the filenames contain only the track numbers, and you also have a list of full song titles. With the new Mapping rule you can create a mapping to convert track numbers into to the corresponding full song titles, like shown above.\nThe improved Analyze dialog can now identify complex Unicode characters. This can be especially useful when dealing with characters that are visually indistinguishable from other characters. Here is a quick demo of how it looks:\n\nMaintenance and other changes:\n- Optimized implementation of renaming rules.\n- Fix: The rules list is loosing focus after moving rules. Issue introduced in v7.7.\n- Gracefully handle errors when generating rule statements. Prevent bogus rule configurations from breaking the main user interface.\n- Updated language files: French, Turkish, Portuguese (Brazil), Traditional Chinese, Simplified Chinese, Russian.\nFor more details see the full changelog between versions 7.7 and 7.8.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.8","version":0,"site":"https://www.den4b.com/","source":"den4b Team","license_or_tos":"CC-BY-NC-ND-3.0","resources":null,"verified":false}