{"appId":"w:Devolutions.Gateway","appShortcutName":"Devolutions Gateway","appDisplayName":"Devolutions Gateway","authorId":"w:winget","releaseTagName":"winget-25.3.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://cdn.devolutions.net/download/DevolutionsGateway-x86_64-2025.3.4.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access management — No VPN required\n\nDevolutions Gateway offers a lightweight alternative to Apache Guacamole and traditional VPNs for organizations requiring secure access to remote network segments. Meant for small deployments, the standalone version is free to install and use (commercial and personal), and offers you a simple web interface as an external launcher to connect to internally hosted services via RDP, SSH, Telnet, VNC, or ARD!\nNew features (3)\n- Installer - Allow downloading keys even when the certificate isn't trusted (useful in restricted/air-gapped environments)\n- Service - Add credential injection support for RDCleanPath\n- Service - Add outbound HTTP/HTTPS/SOCKS4/SOCKS5 proxy configuration support\nImprovements (2)\n- Service - Add ARM64 Docker image support (run natively on ARM hosts)\n- Service - Reduce noisy logs: benign client disconnects are now logged as DEBUG instead of ERROR\nFixes\n- Installer - Fix handling of certificate passwords containing single quotes\n- Service - Fix certificate store resolution error logging to include clearer failure details\n- Service - Fix Docker image build to correctly generate a self-signed TLS certificate\n- Service - Fix Linux container startup to honor the TCP_PORT environment variable","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"25.3.4","version":0,"site":"https://devolutions.net/","source":"Devolutions","license_or_tos":"Apache-2.0, MIT","resources":null,"verified":false}