{"appId":"w:Devolutions.RemoteDesktopManager","appShortcutName":"Remote Desktop Manager","appDisplayName":"Remote Desktop Manager","authorId":"w:winget","releaseTagName":"winget-2025.2.30.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://cdn.devolutions.net/download/Setup.RemoteDesktopManager.win-arm64.2025.2.30.0.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://cdn.devolutions.net/download/Setup.RemoteDesktopManager.win-x64.2025.2.30.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Remote Connections & Passwords. Everywhere!\n\n\nDVLS 2025.2 is required with this version (only if you're already using DVLS)\n\n### Improvements\n\n- Added a folder creation mode for VMware Synchromizer\n- Added support for linked proxy tunnel VPNs in terminal entries\n- Allowed Jump host session to start as undocked\n\n### Fixes\n\n- Fixed an issue preventing the disconnect on idle to work in the user vault\n- Fixed bitwarden synchronizers not properly cleaning Bitwarden Secret key for\n  TOTP entries\n- Fixed double click on SQL console treeview crashing\n- Fixed empty root issue when MFA auth is cancelled\n- Fixed issue allowing replies to disabled users in secure messaging\n- Fixed issue when connecting to websites through network scan\n- Fixed issue where going Online in User Vault doesn't change the icon in the\n  Status bar\n- Fixed issue where script were executed on gateway instead of selected\n  connection\n- Fixed issue with macros/scripts/tools not resolving host and credentials\n  properly\n- Fixed issue with offline mode in Hub\n- Fixed loading issue with pre shared key for Wireguard peers\n- Fixed Opened Session state of jump session being lost after automatic refresh\n- Fixed potential error when changing nodes in the AWS Dashboard\n- Fixed potential error when reconnecting to undocked sessions\n- Fixed potential error when the Windows daily theme change triggers\n- Fixed potential freeze when stopping SSH Key Agent\n- Fixed read-only flag persisting on files for embedded document\n- Fixed session tools not loading in a few connection views","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2025.2.30.0","site":"https://devolutions.net/","source":"Devolutions inc.","license_or_tos":"Proprietary","resources":null,"verified":false}