{"appId":"w:Devolutions.Gateway","appShortcutName":"Devolutions Gateway","appDisplayName":"Devolutions Gateway","authorId":"w:winget","releaseTagName":"winget-25.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://cdn.devolutions.net/download/DevolutionsGateway-x86_64-2025.3.0.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access management — No VPN required\n\nDevolutions Gateway offers a lightweight alternative to Apache Guacamole and traditional VPNs for organizations requiring secure access to remote network segments. Meant for small deployments, the standalone version is free to install and use (commercial and personal), and offers you a simple web interface as an external launcher to connect to internally hosted services via RDP, SSH, Telnet, VNC, or ARD!\n- Service - Devolutions Gateway now records and expose traffic transferred over JMUX tunnels for auditing and usage insights\n- Standalone - Added an MVP for self-contained session URLs so sessions can be launched or shared via a single link\n- Standalone - SSH and Telnet web clients now support clipboard copy/paste\n- Optimized binary size to reduce download and footprint\n- Service - WebM video player now autoplays for smoother playback\n- Standalone - Added a color format selector for VNC sessions to balance bandwidth and image quality\n- Standalone - Clipboard features are disabled in non-secure contexts to protect data\n- Standalone - Improved error handling across remote desktop clients for clearer, more actionable messages\n- Standalone - Introduced manual clipboard mode for RDP, VNC, and ARD with Send Clipboard and Save Clipboard buttons; auto mode is toggleable and supported only on Blink-based browsers (e.g., Chrome)\n- Standalone - Replaced TightLow/High with a granular JPEG Quality control for finer tuning of performance vs. clarity\n- Standalone - The web app shows a fallback screen with guidance when an unsupported browser is detected\n- Standalone - Fixed user domain parsing for UPN-formatted usernames during sign-in","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"25.3.0","site":"https://devolutions.net/","source":"Devolutions","license_or_tos":"Apache-2.0, MIT","resources":null,"verified":false}