{"appId":"w:Diffractor.Diffractor","appShortcutName":"Diffractor","appDisplayName":"Diffractor","authorId":"w:winget","releaseTagName":"winget-126.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Diffractor is designed to manage a collection of photos and videos. It indexes your files to allow duplicate detection, fast search and collection presence.\n\nDiffractor is designed to manage a collection of photos and videos on your PC.\nIt can view and search any files, but the collection has extra features such as duplicate detection, fast search and presence. The collection is indexed to support these features.\n\nDiffractor calculates the presence of files in the collection. The presence indicates if a file exists or is duplicated in the collection. It also indicates if an item has sidecars.\nSidecars are extra files associated with a media item – for example XMP metadata or subtitles.\nThe presence tooltip lists the files that diffractor has detected. Duplicates in red and sidecars in green.\nPresence also works for files outside the collection. Use it to check if files on an old memory card are missing from the collection. Simply open the memory card and group files by presence.\n\nFile formats  supported by Diffractor:\n- Video Encoding Formats: MP4, 3GP, OGG, WMV, WEBM, FLV, AVI, QuickTime, HDV, MXF, MPEG-TS, MPEG-2 PS, MPEG-2 TS, WAV, LXF, GXF, VOB\n- Audio Formats: MP3, AAC, HE-AAC, AC3, EAC3, Vorbis, WMA, PCM\n- Standard Image File Formats: BMP, GIF, JPG/JPEG, PNG, PSD, TIFF, WEBP\n- Raw photo file formats: 3FR, ARW, BAY, BMQ, CINe, CRW, CR2, CR3, CS1, DC2, DCR, DNG, ERF, FFF, HDR, IA, K25, KC2, KDC, MDC, MEF, MOS, MRW, NEF, NRW, ORF, PEF, PXN, QTK, RAF, RAW, RDC, RW2, RWL, SR2, SRF, SRW, STI, X3F\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"126.0","version":0,"site":"https://diffractor.com/","source":"Diffractor","license_or_tos":"LGPL","resources":null,"verified":false}