{"appId":"w:DiskInternals.EFSRecovery","appShortcutName":"DiskInternals EFS Recovery","appDisplayName":"DiskInternals EFS Recovery","authorId":"w:winget","releaseTagName":"winget-5.18.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Decrypt EFS files from damaged, formatted or healthy NTFS/EFS partitions and RAID arrays\n\nRecover encrypted files and folders from healthy or damaged NTFS disks and RAID arrays. Whether you simply moved a disk with protected files to another PC, deleted an encrypted file or folder, formatted the partition, or experienced a hard disk corruption, Diskinternals EFS Recovery will help you get back your encrypted information quickly and easily.\n\nEFS Recovery supports NTFS/EFS partitions created by Windows 11, 10, Windows 7 and 2008 Server R1/R2, as well as Windows 2000, XP, 2003 Server, and Windows Vista\n\nDiskinternals EFS Recovery works completely automatically, locating and recovering encrypted files and folders from healthy, damaged, deleted or inaccessible disks and partitions. The EFS data recovery tool will help if you moved the disk into another PC, upgraded or downgraded Windows, or are trying to access encrypted files located on an external disk from a different PC or user account (*). Just specify the disk or partition and enter your Windows account password (*) to begin!\n\nDiskinternals EFS Recovery enables you to read protected files and folders stored on the Encrypted File System (EFS) partitions from all versions of Windows, even if they don’t support the original EFS version natively. You can encrypt files and folders in Windows 7, move the disk to a Windows XP computer, and still have access to protected information.\n\nDiskInternals can recover files and folders from damaged volumes using BitLocker encryption. To recover files and folders from the encrypted drive, launch EFS Recovery and enter your volume Recovery Key. If the key matches, the product will automatically scan the BitLocker volume to locate any recoverable files and folders, detecting and fixing file system errors if that option is selected. Everything happens completely automatically; all you need to do is selecting which files to recover.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.18.1","version":0,"site":"https://www.diskinternals.com/","source":"DiskInternals Research","license_or_tos":"Proprietary","resources":null,"verified":false}