{"appId":"w:DiskInternals.DVRRecovery","appShortcutName":"DiskInternals DVR Recovery","appDisplayName":"DiskInternals DVR Recovery","authorId":"w:winget","releaseTagName":"winget-2.16.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Recovery of video recordings from corrupted, erased or healthy Dahua and HikVision NVR\n\nDiskInternals DVR Recovery™ is CCTV DVR data recovery software. With DVR Recovery™ you get video and metadata, which can be used for digital forensic investigations. DVR Recovery™ can be used for recovering video recordings directly from CCTV DVR HDDs or SD cards; no passwords are required to recover deleted or overwritten recordings.\n\nDVR data recovery is a special process, which requires special DVR recovery tools. Thus it’s important to have high-quality DVR recovery software such as DiskInternals DVR Recovery to recover the vast majority of deleted CCTV video records.\n\nCountless hours of video footage can be restored by this CCTV data recovery software. Imagine having important footage of a crime that gets accidentally deleted.\n\nSupported DVR Recorders:\n- HikVision, HikVision NVR, HikVision NAS, HikVision NVR NAS.\n- Dahua, Dahua NVR, DHFS (Dahua File System), DHFS over ISCSI\n\nDVR Recovery™ scans all available data and recovers found recordings. Sorting and filtering are possible. This makes it easy to identify the video clip you need. The sorting and filtering tools make this DVR video recovery software easy to use.\n\nDVR Recovery™ offers various options for exporting recovered DVR videos while keeping the original data intact — this is essential for forensic usage.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.16.1","version":0,"site":"https://www.diskinternals.com/","source":"DiskInternals Research","license_or_tos":"Proprietary","resources":null,"verified":false}