{"appId":"w:DiskInternals.MailRecoveryExpress","appShortcutName":"DiskInternals Mail Recovery Express","appDisplayName":"DiskInternals Mail Recovery Express","authorId":"w:winget","releaseTagName":"winget-5.15","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mail Recovery Express is a robust tool that detects email accounts, scans them for damages and restores their contents as EML files. It can work with several accounts at a time and allows importing them between systems.\n\nMail Recovery Express is a robust tool that detects email accounts, scans them for damages and restores their contents as EML files. It can work with several accounts at a time and allows importing them between systems. File preview can show just message headers or the whole messages. Moreover, each message is shown as either text or an HTML page. Here you can choose particular messages for recovery to speed up the Mail Recovery Express. The variety of options aims at fast and accurate recovery of email accounts and their contents.\n\nTo make the repair even easier, the program offers export and import wizards that help detect accounts, choose messages, and save them to a given destination. After you import a DBX file, look through messages, and choose the ones to be recovered, the export wizard will extract them from the damaged database and save as separate EML files. Mail Recovery Express can also extract attachments and HTML letters so that all your precious data can be recovered and the email account restored.\n\nMail Recovery Express integrates with other DiskInternals solutions to provide the user with a single toolkit for emergency tasks. All the solutions feature customary Windows interface and blend with your system without destroying its integrity. Mail Recovery Express in particular looks just like your trusted email service. It provides wide functionality and prevents data loss. Its core functionality, including file preview, is also available in the freeware version. If you have problems with an email account, give it a try and make sure of its skills.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.15","version":0,"site":"https://www.diskinternals.com/","source":"DiskInternals Research","license_or_tos":"Proprietary","resources":null,"verified":false}