{"appId":"w:DiskInternals.OfficeRecovery","appShortcutName":"DiskInternals Office Recovery","appDisplayName":"DiskInternals Office Recovery","authorId":"w:winget","releaseTagName":"winget-5.20.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Recover deleted or corrupted Microsoft Office, Outlook, Access, OpenOffice, or LibreOffice files\n\nRecover deleted or corrupted Microsoft Office, Outlook, Access, OpenOffice, or LibreOffice files\n\nDiskInternals Office Recovery scans the entire surface of your hard drive in order to locate all Microsoft Office documents that are still there. In order to find the documents, it uses a set of signatures that are characteristic for the Office file types. The file system is also scanned in order to retrieve the names of the files. The results of disk scan are matched against information contained in the file system, and you are presented with a complete list of all Microsoft Office documents that are on the disk and that are still possible to recover.\n\nDiskInternals Office Recovery offers an extensive set of filters allowing you to display only the files that you need with just a few mouse clicks. If you need a DOC file that you know you worked with today, you simply activate the File Format and Date filters, and only the Word documents that were modified on this day will be displayed. If you don't remember the name of the file, but know its title or the person who created the document, the Title and Author filters will show you those files. Similarly, if you only remember a line or even a few words of text from the document, you can instantly locate that particular file by activating the Text filter.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.20.1","version":0,"site":"https://www.diskinternals.com/","source":"DiskInternals Research","license_or_tos":"Proprietary","resources":null,"verified":false}