{"appId":"w:DiskInternals.MailRecovery","appShortcutName":"DiskInternals Mail Recovery","appDisplayName":"DiskInternals Mail Recovery","authorId":"w:winget","releaseTagName":"winget-5.15","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DiskInternals Mail Recovery is able to locate, recover and fix broken Outlook Express, Vista Mail, Microsoft Outlook, Thunderbird and TheBat email databases on severely corrupted and damaged disks in one action.\n\nDiskInternals Mail Recovery is able to locate, recover and fix broken Outlook Express, Vista Mail, Microsoft Outlook, Thunderbird and TheBat email databases on severely corrupted and damaged disks in one action.\n\nRecover and repair lost or corrupted Outlook Express and Vista Windows Mail databases and messages automatically. Even if your email is completely gone, DiskInternals Mail Recovery scans the entire hard disk and locates the deleted email folders, recovers the files and repairs the database if it is corrupted.\n\nDiskInternals Mail Recovery combines the functionality of two great data recovery products in a single convenient package. Think of DiskInternals Uneraser and Outlook Express Repair combined for greater convenience and flexibility!\n\nDiskInternals Mail Recovery support file system as UFS, exFAT, NTFS, FAT, ReFS, HFS, Ext2/3/4, ReiserFS, XFS, Reiser4, RomFS(reader).\n\nDeleted files, corrupted file systems and damaged disks often result in data corruption. What use would be a corrupted email database to you if you cannot access your messages with Outlook Express? DiskInternals Mail Recovery will repair the corrupted email database, allowing you to access your email in Outlook Express without a problem!\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.15","version":0,"site":"https://www.diskinternals.com/","source":"DiskInternals Research","license_or_tos":"Proprietary","resources":null,"verified":false}