{"appId":"w:DiskInternals.OutlookRecovery","appShortcutName":"DiskInternals Outlook Recovery","appDisplayName":"DiskInternals Outlook Recovery","authorId":"w:winget","releaseTagName":"winget-5.15","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DiskInternals Outlook Recovery recovers messages and attachments lost or deleted from the Deleted Items folder, and repairs corrupted PST and OST databases produced by all versions of Microsoft Outlook including the latest Outlook 2007.\n\nDiskInternals Outlook Recovery recovers messages and attachments lost or deleted from the Deleted Items folder, and repairs corrupted PST and OST databases produced by all versions of Microsoft Outlook including the latest Outlook 2007. The new recovery tool recovers all email messages, attachments, Outlook and WAB contacts, tasks and calendars from healthy and corrupted Outlook databases, including parts of damaged PST files.\n\nThe revamped Outlook recovery engine is able to locate, recover and repair damaged Outlook databases from formatted, corrupted and repartitioned hard disks, and can reconstruct highly fragmented PST files from multiple parts randomly distributed on the disk. The new Outlook recovery engine makes it possible to extract useful information including email messages, attachments, address books, tasks, etc., from separate fragments of large PST files.\n\nDiskInternals Outlook Recovery provides fully automated recovery, repair and extraction of messages, contacts and appointments for lost and damaged PST and OST files. Whether your hard disk is healthy or badly damaged, DiskInternals Outlook Recovery is able to scan the entire surface of the hard drive in order to locate, recover and repair damaged Outlook databases. The recovery is completely automatic. Just select the disk that contains your email, and DiskInternals Outlook Recovery will do the rest automatically!\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.15","version":0,"site":"https://www.diskinternals.com/","source":"DiskInternals Research","license_or_tos":"Proprietary","resources":null,"verified":false}