{"appId":"w:DisplayLink.GraphicsDriver","appShortcutName":"DisplayLink Graphics","appDisplayName":"DisplayLink Graphics","authorId":"w:winget","releaseTagName":"winget-12.0.367.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Driver for DisplayLink USB graphics chipsets incorporated in your dock, adapter or monitor\n\n\nDisplayLink software release 12.0 delivers:\n- New features for DL-41xx series:\n    - Added support for flipping the display horizontally and vertically using VCP codes via DDC/CI.\n- General stability updates and bug fixes\n\nC1. Issues Fixed Since 11.7 M0 Release (11.7.4969.0)\nIssues Fixed in 12.0 M0 Release (12.0.273.0)\n----------------------------------------------------\n- DL-7xxx: Improved stability under heavy load with monitors in clone mode. (VIFR-5292)\n- DL-7xxx: Resolved an issue where monitors could remain blank after resuming the device from USB suspend. (VIFR-6275, VIFR-6542)\n- DL-7xxx: Resolved a problem where analog audio would stop functioning after the audio device was unplugged and reconnected. (VIFR-6056)\n- Resolved an issue where the driver could delay system shutdown. (VIFR-6275)\n\nIssues Fixed in 11.7 M4 Release (11.7.5813.0)\n----------------------------------------------------\n- DL-7xxx: Resolved an issue where monitors remained blank after replugging the video cable or switching to \"PC screen only\" mode. (VIFR-6304)\n- DL-6xxx: Fixed audio stuttering during video playback on ARM64 platforms. (VIFR-6124, VIFR-6543)\n- Improved video mode availability on certain monitors where some modes were previously not offered. (VIFR-6402)\n\nIssues Fixed in 11.7 M3 Release (11.7.5493.0)\n----------------------------------------------------\n- DL-7xxx: Some monitors emits noise when changing resolution or frequency. (VIFR-6027)\n- DL-7xxx: Resolved an issue where certain monitors could intermittently blink during normal operation. (VIFR-6380)\n- DL-7xxx: Addressed an issue preventing some monitors from being activated. (VIFR-6412)\n\nIssues Fixed in 11.7 M2 Release (11.7.5277.0)\n----------------------------------------------------\n- DL-7xxx: Monitors interoperability issues. (VIFR-6199, VIFR-6200, VIFR-6278)\n- DL-1xx: Monitor keeps reconnecting. (VIFR-5564, VIFR-5497, VIFR-5576, VIFR-6237)\n\nIssues Fixed in 11.7 M1 Release (11.7.5026.0)\n----------------------------------------------------\n- DL-3xx0: Improved Ethernet stability after locking machine. (VIFR-6044)\n\nIssues Fixed in 11.7 M0 Release (11.7.4969.0)\n----------------------------------------------------\n- Added extension INF for MS usbaudio2 driver that enables selective suspend during inactivity. (VIFR-5435)\n- DL-7xxx: Fixed driver stability issues that could lead to unexpected splash screen apperance during cold boot. (VIFR-5828)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"12.0.367.0","site":"https://www.synaptics.com/","source":"DisplayLink Corp.","license_or_tos":"Proprietary","resources":null,"verified":false}