{"appId":"w:DolphinComputerAccess.EasyReader","appShortcutName":"Winget Application","appDisplayName":"Dolphin EasyReader","authorId":"w:winget","releaseTagName":"winget-11.0.5.622","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"EasyReader App removes barriers to accessible reading. With global links to libraries, it enables anyone with a print disability to read independently\n\n\nWe are pleased to announce that version 11.05 of EasyReader App is now available across all platforms:\n- iOS\n- iPadOS\n- Android\n- Amazon Fire\n- Windows\n- macOS (only with EasyReader Premium Plan)\n- You can also use EasyReader on Chromebooks which have Android app support enabled.\nNew in Dolphin EasyReader App Version 11.05\niOS Devices only:\n- Login Improvements: For libraries including Bookshare, RNIB Libraries, Google Classroom and MS Education.\n\nAll Devices and Operating Systems:\n- Enhanced Copy Protection: Books in Tibi (Norway) now protected with Dolphin DRM. This ensures text and audio books cannot be copied outside EasyReader.\n- France Éole Library: More book types available to download.\n- Help: Now available in Norwegian\n- Additional Improvements: Enhancements and fixes for RNIB Bookshare, MathML, SVG images and more.\n- Language Updates: App text available in most languages\n\nRead on for further details.\n\nProtect downloads with Dolphin DRM\nMany publisher partners have concerns around security of book content and therefore require libraries to ensure distributed content is secure, so that it can’t be used outside the targeted reading system.\nDolphin offers - and encourages library partners use - the Dolphin Digital Rights Management (DRM). This secures the downloaded content on the users’ local device, to prohibit misuse. It means the user is not able to copy large amounts of text to the device’s clipboard.\nThe Dolphin DRM does not require any backend changes for the library partner, as the protection scheme is applied on the download requests in EasyReader App.\nThe Dolphin DRM solution is available for downloaded DAISY, EPUB, MP3 audio and other formats on request. Dolphin DRM is currently used by:\n- Calibre Audio (UK)\n- Passend Lezen (Netherlands)\n- Tibi (Norway)\nFor more information about Dolphin DRM, and to organise this for your library, please contact the team at easyreader@yourdolphin.com\n\nFixes and improvements for library partners\nIn close partnership with our library partners, the latest update to version 11.05 includes these fixes:\n- Éole (France): Download fix\nA fix has been applied to enable downloads for more book types.\n- RNIB Bookshare (UK)\nFix to ‘My Assigned Books’ pagination. It now supports more than 10 books in this category.\n- MathML\nMathML expressions in EPUB now contains displays which include italics and spacing.\n- SVG\nA fix has been applied for some SVG images in EPUB, so they now display correctly.\n- EasyReader App language updates mean that the EasyReader App is available in most languages.\nLibrary Services Around the World\nEasyReader App is trusted by blind, partially sighted and neurodivergent readers around the world. EasyReader App now provides free global access to 49 accessible book and newspaper services, with more expected to join in 2025!\nDolphin remains committed to empowering people who are print impaired to read in a way that is accessible for them.\nTogether, our collaboration continues to remove barriers to accessible reading.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"11.0.5.622","site":"https://yourdolphin.com/","source":"Dolphin","license_or_tos":"Proprietary","resources":null,"verified":false}