{"appId":"w:DoltHub.Dolt","appShortcutName":"Dolt","appDisplayName":"Dolt","authorId":"w:winget","releaseTagName":"winget-1.81.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/dolthub/dolt/releases/download/v1.81.1/dolt-windows-amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Dolt is a SQL database that you can fork, clone, branch, merge, push and pull just like a git repository.\n\nDolt is a SQL database that you can fork, clone, branch, merge, push and pull just like a git repository.\nConnect to Dolt just like any MySQL database to run queries or update the data using SQL commands.\nUse the command line interface to import CSV files, commit your changes, push them to a remote, or merge your teammate's changes.\nMerged PRs\ndolt\n- 10347: fixed output bug for foreign key constraints\ngo-mysql-server\n- 3389: remove convertLeftAndRight\n  This PR removes c.convertLeftAndRight, which avoids calls to c.Left().Type() and c.Right().Type().\n  Not entirely sure why receiver methods would impact performance this much, but benchmarks say so.\n  Benchmarks: #10342 (comment)\n- 3384: Look at every join node parent when computing outer scopes.\n  Previously, when building scopes for subqueries that appear inside joins, we would only track a single parent join node. If the subquery had multiple join parents, we would only be able to resolve references to the innermost subquery. This inhibits the optimizations we can perform.\n  This PR uses a custom tree walker to track a list of parent join nodes, and includes an example of a query that was not previously possible to optimize.\n- 3370: Wrap errgroup.Group.Go() calls for consistent panic recovery\n  Each spawned goroutine needs a panic recovery handler to prevent an unexpected panic from crashing the entire Go process. This change introduces a helper function that wraps goroutine creation through errgroup.Group and installs a panic recovery handler and updates existing code to use it.\nvitess\n- 448: Move SERIAL type out of numeric type definitions so that unsigned value is not overwritten\n  fixes #10345\n  MySQL docs\n- 446: Added DISTINCT ON expressions\n  Related PRs:\n  - dolthub/go-mysql-server#3369\n  - dolthub/doltgresql#2181\nClosed Issues\n- 10345: SERIAL type alias creates signed BIGINT instead of unsigned\n- 10329: Foreign key constraint doesn't enforce index requirement on receiving table","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.81.1","version":0,"site":"https://github.com/dolthub/dolt","source":"DoltHub","license_or_tos":"Apache-2.0","resources":null,"verified":false}