{"appId":"w:DoltHub.Dolt","appShortcutName":"Winget Application","appDisplayName":"Dolt","authorId":"w:winget","releaseTagName":"winget-1.51.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/dolthub/dolt/releases/download/v1.51.2/dolt-windows-amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Dolt is a SQL database that you can fork, clone, branch, merge, push and pull just like a git repository.\n\nDolt is a SQL database that you can fork, clone, branch, merge, push and pull just like a git repository.\nConnect to Dolt just like any MySQL database to run queries or update the data using SQL commands.\nUse the command line interface to import CSV files, commit your changes, push them to a remote, or merge your teammate's changes.\nMerged PRs\ndolt\n- 9089: refactor: use the built-in max/min to simplify the code\n  Contribution: #9044\n- 9084: [no release notes] Handle NULL adaptive values\n  NULL Adaptive values weren't being properly handled in all codepaths. Some operations during tuple building (such as trying to move them out of band) caused a panic. This fixes that and adds tests.\n- 9083: Support for non-MySQL query elements during merge\n  During the merge operation, Dolt creates a CREATE TABLE statement for the table being merged, parses it, and uses that information during the merge. This PR allows this process to work with a non-MySQL dialect.\n- 9075: Don't alter branch head outside of transactions when amending a commit\n  Fixes: #9072\n- 9071: Fix typo mistake of commmitted\n  Thanks to @jbampton\n- 9067: go: sqle/dprocedures: Implement operational inspection hook, dolt_thread_dump stored procedure.\n- 9066: go/store/nbs: Add info level logging for a store conjoin.\n- 9044: refactor: use the built-in max/min to simplify the code\n  Use the built-in max/min from the standard library in Go 1.21 to simplify the code. https://pkg.go.dev/builtin@go1.21.0#max\n- 9013: Add Adaptive Inline encoding\n  Adaptive Inline encoding refers to values that can be stored either inline in a table, or out-of-band in external storage. Postgres calls them TOAST (The Oversized-Attribute Storage Technique) types.\n  This PR adds two new encoding types: one for toasted TEXT columns and one for toasted BLOB columns.\n  The important parts of this PR are:\n  - The new encoding values StringToastEnc and BytesToastEnc\n  - The ToastValue type: this type has methods for creating and inspecting TOAST values.\n  - The changes to prolly.PutField and prolly.GetField to handle writing reading and writing these encodings to tuples\n  - The changes to TupleBuilder, which choose an inline or outlined representation for each value with a TOAST encoding. It prefers to store these values inline, but selectively outlines columns in a deterministic way if the length of the tuple would otherwise exceed a threshold. (Currently 2KB, not currently configurable.)\n    It is not currently possible to use these encodings in Dolt proper. For testing purposes, a variable schema.UseToastTypes has been added. Setting this variable to true will cause Dolt to use these toast encodings for TEXT and BLOB columns instead of the normal address encodings.\ngo-mysql-server\n- 2927: Converting a nil value should return nil, not panic.\n  Most uses of convertValue checked if the input was nil, but Binary.Eval didn't.\n  NULL should always be converted to NULL, so we can just put the check there.\n- 2926: Provide a SchemaFormatter interface to complement the SqlParser interface\n  Dolt uses functions in the sql package to create and then parse CREATE TABLE statements as part of the merge process. Therefore, we need the ability to create these statements for other dialects, just as we do for MySQL.\n  This PR also exposes a Noop auth method for the same use case.\n- 2924: fix ifnull typing\n  fixes #9076\n- 2923: fix AND optimization\n  This PR fixes AND optimizations where TRUE & x -> x.\n  Probably should've seen this coming given our bug fix with OR here,\n  fixes: #9074\n- 2921: fix not equal conversions\n  fixes: #9052\n- 2913: insert trigger bugs\n  fixes: #9039\n  Inserts nested inside triggers is a special case that we have minimal testing for. Some of the things that were broken before:\n  - we did not prepend nodes inside trigger->insert blocks, so new columns were not accessible / the index offsets estimated based on prepending trigger rows were invalid\n  - subqueries inside trigger->insert that have no outer visibility did not make exceptions for trigger rows, which act like lateral rows\n  - prepending rules are flaky and mistakenly prepended in-between project->project nodes\n- 2893: Add Wrapper values\n  This PR adds support for Wrapper values, a new type of value that the storage layer can provide to the engine. This is a generalization of the existing JsonWrapper interface, but is not limited to JSON values.\n  Wrapper types are useful because they can represent a value in storage without needing to fully deserialize that value for the engine. The primary use case is for \"out-of-band\" storage values, such as large BLOB or TEXT values that aren't stored directly in tables.\n  The Wrapper interface has the following methods:\n  Unwrap/UnwrapAny - These methods both deserialize the wrapped value and return it. UnwrapAny returns an interface{}, while Unwrap has a parameterized return type. The implementation is encouraged to cache this value.\n  IsExactLength - Returns true if the size of the value can be known without deserializing it.\n  MaxByteLength - The length of the value in bytes. If IsExactLength is true, this is the exact length of the value. Otherwise, it's an upper bound on the length of the value, determined by the schema of the table the value was read from.\n  Compare - Some Wrapper implementations may be able to compare wrapped values without needing to deserialize them. This method returns a boolean indicating whether or not this \"short-circuit\" comparison is possible, and an int indicating the result of the comparison.\nClosed Issues\n- 9072: Potential concurrency Issue with call dolt_commit('--amend')\n- 9076: Unexpected type conversion in IFNULL\n- 9074: Incorrect optimization of AND operation in expression in WHERE clause\n- 9052: Incorrect optimization of OR operation in expression in WHERE clause\n- 9039: Trigger LEFT_JOIN indexing error","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.51.2","site":"https://github.com/dolthub/dolt","source":"DoltHub","license_or_tos":"Apache-2.0","resources":null,"verified":false}