{"appId":"w:DoltHub.Dolt","appShortcutName":"Winget Application","appDisplayName":"Dolt","authorId":"w:winget","releaseTagName":"winget-1.51.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/dolthub/dolt/releases/download/v1.51.3/dolt-windows-amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Dolt is a SQL database that you can fork, clone, branch, merge, push and pull just like a git repository.\n\nDolt is a SQL database that you can fork, clone, branch, merge, push and pull just like a git repository.\nConnect to Dolt just like any MySQL database to run queries or update the data using SQL commands.\nUse the command line interface to import CSV files, commit your changes, push them to a remote, or merge your teammate's changes.\nMerged PRs\ndolt\n- 9100: Consistently use pointer receivers for TextStorage methods.\n  For structs that are exclusively used in interfaces, there's no reason to not use pointer receivers instead of value receivers. Using value receivers can cause the struct to be copied every time the method is invoked.\n  Pointer receivers are also more correct here: copying the struct means that changes to the ImmutableValue field (such as setting its Buf field in ImmutableValue.GetBytes) won't be saved when the method exits, defeating the caching of values loaded from storage.\n- 9098: Add support for SSL connections to a source MySQL server\n  Allows a replica Dolt sql-server to connect to a MySQL source via SSL when the SOURCE_SSL configuration parameter is supplied.\n  Depends on: dolthub/go-mysql-server#2930\n- 9097: Prevent unnecessary bytes <-> string conversions and unnecessary allocations when converying to bytes.\n- 9095: Add the archive --purge flag to clean up table files\n  The dolt archive command is extra safe, and doesn't cleanup table files is converts. The --purge flag will delete table files after the conversion is done.\n- 9085: Adding new copy-tags command\ngo-mysql-server\n- 2932: Optimize ConvertToBytes by avoiding unnecessary string <-> bytes conversions and copies.\n  ConvertToBytes is a commonly called function to get the string representation of a value. However, it has some unnecessary allocations where a child function allocates a byte buffer, only for the result to be copied into the buffer provided by the parent function. In other places we needlessly round-trip between string and []byte.\n  This PR improves performance by removing some of these unneeded copies. In places where ConvertToBytes calls a function that allocates a buffer (instead of using the buffer that ConvertToBytes can provide), we can optimize by using the returned value without copying it again.\n  Dolt shows a 7% improvement in the types_table_scan benchmark.\n  We can potentially do even better by allowing these child functions to take a buffer, removing the need for an extra allocation.\n- 2930: Add support for SSL connections to a source MySQL server\n  Adds GMS support for the SOURCE_SSL MySQL replication configuration param.\n- 2928: implement stddev_pop(), stddev_samp(), var_pop(), var_samp(), and aliases\n  This PR implements STD() and VARIANCE() and its aliases.\n  docs: https://dev.mysql.com/doc/refman/8.4/en/aggregate-functions.html#function_std\n  syntax: dolthub/vitess#409\n  fixes: #9088\n- 2926: Provide a SchemaFormatter interface to complement the SqlParser interface\n  Dolt uses functions in the sql package to create and then parse CREATE TABLE statements as part of the merge process. Therefore, we need the ability to create these statements for other dialects, just as we do for MySQL.\n  This PR also exposes a Noop auth method for the same use case.\nvitess\n- 409: add var_samp to keywords\n- 408: Add support for SOURCE_SSL replication option\n- 407: remove incorrect continue statement which skips handling connection\n  Caught in PR.\nClosed Issues\n- 9088: Request for STDEV_POP() (and aliases) and VAR_POP() (and alias)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.51.3","site":"https://github.com/dolthub/dolt","source":"DoltHub","license_or_tos":"Apache-2.0","resources":null,"verified":false}