{"appId":"w:DominikReichl.KeePass","appShortcutName":"KeePass","appDisplayName":"KeePass","authorId":"w:winget","releaseTagName":"winget-2.60.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"KeePass, the free, open source, light-weight and easy-to-use password manager.\n\nKeePass Password Safe is a free, open source, lightweight, and easy-to-use password manager for Windows, Linux and macOS, with ports for Android, iPhone/iPad and other mobile devices.\nWith so many passwords to remember and the need to vary passwords to protect your valuable data, it’s nice to have KeePass to manage your passwords in a secure way.\nKeePass puts all your passwords in a highly encrypted database and locks them with one master key or a key file. As a result, you only have to remember one single master password or select the key file to unlock the whole database.\nAnd the databases are encrypted using the best and most secure encryption algorithms currently known, AES and Twofish.\nNew features:\n- Added option 'Search for group paths in quick searches' (in 'Tools' → 'Options' → tab 'Interface (1)', turned on by default).\n- Added optional main entry list columns 'Group Path' and 'Group Name' (both turned off by default, can be turned on in 'View' → 'Configure Columns').\n- In list views that support selecting multiple items, all items can now be selected by pressing Ctrl+A.\n- In list views that have a corresponding 'Delete' button, the selected items can now alternatively be deleted by pressing the Delete key.\n- Added empty state messages for list views.\n- The placeholder confirmation dialog now contains links to the help pages on placeholders and security.\n- If the global auto-type hot key is Ctrl+Alt+A and the new French Standard AZERTY keyboard layout (introduced in Windows 11 24H2) is active, KeePass now shows a warning dialog (telling the user that Ctrl+Alt+A is in conflict with a system key combination producing a character and where it can be changed).\n- Added 'More information' link in the Ctrl+Alt+A conflict warning dialog.\n- The clipboard clearing countdown bar now has a tooltip that shows the remaining number of seconds.\n- When the optimization for screen readers is active, the clipboard clearing countdown bar is now an alert.\n- When the optimization for screen readers is active, quality progress bars can now be focused (using the Tab key).\n- Added support for importing Mozilla Firefox 143 passwords CSV files.\n- Bitwarden JSON import: if the value of a 'totp' field consists only of Base32 characters, it is now treated as a shared secret for time-based one-time password generation.\n- Added support for parsing Unix timestamps in milliseconds.\n- Added workaround for focus bug after returning from a secure desktop.\n- ShInstUtil is now built using Visual Studio 2022.\n- ShInstUtil: added support for generating native ARM64 images (NGen) on ARM64 systems.\n- When using the MSI file for installing KeePass, native images (NGen) are now generated and the start-up performance is optimized (as the regular installer does by default).\nImprovements:\n- It is now possible to select an item in the drop-down list of the quick search box using the keyboard (the quick search box can be focused by pressing Ctrl+E, and the drop-down list can be opened by pressing Alt+↓).\n- Disabled auto-completion of the quick search box (because the auto-completion causes a bug when trying to search for a new text while the drop-down list is being displayed).\n- The commands 'Show HMAC-Based OTP' and 'Show Time-Based OTP' now display the generated OTP with a larger font (on Windows Vista and later).\n- In order to avoid selection/Ctrl+A problems, the entry string name auto-completion now does not append suggestions anymore; it only shows a list of suggestions (in which a suggestion can be selected manually).\n- In the entropy collection dialog, the number of bits generated using the mouse is now displayed on the quality progress bar.\n- The value of a 'File/URL' or 'Key file' field of a trigger event/condition/action may now optionally be enclosed in double quotation marks.\n- When shutting down the system, KeePass now saves the configuration immediately.\n- Improved parsing of floating-point numbers in some places.\n- When trying to use the Windows user account as master key component and the 'ProtectedUserKey.bin' file cannot be decrypted, KeePass now shows an error message and does not overwrite the file anymore.\n- Improved handling of unsupported custom icons.\n- Improved handling of invalid handle values.\n- Improved plugin loading error messages.\n- Improved native structure tests.\n- ShInstUtil: improved command line handling.\n- ShInstUtil: improved uninstallation of native images (NGen).\n- ShInstUtil: improved .NET check.\n- Upgraded installer.\n- MSI setup: when updating from KeePass 2.60 to a newer version, shortcuts created manually by users (e.g. pinned to the start menu or the taskbar) should not break anymore.\n- Various code optimizations.\n- Minor other improvements.\nBugfixes:\n- (None).","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.60.0","version":0,"site":"https://keepass.info/","source":"Dominik Reichl","license_or_tos":"GPL-2.0","resources":null,"verified":false}