{"appId":"w:DominikReichl.KeePass","appShortcutName":"KeePass","appDisplayName":"KeePass","authorId":"w:winget","releaseTagName":"winget-2.59.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"KeePass, the free, open source, light-weight and easy-to-use password manager.\n\nKeePass Password Safe is a free, open source, lightweight, and easy-to-use password manager for Windows, Linux and macOS, with ports for Android, iPhone/iPad and other mobile devices.\nWith so many passwords to remember and the need to vary passwords to protect your valuable data, it’s nice to have KeePass to manage your passwords in a secure way.\nKeePass puts all your passwords in a highly encrypted database and locks them with one master key or a key file. As a result, you only have to remember one single master password or select the key file to unlock the whole database.\nAnd the databases are encrypted using the best and most secure encryption algorithms currently known, AES and Twofish.\nNew features:\n- On Windows 11 24H2 ARM64 and later, KeePass now runs natively, too (i.e. without x64 emulation).\n- Added KeePassLibN native support library, which provides native implementations of AES-KDF and Argon2 on Windows systems (x86, x64 and ARM64).\n- New C# AES-KDF implementation (about 30-50 times as fast as before, depending on the system; used when the native support library is unavailable or disabled).\n- New C# KeePass KDB import/export module, which now makes it possible to import/export KDB files on ARM64 systems and on Unix-like systems, too.\n- The KeePass KDB import/export module now supports importing and exporting the default user name and the database color.\n- When exporting a database to a KDB file, the root group is now exported, too.\n- The 'About KeePass' dialog now displays the architecture of the current process ('x86'/'x64'/'ARM64'/... instead of only '32-bit'/'64-bit').\n- Added support for opening URLs with Maxthon, SeaMonkey and Yandex in private mode.\n- On Unix-like systems, URLs in certain views are now linkified.\n- Some development snapshots can now load DLL plugins.\n- Added framework-specific solution and project files for Visual Studio 2022.\nImprovements:\n- Encrypting/decrypting databases using the AES algorithm is now faster.\n- The option for using the native support library now also applies to Argon2.\n- Native support library settings are now respected when using KeePass as a library (e.g. KPScript or PowerShell script).\n- When clicking the [OK] button of the options dialog, volatile settings (such as the main window position/size) are now saved, too.\n- When an exception occurs while exporting data, it is now shown in the status logger dialog, if one is displayed.\n- Improved formatting of multiline messages in the status logger dialog.\n- The KeePass KDB import/export module now refuses to use a master key containing an XML key file (because KeePass 1.x does not support XML key files).\n- The KeePass KDB export module does not export unnecessary auto-type sequence definitions anymore.\n- Improved removal of dangling custom icon references.\n- KeePass is now built using Visual Studio 2022.\n- Increased target framework version.\n- Improved efficiency of some algorithms that use a set.\n- Improved creation of AES CSP objects.\n- Improved project cleanup script.\n- Removed KeePassLibC native support library (because it is not used by KeePass 2.x anymore; KeePassLibC continues to be available in the KeePass 1.x source code package); the installer deletes it when updating an existing KeePass installation.\n- Installer: updated native image (NGen) size estimation.\n- Upgraded installer.\n- Various UI text improvements.\n- Various code optimizations.\n- Minor other improvements.\nBugfixes:\n- The 'Test' button on the 'Security' tab page of the database settings dialog does not ignore the option for using the native support library anymore.\n- The KeePass KDB import module does not append a new-line character to notes anymore.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.59.0","site":"https://keepass.info/","source":"Dominik Reichl","license_or_tos":"GPL-2.0","resources":null,"verified":false}