{"appId":"w:DominikReichl.KeePass","appShortcutName":"Winget Application","appDisplayName":"KeePass","authorId":"w:winget","releaseTagName":"winget-2.58.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"KeePass, the free, open source, light-weight and easy-to-use password manager.\n\nKeePass Password Safe is a free, open source, lightweight, and easy-to-use password manager for Windows, Linux and macOS, with ports for Android, iPhone/iPad and other mobile devices.\nWith so many passwords to remember and the need to vary passwords to protect your valuable data, it’s nice to have KeePass to manage your passwords in a secure way.\nKeePass puts all your passwords in a highly encrypted database and locks them with one master key or a key file. As a result, you only have to remember one single master password or select the key file to unlock the whole database.\nAnd the databases are encrypted using the best and most secure encryption algorithms currently known, AES and Twofish.\nNew Features:\n- When no entry is selected in the entry list of the main window, the details view now displays information of the current group (name, expiry time, tags, notes).\n- Added option 'Unhide empty data' (in 'Tools' → 'Options' → tab 'Advanced', turned off by default).\n- On the 'Preview'/'Generate' tab page of the password generator dialog, the average estimated quality of the generated passwords is now displayed.\n- Added Ctrl+H keyboard shortcut for the 'Show/hide password using asterisks' option in report dialogs.\n- Added 'User-Agent' header for HTTP/HTTPS/WebDAV web requests.\n- If Microsoft Edge has been uninstalled, it now no longer appears in the 'URL(s)' menu.\n- Added 'More Commands' item in the group and entry context menus (it shows the corresponding full menu).\n- Added 'Status' column in the triggers dialog.\n- Added support for comments in INI files.\n- Enhanced CodeWallet TXT import module.\n- Fatal error messages are now more detailed when running KeePass with the '-debug' command line option.\n- Added filter for duplicate MRU items (caused by an MRU item with an unsuitable database file path in an enforced configuration file).\n- Added filter for duplicate key source associations (caused by a key source association with an unsuitable database file path in an enforced configuration file).\n- Added solution and project files for Visual Studio 2022.\n- Added workaround for Mono's tree view right-click and context menu handling.\nImprovements:\n- When clicking on a group in the group tree of the main window, all entries are deselected now.\n- If the currently selected entry does not have parameters for generating time-based one-time passwords, the Ctrl+T and Ctrl+Shift+T keyboard shortcuts are now ignored.\n- Improved icon handling in certain entry lists (significantly faster creation of such a list when there are many entries with custom icons, reduced memory usage, reduced number of GDI objects, ...).\n- In the master key prompt dialog, toggling the hiding of the password now does not change the state of the password check box anymore.\n- When generating passwords for the 'Preview'/'Generate' tab page of the password generator dialog takes too long, it is now aborted.\n- Replaced status indicators on the 'Preview'/'Generate' tab page of the password generator dialog.\n- Increased the number of preview passwords to 50.\n- UI improvements in the trigger editing dialog.\n- After showing a command/placeholder confirmation dialog (cmd:// URI, {CMD:...} placeholder, {REF:P@...} placeholder), KeePass now focuses the previously focused window.\n- Renamed 'entry view' to 'details view' (because it can now also display details of a group).\n- Removed the group/entry duplication commands from the context menus (they continue to be available in the main menu).\n- Various improvements in some import modules.\n- Improved UUID zero tests.\n- The revision component of the assembly version is now invariant.\n- Improved PLGX cache item identifiers.\n- Improved project cleanup script.\n- Upgraded installer.\n- Various code optimizations.\n- Minor other improvements.\nBugfixes:\n- Fixed two image list handling bugs.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.58.0","site":"https://keepass.info/","source":"Dominik Reichl","license_or_tos":"GPL-2.0","resources":null,"verified":false}