{"appId":"w:dotNetInstaller.dotNetInstaller","appShortcutName":"dotNetInstaller","appDisplayName":"dotNetInstaller","authorId":"w:winget","releaseTagName":"winget-3.2.115.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A widely used, general-purpose setup bootstrapper for MS Windows.\n\ndotNetInstaller is a widely used, general-purpose setup bootstrapper for Microsoft Windows XP, 2003, Vista, 2008, 7, 8, 2012, 8.1, 10, 2016, 2019, 2022, and 11.\ndotNetInstaller enables the developer to define the application prerequisites and install the correct version(s) of these components in a predictable order based on the processor architecture, user operating system type and language, allow the user to download these components from the web, install these components directly from a single packaged setup, local media or both. dotNetInstaller is very feature rich and runs on all known Windows operating systems with a very tiny footprint.\nA boostrapper doesn't replace tools like InstallShield, Wise, Visual Studio Setup and Deployment Project or Wix. The goal is to create an application to help users with installing the correct prerequisites. Most real world applications need to install several components to work properly, including Windows Service Packs, Internet Explorer, MDAC or .NET Framework. This kind of applications are most commonly known as bootstrappers. dotNetInstaller is such a bootstrapper.\nFeatures\n- #146 - Added support for specific Windows 10 versions, Windows 11, Windows Server 2019, and Windows Server 2022 - @icnocop.\n- #144 - Fix: OSinfo not displaying correctly if server 2016 or 2019 - @icnocop.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2.115.0","version":0,"site":"https://dotnetinstaller.github.io/dotnetinstaller/","source":"DevAge, Vestris Inc. & Contributors","license_or_tos":"MIT","resources":null,"verified":false}