{"appId":"w:Drawpile.Drawpile","appShortcutName":"Drawpile","appDisplayName":"Drawpile","authorId":"w:winget","releaseTagName":"winget-2.3.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/drawpile/Drawpile/releases/download/2.3.0/Drawpile-2.3.0-x86_64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Drawpile is a Free software collaborative drawing program that allows multiple users to sketch on the same canvas simultaneously.\n\n\nCode signing policy: https://drawpile.net/codesigningpolicy/\n- Fix: Don't show \"exit layer view\" notice when there's no canvas.\n- Fix: Properly remove the \"unsaved changes\" marker when saving to DPCS.\n- Feature: Add crop to selection action in the selection menu. Not any different to the resize canvas action, but there for discoverability.\n- Feature: Allow using stabilizer and smoothing with lasso select tool.\n- Fix: Don't remember interpolation mode on transform tool, since it's too easy to mess up art from having a stale mode set.\n- Fix: Make mipmap usage in hardware renderer configurable, since it causes performance issues with some graphics cards or drivers. Defaults to off. Thanks Bluestrings and Sinamer for reporting.\n- Fix: Make setting the hue slider to 359 in HSL space not turn out gray. Thanks BornIncompetence for reporting.\n- Fix: Make sliders not show a text selection cursor on Android when they're not in edit mode.\n- Fix: Make layer list items not show a text selection cursor on Android.\n- Fix: Correctly calculate the distance to move before a press is no longer considered a long-press. The calculation ended up with incorectly small values in most cases.\n- Fix: Improve long-press handling for context menus to act more like a real right-click would.\n- Fix: Don't delay long-presses by left-click or touch kinetic scrolling.\n- Feature: Add touch draw pressure settings, because apparently some screen tablets on Android use touch inputs instead of stylus ones. Thanks SurgeonTaco for suggesting.\n- Fix: Make dragging a layer onto its own canvas not paste its contents. Dragging layers between different windows is still possible. Thanks Blozzom and Pepper for reporting.\n- Server Fix: Don't claim that dprec templates are incompatible when they're not.\n- Fix: Make the \"alpha lock layer for you\" a buttton in the layer dock, rather than having it in the lock menu. Otherwise the inherit alpha button is too confusing to people not used to that feature existing. Thanks Phoneme for reporting.\n- Feature: Add extra thickness to the color sampling ring in the area where the colors meet to give better visibility of the comparison. Thanks tiar for suggesting.\n- Feature: Allow toggling color sampling ring in the color picker tool settings.\n- Fix: Only add actually picked colors to the color picker history, not every color hovered over along the way.\n- Fix: Make opening settings dialog not exit fullscreen on Android.\n- Fix: On Android devices with a screen large enough to show a full desktop UI, dialogs no longer get full-screened by default. The start and settings dialogs also no longer use their vertical design meant for tiny screens. Thanks tiar for reporting.\n- Fix: Replace some symbols in messages that don't show up properly on Android with equivalent ones that do.\n- Fix: Default MyPaint brushes to use synchronized smudging, since many of them only work properly with it turned on.\n- Fix: Select proper file type and remove the extension on the name input field when saving on Android and the browser.\n- Fix: Make color picker color dialog use the current foreground color when manually adding a color. Thanks Phoneme for reporting.\n- Fix: Show an error message on Linux under Wayland when attempting to pick a color from the screen with a hint to use Xorg instead. Thanks Meru and Phoneme for reporting.\n- Fix: Remove pick from screen button in the browser, since it doesn't work there.\n- Fix: Don't enter fullscreen in the browser when reopening the main window. Thanks Bluestrings for reporting.\n- Feature: Skip the username selection when reconnecting to a session in the browser using a drawpile.net account. It now automatically picks the same username again as it does on other platforms.\n- Fix: Remember local state when reconnecting, such as layer/track visibility, sketch mode, alpha lock, view mode etc. Thanks Bluestrings and hpar for reporting.\n- Removed Feature: Migration of settings from very old versions of Drawpile. That code no longer works properly, but it's doubtful anyone would want to port their settings from a 2017 version of Drawpile anyway.\n- Fix: Make keyboards like GBoard not eat all your hardware keyboard shortcuts after editing text once. This is a patch to Qt. Thanks justanotatest for reporting.\n- Fix: Unfocus chat when collapsing it so that you don't continue typing into it while it's gone.\n- Fix: Fall back to the application storage on Android when proper storage is unavailable. This is a patch to Qt. Thanks Sherb for reporting.\n- Fix: Use different zoom levels for hardware and software renderers, depending on which ones work better in the respective modes.\n- Fix: Default hardware renderer to single-buffering, since the system default buffering can add an immense amount of input lag.\n- Feature: Three new layout presets under View → Layouts. Thanks Ausjamcian, lambda20xx and Scruff for providing them.\n- Feature: Several new brush presets in the Drawpile tag. Thanks Annoy, Blozzom and lambda20xx for providing them.\n- Fix: Properly disable the save as ORA/DPCS actions while another save is going.\n- Fix: Don't process brush dabs that are invisible due to being infinitesimally tiny, fully transparent or infinitely soft (as opposed to only skipping their processing when they fulfilled all three criteria.) Thanks Blozzom for reporting.\n  2025-10-18 Version 2.3.0-beta.4\n- Fix: Unpremultiply alpha values when exporting to animated WEBP so that partially transparent pixels come out looking correct.\n- Fix: Make the preferences menu item on macOS open the preferences again.\n- Fix: Make mouse wheel to adjust brush sizes not skip over small values on wheels that make big steps. Thanks Meiren for reporting.\n- Fix: Make zoom tool detect clicks properly, rather than detecting tiny motions as a rectangle to zoom into. Thanks Scruff for reporting.\n- Fix: Make freehand tool icon appear again if starting up with the eraser selected. Thanks Meiren for reporting.\n- Fix: Make software renderers handle canvas sizes with dimensions beyond 32767 pixels properly. Thanks Ben for reporting.\n- Fix: Open ORA files with width or height greater than 32767 pixels. Thanks Nimono for reporting.\n- Feature: Make true /roll messages in chat have a blue tint to make cheating more difficult. They're also translatable now, rather than always being in English. Thanks KosmonautKat, lambda20xx and Potete for suggesting.\n- Feature: Allow \"blocking\" of layers. It works like censoring a layer, but the censor is only visible to you. It lets you hide stuff you don't want to see, but still be aware that it's there so you don't draw over other people's art.\n- Fix: Make layer clipping onto pass-through groups work the same as it does in other programs (that is, make it not clip.)\n- Feature: Anti-overflow fill for brushes. Thanks Ausjamcian, Axocrat and Null for suggesting.\n- Feature: Exit Drawpile when the last window is closed on macOS, like on all other systems. You can reenable this behavior in the user interface preferences if you want it back.\n- Fix: Make clicking with touchpad not trigger touch color picker.\n- Fix: Properly enable or disable session permission boxes and sliders according to compatibility mode and operator status.\n- Fix: Make key frame visibility attributes work properly in compatibility mode.\n- Server Feature: Fast reconnects. Clients now remember the state of the history when they got disconnected and skip ahead in the catchup sequence if possible. Thanks Bluestrings for testing.\n- Server Fix: Don't restrict binary (.dprec) templates to the current version.\n- Fix: Disable native message boxes, they're broken on macOS Tahoe and don't add anything except an inconsistent appearance.\n- Fix: Make start, login, invite and numerous other dialogs have proper title bars on macOS, rather than being those weird sheets. Thanks Axocrat for reporting.\n- Fix: Don't show duplicate full screen action in view menu on macOS.\n- Fix: Make window maximized when leaving full screen on macOS, rather than crumpling it down to a small size and messing up the docks arrangement.\n- Feature: Allow closing modal dialogs on macOS using Command+Q. Thanks Axocrat for suggesting.\n- Feature: Increase/decrease key frame exposure actions for all visible tracks, bound to Ctrl+Shift+Alt+Plus/Minus by default. This lets you shift frames on multiple frames at once, rather than having to move each track individually.\n- Removed Server Feature: Socket activation. Attempting to pass sockets via systemd now just raises an error and tells you to uninstall drawpile-srv.socket. This was a pretty obscure feature that apparently wasn't working properly anyway and only ever seems to get used unintentionally. Thanks Bluestrings for reporting.\n- Feature: Binary interpolation mode for transforms. Works like Bilinear, but tries to keep the opacity of pixels the same so that you can scale stuff drawn with a binary brush without making it all blurry. Thanks TGS for suggesting.\n- Fix: Properly reconnect to sessions when using an invite code, rather than asking for a password the second time around.\n- Fix: Properly reconnect when using a WebSocket URL, rather than replacing the path inappropriately.\n- Fix: Don't incorrectly redo already gone undone commands after a series of undos and redos. Thanks Sinamer for reporting.\n- Feature: Don't ask for login method, username and password again when reconnecting. Thanks Meru for reporting.\n- Feature: Don't show chat until connecting to a session and remember the size of it even when it was hidden.\n- Feature: Send button in chat, for virtual keyboards where hitting return is inconvenient.\n- Feature: Make drawpile-timelapse command-line tool fill the background with the canvas background color instead of black.\n- Server Fix: Apply archive and size limit setting immediately, not only when a session is started.\n- Server Feature: Allow toggling archive mode on individual sessions instead of using server default. Thanks Bluestrings for suggesting.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.0","version":0,"site":"https://drawpile.net/","source":"Drawpile","license_or_tos":"GPL-3.0","resources":null,"verified":false}