{"appId":"w:dRofus.dRofus","appShortcutName":"dRofus","appDisplayName":"dRofus","authorId":"w:winget","releaseTagName":"winget-2.16.16.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://deploy.drofus.com/stable/drofus-setup-2.16.16.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The leading planning and data management tool for the global building industry\n\ndRofus is a unique planning, data management and BIM collaboration tool that provides all stakeholders with extensive workflow support and access to building information throughout the building lifecycle.\nUnlike any other planning tool on the market, dRofus was developed directly on behalf of public building owners. Capturing client requirements (EIR), validating design solutions (BIM) against client requirements, management of public standards and equipment planning are core features in the software.\ndRofus has strong ArchiCAD, Revit and IFC integration with bi-directional data sync capabilities.\nModel data from each discipline is captured, together with planning data, non-geometric data and documents, in a centralized database accessible to all project stakeholders via the dRofus desktop client and dRofus Web.\nTypically, stakeholders produce data using different software programs that have different data schemas, with different filetypes, distributed across multiple servers, located in multiple different locations - and often this data is not re-usable by others.\nThis is why dRofus has become an essential tool for BIM projects - we consolidate disparate data sets and convert them into project information, insight and intelligence accessible to all project stakeholders.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.16.16.0","version":0,"site":"https://www.drofus.com/","source":"dRofus AS","license_or_tos":"Proprietary","resources":null,"verified":false}