{"appId":"w:Dunes.WinNc","appShortcutName":"WinNc","appDisplayName":"WinNc","authorId":"w:winget","releaseTagName":"winget-11.3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.winnc.com/setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"WinNc, file manager for Windows\n\nWinNc is a file manager for Windows 11/10/8/7/Vista/XP/2003/2000/ME/98/95 that replaces the use of the existing Windows Explorer.\nDeveloped by a Dutch multimedia company called Dunes MultiMedia, WinNc uses the same key shortcuts and the same mouse functionality as a well-known DOS file manager, Norton Commander. \nThe product gives you direct drag-and-drop access to servers, network neighborhoods and other network computers in the double-pane interface, each of which function independently.\nIn addition to standard file-management functions such as formatting, copying, moving, deleting and editing files, WinNc lets you view inside compressed files as if they were directories (it allows you to split, encrypt and FTP files, too).\nWinNc can view JPEG, GIF, BMP, TGA, WMF, PCX, WAV, FLC, DOCS, XLS, HTML, MID and AVI files. \nIt supports extraction from WAV to MP3 files, ripping audio cd's to MP3 and converting WAV to MP3.\nA new feature in WinNc is the ability to record files on CDs or DVDs. \nWinNc is shareware and can be freely downloaded and distributed from the Dunes MultiMedia website.\n- Improved folder caching for faster navigation\n- Better scaling on high-DPI screens\n- Lower CPU use during background tasks\n- Enhanced drag-an-drop with external apps\n- Various bug fixes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.3.0.0","version":0,"site":"https://www.ontwerpbureaudunes.nl/","source":"Dunes MultiMedia","license_or_tos":"Proprietary","resources":null,"verified":false}