{"appId":"w:DuoSecurity.DuoDesktop","appShortcutName":"Duo Desktop","appDisplayName":"Duo Desktop","authorId":"w:winget","releaseTagName":"winget-7.15.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Duo Desktop helps enforce security posture requirements for endpoints by performing health checks before granting access to Duo-protected applications.\n\nDuo Desktop, formerly known as Duo Device Health, gives organizations more control over which laptop and desktop devices can access corporate applications based on the security posture of the device or presence of Duo Desktop installed on the endpoint.\nThere are three key components:\n1. Duo access policies that enforce application access based on device health.\n2. A native client application for supported Linux, macOS, and Windows clients that checks the security posture of the device when a user authenticates to an application protected by Duo's browser-based prompt with an applied Duo Desktop policy.\n3. Additional endpoint information provided in the Duo Admin Panel.\nThe first time users log in to an application protected by the web-based Duo Universal Prompt or traditional Duo Prompt with the Duo Desktop policy set to require the app, Duo prompts them to download and install Duo Desktop. After installing Duo Desktop, Duo blocks access to applications through the Duo browser-based authentication prompt (when displayed in a browser or in a supported thick client's embedded browser) if the device is unhealthy based on the Duo policy definition and informs the user of the reason for denying the authentication.\nWhen a user's device doesn't meet the security requirements of the Duo Desktop policy, Duo Desktop provides the user with steps they can take to remediate their security posture to align with the Duo Desktop policy on the application.\nNote: While Duo Desktop transmits collected information securely, this information is not uniquely identified. This means that a bad actor could intercept the Duo authentication prompt and create their own response to Duo's request for device health information and send that response up to Duo servers. Every authentication is uniquely identified, so a user cannot reasonably impersonate another user’s device information. You can limit this risk by enabling device registration.\n- Fixed an issue that prevented DuoConnect from being detected on the device.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.15.0.0","version":0,"site":"https://duo.com/","source":"Duo Security","license_or_tos":"Proprietary","resources":null,"verified":false}