{"appId":"w:Duplicati.Duplicati","appShortcutName":"Duplicati 2","appDisplayName":"Duplicati 2","authorId":"w:winget","releaseTagName":"winget-2.2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/duplicati/duplicati/releases/download/v2.2.0.0_stable_2025-10-23/duplicati-2.2.0.0_stable_2025-10-23-win-arm64-gui.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/duplicati/duplicati/releases/download/v2.2.0.0_stable_2025-10-23/duplicati-2.2.0.0_stable_2025-10-23-win-x64-gui.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Duplicati is a free, open source, backup client that securely stores encrypted, incremental, compressed backups on cloud storage services and remote file servers.\n\n\nAbout this release\nThis is the next stable release building on the 2.1 line and adds more features and stability fixes, and we are super excited to share this version!\nA big thanks to the supportive Duplicati user base who continues to contribute with fixes, issue reports and feature requests.\nThe most visual change for this version is the use of the new user interface, but there is also a massive list of fixes and improvements in this version. Below is a summary of some of the larger changes.\nIf you have already been using the beta release, this release is the same as v2.1.2.3.\nNew user interface\nThe new user interface is rewritten from scratch and has the same general structure as the previous one, but we made some things more user friendly and more visually appealing.\nShould you find a function that is lacking, we have included buttons to switch back-n-forth between the two user interfaces.\nNew backends\nWe added support for using the cloud services pCloud, Filen and Filejump.\nWe also added support for connections with SMB.\nThe new SMB backend can connect directly to a Windows share without needing to mount the folder or install SMB support, and it works on Windows, Linux and macOS.\nNew restore flow\nThe new restore flow is enabled by default and you should not notice anything other than faster restores!\nIn case there is an issue with this, it is possible to set the option --restore-legacy=true to fall back to the previous restore flow.\nNew signing keys\nThe packages are now signed by Duplicati Inc, and the Windows packages are signed with EV certificates.\nRemote source support\nWith this version it is now possible to make backups of local and some remote data.\nIn this version, S3, IDrive, SSH and CIFS sources are supported.\nThe UI does not yet support editing this nicely, but you can enter a path in the special format to \"mount\" the remote source.\nFor the commandline (and manual text entry in the UI) enter sources such as:\n// Linux/MacOS\n@/mnt/s3-data|s3://example?auth-username=...\n// Windows\n@X:\\server1|smb://server/share?auth-username=...\nThis will cause the backups to fetch data from the remote sources.\nWe will add an editor to the UI to allow browsing the remote sources, similar to the local files.\nArchive attributes support\nFor AWS S3 and Azure Blob Storage, Duplicati will now respect the archive attributes and not attempt to read and verify files that have been moved to cold storage.\nDatabase updates\nThis version updates the format of the local database to version 17.\nThis version updates the format of the settings database to v9.\nTo assist in downgrades there is now a bundled CommandLine.DatabaseTool.exe / duplicati-database-tool that can downgrade databases with minimal data loss.\nFor a downgrade from this version to 2.1.0.5 this will only drop a few indexes and not cause any data loss.\nBe sure to run the database tool before downgrading the install as the tool needs to be in the latest version.\nThrottle updated\nFor backups that throttle the transfer speeds, the new throttle logic uses a shared limit for the backup, where previous versions would apply the throttle for each individual stream.\nRemoved backends\nThe Sia backend has been removed due to an incompatible hardfork.\nThe Mega backend has been marked as unmaintained due to lack of a supported library.\nFor now, the Mega library still works, but you should migrate away from it. The new Mega S4 storage might be an option.\nUpdates to all backends\nAll backends are updated to handle timeouts in a granular manner.\nThis means the option --http-operations-timeout is no longer present, but instead there are now --read-write-timeout, --list-timeout, and -short-timeout. These have sensible defaults but are open for tweaking.\nThe option --allowed-ssl-versions is only present for the FTP backend, all other backends use the operating system to figure out what version to use.\nNew datafolder default location\nFor Duplicati running as a service there are now changes for the default folder location.\nIf you are not running Duplicati as a service/daemon, this change has no effect.\nWindows: Avoid storing data in C:\\Windows\\System32\\config\\systemprofile\\AppData\\Local\\Duplicati and prefer {CommonProgramData}\\Duplicati, usually resolving to C:\\ProgramData\\Duplicati.\nThis change is to counter an issue where Windows will wipe the C:\\Windows folder on major updates, and destroy the backup configuration in the process. If your service stores data under C:\\Windows you will see a warning in the user interface on startup.\nLinux: Avoid storing data in /Duplicati and prefer /var/lib/Duplicati.\nThis was caused by the update to .NET8 where the data folder was not resolved correctly and returned /, which is not the ideal place for storing data.\nIf you are using --server-datafolder or DUPLICATI_HOME, this has no effect on the database, but may cause your machineid and installid to change.\nThe machineid.txt and installid.txt would previously be stored in the local app data folder, even when using portable mode or choosing a specific data folder.\nThis has been fixed, so the files will now follow the database.\nIf you are using the Duplicati console or otherwise depend on these values, you need to move them into the folder where the database is stored.\nThis update also sets permissions on the data folder and the databases to prevent unauthorized access from local accounts.\nTo opt out of setting permissions on each startup, place a file named insecure-permissions.txt inside the data folder.\nOther large changes\n- New file and folder enumeration logic\n- Timeout logic on all backend operations\n- Improved database validation and repair logic\n- ServerUtil can output JSON for script integration\n- Improved support for having Duplicati behind a proxy\n- Updated throttle logic, all streams share the throttle\n- Improved repair logic\n- VSS is automatically on if running on Windows with sufficient privileges\n- Improved backend test function\n- Ability to suppress warnings\n- Support for remotely provided reporting url and remotely managed backup configs\n- Added support for Google IAM on Google Drive","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.2.0.0","version":0,"site":"https://www.duplicati.com/","source":"Duplicati Team","license_or_tos":"MIT","resources":null,"verified":false}