{"appId":"w:DygmaLabs.Bazecor","appShortcutName":"Bazecor","appDisplayName":"Bazecor","authorId":"w:winget","releaseTagName":"winget-1.8.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Bazecor configurator software allows you to remap any key and create up to 10 fully programmable layers for your Dygma Raise keyboard. It also allows you to create and manage superkeys, macros, and shortcuts.\n\n\nHi, Dygmates\nToday, we have a new Bazecor version. Compared to Bazecor 1.7, it brings two substantial updates:\n1. We've added a prompt after the firmware update to restore your layers.\nYour configuration will never be lost after a firmware update.\nScreenshot 2025-11-17 at 18 24 22\n2. We've added support for the new Superkeys.\nScreenshot 2025-10-21 at 17 34 36 Screenshot 2025-11-19 at 11 29 56\n- Now you configure all your multi-function keys in the Superkeys menu and then add them to your layout.\n- If you have \"Add a key on Tap\" in your layout, don't worry; you don't need to do anything. Bazecor will still recognize them. It's just for new ones.\n- There's a new Superkey Memory Usage indicator. You can add up to 70.\n- You'll also notice the new naming in Preferences > Typing and Keys, where you can adjust the timings for the Superkeys.\nScreenshot 2025-11-27 at 12 47 59\nThis second update only applies if you update your keyboard to the new Defy v2.2 and Raise 2 v1.4 beta firmware. If not, you'll still be able to configure \"Add a Key on Tap\" as before in the \"Layers and Modifiers\" submenu of the Layout Editor.\nHowever, you'll miss out on the new, improved Superkeys. You can now configure a key on TAP with a modifier (say, CTRL+C) and a key on HOLD with extra modifiers (say, SHIFT+CTRL), and they will behave like Add a Key on tap, with all the natural chording timeouts that allow you to use them as homerow modifiers without accidentally triggering keypresses.\nScreenshot 2025-10-21 at 17 33 29\nIf you configure additional functions (TAP&HOLD, 2-TAP, or 2-TAP&HOLD), the Superkeys will behave like Standard Superkeys, which are not as fast (and therefore not suitable for use in Alpha keys), but we have also reworked them to eliminate all the bugs.\nHere are all the details of the new firmware as well as instructions on how to update your keyboard:\n- Dygma Defy v2.2 beta 12\n- Dygma Raise 2 v1.4 beta 12\nFinally, we've merged the Advanced Layers and Advanced Modifiers submenus in the layout editor for simplicity.\nScreenshot 2025-11-19 at 11 35 42\nWhat's new from 1.7\n- Added a prompt after the firmware update menu to restore your layers.\n- Added support for the new Superkeys. If you have the Defy v2.2 or Raise 2 v1.4 firmware, all dual-function keys are configured in the Superkeys menu. This includes an updated Superkeys menu and updated settings in Preferences > Typing and Key.\n- Added a button to access the Superkeys menu from the layout editor.\n- Added a button to access the Macro Editor from the layout editor.\n- Merged the Advanced Layers and Advanced Modifiers submenus in the layout editor for simplicity.\n- Added a Superkey Memory Usage indicator to the Superkeys menu\n- Modified the instructions in the firmware update menu to indicate that you need to us the short Dygma cables for flashing the firmware.\nWhat's Changed\n- Superkeys 2.0 by @gonza2206 in #1065\n- Superkeys Limit & Firmware Update Dialog Improvements by @gonza2206 in #1070\n- feat: unify superkeys and qukeys hold timeout settings for sk20 keybo… by @gonza2206 in #1076\nFull Changelog: v1.7.0...v1.8.2","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.8.2","version":0,"site":"https://github.com/Dygmalab/Bazecor","source":"Dygma Lab S.L.","license_or_tos":"GPL-3.0","resources":null,"verified":false}