{"appId":"w:DygmaLabs.Bazecor","appShortcutName":"Bazecor","appDisplayName":"Bazecor","authorId":"w:winget","releaseTagName":"winget-1.7.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Dygmalab/Bazecor/releases/download/v1.7.0/Bazecor-1.7.0-Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Bazecor configurator software allows you to remap any key and create up to 10 fully programmable layers for your Dygma Raise keyboard. It also allows you to create and manage superkeys, macros, and shortcuts.\n\n\nHi, Dygmates\nToday, we have a new Bazecor version with a nifty little feature: you can now manually export backups in preferences.\nThis is really helpful if you want to save and name a specific configuration. This can be useful before making big changes to your layout or if you want to have a layout for Mac and another for Windows that you can easily load.\nScreenshot 2025-03-27 at 15 08 56\nRemember, Bazecor does an automatic backup of your configuration every time you save changes to the keyboard. This makes it easier to save one in particular 😊\nWhat's New\n- Added a button to export the current backup\n- Renamed the restore backup buttons to make them easier to understand\n- Fixed a bug where long macros would overflow in the preview window of the layout editor\n- Added a better explanation for \"Add key on tap\" in Advanced Modifiers\n- Removed the mouse movement options on Macros, as it was never supported by the firmware 😅\n- Removed the option to add Layer Shift on TAP in a Superkey, as it doesn't make sense\nWhat's Changed\n- fix: layer shift on TAP actions no longer possible by @alexpargon in #1023\n- fix: added text to better clarify adv. functions by @alexpargon in #1024\n- fix: wrap text around macro keypicker pre-visualization by @alexpargon in #1025\n- fix: mouse movements removed from macros actions due to incompatibili… by @alexpargon in #1026\n- feat: add Backup export button to preferences by @alexpargon in #1027\n- feat: added hidden prop to keys for kb layout by @alexpargon in #1028\nFull Changelog: v1.6.5...v1.7.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.7.0","version":0,"site":"https://github.com/Dygmalab/Bazecor","source":"Dygma Lab S.L.","license_or_tos":"GPL-3.0","resources":null,"verified":false}