{"appId":"w:Eassos.DiskGenius","appShortcutName":"DiskGenius","appDisplayName":"DiskGenius","authorId":"w:winget","releaseTagName":"winget-6.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download2.eassos.com/DGEngSetup6001631.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"All-in-one solution for IT professionals\n\nDiskGenius provides an all-in-one solution for data recovery, disk partition management and backup & restore for Windows PCs, Servers and workstations.\n- New\n  1. The \"Clone Disk\" feature supports multiple target disks.\n  2. The \"Erase Sectors\" feature supports multiple target disks.\n  3. The \"System Migration\" feature supports multiple target disks.\n  4. The \"Restore Image File To Disk\" feature supports multiple target disks.\n  5. Add the feature to share disks over the network.\n  6. The \"Verify Or Repair Bad Sectors\" feature supports multiple target disks.\n  7. Improve the speed of cloning EXT4 partitions by file.\n  8. Add the \"Refresh All Disks\" feature to update disk status.\n  9. Sector editing is supported for pmfx disk image files.\n  10. When recovering lost files, the program will automatically set file names for Office documents listed under the \"File type\" tab.\n  11. For partially encrypted BitLocker partitions, the program can automatically detect whether file data is encrypted during read operations.\n  12. Add Norwegian and Slovenian language packs.\n- Enhanced\n  1. Optimize the partition layout on target disks during disk cloning and backup/restore to better match the source disk.\n  2. Optimize the \"Partition Recovery\" feature.\n  3. Optimize the file recovery feature for NTFS partitions.\n  4. Optimize the file recovery feature for FAT32 partitions.\n  5. Strengthen the warning prompts before repairing bad sectors.\n- Fixed\n  1. Fixed the issue that Linux systems could not boot after disk cloning.\n  2. The File Recovery feature adds support for recovering AVIF files by file type.\n  3. Disabled direct sector editing and sector erasing operations on dynamic disks.\n  4. Fixed inaccurate prompts after errors occurred in copying EFS-encrypted files.\n  5. Fixed the issue that the \"Extend Partition\" feature sometimes failed to select free space.\n  6. Fixed the issue that the notes saved in partition and disk image files might be garbled.\n  7. Fixed the issue that the dynamic volumes were displayed as damaged.\n  8. Fixed the issue that the GUID partition table couldn't be loaded in certain cases.\n  9. Fixed display errors in the \"Clone Disk\" feature.\n  10. Fixed the issue that error might occur when backing up EXT4 partitions to image files.\n  11. Fixed the issue that when incrementally backing up partitions to image files, files that simply changed their attributes were not backed up again.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.0.0","version":0,"site":"https://www.eassos.com/","source":"Eassos Co., Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}