{"appId":"w:EdgeTX.Companion","appShortcutName":"EdgeTX Companion","appDisplayName":"EdgeTX Companion","authorId":"w:winget","releaseTagName":"winget-2.11.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The cutting edge open-source firmware for your R/C radio\n\nEdgeTX is the cutting edge of OpenTX. It is the place where innovative ideas and cutting-edge features are developed and field-tested by the enthusiasts of our hobby. EdgeTX is a community project – ideas from the community, developed by the community, and enjoyed by the community! The community will always have a say in what EdgeTX is and what EdgeTX will be in the future. Without community feedback and involvement EdgeTX cannot exist.\nWe are pleased to announce the fifth maintenance release for EdgeTX \"Jolly Mon\", v2.11.5. Thank you for all the feedback and testing by you, the community (and partner manufacturers) which has allowed us to identify and squash both new and old bugs!! We simply cannot have done this without you! 🤗 🍻\nNote\n- As with any firmware update, please ensure you back up your model and radio settings before updating, fully bench-test your models after updating, and report any issues you encounter.\n- For MacOS users, Companion is now only compiled for MacOS 12 and above. Stay with v2.10.5 or earlier if you need support for an older version of MacOS.\n- EdgeTX Companion v2.11 can no longer do binary conversions, and thus cannot open .otx files. If you have an old .otx file you need to convert or open, you will need to use an older version of EdgeTX Companion. This follows on from EdgeTX 2.8 being the last firmware version to support binary conversion (i.e. from OpenTX 2.3 or earlier versions of EdgeTX).\n  See the EdgeTX Manual for more information.\nWarning\nRadios based on STM32H7 MCUs update differently to older radios. Do not use the \"Flash via USB\" option in EdgeTX Buddy with them (yet). To update radios such as the Flysky PA01 & ST16, Jumper T15 Pro, RM TX15 and RM TX16S MK3, please follow the instructions in the EdgeTX Manual.\nWhat's Changed\nThis is another maintenance release, which brings a several fixes for both colour screen radios and for Companion, as well as a few minor bugs that\n🖥️ Black & White Radio Fixes\n- input trim display is incorrect on some radios (#6984)\n🎨 Color Radio Fixes\n- event handling may not work when using the Lua 'page' object (#6878)\n- don't show 'RTN to exit' message when USB connected for UF2 bootloader (#6948)\n- radio starts with very low LCD brightness level (#6883)\n- lvgl.build() function not returning table of named objects (#6958)\n- layout for Source field on input edit page when telemetry source type (#6978)\n- widgets may not use all available space on some radios (#6983)\n- subtrim value on Outputs page not updated when copying all trims to sub trims (#6998)\n- images may not load in Windows simulator (#7010)\n- widget size and position may not be correct when switched to full screen (#7053)\n- label at the top & bottom of the page of Lua scripts may not be visible when scrolling (#7079)\n- widget Lua 'update' function may give unexpected error (#7119)\n- add 'edited' callback to 'numberEdit' control for LVGL Lua scripts (#7077)\n- add 'borderPad' property for LVGL Lua script container objects (#7095)\n🎮 Firmware (All Radios Generally) Fixes\n- global variable value and range may not be correct (#7009)\n- display of mixer max time (#6880)\n- incorrect GPIO for SPort power pin (#6929)\n- improve servo refresh rates to the module (#6930)\n- always set serial port (#6990)\n- incorrect identification of module for RF power adjustment (#6886)\nH7 Radios\n- UF2 bootloader unable to flash (#6985)\nFlysky PA01\n- add long-press power-on and improve charging indication (#6885)\n💻 Companion Software Fixes\n- logical switch global variable unit and precision (#6906)\n- range check initial own value (#6973)\n- telemetry simulation CRSF protocol VSpd UI properties (#6981)\n- units for special telemetry (Batt, Time, GPS) (#6382)\n- logical switch global variable compare range (#7007)\n- special function adjust global variable ensure value within configured range (#7006)\n- cannot select correct script file for 'Lua Script' SF/GF (#7087)\n- missing sources when reading models and settings (#7089)\nA more simplified overview, which is broken down into by screen type (Color LCD and B&W), is available in the user manual here. You can also check the 2.11.0 release notes for what was new or changed in this release.\nFull Changelog: v2.11.4...v2.11.5\nKnown Limitations and Issues\n- Wireless Model Trainer and CRSF/ELRS - if using the Multi Protocol Module (MPM) as a wireless trainer in conjunction with CRSF/ELRS, do not go above 250 Hz, otherwise the MPM wireless trainer will be dropped. 250 Hz or below is stable.\n- Due to a change in how the battery voltage calculation is done, you may want to double-check the accuracy of your measured battery voltage if you have calibrated it in the past. #5635, #6255\nUI/UX behavioral changes and/or new capabilities:\n- Color LCD: menus now \"wrap around\" when using the rotary encoder, allowing you to get to back to the top of the list quickly (#4867)\n- Companion: New menus have been added, and menu entries reorganized to be no so cluttered and more logical (#5753)\n- Companion: Now automatically validates if any model settings have any missing mixer or input sources, and prevents writing of invalid model configurations to handset, while turning invalid model names red. Shows a red/green traffic light at the bottom of the models window to indicate overall status (#5798)\nSupported radios\nThe full list of supported radios and their support status can be viewed here on the EdgeTX website.\nInstallation Guide\nhttps://manual.edgetx.org/edgetx-user-manual/installing-and-updating-edgetx\nFlash firmware via Chrome based browser\nhttps://buddy.edgetx.org/#/flash?version=v2.11.5\nLanguage and Custom builds\nCloudBuild option in EdgeTX Buddy will allow you build your own (supported) language firmware, with just a few clicks. Additionally, EdgeTX Companion also has some support for CloudBuild, and will automatically fetch firmware for a supported language when you use the \"Update components\" option. But you can also build your own firmware online following this guide, request a specific build at TODO or ask on Discord for someone to build one for you.\nContributors\nThank you to the following contributors who made this release possible!\n- @3djc\n- @frankiearzu\n- @elecpower\n- @pfeerick\n- @philmoz\n- @sneone","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.11.5","version":0,"site":"https://edgetx.org/","source":"EdgeTX","license_or_tos":"GPL-2.0","resources":null,"verified":false}