{"appId":"w:EdgeTX.Companion","appShortcutName":"EdgeTX Companion","appDisplayName":"EdgeTX Companion","authorId":"w:winget","releaseTagName":"winget-2.11.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The cutting edge open-source firmware for your R/C radio\n\nEdgeTX is the cutting edge of OpenTX. It is the place where innovative ideas and cutting-edge features are developed and field-tested by the enthusiasts of our hobby. EdgeTX is a community project – ideas from the community, developed by the community, and enjoyed by the community! The community will always have a say in what EdgeTX is and what EdgeTX will be in the future. Without community feedback and involvement EdgeTX cannot exist.\nWe are pleased to announce the fourth maintenance release for EdgeTX \"Jolly Mon\", v2.11.4. Thank you for all the feedback and testing by you, the community (and partner manufacturers) which has allowed us to identify and squash both new and old bugs!! We simply cannot have done this without you! 🤗 🍻\nNote\n- As with any firmware update, please ensure you back up your model and radio settings before updating, fully bench-test your models after updating, and report any issues you encounter.\n- For MacOS users, Companion is now only compiled for MacOS 12 and above. Stay with v2.10.5 or earlier if you need support for an older version of MacOS.\n- EdgeTX Companion v2.11 can no longer do binary conversions, and thus cannot open .otx files. If you have an old .otx file you need to convert or open, you will need to use an older version of EdgeTX Companion. This follows on from EdgeTX 2.8 being the last firmware version to support binary conversion (i.e. from OpenTX 2.3 or earlier versions of EdgeTX).\nWhat's Changed\nThis is basically an overdue maintenance release, that fixes issues for colorlcd and H7 MCU based radios, as well as the recently added Flysky ST16 and PA01. It also fixes some issues for older handsets / protocols (i.e. FrSky ACCST handsets, XJT module, PWM gimbals). It is recommended anyone already on 2.11 should update, as it is primarily bug fixes only.\nAll Radios\n- radio settings may be incorrect after updating from Companion (#6866)\n- input value may not return to 0 when using the 'x<0' or 'x>0' side options (#6664)\n- EM when trying to use Ghost configuration tool (#6638)\n- USART with half-duplex and RX DMA (#6637)\n- do not show Onebit on unsupported handsets (#6611)\n- PWM gimbal \"twitches\" (#6550)\nH7 based Radios\n- prevent being unable to flash when corrupted firmware present (#6814)\n- init rambackup clock so EM process operates correctly (#6827)\n- ambiguities in ADC oversampling (#6577)\n- restore ADC3 short sampling values (#6547)\n- radio yaml file may not be parsed correctly on H7 radios (#6725)\nColor LCD Radios\n- rotary encoder may not work after editing a telemetry sensor (#6853)\n- rotary encoder may not work in setup menus (#6802)\n- Lua LVGL page layout not always correct when using flex layouts (#6841)\n- various minor UI issues (#6840)\n- file picker may not work in Lua scripts (#6828)\n- default popup width is not scaled to LCD size (#6803)\n- memory leaks in UI code (#6795)\n- widgets may move or resize when trims are disabled in flight modes (#6746)\n- popup warning may block UI and key input, effectively freezing radio (2.11 version). (#6715)\n- input curve preview not updating when 'Side' value changed (#6675)\n- top bar radio info widget battery indicator misaligned (#6671)\n- widgets may not update correctly when flight mode changes (#6631), (#6639)\n- potential crash when configuring external module if trainer mode set to Master/SBUS (#6623)\n- navigation for Ghost module config tool (#6614)\nCompanion\n- model reference updates (#6769)\n- inputs and mixes conversion references (#6751)\n- preserve current calibration when writing models and settings to radio (#6742)\n- remove radio settings calibration tab (no longer relevant after #6742) (#6726)\nLemonRX DSMP\n- servo jumping when power on or switching models (#6786)\n- binding issue, channel update rate, unexpected servo movement on startup - 2.11 (#6679)\nLua / Lua API\n- wrong model.getInput() and model.getMix() values for weight, offset and curve negative values (#6761)\n- Lua API improvements (#6846)\n- improvements for Lua LVGL API (#6676)\nFlysky PA01 / ST16\n- occasional Read/Write Failures on SD Card (#6849)\n- SD storage hangs after copy a large file (#6847)\n- backlight related issues (#6826)\n- SDIO file access stability (#6771)\n- Minor fixes on power on and charging animation (#6733)\n- fix UI issues for 2.11 (#6708)\n- should use ADC3 for reading RTC battery - v2.11 (#6668)\n- enable stick dead zone support (#6666)\n- always enable charger when radio is switched on (#6669)\n- modify RF power related issues (#6831)\nFrsky ACCST/XJT\n- upstream telemetry buffer alignment (#6842)\n- XJT module incorrect processing Telemetry Push/Pop data - 2.11 (#6721)\nA more simplified overview, which is broken down into by screen type (Color LCD and B&W), is available in the user manual here. You can also check the 2.11.0 release notes for what was new or changed in this release.\nFull Changelog: v2.11.3...v2.11.4\nKnown Limitations and Issues\n- Wireless Model Trainer and CRSF/ELRS - if using the Multi Protocol Module (MPM) as a wireless trainer in conjunction with CRSF/ELRS, do not go above 250 Hz, otherwise the MPM wireless trainer will be dropped. 250 Hz or below is stable.\n- Due to a change in how the battery voltage calculation is done, you may want to double-check the accuracy of your measured battery voltage if you have calibrated it in the past. #5635, #6255\nUI/UX behavioral changes and/or new capabilities:\n- Color LCD: menus now \"wrap around\" when using the rotary encoder, allowing you to get to back to the top of the list quickly (#4867)\n- Companion: New menus have been added, and menu entries reorganized to be no so cluttered and more logical (#5753)\n- Companion: Now automatically validates if any model settings have any missing mixer or input sources, and prevents writing of invalid model configurations to handset, while turning invalid model names red. Shows a red/green traffic light at the bottom of the models window to indicate overall status (#5798)\nSupported radios\nThe full list of supported radios and their support status can be viewed here on the EdgeTX website.\nInstallation Guide\nhttps://manual.edgetx.org/installing-and-updating-edgetx\nFlash firmware via a Chromium-based browser (e.g. Google Chrome, Microsoft Edge)\nhttps://buddy.edgetx.org/#/flash?version=v2.11.4\nLanguage and Custom builds\nCustom prebuilt firmware is no longer available. However, the CloudBuild option in EdgeTX is here to allow you to build your own firmware, with just a few clicks. Additionally, EdgeTX Companion now also has some support for CloudBuild, and will automatically fetch firmware for a supported language when you use the \"Update components\" option. But you can still build your own firmware online following this guide, request a specific build at #6165 or ask on Discord for someone to build one for you.\nNew Contributors\n- @bastian2001 made their first contribution in #4857\n- @493505110 made their first contribution in #5288\n- @LupusTheCanine made their first contribution in #5452\n- @nrw505 made their first contribution in #5410\n- @forbesmyester made their first contribution in #5688\n- @sneone made their first contribution in #6826","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.11.4","version":0,"site":"https://edgetx.org/","source":"EdgeTX","license_or_tos":"GPL-2.0","resources":null,"verified":false}