{"appId":"w:EdgeTX.Companion","appShortcutName":"EdgeTX Companion","appDisplayName":"EdgeTX Companion","authorId":"w:winget","releaseTagName":"winget-2.11.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The cutting edge open-source firmware for your R/C radio\n\nEdgeTX is the cutting edge of OpenTX. It is the place where innovative ideas and cutting-edge features are developed and field-tested by the enthusiasts of our hobby. EdgeTX is a community project – ideas from the community, developed by the community, and enjoyed by the community! The community will always have a say in what EdgeTX is and what EdgeTX will be in the future. Without community feedback and involvement EdgeTX cannot exist.\nWe are pleased to announce the third maintenance release for EdgeTX \"Jolly Mon\", v2.11.3. Thank you for all the feedback and testing by you, the community (and partner manufacturers) which has allowed us to identify and squash both new and old bugs!! We simply cannot have done this without you! 🤗 🍻\nNote\n- As with any firmware update, please ensure you back up your model and radio settings before updating, fully bench-test your models after updating, and report any issues you encounter.\n- For MacOS users, Companion is now only compiled for MacOS 13 and above. Stay with v2.10.5 or earlier if you need support for an older version of MacOS.\n- EdgeTX Companion v2.11 can no longer do binary conversions, and thus cannot open .otx files. If you have an old .otx file you need to convert or open, you will need to use an older version of EdgeTX Companion. This follows on from EdgeTX 2.8 being the last firmware version to support binary conversion (i.e. from OpenTX 2.3 or earlier versions of EdgeTX).\nWarning\nDue to a change in how the handset battery voltage calculation is done (due to #5635, #6255), you may want to double-check the accuracy of your measured handset battery voltage if you have calibrated it in the past. The default value should be pretty close if you have never calibrated it.\nWhat's Changed\nNew Handset\n- Flysky PA01 (#6393, #6530)\nTelemetry\n- feat(telem): add support for CRSF 0x09 packed vertical speed (#6402)\nBlack and White handsets\n- fix(bw): cannot select 'inc/dec' mode for Adjust SF on some radios (#6489)\nColor screen handsets\n- fix(color): trims and sliders UI creation slows down model switch (#6492)\n- fix(color): battery voltage value not updating on Radio Hardware page (#6485)\n- fix(color): text input field may not display correctly when value is erased (#6430)\n- feat(color): delay load the built-in widgets to improve responsiveness (#6480, #6486)\n- feat(color): increase RAM allocation to LVGL (#6447)\nAll handsets generally\n- fix: missing IT bootloader translation string (#6395)\n- fix(afhds3): enable settings for internal TX RF Power (#6534)\n- fix(radio): clear buffers on telemetry start (#6443)\n- chore(radio): obsolete raw telemetry packets from MPM (#6444)\n- chore(radio): update Italian translations (#6420)\nRadio/handset specific\n- fix(t8): abs() usage issue in setBindProtocolSelection (#6433)\n- fix(v16): USB descriptor name (#6511)\n- fix(v16): I2C conflicts in sensors reading (#6385)\n- fix(x10): build failure due to ledGreen not always existing (#6536)\nLua\n- fix(color): momentaryButton in Lua script crashes radio (#6460)\n- fix(color): crash if custom mixer Lua script output name is 6 chars long (#6419)\n- fix(color): debug messages when loading images in Lua script not shown as errors (#6464)\n- fix(lua): getFieldInfo not returning sensor name if one defined (#6422)\n- fix(lua): allow scrolling of containers in widget full screen mode (#6406)\n- fix(lua): model.setCurve function fails when creating a curve with 17 points (#6403)\n- fix(radio): Lua script special functions running when no trigger set (#6411)\nCompanion / Simulator\n- fix(cpn): model print function lua script name (#6496)\n- fix(cpn): add HRS V14 (#6409)\n- fix(sim): radio profile SD path (#6415)\n- fix(sim): not behaving like firmware when playing audio file in Lua script (#6436)\n- chore: fix MacOS Companion build on GH (#6500)\nMore information, which is broken down into by screen type (Color LCD and B&W), is available in the user manual here. You can also check the 2.11.0 release notes for what was new or changed in this release.\nFull Changelog: v2.11.2...v2.11.3\nKnown Limitations and Issues\n- Wireless Model Trainer and CRSF/ELRS - if using the Multi Protocol Module (MPM) as a wireless trainer in conjunction with CRSF/ELRS, do not go above 250 Hz, otherwise the MPM wireless trainer will be dropped. 250 Hz or below is stable.\n- Due to a change in how the battery voltage calculation is done, you may want to double-check the accuracy of your measured battery voltage if you have calibrated it in the past. #5635, #6255\nUI/UX behavioral changes and/or new capabilities:\n- Color LCD: menus now \"wrap around\" when using the rotary encoder, allowing you to get to back to the top of the list quickly (#4867)\n- Companion: New menus have been added, and menu entries reorganized to be no so cluttered and more logical (#5753)\n- Companion: Now automatically validates if any model settings have any missing mixer or input sources, and prevents writing of invalid model configurations to handset, while turning invalid model names red. Shows a red/green traffic light at the bottom of the models window to indicate overall status (#5798)\nSupported radios\nThe full list of supported radios and their support status can be viewed here on the EdgeTX website.\nInstallation Guide\nhttps://manual.edgetx.org/installing-and-updating-edgetx\nFlash firmware via a Chromium-based browser (e.g. Google Chrome, Microsoft Edge)\nhttps://buddy.edgetx.org/#/flash?version=v2.11.3\nLanguage and Custom builds\nCustom prebuilt firmware is no longer available. However, the CloudBuild option in EdgeTX is here to allow you to build your own firmware, with just a few clicks. Additionally, EdgeTX Companion now also has some support for CloudBuild, and will automatically fetch firmware for a supported language when you use the \"Update components\" option. But you can still build your own firmware online following this guide, request a specific build at #6165 or ask on Discord for someone to build one for you.\nNew Contributors\n- @bastian2001 made their first contribution in #4857\n- @493505110 made their first contribution in #5288\n- @LupusTheCanine made their first contribution in #5452\n- @nrw505 made their first contribution in #5410\n- @forbesmyester made their first contribution in #5688","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.11.3","version":0,"site":"https://edgetx.org/","source":"EdgeTX","license_or_tos":"GPL-2.0","resources":null,"verified":false}