{"appId":"w:EdrawSoft.EdrawMind","appShortcutName":"EdrawMind","appDisplayName":"EdrawMind","authorId":"w:winget","releaseTagName":"winget-12.4.1.1303","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.wondershare.com/cbs_down/edrawmind_12.4.1_full5370.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A versatile mind mapping tool for collaborative brainstorming.\n\nEdrawMind is designed for creating fresh new visual innovations, integrating your bullet points to structure an overall mind map. It is convenient and helpful for you to use EdrawMind to sort out your thoughts or ideas in order to find solutions to problems.\nProduct Feature Experience Optimization\n1. Matrix Function Enhancement: New floating action button allows for quick addition of rows/columns without navigating through multi-level menus, improving data structure editing efficiency;\n2. Gantt Chart Time Management Optimization: Supports manual setting of the \"Now\" time function, allowing quick localization of the current time point and intuitive comparison of project plans with actual progress;\n3. Todo Operation Efficiency Improvement: Supports customizable shortcut keys to perform 'Complete' and 'Cancel' actions, reducing mouse interaction steps and improving todo item processing speed.\n4. Brainstorming Content Customization: Supports modifying the colors of added thinking content to help distinguish content categories or priorities by color.\n5. Brainstorming Line Style Optimization: Supports adjusting the thickness parameters of hand-drawn lines to meet different visual presentation needs, making cognitive associations clearer.\nDefect Issue Fix\n1. Shortcut Anomaly Fix: Resolved the issue of duplicate shortcuts generated on the desktop/taskbar after checking for updates, optimizing the application startup experience.\n2. Stability and Experience Optimization: Fixed multiple known interaction issues (such as operation lag and abnormal pop-up windows) and application crash bugs in specific scenarios, enhancing overall stability.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"12.4.1.1303","site":"https://www.edrawsoft.com/","source":"EdrawSoft Co.,Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}