{"appId":"w:EdrawSoft.EdrawMind","appShortcutName":"EdrawMind","appDisplayName":"EdrawMind","authorId":"w:winget","releaseTagName":"winget-12.3.18.1286","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.wondershare.com/cbs_down/edrawmind_12.3.18_full5370.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A versatile mind mapping tool for collaborative brainstorming.\n\nEdrawMind is designed for creating fresh new visual innovations, integrating your bullet points to structure an overall mind map. It is convenient and helpful for you to use EdrawMind to sort out your thoughts or ideas in order to find solutions to problems.\nNew Layout Structure Added: Matrix Diagram\nThe layout structure has added a new matrix chart type that supports switching between row mode and column mode, with subtopics nested in different structures. The multidimensional comparison and analysis of mind map content are clearer and more intuitive.\nFunction access: Canvas Page > Right Panel > Mind Map Layout, select the Matrix chart.\nOptimization of the image editing experience.\nSupports applying the current image size to all images with one click, making size adjustments more efficient!\nSupports new fixed image sizes. Uniform sizes is more convenient.\nOptimization of the file export experience.\nPDF export supports adding margins and specifying page ranges for export.\nOptimization of image export quality, enhancing the export experience.\nOptimization of shortcut key customization.\nNew shortcut keys for adding brushes, switching documents, and switching pages. More functional shortcuts can be viewed and customized in Options > Shortcut Panel.\nSupports Importing Folder Paths\nImport Function Upgrade! It supports importing local folder paths, mapping them to Mind Maps, and allowing hyperlinks to open the folder. The maximum number of folders that can be mapped is 5000.\nOptimize Todo Association Logic\nOptimize editing experience for completed tasks. Todo actions for sibling subtopics will not be associated with the parent topic. Only the completion status of the parent topic is related to the child topics.\nImage Scaling Experience Optimization\nImage scaling supports quick selection of the scaling factor.\n\nCustom Context Menu Options Extension\nThe custom right-click menu now supports selecting [Theme Height] and [Theme Margin]. You can quickly adjust the theme style through the custom right-click.\nMatrix Chart Experience Optimization\nThe matrix layout structure supports hiding the tag bar.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"12.3.18.1286","site":"https://www.edrawsoft.com/","source":"EdrawSoft Co.,Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}