{"appId":"w:EdrawSoft.EdrawMind","appShortcutName":"Winget Application","appDisplayName":"EdrawMind","authorId":"w:winget","releaseTagName":"winget-12.2.15.1146","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.edrawsoft.com/cbs_down/edrawmind_12.2.15_full5370.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A versatile mind mapping tool for collaborative brainstorming.\n\nEdrawMind is designed for creating fresh new visual innovations, integrating your bullet points to structure an overall mind map. It is convenient and helpful for you to use EdrawMind to sort out your thoughts or ideas in order to find solutions to problems.\nAdded single-page Slides generation feature\nSupports one-sentence generation, one-paragraph generation, and selected mind map branch generation.\nFeature Entry: On the right-side panel of the Homepage, select “Generate Single-Page Slides,” or select “Mind Map Branch > Floating Shortcut Bar > Generate Single-Page Slides”\nYouTube Mindmap Summarizer\n1. Convert YouTube videos into mind maps. Just paste the URL, and get a clear mind map.\n2. Access the feature on the right panel of the Workbench homepage - Youtube Mind Map Summerizer.\nAI dialogue optimization and upgrade\nLimited time only: free AI experience! Edraw AI Assistant’s Free Dialogue feature has been connected to the DeepSeek-R1 deep thinking model, and supports switching between different models to let you experience a range of them. AI Tokens are not deducted when using the Free Dialogue feature.\nAfter the content is generated by AI, when inserted into the canvas theme, it supports analyzing the hierarchical structure and generating a multi-level structured mind map with one click.\nAI dialogue has added [Regenerate] and [Clear historical dialogue record] functions. Provide a better Q&A experience.\nNew revision of local backup center\nThe local backup center (original file recovery) has been newly revised and launched to safely store your local backup version.\nFunction entry:\n1. Top Toolbar > Advanced > Local Backup Center\n2. Top menu bar in the upper left corner > File > Local Backup Center\nOptimize Experience Upgrade\n1. Supports automatic software launch on startup.\n2. Organization chart layout (bidirectional, up and down) supports unbalanced layout effect.\n3. Optimize the content output structure after file parsing.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"12.2.15.1146","site":"https://www.edrawsoft.com/","source":"EdrawSoft Co.,Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}