{"appId":"w:EdrawSoft.EdrawMax","appShortcutName":"Wondershare EdrawMax","appDisplayName":"Wondershare EdrawMax","authorId":"w:winget","releaseTagName":"winget-15.0.2.1409","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.wondershare.com/cbs_down/edraw-max_64bit_15.0.2_full5371.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An intuitive diagram software with templates for any scenario.\n\nEdrawMax is a powerful, all-in-one, and yet easy-to-use diagramming tool that enables users to visualize the ideas effortlessly. With EdrawMax, you can create and customize flowcharts, Venn diagrams, mind maps, organizational charts, Gantt charts, UML diagrams, electrical drawings, genograms, building plans, etc.\nNew: Added Edraw AI Floating Button, supporting diagram generation from text selections on web pages and various documents.\n\nNew: Introduced Edraw Agent with intent recognition and online search capabilities.\n\nNew: Added AI generation for Gantt charts, technical roadmaps, UML sequence diagrams, UML class diagrams, charts and graphs, and more.\n\nNew: Added image-to-vector conversion — AI can now convert image-based diagrams into editable vector graphics.\n\nNew: Introduced AI-powered diagram analysis.\n\nNew: Added support for inserting vertical text.\n\nImproved: Enhanced ECharts functionality with more customization options.\n\nNew: Added Draw.io import feature (currently supports flowcharts only).\n\nImproved: Homepage template recommendations are now optimized based on user habits.\n\nImproved: Optimized the scale setting feature for floor plans.\n\nOther: General improvements and bug fixes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"15.0.2.1409","version":0,"site":"https://www.edrawsoft.com/","source":"EdrawSoft Co.,Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}