{"appId":"w:eibol.FFmpegBatchAVConverter","appShortcutName":"FFmpeg Batch AV Converter","appDisplayName":"FFmpeg Batch AV Converter","authorId":"w:winget","releaseTagName":"winget-3.2.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/eibol/ffmpeg_batch/releases/download/3.2.4/FFBatch_AV_Converter_3.2.4_64bit.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"FFmpeg Batch AV Converter is a free universal audio and video encoder,\n\nFFmpeg Batch AV Converter is a free universal audio and video encoder, that allows to use the full potential of ffmpeg command line with a few mouse clicks in a convenient GUI with drag and drop, progress information.\n• Polish translation available (a few translations were automatic).\n• Log refreshable during encoding, now with encoding results summary.\n• Log saved every 60 seconds kept in case of application crash/blackout.\n• Added warning for incompatible characters [',] found in input file path, required to be renamed to avoid errors when using ffmpeg filters.\n• Fixed: Sequential encoding abruptly ends with some ffmpeg.exe builds.\n• Fixed: some settings being lost after upgrades, like ffmpeg.exe path. (installer version).\n• Fixed: %fn variable not working (working directory was not set properly).\n• Fixed: %f2 variable not working (Windows paths conversion issue).\n• Fixed: Keep source timestamp was not applied for some features (two pass encoding, multiplex, batch subtitling).\n• Fixed: -vf filter previously not supported in batch subtitles parameters (Burnt subtitles) .\n• Fixed: Try preset button sometimes rendering application unresponsive.\n• Hopefully fixed Youtube download progress sometimes wrong by a factor of 10.\n• Other minor corrections and bugfixes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2.4","version":0,"site":"https://ffmpeg-batch.sourceforge.io/","source":"eibol","license_or_tos":"LGPL-2.1","resources":null,"verified":false}