{"appId":"w:Elastic.Heartbeat","appShortcutName":"Beats heartbeat","appDisplayName":"Beats heartbeat","authorId":"w:winget","releaseTagName":"winget-9.3.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://artifacts.elastic.co/downloads/beats/heartbeat/heartbeat-9.3.0-windows-x86_64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Ping remote services for availability\n\nHeartbeat is a beat for testing service availability using PING based on ICMP, TCP or higher level protocols.\nThis release also includes: Deprecations.\nFeatures and enhancements\nAll\n- Introduce cloud connectors flow. #47587\n- Make beats receivers emit status for their subcomponents. #48015\n- Add GUID translation, base DN inference, and SSPI authentication to LDAP processor. #47827\n- Add events.failure_store metric to track events sent to Elasticsearch failure store. #48068 #47164\nFilebeat\n- Add support for direct HTTP request rate limit setting in CEL input. #46953\n- Allow adding file owner and group to the events' meta fields on Unix systems. #47331 #43226\n- Add AWS auth method for CEL and HTTP JSON inputs. #47260\n- Add client secret authentication method for Azure Event Hub and storage in Filebeat. #47256\n- Add client address and name to submitted Redis slowlogs. #41507\n- Log unpublished event count and exit publish loop on input context cancellation. #47730\n- Upgrade CEL mito library version to v1.24.0. #47762\n- Add OTEL metrics to CEL inputs. #47014\n- Improve input error reporting to Elastic Agent, specially when pipeline configurations are incorrect. #47905 #45649\n- Azure EventHub input v2 - Add support for AMQP over WebSocket and HTTPS proxy. #47956 #47823\n- The Journald input now supports setting a chroot to use when calling the journalctl binary, thus allowing the journald input to be used with the wolfi container variant and in environments where the host's Journald is not compatible with the journalctl version shipped with the container. . #48008 #47164\n  Add support in the journald inpur for using chroot when calling journalctl. In a container environment this allows to mount the host file system into the container and use its journalctl, which prevents any sort of incompatibility between the journalctl in the container image and the host Journald. Allows using the journald input with Wolfi based Docker containers.\n- GZIP support is GA and always enabled on filestream. #47893 #47880\n  Ingesting GZIP-compressed files is now GA. The gzip_experimental configuration option has been deprecated. Users should use compression instead. Refer to the documentation for more details.\n- Filebeat deploy on kubernetes examples use compression instead of gzip_experimental. #48079 #47882\n- Add file-based auth provider for CEL and HTTP JSON inputs. #47507 #47506\n  The CEL and HTTP JSON inputs now support reading authentication tokens from files, enabling integration with various secret providers like Vault, Kubernetes secret projections, etc. Tokens are automatically refreshed based on a configurable interval without requiring restarts.\nMetricbeat\n- Change calculation of CPU/Memory for Kubernetes to allocatable values. #47815\n  Update kubernetes cpu and memory metrics to use allocatable values instead of capacity values.\n- Add extra debug logging to simplify troubleshooting in prometheus module. #47477 #15693\n- Add resource pool id to vsphere cluster metricset. #47883\n- Add last_terminated_exitcode to kubernetes.container.status. #47968\n- Report memory pressure stall information (PSI) for cgroup v2. #48054\n  Add memory PSI metrics to system.process.cgroup, complementing existing CPU and IO pressure metrics for cgroupv2.\nOsquerybeat\n- Add browser_history table to Osquery extension for cross-platform browser history analysis. #47117\n- Add amcache hive support for osquery extension in Windows. #46996\n- Add status reporting for osquerybeat lifecycle and osqueryd management. #47472\n- Add osqueryd process health monitoring with metrics exposed via beats monitoring endpoint. #47474\n- Upgrade osquery version to 5.19.0. #48040\n- Add record filtering/scoping support to the osquery extension. #47396\n- Update documentation for the amcache tables in the osquery extension. #47748\n- Add marshalling support for embedded structs in the osquery extension. #47746\n- Update column definition encoding to support embedded structs. #47758\nPacketbeat\n- Add status reporter interface to packetbeat. #45732\nWinlogbeat\n- Add 'process.args_count' to winlogbeat windows security ingest pipeline. #47266\nFixes\nAll\n- Add msync syscall to seccomp whitelist for BadgerDB persistent cache. #48229\n- Fix windows install script to properly migrate legacy state data. #48293\n- Remove use of github.com/elastic/elastic-agent-client from OSS Beats. #48353\nFilebeat\n- Fix an issue in the initialization of exporters for input metrics that could cause an unexpected number of exporter connections to be created. #48321\n- Prevent panic during startup if dissect processor has invalid field name in tokenizer. #47839\n- Fix AD Entity Analytics failing to fetch users when Base DN contains a group CN. #48395\n- Fix filebeat goroutine leak when using harvester_limit. #48445\nMetricbeat\n- Improve defensive checks to prevent panics in meraki module. #47950\n- Remove GCP Billing timestamp functions. #47963\n- Harden Prometheus metrics parser against panics caused by malformed input data. #47914\n- Add bounds checking to Zookeeper server module to prevent index-out-of-range panics. #47915\n- Fix panic in graphite server metricset when metric has fewer parts than template expects. #47916\n- Skip regions with no permission to query for AWS CloudWatch metrics. #48135\n- Enforce configurable size limits on incoming requests for remote_write metricset (max_compressed_body_bytes, max_decoded_body_bytes). #48218\n- Autoops agent to shutdown when it can't recover from the http errors. #48292\n- Add missing vector metrics in Autoops agent. #48365\n- Stack Monitoring now trims trailing slashes from host URLs for simplicity. #48430 #48426\n- Flatten AutoOps Cluster Settings to avoid unnecessary nesting and information. #48454 #48453\nOsquerybeat\n- Fix zero time encoding for Unix timestamps. #47970\nPacketbeat\n- RPC fragment bounds checking and sanitization. #47803\n- Add check for incorrect length values in PostgreSQL datarow parser. #47872\n- Verify and cap memcache UDP fragment counts. #47874\n- Fix bounds checking in MongoDB protocol parser to prevent panics. #47925","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.3.0","version":0,"site":"https://www.elastic.co/","source":"Elastic","license_or_tos":"Elastic-2.0","resources":null,"verified":false}