{"appId":"w:Elastic.Auditbeat","appShortcutName":"Winget Application","appDisplayName":"Beats auditbeat","authorId":"w:winget","releaseTagName":"winget-9.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://artifacts.elastic.co/downloads/beats/auditbeat/auditbeat-9.0.0-windows-x86_64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Collect your Linux audit framework data and monitor the integrity of your files.\n\n\nFeatures and enhancements\n- Improves logging in system/socket in Auditbeat. #41571\n- Adds out of the box support for Amazon EventBridge notifications over SQS to S3 input in Filebeat. #40006\n- Update CEL mito extensions to v1.16.0 in Filebeat. #41727\n- Filebeat's registry is now added to the Elastic-Agent diagnostics bundle. #33238 and #41795\n- Adds unifiedlogs input for MacOS in Filebeat. #41791\n- Adds evaluation state dump debugging option to CEL input in Filebeat. #41335\n- Rate limiting operability improvements in the Okta provider of the Entity Analytics input in Filebeat. #40106 and #41977\n- Rate limiting fault tolerance improvements in the Okta provider of the Entity Analytics input in Filebeat. #40106 #42094\n- Introduces ignore older and start timestamp filters for AWS S3 input in Filebeat. #41804\n- Journald input now can report its status to Elastic-Agent in Filebeat. #39791 and #42462\n- Publish events progressively in the Okta provider of the Entity Analytics input in Filebeat. #40106 and #42567\n- Journald include_matches.match now accepts + to represent a logical disjunction (OR) in Filebeat. #40185 and #42517\n- The journald input is now generally available in Filebeat. #42107\n- Adds support for RFC7231 methods to HTTP monitors in Heartbeat. #41975\n- Adds use_kubeadm config option in kubernetes module in order to toggle kubeadm-config API requests in Metricbeat. #40086\n- Preserve queries for debugging when merge_results: true in SQL module in Metricbeat. #42271\n- Collect more fields from ES node/stats metrics and only those that are necessary in Metricbeat. #42421\n- Adds benchmark module in Metricbeat. #41801\n- Increase maximum query timeout to 24 hours in Osquerybeat. 42356\n- Properly set events UserData when experimental API is used in Winlogbeat. #41525\n- Include XML is respected for experimental API in Winlogbeat. #41525\n- Forwarded events use renderedtext info for experimental API in Winlogbeat. #41525\n- Language setting is respected for experimental API in Winlogbeat. #41525\n- Language setting also added to decode XML wineventlog processor in Winlogbeat. #41525\n- Format embedded messages in the experimental API in Winlogbeat. #41525\n- Make the experimental API GA and rename it to winlogbeat-raw in Winlogbeat. #39580 and #41770\n- Removes 22 clause limitation in Winlogbeat. #35047 and #42187\n- Adds handling for recoverable publisher disabled errorsin Winlogbeat. #35316 and #42187\n- Removes Functionbeat binaries from CI pipelines. #40745 and #41506\n- Update Go version to 1.24.0. #42705\n- Add etw input fallback to attach an already existing session in Filebeat. #42847\n- Update CEL mito extensions to v1.17.0 in Filebeat. #42851\n- Winlog input in Filebeat cam now report its status to Elastic Agent. #43089\n- Add configuration option to limit HTTP Endpoint body size in Filebeat. #43171\n- Add a new match_by_parent_instance option to perfmon module in Metricbeat. #43002\n- Add a warning log to metricbeat.vsphere in Metricbeat in case vSphere connection has been configured as insecure. #43104\nFixes\n- hasher: Add a cached hasher for upcoming backend in Auditbeat. #41952\n- Split common tty definitions in Auditbeat. #42004\n- Redact authorization headers in HTTPJSON debug logs in Filebeat. #41920\n- Further rate limiting fix in the Okta provider of the Entity Analytics input in Filebeat. #40106 and #41977\n- The _id generation process for S3 events has been updated to incorporate the LastModified field. This enhancement ensures that the _id is unique in Filebeat. #42078\n- Fixes truncation of bodies in request tracing by limiting bodies to 10% of the maximum file size in Filebeat. #42327\n- [Journald] Fixes handling of journalctl restart. A known symptom was broken multiline messages when there was a restart of journalctl while aggregating the lines in Filebeat. #41331 and #42595\n- Fixwa bug where Metricbeat unintentionally triggers Windows ASR in Metricbeat. #42177\n- Removes hostname field from ZooKeeper's mntr data stream in Metricbeat. 41887\n- Properly marshal nested structs in ECS fields, fixing issues with mixed cases in field names in Packetbeat. 42116\n- Fixed race conditions in the global ratelimit processor that could drop events or apply rate limiting incorrectly in Filebeat. 42966\n- Prevent computer details being returned for user queries by Activedirectory Entity Analytics provider in Filebeat. #11818 and #42796\n- Handle unexpected EOF error in aws-s3 input and enforce retrying using download failed error in Filebeat. #42420\n- Prevent azureblobstorage input from logging key details during blob fetch operations in Filebeat. #43169\n- Add AWS OwningAccount support for cross account monitoring in Metricbeat. #40570 and #40691\n- Fix logging argument number mismatch in Metricbeat(Redis). #43072\n- Reset EventLog if error EOF is encountered in Winlogbeat. #42826\n- Implement backoff on error retrial in Winlogbeat. #42826\n- Fix boolean key in security pipelines and sync pipelines with integration in Winlogbeat. #43027","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"9.0.0","site":"https://www.elastic.co/","source":"Elastic","license_or_tos":"Elastic-2.0","resources":null,"verified":false}