{"appId":"w:EQAditu.AdvancedCombatTracker","appShortcutName":"Winget Application","appDisplayName":"Advanced Combat Tracker","authorId":"w:winget","releaseTagName":"winget-3.8.2.285","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/EQAditu/AdvancedCombatTracker/releases/download/3.8.2.285/ACTv3-Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A real-time MMO log parser.\n\n\nMiscellaneous\nAdded two misc options to allow the View Logs feature and/or Custom Triggers to receive the original log line instead of one modified by plugins or having the timestamp removed. -- The Custom Triggers tab & Spell Timers page will try to remember node expansion when rebuilding the list. When removing a Custom Trigger/Spell Timer(Alt-R), it will try to select an adjacent node. -- For some Linux users, their version of the CLR gets confused by an app.config section which prevents web requests from completing. If ACT detects this, it will create a notification with an option to modify the app.config to remove this offending config section. -- Some instances of \\n have been replaced with Environment.NewLine in text generation.\nMiscellaneous UI / API\nButtonPainted and CheckboxButtonPainted margin/padding logic now more closely matches their WinForms counterparts. Slightly altered some of the color blending methods these types of controls use.\nPlugins / API\nExposed Color.ToAdjustedColor() extension method to alter a given color according to ACT's UI settings or other arbitrary values. Exposed Color.MixWith() extension method to mix one color with another by a percentage. -- Fixed some cases where ACT's custom controls would not work in designer mode without a parented form(like when designing a UserControl). -- LogLineEventArgs.originalLogLine will now have the same value in OnLogLineRead as it did in BeforeLogLineRead. -- TraySliderAdd() should properly run on the UI thread like the docs state.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.8.2.285","site":"https://advancedcombattracker.com/","source":"EQAditu","license_or_tos":"Proprietary","resources":null,"verified":false}