{"appId":"w:ESET.EndpointAntivirus","appShortcutName":"ESET Endpoint Antivirus","appDisplayName":"ESET Endpoint Antivirus","authorId":"w:winget","releaseTagName":"winget-12.1.2076.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.eset.com/com/eset/apps/business/eea/windows/v12/12.1.2076.0/eea_arm64.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.eset.com/com/eset/apps/business/eea/windows/v12/12.1.2076.0/eea_nt64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ESET Endpoint Antivirus is a complete security solution produced from our long-term effort to combine maximum protection and a minimal system footprint.\n\nESET Endpoint Antivirus represents a new approach to truly integrated computer security. The most recent version of the ESET LiveGrid® scanning engine utilizes speed and precision to keep your computer safe. The result is an intelligent system that is constantly alert for attacks and malicious software endangering your computer.\nESET Endpoint Antivirus is a complete security solution based on the long-term effort to combine maximum protection and a minimal system footprint. The advanced technologies, based on artificial intelligence, can proactively eliminate infiltration by viruses, spyware, trojan horses, worms, adware, rootkits, and other internet-borne attacks without hindering system performance or disrupting your computer.\nESET Endpoint Antivirus is primarily designed for workstations in a business environment.\n- Improved: Prompt to create ESET HUB account disappears faster after creating one and linking license\n- Fixed: Windows context menu entries not available after installation via Remote Desktop\n- Fixed: Notification forwarding to email using OAuth 2.0 authentication does not work via HTTP/S proxy\n- Fixed: \"A new version is available\" app status is incorrectly displayed in specific situation even no new build available\n- Fixed: Audit log does not report setting changes from Protect\n- Fixed: PDF24 application could not be force closed and patched if multiple Close application for patching notifications appear\n- Fixed: Network access troubleshooting doesn't work if the IDS exceptions rules list is empty\n- Fixed: Upload speed to Google NoteBookLM reduced by Real-time file system protection\n- Fixed: Conflicts and slowdowns co-existing with Tencent IOA\n- Fixed: \"The installed operating system is outdated\" application status displayed for several days after upgrade to Microsoft Windows 11\n- Fixed: Some spam emails are not moved to SPAM folder on IMAP account","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"12.1.2076.0","version":0,"site":"https://www.eset.com/","source":"ESET, spol. s r.o.","license_or_tos":"Proprietary","resources":null,"verified":false}