{"appId":"w:ETHZurich.SafeExamBrowser","appShortcutName":"Safe Exam Browser","appDisplayName":"Safe Exam Browser","authorId":"w:winget","releaseTagName":"winget-3.10.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Safe Exam Browser is a web browser environment to carry out e-assessments safely.\n\n\nSummary\nThis update improves integrity and security aspects, enhances the optional server and screen proctoring functionalities and fixes the drag & drop issue as well as other important bug fixes and improvements.\nNote\nStarting with release version 3.8.0, Safe Exam Browser for Windows requires a minimum operating system version of Windows 10 version 1803.\nImportant\nThe Browser Exam Key of Safe Exam Browser for Windows is platform-specific, i.e. its value is different for the 32-bit (x86) and 64-bit (x64) build of the same version!\nChanges\n- Updated Dutch user interface translation.\n- Fixed GHSA-xhg6-9j5j-w4vf by switching to ProDotNetZip.\n- Improved stack traces to show only relative paths.\n- Implemented basic window protection (#1071).\n- Implemented verification of permitted applications during initialization (#1129).\n- Ensured audio mute state is reverted correctly.\n- Fixed issue with drag & drop question types by allowing fragment movements (#1127, #1153).\n- Suppressed autocomplete functionality in browser (#1185).\n- Disabled action center for browser resource use case.\n- Implemented permissions operation (e.g. for granting wireless network access) which is executed before the application monitoring starts (#1108).\n- Fixed issues with the implementation of the isolated clipboard (#1090).\n- Ignoring session lock and unlock to prevent lock screens (#1028).\n- Added missing translations and minor changes (#1028).\n- Blocking of injected keyboard inputs (#1028).\n- Removed obsolete auto-find functionality (#1187).\n- Implemented wrapper for context menu handler.\n- Updated setup bundle to install Visual C++ 2015-2022 Redistributable.\n- Fixed null reference exception when terminating browser after initialization failure.\n- Fixed default log directory for macOS.\n- Updated browser engine to version 139.0.280 (Chromium version 139.0.7258.139).\nThe following optional features and changes are disabled by default and need to be configured individually:\n- Implemented functionality for server reconfiguration.\n- Implemented cookie traversal for user resolution with server.\n- Implemented quit password requirement for proctoring finalization dialog.\n- Separated invigilation functionality from proctoring feature.\n- Added user identifiers to browser integration logs.\n- Separated invigilation settings from server settings and ensured they are correctly mapped during session initialization.\n- Made LMS type optional for server handshake.\nKnown Issues\n- Screen readers NVDA and JAWS are not compatible with kiosk mode Create New Desktop. If their usage is required, please use kiosk mode Disable Explorer Shell where they should work as expected.\nRequirements\nSEB 3.10.0 requires the prerequisites listed below in order to work correctly. These are automatically installed with the setup bundle and need only be manually installed when using the MSI packages.\n- .NET Framework 4.8 Runtime: https://dotnet.microsoft.com/download/dotnet-framework/net48\n- Visual C++ 2015-2022 Redistributable: https://learn.microsoft.com/en-us/cpp/windows/latest-supported-vc-redist\nInstallation\nPlease use the setup bundle for installation! The platform-specific setups are mainly provided for system administrators who require MSI packages for their automated installation procedures.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.10.0","version":0,"site":"https://github.com/SafeExamBrowser","source":"ETH Zürich","license_or_tos":"MPL-2.0","resources":null,"verified":false}