{"appId":"w:ETHZurich.SafeExamBrowser","appShortcutName":"Safe Exam Browser","appDisplayName":"Safe Exam Browser","authorId":"w:winget","releaseTagName":"winget-3.10.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Safe Exam Browser is a web browser environment to carry out e-assessments safely.\n\n\nSummary\nThis patch update improves the virtual machine detection, resolves a browser initialization failure and provides a Turkish user interface translation as well as other important bug fixes and improvements.\nNote\nSafe Exam Browser for Windows requires a minimum operating system version of Windows 10 version 1803.\nImportant\nThe Browser Exam Key of Safe Exam Browser for Windows is platform-specific, i.e. its value is different for the 32-bit (x86) and 64-bit (x64) build of the same version!\nChanges\n- Implemented system hardware verification.\n- Improved virtual machine detection.\n- Integrated new code signing certificate for release builds.\n- Updated signature for application monitoring (#1261).\n- Integrated Turkish user interface translation (#1277).\n- Added logging of exit code for browser initialization failure (#1299).\n- Fixed issue where message boxes were rendered in the background behind the active browser window.\n- Fixed bug with settings password when reconfiguring in standard kiosk mode (#1261).\n- Fixed full screen resp. focus issue by asynchronously invoking termination activator (#1314).\n- Disabled de-elevation of browser process (#1331, #1299, #1274).\n- Browser engine version 139.0.280 (Chromium version 139.0.7258.139).\nThe following optional features and changes are disabled by default and need to be configured individually:\n- n/a\nKnown Issues\n- Screen readers NVDA and JAWS are not compatible with kiosk mode Create New Desktop. If their usage is required, please use kiosk mode Disable Explorer Shell where they should work as expected.\nRequirements\nSEB 3.10.1 requires the prerequisites listed below in order to work correctly. These are automatically installed with the setup bundle and need only be manually installed when using the MSI packages.\n- .NET Framework 4.8 Runtime: https://dotnet.microsoft.com/download/dotnet-framework/net48\n- Visual C++ 2015-2022 Redistributable: https://learn.microsoft.com/en-us/cpp/windows/latest-supported-vc-redist\nInstallation\nPlease use the setup bundle for installation! The platform-specific setups are mainly provided for system administrators who require MSI packages for their automated installation procedures.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.10.1","version":0,"site":"https://github.com/SafeExamBrowser","source":"ETH Zürich","license_or_tos":"MPL-2.0","resources":null,"verified":false}