{"appId":"w:FireDaemon.OpenSSL","appShortcutName":"FireDaemon OpenSSL 3","appDisplayName":"FireDaemon OpenSSL 3","authorId":"w:winget","releaseTagName":"winget-3.6.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.firedaemon.com/FireDaemon-OpenSSL/FireDaemon-OpenSSL-x64-3.6.1.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"FireDaemon OpenSSL 3 Installer\n\nOpenSSL is a popular open-source software library that provides a robust, full-featured set of cryptographic functions and tools to secure communications over computer networks. It implements the Transport Layer Security (TLS) protocol, which is used to encrypt data transmissions between web servers and clients, such as web browsers. OpenSSL provides a wide range of cryptographic functions, including symmetric encryption, public-key encryption, message digest and hash functions, digital signatures, and random number generation. It supports a large number of classical cryptographic algorithms, such as AES, RSA, SHA, and post-quantum algorithms such as ML-KEM, ML-DSA, and SLH-DSA. In addition to cryptographic functions, OpenSSL also provides utilities for generating and managing digital certificates and keys, creating and verifying digital signatures, and performing TLS handshakes and negotiations.\nThe key advantages of using our OpenSSL Binary Distribution for Microsoft Windows over others that are available are:\n- No need to deploy various software tools to attempt to compile the source from scratch. Our build script is available if you do want to compile OpenSSL yourself\n- No external dependencies. Installing or distributing the Visual C++ Redistributable Runtime (MSVC) is unnecessary. There is an implicit dependency on the Windows Universal C Runtime (UCRT), which is included by default in all modern versions of Microsoft Windows\n- Packaged for simple deployment and use case scenarios, including standalone, embeddable, deployable, or portable\n- Installer and binaries are digitally signed with our Extended Validation (EV) code signing certificate to avoid Windows SmartScreen warnings and to allow you to validate binary integrity to meet your compliance requirements.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.6.1","version":0,"site":"https://www.firedaemon.com/","source":"FireDaemon","license_or_tos":"Apache-2.0","resources":null,"verified":false}