{"appId":"w:FlorianHeidenreich.Mp3tag","appShortcutName":"Mp3tag","appDisplayName":"Mp3tag","authorId":"w:winget","releaseTagName":"winget-3.32","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.mp3tag.de/mp3tagv332-x64-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The universal tag editor and more...\n\nMp3tag is a powerful and easy-to-use tool to edit metadata of audio files.\nIt supports batch tag-editing of ID3v1, ID3v2.3, ID3v2.4, iTunes MP4, WMA, Vorbis Comments and APE Tags for multiple files at once covering a variety of audio formats.\nFurthermore, it supports online database lookups from, e.g., Discogs, MusicBrainz or freedb, allowing you to automatically gather proper tags and download cover art for your music library.\nYou can rename files based on the tag information, replace characters or words in tags and filenames, import/export tag information, create playlists and more.\nNEW: added functions `SayVar`, `Use`, and `UseFormat` to Web Sources Framework. (#70122, #70129, #61854, #63206)\nFIX: labels in the Tag Sources search dialog were partially clipped at the bottom for some characters.\nFIX: MP4 `mean` atoms with uncommon namespaces were no longer displayed (since v3.31b).\nCHG: Discogs Tag Sources: automatically remove disambiguation numbers from artist names.\nFIX: Discogs Tag Sources: DISCNUMBER was not imported correctly for track listings which used the - character only for some of the tracks.\nFIX: debug output of Web Sources Framework created current output set via `outputto` even when no data has been emitted.\nNEW: added function `SayFormat` to Web Sources Framework.\nNEW: Discogs Tag Sources: added support for importing `COMPOSER` from extra artist roles of index tracks and use them for subtracks.\nCHG: MusicBrainz Tag Source: complete rewrite to use JSON input instead of XML.\nCHG: MusicBrainz Tag Source: media title is now imported to `SETSUBTITLE` (instead of `Disc Title`).\nNEW: MusicBrainz Tag Source: added support for importing fields `COMPILATION`, `MUSICBRAINZ_ALBUMTYPE`, and `ORIGYEAR`.\nNEW: Discogs Tag Sources: added support for importing `COMPOSER` from extra artist roles `Composed-By`, `Music-By`, `Songwriter`, and `Written-By` (and variants thereof).\nNEW: Discogs Tag Sources: added support for importing `MIXARTIST` from extra artist role `Remix`.\nFIX: drag and drop of files into File List did not work using latest Wine.\nCHG: added `TITLE` to track list at Tag Sources result dialog for releases with identical titles for all tracks. (#68393)\nNEW: added option to disable auto-sizing of columns in Find window results list to preserve manually adjusted column widths. (#69494)\nFIX: tooltips for toolbar buttons were not displayed when the Filter window was focused. (#70053)\nCHG: added confirmation question when sorting the File List if the Tag Panel contains unsaved changes and auto-saving is not enabled. (#70046)\nFIX: occasional runtime error when performing drag and drop from the File List. (#69942)\nNEW: added `mp4_creation_time`, `mp4_creation_time_raw`, `mp4_modification_time`, and `mp4_modification_time_raw` to display MP4 `mvhd` creation and modification dates. (#68880)\nFIX: pressing Del key removed file from File List when editing in File List (since v3.31e). (#70030)\nNEW: added ability to select similar files via 'Edit > Select similar files' or Ctrl+G. (#5485, #8853, #17247, #54274, #56177, #62080)\nNEW: added ability to select next similar files that differ from current file via 'Edit > Select next similar files' or Ctrl+Shift+G. (#14309, #14905, #58926)\nNEW: added support for auto-completion of custom values when editing in Extended Tags. (#69448)\nNEW: added support for auto-completion of custom values when editing in File List. (#69448)\nFIX: auto-numbering wizard couldn't be confirmed when the list of fields was empty, even if \"Next disc on field change\" was disabled.\nCHG: added tooltip for cover text at Tag Panel if text is clipped.\nFIX: confirmation message loop when changing file selection to already selected files after Tag Panel edits if asking for writing unsaved changes was enabled.\nNEW: added support for Matroska stereoscopic video *.mk3d files.\nNEW: added support for Matroska stereoscopic video *.mk3d for Explorer context menu shell extension (requires restart to be updated if already installed).\nFIX: action Split field by separator did not trim spaces from resulting values. (#69981)\nFIX: MP3 length could be slightly inaccurate for large constant-bitrate files if some frames used padding and others don't. (#69894)\nFIX: MP4 gnre atom for GENRE used type identifier that was incompatible with Apple Music so that \"Unknown Genre\" was displayed instead of the actual genre (since v3.31b).\nFIX: MP4 fields TOTALTRACKS and TOTALDISCS were not written, if accompanied TRACK and DISC were not changed (since v3.31b).\nFIX: runtime error when rewriting FLAC files via temporary file (since v3.31b).\nCHG: improved formatting for preview at 'Convert > Tag - Tag'. (#69508)\nFIX: runtime error that occurred when opening 'Manage covers...' and one of the selected files had an invalid cover which could not be displayed.\nFIX: added special handling for situations where writing to FLAC files was prevented by Windows Controlled Folder Access and resulted in a crash.\nCHG: in case a Nero tag needs to be written, it's now using a minimal version without duplicating other metadata. (#67243, #69322)\nNEW: added `$dedup(x,y,c)` scripting function, which removes duplicated strings from `x`, separated by `y`, optionally using case-insensitive comparison if `c` is set to `1`. (#69515)\nLNG: updated Brazilian Portuguese, Catalan, Corsican, Italian, Simplified Chinese, Slovak, Spanish, and Ukrainian translation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.32","version":0,"site":"https://www.mp3tag.de/en","source":"Florian Heidenreich","license_or_tos":"Freeware","resources":null,"verified":false}