{"appId":"w:FlorianHeidenreich.Mp3tag","appShortcutName":"Mp3tag","appDisplayName":"Mp3tag","authorId":"w:winget","releaseTagName":"winget-3.33.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.mp3tag.de/mp3tag-v3.33.1-x64-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The universal tag editor and more...\n\nMp3tag is a powerful and easy-to-use tool to edit metadata of audio files.\nIt supports batch tag-editing of ID3v1, ID3v2.3, ID3v2.4, iTunes MP4, WMA, Vorbis Comments and APE Tags for multiple files at once covering a variety of audio formats.\nFurthermore, it supports online database lookups from, e.g., Discogs, MusicBrainz or freedb, allowing you to automatically gather proper tags and download cover art for your music library.\nYou can rename files based on the tag information, replace characters or words in tags and filenames, import/export tag information, create playlists and more.\nCHG: replacing cover art using 'Manage covers...' now opens the same folder as adding cover art via the Tag Panel context menu.\nCHG: improved handling of long paths when adding images via drag and drop at 'Manage covers...'.\nCHG: improved handling of long paths in the File Explorer context menu shell extension (requires restart to be updated if already installed).\nCHG: reverted previous change to reuse unmodified ID3v2 frames and added an advanced configuration option to enable reuse.\nCHG: reverted previous change to reuse unmodified MP4 atoms and added an advanced configuration option to enable reuse.\nCHG: flipped directions when scrolling horizontally in File List via Shift + mouse wheel.\nFIX: adding covers via Add Cover not always opens the configured cover directory if it's based on a format string. (#70562)\nCHG: improved detection of move operations on drag and drop to external applications. (#70553)\nLNG: updated Catalan, Polish, Simplified Chinese, Slovak, and Spanish Itranslation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.33.1","version":0,"site":"https://www.mp3tag.de/en","source":"Florian Heidenreich","license_or_tos":"Freeware","resources":null,"verified":false}