{"appId":"w:FlorianHeidenreich.Mp3tag","appShortcutName":"Winget Application","appDisplayName":"Mp3tag","authorId":"w:winget","releaseTagName":"winget-3.29","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.mp3tag.de/mp3tagv329-x64-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The universal tag editor and more...\n\nMp3tag is a powerful and easy-to-use tool to edit metadata of audio files.\nIt supports batch tag-editing of ID3v1, ID3v2.3, ID3v2.4, iTunes MP4, WMA, Vorbis Comments and APE Tags for multiple files at once covering a variety of audio formats.\nFurthermore, it supports online database lookups from, e.g., Discogs, MusicBrainz or freedb, allowing you to automatically gather proper tags and download cover art for your music library.\nYou can rename files based on the tag information, replace characters or words in tags and filenames, import/export tag information, create playlists and more.\nCHG: further compatibility improvements regarding cover-type handling for MP4.\nCHG: improved running Mp3tag from elevated installer to start process unelevated. (#67863, #67917)\nCHG: improved calculation of bitrate for CBR MP3 files with a Xing Info header.\nNEW: added scripting function `sort` to sort parts of a given string delimited by a given delimiter string. (#44129, #61706, #65925, #67901)\nCHG: added option to run Mp3tag from installer. (#67791)\nCHG: running Mp3tag process is closed during installation. (#67791)\nCHG: improved detection and skipping of invalid ID3v2 frame IDs to prevent ID3v2 parse errors.\nNEW: added mapping of `ENCODERSETTINGS` to `ENCODER_SETTINGS` for Matroska files.\nCHG: use T=60 als target type for `ALBUM` and `SETSUBTITLE` with MKV Matroska video files.\nCHG: use T=50 als target type for `TITLE` with MKV Matroska video files.\nCHG: use T=50 als default target type for MKV Matroska video files.\nNEW: added mapping of `TVEPISODE` to T=50 `PART_NUMBER` for MKV Matroska video files. (#41736, #67118)\nNEW: added mapping of `TVSEASON` to T=60 `PART_NUMBER` for MKV Matroska video files. (#41736, #67118)\nFIX: buttons to navigate between multiple covers at Extended Tags overlapped the cover window in some cases. (#67543)\nFIX: runtime error if malformed image data for cover thumbnails is returned from a tag source. (#67584)\nCHG: added support for writing covers of type Artist, Media, and Icon for MP4 via Nero tags to improve compatibility with other apps.\nCHG: moved configuration options to top of Tag-Panel context menu. (#67393)\nCHG: added workaround for drop sources that don't support the link drop effect (e.g., iTunes). (#67363, #67368)\nCHG: progress reporting in taskbar button when exporting files is performed in one-percent increments.\nCHG: progress reporting when exporting files requires less updates of the user interface.\nCHG: progress reporting in taskbar button when reading files is performed in one-percent increments.\nCHG: use link instead of move drop effect when dropping files to File List to prevent files being removed from the drop source. (#63359, #66931)\nCHG: use favorite directory as initial directory when changing directory from the empty startup directory.\nCHG: added workaround to read ID3v2.4 frames with incorrect encoding of unsynced integers.\nCHG: multiple genre fields are now written using the respective MP4 atom identifiers and not as custom fields to improve compatibility with other apps. (#66861)\nCHG: added code-signing to uninstaller.\nLNG: updated Corsican, French, Polish, Korean, Simplified Chinese, Turkish, and Ukrainian translation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.29","site":"https://www.mp3tag.de/en","source":"Florian Heidenreich","license_or_tos":"Freeware","resources":null,"verified":false}