{"appId":"w:Flow_Launcher.Flow_Launcher","appShortcutName":"Flow Launcher","appDisplayName":"Flow Launcher","authorId":"w:winget","releaseTagName":"winget-2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Keystroke launcher for Windows to search, manage and launch files, folders bookmarks, websites and more.\n\n\nRelease notes\nHighlights\nDialog Jump\n- Use Alt+G to quickly jump the Open/Save As dialog window path to the path of the active file manager.\n- Search for a file/folder and quickly jump to its path in the Open/Save As dialog window. This is enabled via settings 'General' section.\nAutomatic Plugin Update Check\n- A new option to enable automatic checking for plugin updates.\n- A new update dialog will allow for selective plugin updating.\nRelease Notes Window\n- A release notes window will be available when a new update arrives, allowing you to check the release notes directly from the app. You can also access this window from the \"About\" section in settings.\nDouble Pinyin Search\n- When the \"Search with Pinyin\" option is enabled via settings, a new option for Double Pinyin search will also be available.\nPrevious Windows Versions\nFrom this release onward, Flow will only be compatible with Windows 10, 11, and future versions. This is because the newer libraries and frameworks we plan to adopt are no longer compatible with older versions of Windows. Only v1.20.x will remain compatible with Windows 7 and above.\nNew & Updated Plugins\nNew and updated plugins will no longer be available for versions of flow prior to v2.0.0. This is because the default plugins have been upgraded to .NET 9, making them incompatible with older versions.\nFeatures\n- Added the ability to rename the Explorer plugin's Quick Access Links.\n- Improved image icon loading performance.\n- Web Search plugin can now set private mode for its queries.\n- Added a new language: Srpski (Cyrillic).\n- The Calculator plugin now works with either a comma or a dot as its thousands separator.\n- Added a delete confirmation when deleting Quick Access Links and paths excluded from Windows Index search.\n- The Sys plugin now displays all usable commands when its action keyword is triggered without a search query.\n- Added an API function for plugins to determine whether the flow is currently using a dark theme.\n- Added an API function for plugins to be invoked when the theme is changed.\n- Added the ability for plugins to set their own query suggestion text via Result.QuerySuggestionText.\n- The Program plugin now displays all programs when its action keyword is triggered without a search query.\n- The Calculator plugin now supports using hexadecimal numbers.\n- Added a new date and time format options: \"dd MMMM yyyy\" & \"yyyy-MM-dd\".\n- Improved the UI for adding Quick Access Links.\n- Improved the UI for adding action keywords.\n- Added a new API function to show a message with custom buttons.\n- Added a new option in the Explorer plugin to display a file or folder's size and age in the plugin result's tooltip.\n- Added a new date format in the Explorer plugin's Preview Panel settings.\n- Added folder information in the preview panel for folder results in the Explorer plugin.\n- Added a new option to show the search window at topmost.\n- Added ability for plugin to set a minimum required flow version. This is done via the plugin manifest by setting a \"MinimumAppVersion\" property.\n- Updated to .NET 9.\nBug fixes\n- Fixed some minor issues with the Explorer plugin's preview panel.\n- Fixed an issue that caused a pop-up error message after opening a file's containing folder.\n- Fixed a possible recursive image loading issue.\n- Fixed a property binding issue in the Web Search plugin.\n- Fixed an issue with mouse hovering on items in the \"Plugins\" section of settings.\n- Corrected typos in the Calculator plugin's translation strings.\n- Added a warning message to notify that the preview panel requires a minimum height to properly render content, maximum number of results set below this height may not take effect.\n- Stopped a customized preview panel from being created when the preview is turned off.\n- Fixed an issue that caused the flow to crash when the error report window's URL was invalid.\n- Fixed missing translations and UI issues for some message boxes.\n- Fixed an issue with the Browser Bookmark plugin that caused a random high CPU load.\n- Fixed an incorrect Quick Access Link type display.\n- Updated translations\nContributions\nWe would like to directly mention and thank the following people (in alphabetical order) for their contribution and support in this release.\n@01Dri, @dcog989, @Jack251970, @onesounds, @stefanroelofs, @taooceros, @TBM13, @VictoriousRaptor, @WayneFerdon, @Yusyuriv, @zoltanvi","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.0.0","site":"https://github.com/Flow-Launcher/Flow.Launcher","source":"Flow-Launcher Team","license_or_tos":"MIT","resources":null,"verified":false}