{"appId":"w:Foundry376.Mailspring","appShortcutName":"Mailspring","appDisplayName":"Mailspring","authorId":"w:winget","releaseTagName":"winget-1.18.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Foundry376/Mailspring/releases/download/1.18.0/MailspringSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Boost your productivity and send better email with Mailspring, the best mail client for Mac, Linux, and Windows.\n\n\nFeatures:\n- Grammar check is now available in the composer! (#2612)\n  - This feature relies on a deployment of LanguageTool at id.getmailspring.com - when you use Grammar Check, small snippets of your draft are sent to this server, but the requests are not logged and no message data is stored.\n  - This feature is disabled by default. To turn it on, click the new icon in the composer toolbar.\n- Mailspring now properly detects \"Do Not Disturb\" status on MacOS Sequoia and on Windows.\nBug Fixes:\n- On Wayland, the --background flag now shows the main window briefly then hides it, which is the best we can do under Wayland's rules. (#2623)\n- On Wayland, fixed a keyboard freeze in the composer caused by a double focus() call. (#2622)\n- Fixed sound notifications playing on Windows regardless of the notification preference. (#2619)\n- Fixed the tray icon theme detection on GNOME/Unity Linux desktops. (#2610)\n- Fixed a crash in vCard parsing when the VERSION line is not found.\n- Fixed an issue with the first CardDAV sync incorrectly seeing existing ETags in mailsync.\n- Fixed IMAP IDLE to process VANISHED notifications sent by FastMail (and possibly other providers).\n- Fixed folder priority logic that was incorrectly applied to non-iCloud accounts in mailsync.\nImprovements:\n- Added support for the stnadard biographies / notes field on contacts. (#2621)\n- Rearranged the thread context menu to reduce accidental destructive actions. (#2620)\n- Added an empty state to the calendar when no CalDAV accounts are connected. (#2625)\n- The draft window now uses the message subject as the window title.\n- Improved read receipt tracking pixel reliability. (#2613)\n- Improved mail rules robustness and fixed condition evaluation bugs. (#2616)\n- Added VTIMEZONE to created calendar events so they are created on Yahoo in the correct timezone.\n- Enabled CalDAV discovery to support Fastmail, Yahoo, and other providers in the upcoming calendar.\n- On Windows, the app icon is now a rounded square to better fit with Windows 11 design guidelines.\nDeveloper:\n- Replaced CSS-based platform hiding with React conditionals in preferences. (#2614)\n- Removed subpixel-antialiased font smoothing overrides. (#2618)\n- Added syncInit to main-calendar to eliminate a 2.5s startup delay. (#2606)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.18.0","version":0,"site":"https://www.getmailspring.com/","source":"Foundry 376, LLC","license_or_tos":"GPL-3.0","resources":null,"verified":false}