{"appId":"w:Foxit.PhantomPDF","appShortcutName":"Foxit PDF Editor","appDisplayName":"Foxit PDF Editor","authorId":"w:winget","releaseTagName":"winget-14.0.0.33046","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://cdn01.foxitsoftware.com/product/phantomPDF/desktop/win/14.0.0/FoxitPDFEditor140_L10N_Setup_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Powerful desktop PDF solution to create and edit PDF documents and integrate with Foxit eSign.\n\n\nNew Features and Improvements in Foxit PDF Editor 14.0.0.33046\n- Create organized PDF binders (Pro only)\n  The Binder feature offers an efficient way to compile and organize multiple documents in different formats into a single file - a PDF binder, with the support of various customizations like TOC (table of contents) generation. This feature is useful for users such as legal professionals or sales representatives to easily consolidate multiple related documents into one cohesive presentation or report. It supports creating a blank binder project or creating one from an existing template on a local computer or in iManage 10, as well as opening, editing, and saving existing projects.\n- Allows users to quickly add tickmarks (including symbols, numbers, and letters) to a PDF like a stamp. (Pro only)\n- Enhanced protection with sensitivity labels using Microsoft Azure Information Protection\n  - Support User Defined Permissions (UDP) Labels to let users assign permissions when they apply the sensitivity labels to PDF files, granting users the desired flexibility within the scope of organization’s security policies to improve the productivity.\n  - Organization administrator can configure Default Labeling and Mandatory Labeling policies to apply a default label pre-set by the administrator or require users to add a sensitivity label when saving PDF files.\n- View, navigate, measure, and comment on 3D content in glTF (GL Transmission Format) format in PDF documents.\n- Sign and verify digital signatures using the new Hash algorithms in compliance with ISO/TS 32001 and ISO/TS 32002.\n- Improve the accessibility features associated with keyboard shortcuts, button identifiers, and object focus to deliver a better user experience.\n- Modify the page size for multiple documents at once.\n- Support Vietnamese and Indonesian text recognition in the OCR feature.\n- Support HKSCS (Hong Kong Supplementary Character Set) coded in ISO 10646.\n- Save or import document metadata (the document information such as the document’s title, author, and keywords) in XMP format, making it easier to share metadata among different documents.\n- Allow end users to upgrade Foxit PDF Editor without requiring admin rights.\n- Enterprise admins can set a domain whitelist or blacklist using GPO templates or Foxit Customization Wizard to restrict end users with specific email addresses from allowed domains from logging into the application.\n- The Combine feature allows users to preview page thumbnails of each file and rearrange pages by deleting or reordering thumbnails before combining the files.\n- Provide a native 64-bit version of the application to enhance the performance on 64-bit systems.\n- Provide support for Microsoft’s Double Key Encryption (DKE), which protects highly sensitive data by using two encryption keys—one controlled by the user and another stored securely in Microsoft Azure.\n- Enable admins to use deployment tools to configure a shared location for templates, including watermarks, backgrounds, headers/footers, and stamps, across the organization.\n- Compatible with USB writing pads for users to add handwritten signatures as stamps in PDFs conveniently.\n- Encrypt and decrypt PDF files using AES GCM encryption algorithm in compliance with ISO/TS 32003.\n- Other enhancements to the user experience.\nIssues Addressed in Foxit PDF Editor 14.0.0.33046\n- Fixed some security and stability issues. Click here for details.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"14.0.0.33046","version":0,"site":"https://www.foxit.com/","source":"Foxit Software Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}