{"appId":"w:Foxit.PhantomPDF.Subscription.MSI","appShortcutName":"Foxit PDF Editor (MSI)","appDisplayName":"Foxit PDF Editor (MSI)","authorId":"w:winget","releaseTagName":"winget-2025.3.0.35737","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn01.foxitsoftware.com/product/phantomPDF/desktop/win/2025.3.0/FoxitPDFEditor20253_L10N_Setup_Prom_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Powerful desktop PDF solution to create and edit PDF documents and integrate with Foxit eSign.\n\n\nNew Features and Improvements in Foxit PDF Editor Subscription Release 2025.3.0.35737\n- New features and enhancements for AI Assistant\n  - Add AI powered image generation from text prompts or reference photos, and AI driven image editing inside PDFs.\n  - Enable exporting AI Assistant responses, including summaries, reports, and insights, directly to Word or PDF.\n  - Support additional languages for translations and AI responses.\n  - Make Document Summary easier to access with a new ribbon button and panel, allowing users to extract key information without extra clicks.\n- The enhanced Comment feature\n  - Enable proper display and editing of comments generated by external PDF editors.\n  - Easily create a CSV summary of your PDF comments with customizable columns, allowing you to select desired comment types, page ranges, and sorting options before export.\n  - Add the ability to save custom annotations as favorites/templates in the Favorite Toolbox panel of the navigation pane for easy reuse.\n- The Create Sequential Stamp feature automatically updates with sequential numbers or letters each time a stamp is applied, streamlining labeling for healthcare, legal, and version control workflows.\n- Add settings to remove hidden information (including metadata, embedded content, and scripts) from PDFs before closing them or emailing them using the PDF Editor’s Email feature.\n- Other enhancements to the user experience.\nIssues Addressed in Foxit PDF Editor Subscription Release 2025.3.0.35737\n- Fixed some security and stability issues. Click here for details.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.3.0.35737","version":0,"site":"https://www.foxit.com/","source":"Foxit Software Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}