{"appId":"w:FutureFiniti.Fotosizer","appShortcutName":"Winget Application","appDisplayName":"Fotosizer","authorId":"w:winget","releaseTagName":"winget-3.19.0.588","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.fotosizer.com/fsSetup319.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free batch photo/image resizer tool\n\nFotosizer is a free batch photo/image resizer tool. It lets you resize hundreds of photos in a matter of minutes in a quick and easy way.\n- Fixed details panel being hidden properly in Resize progress dialog.\n- Fixed \"unsupported culture error\" when opening Options dialog on some computers.\n- Fixed error when panning preview images in Preview changes window when no images.\n- Fixed word wrapping of before and after filenames in Preview changes window when the \"Show original image\" button is toggled off.\n- Fixed slow startup on some computers due to font loading of watermarks settings.\n- Fixed displaying original image in Preview changes window when \"Show original image\" button is toggled back on.\n- Fixed backslash characters being changed to \"-\" in filename mask stopping new folders being dynamically created.\n- Fixed the \"after resize\" filename in Image selection list so that it correctly reflects a lower case file extension when the \"Force lower-case file extensions\" Destination setting is ticked.\n- Fixed the \"after resize\" filename in Preview changes window so that it correctly reflects a lower case file extension when the \"Force lower-case file extensions\" Destination setting is ticked.\n- Fixed maintaining transparency when using Temperature, Vibrance or Shadows colour adjustment settings.\n- Applied corrections to Dutch language translations.\n- Removed auto rotation checkbox in Options dialog. Fixed so images do not change orientation when this setting was not ticked.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.19.0.588","site":"https://www.fotosizer.com/","source":"Fotosizer.com","license_or_tos":"Proprietary","resources":null,"verified":false}