{"appId":"w:FutureFiniti.Fotosizer","appShortcutName":"Fotosizer","appDisplayName":"Fotosizer","authorId":"w:winget","releaseTagName":"winget-3.20.0.590","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.fotosizer.com/fsSetup320.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free batch photo/image resizer tool\n\nFotosizer is a free batch photo/image resizer tool. It lets you resize hundreds of photos in a matter of minutes in a quick and easy way.\n- Added \"Use system setting\" for dark mode on Options dialog. This will mirror the Theme setting used in Windows.\n- Improved application icon quality.\n- Added \"Show image (x/y) on the Preview changes window title bar.\n- Added \"Sort\" menu option to Image selection list toolbar.\n- Added UI changes to banner and options dialog.\n- Added /DESKTOP=1 command line parameter option to Fotosizer installer to be able to set the desktop shortcut option during a silent installation.\n- Added /QUICKLAUNCH=1 command line parameter option to Fotosizer installer to be able to set the quick launch bar shortcut option during a silent installation.\n- Added /AUTOCHECKFORUPDATES=1 command line parameter option to Fotosizer installer to be able to set the automatically check for updates option during a silent installation.\n- Added /SHELLEXT=1 command line parameter option to Fotosizer installer to be able to set the integrate Fotosizer into Windows Explorer context menu option during a silent installation.\n- Added the ability to reorder images in Image selection list by mouse drag and drop.\n- Added ability to resize Profile options dialog.\n- Added Delete option to Profile options dialog.\n- Added ability to select multiple profiles and apply actions.\n- Fixed remembering of Image list column visible selections.\n- Fixed remembering of \"Maintain Aspect Ratio\" for Crop and Pad resize modes.\n- Fixed saving of EXIF comments when the comments are Unicode or UTF8 encoded.\n- Fixed Watermark font size when disabled in dark mode.\n- Fixed rotation changing so that it refreshes preview.\n- Fixed display of EXIF comments in text watermarks.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.20.0.590","version":0,"site":"https://www.fotosizer.com/","source":"Fotosizer.com","license_or_tos":"Proprietary","resources":null,"verified":false}