{"appId":"w:Garmin.BaseCamp","appShortcutName":"Garmin BaseCamp","appDisplayName":"Garmin BaseCamp","authorId":"w:winget","releaseTagName":"winget-4.7.5.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Make the most of your next outdoor activity, or relive the trips you’ve taken. BaseCamp lets you plan outdoor activities, organize your data and share your adventures with others.\n\nMake the most of your next outdoor activity, or relive the trips you’ve taken. BaseCamp lets you plan outdoor activities, organize your data and share your adventures with others.\n\nFeatures:\nPlan a Trip\nUse BaseCamp software to plan your next hiking, biking, motorcycling, driving or off-roading trip. You can view maps, plan routes, and mark waypoints and tracks from your computer — then transfer them to your device.\n- The Track Draw feature lets you trace your planned route and view elevation changes, helping you estimate the difficulty of a hike or bike ride.\n- Plan the perfect scenic route for your next road trip, making sure your navigator takes you through certain waypoints.\n- Play back your routes and tracks over time, and save and share your adventure.\nOverview\n- Import and view maps in 2-D or 3-D, including TOPO and City Navigator® maps.\n- Create, edit and organize routes, waypoints and more on your computer.\n- View BirdsEye Satellite Imagery, BirdsEye TOPO Raster or BirdsEye Select Raster maps, and transfer the data to your device (subscriptions required).\n- Create and share geotagged photos.\n- View playback of routes, tracks and adventures.\nSurvey the Terrain\nBaseCamp displays your topographic map data in 2-D or 3-D on your computer screen, including contour lines and elevation profiles. Load map data from your handheld device, or import maps you've downloaded or purchased on DVD or microSD™ card. Consider our TOPO series maps, which offer detail on a scale of either 1:100,000 or 1:24,000.\nGeotag Photos\nBaseCamp software lets you geotag photos, associating them with specific waypoints. You can see the exact scenery at any given location. Transfer the photos to your handheld device or email your geotagged photos directly to friends or family so they can navigate right to your favorite spots in the future.\nTransfer Satellite Images\nWith BaseCamp and a BirdsEye Satellite Imagery subscription, you can transfer an unlimited amount of satellite images to your outdoor or fitness device and seamlessly integrate those images into your maps to get a true representation of your surroundings. It makes it easy to scout campsites, sources of water, potential hazards and more. If you prefer raster topographic maps, you can also download BirdsEye Select maps and pay only for the data you download.\nChanges\n- Various stability and bug fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.7.5.0","version":0,"site":"https://www.garmin.com/","source":"Garmin Ltd or its subsidiaries","license_or_tos":"Proprietary","resources":null,"verified":false}