{"appId":"w:gileli121.windowtop","appShortcutName":"WindowTop","appDisplayName":"WindowTop","authorId":"w:winget","releaseTagName":"winget-5.28.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/WindowTop/WindowTop-App/releases/download/5.28/WindowTop.5.28.6.-.setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"WindowTop is a powerful Windows window manager and productivity tool that lets you keep any window always on top, create floating Picture-in-Picture (PiP) windows, adjust window opacity and transparency, and easily manage multiple windows with Anchors.\n\nWindowTop is a powerful Windows window manager and productivity tool that lets you keep any window always on top, create floating Picture-in-Picture (PiP) windows, adjust window opacity and transparency, and easily manage multiple windows with Anchors.\n\nWhether you want to overlay transparent windows while working, watch videos while gaming, or reduce eye strain with Dark Mode, WindowTop gives you full control over your Windows desktop multitasking. Start using it for free and unlock advanced features with the Pro version!\n\nKeep any window always on top of others and highlight it with a customizable colored border. Easily adjust frame color, thickness, and behavior from the Always on Top settings — perfect for multitasking, monitoring apps, or staying focused while working.\n\nNeed faster access to your windows? Anchors let you instantly bring windows to focus with a single click — faster than ALT+TAB and perfect for touchscreens. Instead of keeping windows always on top, use Anchors to quickly reopen minimized or background windows.\nMajor Feature Updates (5.28)\nImplemented support to self-update in the non-Microsoft Store version (#440).\nUntil now, only a version installed through the Microsoft Store could update itself.\nIf you installed the software via the regular installer and a new version was released, the user had to manually download the new installer from here and run it.\nNow, that’s no longer the case—when a new version is available, the software will simply ask if you want to update. Just click YES and the whole process will run automatically. You won’t need to do any manual work to update. Click YES to update, and it is take care for you :)\nIn addition, since 5.28.6 we added traditional Chinese language thanks to 朱逸民! (#450)\n\nMinor Changes (5.28.X)\n5.28.6\n- Fixed a few translation mistakes in Traditional Chinese. Thanks to 朱逸民! (#450)\n5.28.6 (Beta until proven stable)\n- Added a translation to Traditional Chines. Thanks to 朱逸民! (#450)\n5.28.4\n- Implemented support to reduce window opacity below 3%, down to 1% (#443)\nimage image\n5.28.3\n- Fixed bug that PiP & Crop position is not saved and applied via the \"Save window configuration\" feature (#448-comment)\n5.28.2 (Beta until proven stable)\n- Fixed bug where Crop and PIP settings, as well as other settings such as opacity, were not saved for PiP mode via the \"Save window configuration\" feature (#448)\n5.28.1\n- Change the implementation to use %temp%/windowtop instead of %appdata%/windowtop/temp for downloading the update, and make a minor change to the update file name.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.28.6","version":0,"site":"https://github.com/BiGilSoft/WindowTop","source":"BiGilSoft","license_or_tos":"Copyright (c) 2019, gileli121@gmail.com","resources":null,"verified":false}