{"appId":"w:GiMeSpace.RAMTempFolderPro","appShortcutName":"GiMeSpace RAM Folder Pro","appDisplayName":"GiMeSpace RAM Folder Pro","authorId":"w:winget","releaseTagName":"winget-2.3.1.53","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://gimespace.com/GMSRAMProX64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GiMeSpace RAM Folder Pro makes it possible to assign folders that will only store files in the RAM memory instead of on your disk as well as providing a safe write caching for file writes.\n\nGiMeSpace RAM Folder Pro makes it possible to assign folders that will only store files in the RAM memory instead of on your disk as well as providing a safe write caching for file writes. So it combines the best of both RAM disk and disk caching programs but with minimal overhead making this program even faster than those programs.\n\nWhat is the use of this?\n- The windows temporary folder is usually full of needless files that keep piling up wasting you disk space. This program can keep all of them in RAM and discard them when no longer needed.\n- By assigning as specific folder as a RAM folder you get file access that is as fast as your RAM access which can greatly speedup certain programs including games. Because it has much smaller overhead, this program is even much faster than the fastest RAM disk programs. Tests show it is between 2x (sequential access) and 20x (random access) faster than tradition RAM Disks!\n- Excess disk writes on a SSD disk can wear out the disk over time. This program can help you extend the life time of a SSD disk by avoiding disk writes.\n- Some programs use your disk as external memory even if you have enough RAM available. Examples are audio/video editors and many other programs that use a lot of memory. This program will instead use your RAM and avoids needless disk access while at the same time speeding up these programs because RAM is much faster than even the fastest SSD.\n- This program can even use the VRAM of your dedicated graphics card to store files making sure you use all the fast storage memory that is available in your system.\n\ntry for maximum 30 days for free without paying\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.1.53","version":0,"site":"https://gimespace.com/","source":"GiMeSpace","license_or_tos":"Proprietary","resources":null,"verified":false}