{"appId":"w:GitButler.GitButler","appShortcutName":"GitButler","appDisplayName":"GitButler","authorId":"w:winget","releaseTagName":"winget-0.17.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://releases.gitbutler.com/releases/release/0.17.1-2540/windows/x86_64/GitButler_0.17.1_x64_en-US.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Git client for simultaneous branches on top of your existing workflow.\n\n\n# 0.17.1\n\n## GitHub Integration\n- Adds support for Github Enterprise\n- Adds support for configuring personal access tokens a credential option\n\n## CLI\n- Adds support for creating PRs `but review --help`\n\n## Fixes\n- Fixes an issue where Azure DevOps remotes are incorrectly considered Gerrit on project add\n- Fixes a Gerrit specific issue where commits with a \"private\" option did not parse the review ID correctly\n- Fixes a GitLab specific issue where Draft MRs were not prefixed correctly\n- Fixes an issue where in some cases applying a branch will incorrectly prompt for a fork name\n\n# 0.17.0\n\n## Gerrit support\nGitButler now supports working Gerrit remotes. Docs: https://docs.gitbutler.com/features/gerrit-mode\n- Commits and pushes are performed in the way that a Gerrit server expects them \n- Adding topics, hashtags, status is supported\n- Review URLs are accessible from GitButler\n- Accessible with both the GUI and the CLI\n\n## GitHub integration\n- It is now possible to configure different GitHub credentials (eg. Work and Private) for different projects in the app\n- It is no longer required to be logged in with a GitButler account to be able to configure a GitHub integration. \n\n## CLI\n- You can now setup a shell auto completion `eval \"$(but completions zsh)\"` (NB: replace zsh with your shell of choice and add this to your respective `~/.zshrc` file)\n- It is now possible to push with the CLI (`but push --help`)\n- Status can now display code review status (`but status -r) (GitHub and Gerrit supported)\n- When referencing branch names, ambiguity is now gracefully handled.\n\n## CLI Breaking changes\n- The `but` binary is now the same as the one that launches the UI (for improved compatibility) - it will be necessary to re-link it from the app settings)\n\n## Codegen (Claude Code)\n- There is now an experimental feature toggle \"Codegen (workspace)\" which enables the ability to use Claude Code directly from the workspace (in-line with branch and commit data)\n- It is now possible to reference project files (begin typing @filename for fuzzy searching)\n- Pressing enter now produces a new line (and Cmd/Control + Enter submits) - this can be reversed in the settings\n\n## Other changes\n- GitLab - Fixes an issue where \"create merge request\" does nothing\n- Adds Haiku as a commit/branch name generation model option\n- Fixes an issue where when setting a new base branch did not perform a checkout\n- Improved submodule support","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.17.1","version":0,"site":"https://gitbutler.com/","source":"GitButler","license_or_tos":"Functional Source License, Version 1.1, MIT Future License","resources":null,"verified":false}