{"appId":"w:GlavSoft.RemoteRipple","appShortcutName":"Remote Ripple","appDisplayName":"Remote Ripple","authorId":"w:winget","releaseTagName":"winget-1.2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://remoteripple.com/downloads/RemoteRipple-1.2.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A modern lightweight viewer based on TightVNC technology.\n\nRemote Ripple is a new generation TightVNC Viewer developed by the same creators (GlavSoft). It is used for accessing remote PCs from mobile and desktop, and it is free even for commercial use.\nNew Design and User Experience:\n- The user interface in viewer tabs has been redesigned to ensure consistency with MightyViewer (a tool you should definitely check out — it might be the perfect fit for your particular needs!).\n- The number of saved connections has increased from 10 to 100.\nNew Features:\n- Implemented multi-monitor support. Now you can choose a specific monitor in the viewer when the remote host has multiple monitors connected. This feature works when connected to TightVNC Server for Windows, starting with version 2.8.81.\n- Added desktop scaling.\n- Added an option to save VNC passwords.\n- Improved handling of authentication failures. The viewer now prompts for a password again if the previous password was incorrect.\n- Enabled editing of station names in the list of recent connections.\n- Made logging configurable.\nBug Fixes:\n- Fixed an issue where the Home tab failed to display on startup.\n- Fixed a keyboard issue with the Alt-Gr key in Spanish, French, and German keyboard layouts.\n- Fixed incorrect session saving when starting a connection from the address line.\n- Fixed a memory leak (a bug fix in the Remote Core SDK).\n- Port numbers can now be specified with a single colon, e.g., :5900, instead of requiring two colons (::5900).\n- Various minor improvements and bug fixes.\nOther Improvements:\n- Enhanced error handling and improved displaying of error messages.\n- Added links to the MightyViewer and Remote Core SDK websites from the Remote Ripple user interface.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.0.0","version":0,"site":"https://remoteripple.com/","source":"GlavSoft LLC.","license_or_tos":"Proprietary","resources":null,"verified":false}