{"appId":"w:GnuCash.GnuCash","appShortcutName":"GnuCash","appDisplayName":"GnuCash","authorId":"w:winget","releaseTagName":"winget-5.12","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Personal and small-business financial-accounting software\n\nGnuCash is personal and small-business financial-accounting software, freely licensed under the GNU GPL and available for GNU/Linux, BSD, Solaris, Mac OS X and Microsoft Windows.\nDesigned to be easy to use, yet powerful and flexible, GnuCash allows you to track bank accounts, stocks, income and expenses. As quick and intuitive to use as a checkbook register, it is based on professional accounting principles to ensure balanced books and accurate reports.\nGnuCash 5.12 Released\nThe GnuCash development team announces GnuCash 5.12, the thirteenth release in the stable 5.x series.\nBetween 5.11 and 5.12, the following bugfixes were accomplished:\n- Bug 648768 - Warning \"Change Reconciled Split\" has wrong cursor focus\n- Bug 797766 - Automatic decimal point doesn't work properly with zeros when entering stocks.\n  Preserve the decimal point when printing numbers with no decimal places to stop the auto-decimal code from triggering when exiting the field.\n- Bug 799490 - Error on start or opening a gnucash file: Can't parse the URL\n- Bug 799506 - reconcile bad date pops to 1969\n- Bug 799521 - Segmentation fault on Autocomplete of Description with ß\n- Bug 799572 - Return proper status code when Finance::Quote errors during price quote retrieval via CLI.\n- Bug 799580 - Swiss currency symbol is displayed as SFr. instead of CHF\n  Replace SFr. with Fr. as SFr. is obsolete but Fr. is still widely used. This is the local symbol so users who want CHF can set it in the security editor.\n- Bug 799582 - Mortgage and Loan Assistant - Compounding Formula\n  Adds a semi-annual compounding period for Canadians and implements the more correct simple-rate formula provided by a Canadian licensed accountant. Also adds support for day-interval loan payments, ensures that the formula on the repayment page reflects changes on that page, ensures that the number and amounts of payments are correct when payments are more frequent than monthly, use the correct intest rate for compunding calculations, and fixes some memory issues.\n- Bug 799590 - Pressing enter after changing date on initial reconcile information window does not change ending balance.\n- Bug 799592 - \"No transactions found\" when importing CSV transactions\n- Bug 799593 - macOS: mariadb hardcodes plugin paths to original install directory.\n- Bug 799594 - GnuCash 5.11 fails to build with boost 1.88\n- Bug 799597 - Crash when deleting all splits in General Journal\n- Bug 799602 - Unit Price on Invoice will NOT display as decimals\n- Bug 799603 - Does not save to mysql on localhost.\n- Bug 799623 - test-backend-dbi fails after 2038\nThe following fixes and improvements were not associated with bug reports:\n- [reports]Lazily generate sub-reports. Reports with links to detail sub-reports like the budget reports would take a long time to generate because they built both the main report and all of the sub-reports. Now the sub-reports generate when the user clicks the link in the main report.\n- Security editor quote sources: Add new source, China Merchants Bank. Remove no longer supported F::Q Modules Bloomberg.pm, DWSFunds, Investor's Exchange (U.S.), Morningstar Australia, Skanddinaviska Enskilda Banken, Tiaacref.pm, Troweprice.pm and many of the multi-source sources from the Security Editor.\n- [import-main-matcher.cpp] Add tooltips to transaction A, U+C, and C action columns in the generic transaction import matcher.\n- [reports] Use ICU for Unicode string comparison and substring search because it knows how to correctly localize comparisons of accented and unaccented characters.\n- [reports] more robust error handling if target report doesn't exist.\n- Register: Ensure splits belong to transaction when doing bulk operations on a transaction's splits.\n- Drop the definition of __EXTENSIONS__ from three files and instead move it to compiler options if on a platform that needs it.\n- Avoid non-POSIX \"echo -n\" behavior in util/gnc-vcs-info.\n- Add testbuild target which builds tests without running them to accommodate packaging processes that run ctest separately.\n- [engine.i] convert gnc_account_accumulate_at_dates to c++.\n- [gnc-engine-guile.cpp] helper gnc_split_to_scm function.\n- [gnc-engine-guile] reduce overhead of gnc_foo_to_scm by caching the result of SWIG_TypeQuery(typestr)\n- [balance-forecast] optimise some loops: fewer temporary lists and gc\n- Let cmake probe for the existence of HAVE_STRUCT_TM_GMTOFF, fix build of test-gnc-date on systems without HAVE_STRUCT_TM_GMTOFF, and avoid unused variable warnings on systems without HAVE_STRUCT_TM_GMTOFF\n- Wrap include of gtest.h and gmock.h with a warning-silencing pragma. See https://github.com/google/googletest/issues/4701 The warnings cause the Arch Linux CI to fail because of -Werror.\n- Fixed GetInvoiceFromTxn to convert to the right type of Python object for a GncInvoice.\n- [test-report-utilities] more tests for gnc:account-accumulate-at-dates testing balances at date boundaries\nNew and Updated Translations: Arabic, Bulgarian, Chinese (Simplified Han script), Danish, Dutch, Finnish, French, German, Hungarian, Portuguese, Romanian, Russian, Spanish, Swedish, Turkish\nHelp translate GnuCash on Weblate\nKnown Problems\nComplete list of all open bugs.\nDocumentation\nThe following fixes and improvements were not associated with bug reports:\n- German translation: Fix some typos\n- German translation: Remove the Finance::Quote appendix. The content has been moved to the wiki.\nUpdated` Translations: German.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.12","version":0,"site":"https://www.gnucash.org/","source":"GnuCash Development Team","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}