{"appId":"w:GnuCash.GnuCash","appShortcutName":"GnuCash","appDisplayName":"GnuCash","authorId":"w:winget","releaseTagName":"winget-5.13","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Personal and small-business financial-accounting software\n\nGnuCash is personal and small-business financial-accounting software, freely licensed under the GNU GPL and available for GNU/Linux, BSD, Solaris, Mac OS X and Microsoft Windows.\nDesigned to be easy to use, yet powerful and flexible, GnuCash allows you to track bank accounts, stocks, income and expenses. As quick and intuitive to use as a checkbook register, it is based on professional accounting principles to ensure balanced books and accurate reports.\nThe GnuCash development team announces GnuCash 5.13, the fourteenth release in the stable 5.x series.\nBetween 5.12 and 5.13, the following bugfixes were accomplished:\n- Bug 343711 - Splits to Imbalance-USD do not disappear when zero-valued.\n  To mitigate potential impact, the Imbalance split is only removed when the split transitions to zero value during the commit of the transaction and the split's memo and action have no value.\n- Bug 799249 - Crash while switch to recently opened file\n- Bug 799638 - error: call to non-'constexpr' function\n- Bug 799649 - Ensure that GnuCash does not crash when it converts a foreign-currency transaction into a trading account transaction.\n- Bug 799650 - Reconcile Ending Balance Ignored When Statement Date Set\n- Bug 799652 - Invoice price decimal places\n- Bug 799654 - Zombie entries in the recently accessed file list.\n- Bug 799656 - Invoice and bills still display prices as fractional amounts with \"Force Prices to display as decimals\"\n- Bug 799657 - Incorrect trial Balance report with stocks and multiple currencies\n- Bug 799661 - Exchange Rate entries displayed in reports in an unstable order\n- Bug 799662 - Importing accounts from UTF8 csv file does not work correctly\nThe following fixes and improvements were not associated with bug reports:\n- Provide a new dialog, gtk_action_dialog, for confirming actions that labels buttons with a active verb (e.g. \"Delete\") instead of a confirmation (e.g. \"Yes\" or \"OK\"). This is hypothetically less ambiguous in some cases. Note that the dialog is not yet used anywhere.\n- Transaction Report: Add links to bills and invoices.\n- [gnc-plugin-page-report] confirm before overwriting saved report\n- Added Swiss Fund Data AG to single_quote_sources. New F::Q source will be available in v1.67. The selection will be disabled until F::Q 1.67 is released and installed.\n- Replace deprecated gdk_pixbuf_new_from_xpm_data\n- Fix tests so that they run on Win32 builds.\n- Fix inadvertant insertion in test-trial-balance.scm.\n- extract-translators: Use 'open :encoding' instead of utf::encode/decode.\n- Fix newline disparity in translator-credits\n- Translator credits: Separate translators with a newline Instead of a semicolon. Presents them as a list, one name per line, as with the other credits.\n- [fin.c] fix encoding to utf8\n- [new-owner-report.scm] insert job-ID if available\n- [balsheet-pnl] use gnc:accounts-get-commodities-sorted\n- Set policy CMP0177 and follow the documented recommendations regarding DESTINATION paths.\n- [balsheet-pnl] ensure the account name cell doesn't wrap\n- Specialize get_row_value_from_object for int64_t so that it doesn't try to pass the value in a pointer. That comes out badly on 32-bit systems.\n- [charts] Add chartjs v4 to borrowed so it can be used when available (meaning not on Windows because Windows's JS support via webkit is too old).\n- [charts] use gnc:html-chart-set-xaxis-type!\n- [html-chart] expose gnc:html-chart-set-x-axis-type!; Centralise to ease chartjs upgrade. The option path changes as follows: '(options scales xAxes (0) type) in chartjs-2 '(options scales x type) in chartjs-3\n- [gnc-pricedb.cpp] plug leak from gnc_g_date_new_today\n- [gtest-xml-contents] test xaccTransGetDatePostedGDate from xml\n- Engine: Replace indirect qof_object_set/get calls with direct qof_instance_kvp ones.\n- [gtest-load-and-test-datafile.cpp] add example .gnucash to test contents\nNew and Updated Translations: Catalan, Chinese (Simplified Han script), Chinese (Traditional Han script), Croatian, Danish, English (Australia), English (New Zealand), English (United Kingdom), French, German, Hebrew, Hungarian, Marathi, Portuguese, Portuguese (Brazil), Russian, Slovak, Swedish, Tamil, Ukrainian\nHelp translate GnuCash on Weblate\nKnown Problems\nComplete list of all open bugs.\nDocumentation\nBetween 5.12 and 5.13 no bug fixes were accomplished.\nThe following fixes and improvements were not associated with bug reports:\n- de:manual:ch_Transactions: new description of import format\n- de:manual:ch_Transactions: Rewrite section 'Import with AqB'\n- docbook: gnc-gui-*: Cleanup entities and improve accel\n- DOCDIR_BUILD: We want PROJECT_NAME, not PACKAGE_NAME\n- Fix cmake variable name for build doc directory.\n- manual/ch_Reports: add Transaction Report Display/Invoice manual entry\nUpdated Translations: German.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.13","version":0,"site":"https://www.gnucash.org/","source":"GnuCash Development Team","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}