{"appId":"w:Google.IAPDesktop","appShortcutName":"Winget Application","appDisplayName":"IAP Desktop","authorId":"w:winget","releaseTagName":"winget-2.45.1717","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/GoogleCloudPlatform/iap-desktop/releases/download/2.45.1717/IapDesktop.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"IAP Desktop is a Windows application that allows you to manage multiple Remote Desktop connections to Windows VM instances that run on Google Cloud. This is not an officially supported Google product.\n\n\nRelease 2.45 introduces a number of improvements, mostly related to SSH:\n- Bracketed pasting: When you paste clipboard content to the terminal, IAP Desktop now uses bracketed pasting again. Bracketed pasting helps maintain formatting when you copy code blocks, and lets you paste multi-line commands to a shell without immediately executing them. Bracketed pasting is on by default, but you can turn it off under Tools > Options > Terminal.\n- Updated terminal: The terminal is now based on Windows Terminal 1.21.2361, which resolves several clipboard-related issues.\n- SFTP downloading: Downloading large files over SFTP (by copy/paste or drag/drop) is now more efficient and uses a clipboard format (TYMED_ISTREAM) that doesn't require the entire file to be buffered in memory.\n- Project Explorer search: When you enter a search term in the search box, the window now perform a case-insensitive search.\nIn addition, the release includes several stability improvements and fixes for the following issues:\n- Right-clicking a deleted project in the Project Explorer window sometimes showed the wrong context menu, making it difficult to unload the project.\n- Running a command that produces large quantities of output sometimes caused the SSH terminal to hang.\n- Hitting Ctrl+Alt+K early during application startup could cause the Authorized Keys window to become unfuntional.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.45.1717","site":"https://github.com/GoogleCloudPlatform/iap-desktop","source":"Google Inc","license_or_tos":"Apache-2.0","resources":null,"verified":false}