{"appId":"w:GPSoftware.DirectoryOpus","appShortcutName":"Directory Opus","appDisplayName":"Directory Opus","authorId":"w:winget","releaseTagName":"winget-13.19","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn2.gpsoft.com.au/files/Opus13/DOpusInstall-13.19.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A complete replacement for Explorer, with far more power and functionality than any other file manager available today.\n\nDirectory Opus is a complete replacement for Explorer, with far more functionality than any other file manager available today.\n\nWith a flexible user interface and unbelievable configurability, you can tailor Opus to streamline your workflow.\n-  Dual panes, dual trees, multiple tabs.\n- Filter, sort, group your folders. Label and rate your files.\n- Queued file copies. Powerful batch renaming. Full archive support.\n- Find your files. Locate duplicates. Synchronize backups.\n- Assign tags and descriptions. Convert images. Edit metadata.\n- Fully multi-threaded, native 64 bit high performance code.\n\nOpus is written in native C++ multi-threaded code; compiled for the latest 64 bit CPUs, with high performance our number one design principle.\nPowerful searching, sorting, grouping, labelling and tagging features let you take control of your files like never before.\nWork with third-party tools as easily as with the built-in features. A full scripting interface, including scriptable dialogs, means your imagination is really the only limit.\n\nTry free for 30 days or Register  for an extended 60 day trial.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"13.19","version":0,"site":"https://www.gpsoft.com.au/","source":"GPSoftware","license_or_tos":"Proprietary","resources":null,"verified":false}