{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.4.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.4.1.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\n- Fixed a bug that prevented searching audit log events in the web UI when using Athena audit storage. #61603\n- Prevented Trivy from reporting false positives when scanning the Teleport binaries. #61539\n- Added support for tsh logout --proxy (or TELEPORT_PROXY set) to work without --user flag when one identity exists. #61404\n- Fixed web upload/download failure behind load balancers when web listen address is unspecified. #61393\n- Fixed corrupted private keys breaking tsh. #61388\n- Resource names are now properly validated for AWS Roles Anywhere integration Generate Command. #61385\n- Added caches to reduce Active Directory user SID lookups and TLS certificate requests. #61317\n- GOAWAY errors received from Kubernetes API Servers configured with a non-zero --goaway-chance are now forward to clients to be retried. #61256\n- Added support for creating and managing scoped tokens using tctl scoped tokens add/ls/rm. SSH nodes can now join a cluster within a particular scope by joining with a scoped token. #60758\nEnterprise:\n- Removed sync of the model identifier from Intune to avoid mismatches between the identifier reported by Intune vs Teleport clients.\n- Added support for Jamf's /v2/computers-inventory API (addresses Jamf's deprecation of /v1/computers-inventory).\n- Updated the AWS Identity Center resource synchronizer to handle AWS Account name changes more gracefully.\n- Added audit events in response to SCIM provisioning requests.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.4.1","version":0,"site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}