{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.2.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.2.1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\n- Fixed client tools managed updates sequential update. #59086\n- Fixed headless login so that it supports both WebAuthn and SSO for MFA. #59078\n- When selecting a login for an SSH server, Teleport Connect now shows only logins allowed by RBAC for that specific server rather than showing all logins which the user has access to. #59067\n- Terraform Provider is now supported on Windows machines. #59055\n- Enabled Oracle Cloud joining in Machine ID's tbot client. #59040\n- Fixed a bug preventing users to create access lists with empty grants through Terraform. #59032\n- Fixed a DynamoDB bug potentially causing event queries to return a different range of events. In the worst case scenario, this bug would block the event-handler. #59029\n- Fixed an issue where SSH file copying attempts would be spuriously denied in proxy recording mode. #59027\n- Updated Enroll Integration page design. #58985\n- Teleport Connect now runs in the background by default on macOS and Windows. On Linux, this behavior can be enabled in the app configuration. #58923\n- Added fdpass-teleport binary to install script for Teleport tar downloads. #58919\n- Support multiple resource editing in tctl edit when editing collections. #58902\n- Added support for browser window resizing to the Teleport Web UI database client terminal. #58900\n- Fixed a bug that prevented root users from viewing session recordings when they were participants. #58897\n- Added ability for user to select whether IC integration creates roles for all possible Account Assignments. #58861\n- Updated Go to 1.24.7. #58835\n- Populate user_roles and user_traits fields for SSH audit events. #58804\n- Added support for wtmpdb as a user accounting backend to wtmp. #58777\n- Prevents an application from being registered if its public address matches a Teleport cluster address. #58766\n- Added a preset role mcp-user that has access to all MCP servers and their tools. #58613\nEnterprise:\n- Fixed an issue where sometimes the session summary was marked as a success, even though the summary was empty (this was particularly visible using GPT 5).\n- Updated Enroll Integration page design.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"18.2.1","site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}