{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.3.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\nWeb UI Workload ID\nTeleport's Web UI now lists all workload identity resources registered in the cluster.\nRelay Service\nTeleport now includes a new relay service that acts as a lightweight proxy service. This new service can receive connections from both SSH clients and agents.\nThe relay service can be used to avoid routing SSH connections through the broader Teleport control plane, providing the ability to optimize network flows in large or complex deployments.\nMulti-cluster Discovery\nMultiple Teleport clusters can now discover the same EC2 instances simultaneously through auto-discovery, with each cluster operating independently without interference.\nKubernetes Health Checks\nTeleport now continuously monitors the health of your registered Kubernetes clusters and displays their status directly in the web UI. When connecting to Kubernetes clusters, Teleport automatically routes you to healthy services, ensuring reliable access to your infrastructure.\nElastiCache Serverless\nTeleport Database Access now supports connecting to ElastiCache Serverless databases.\nOther fixes and improvements\n- The browser window for SSO MFA is slightly taller in order to accommodate larger elements like QR codes. #60703\n- Slack access plugin no longer crashes in the event access list is unsupported. #60671\n- Okta-managed apps are now pinned correctly in the web UI. #60667\n- Create and edit GitLab join tokens from the Web UI. #60649\n- Teleport Connect now displays the profile name (instead of the cluster name) in the UI when referring to the profile; this affects only clusters where the cluster name was specifically set to something else than the proxy hostname during setup. #60615\n- Fixed tsh scp failing on files that grow during transfer. #60607\n- Allowed moderated session peers to perform file transfers. #60604\n- Added support for regular expression conditions for AccessMonitoringRule. #60598\n- Added support for SSE and streamable-HTTP MCP servers. #60519\n- Added health checks for enrolled Kubernetes clusters. #60492\n- MWI: tbot's auto-generated service names are now simpler and easier to use in the /readyz endpoint. #60458\n- Client tools managed updates stores OS and ARCH in the configuration. This ensures compatibility when TELEPORT_HOME directory is shared with a virtual instance running a different OS or architecture. #60414\n- Added a Workload Identities page to the web UI to list workload identities. #59479\nEnterprise:\n- Enabled Access Automation Rule schedule configuration within the WebUI.\n- Updated Entra ID plugin installation UI to support group filter configuration.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.3.0","version":0,"site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}