{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.6.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.6.6.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\n- Fixed tsh/Linux sending a too-large username for device trust. #63387\n- Fixed an issue where MCP JSON-RPC messages with mixed-case field names could be parsed inconsistently and re-serialized to lower cases. Teleport now enforces canonical lowercase JSON-RPC fields. #63364\n- Improved robustness of the Slack hosted plugin to reduce the likeliness of failed token refresh when experiencing external disruption. #63344\n- Fixed a bug affecting access list review queries for lists where the name is a prefix of another list name. #63337\n- Updated the OCI SDK to support new regions. #63265\n- Ensure application session rejections for untrusted devices are consistently audited as AppSessionStart failures after MFA. #63149\n- Added Helm chart support to the teleport-event-handler configure command. #63147\n- Added tctl support for removing okta_assignment internal resource should it be needed. #62698\nEnterprise:\n- Prevented manual membership changes to SCIM-type access lists while enabling support for their reviews.\n- Fixed the issue where Okta integration may not remove previously synced apps after plugin restart.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.6.6","version":0,"site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}