{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.2.10","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.2.10.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\n- Fixed a bug where listing members of an access list results in listing members of access lists which have names prefixed with the original access list name. This may lead to RBAC escalations. #60587\n- Fixed a startup error EADDRINUSE: address already in use in Teleport Connect on macOS and Linux that could occur with long system usernames. #60576\n- Fixed an issue where the eligibility reconsideration flow could continuously reset the Owner’s eligibility status when the Access List contains a dangling reference to a non-existent user. #60575\n- Fixed Username AccessList name collision. #60563\n- Playback speed can be changed in the new SSH/k8s recording player. #60451\n- Adapts EC2 Server auto discovery to send the correct parameters when using the AWS-RunShellScript pre-defined SSM Document. #60434\n- Updated tsh debug output to include tsh client version when --debug flag is set. #60407\n- Updated LDAP dial timeout from 15 seconds to 30 seconds. #60388\n- Fixed a bug that prevented using database role names longer than 30 chars for MySQL auto user provisioning. Now role names as long as 32 chars, which is the MySQL limit, can be used. #60377\n- Fixed a bug in Proxy Recording Mode that causes SSH sessions in the WebUI to fail. #60369\n- Added extraEnv and extraArgs to the teleport-operator helm chart. #60357\n- Fixed issue with inherited roles interfering with auto role provisioning cleanup in Postgres. #60345\n- Fixed malformed audit events breaking the audit log. #60334\n- Enabled use of schedules within automatic review and notification access_monitoring_rules. #60327\n- Fixed an issue that caused Kubernetes debug containers to fail with a “container not valid” error when launched by a user requiring moderated sessions. #60302\n- Added tbot start ssh-multiplexer helper to start the SSH multiplexer service without a config file. #60287\n- Fixed \"The server-side graphics subsystem is in an error state\" during connection initialization to Windows Desktop. #60285\n- Fixed a bug where SSH host certificates are missing the <hostname>.<clustername> principal, breaking SSH access via third-party clients. #60276\n- Reduces the memory usage when processing a session recording by ~80%. #60275\n- Fixed AWS CLI access when using the AWS Roles Anywhere integration. #60227\n- Fixed an issue in Teleport Connect where Ctrl+D would sometimes not close a terminal tab. #60221\n- Updated error messages displayed by tsh ssh when access to hosts is denied and when attempting to connect to a host that is offline or not enrolled in the cluster. #60215\n- Added editing bot description to the web UI. #60212\n- Added support for PodSecurityContext to tbot helm chart. #60206\n- MWI: Add teleport_bot_instances metric. #60196\n- The tbot Workload API now logs errors encountered when handling requests. #60193\n- Added explicit timeout to tbot when the Trust Bundle Cache is establishing an event watch. #60182\n- Fixed a bug where OpenSSH EICE node connections would fail. #60124\n- Updated Go to 1.24.9. #60108\n- Fixed SFTP audit events breaking the audit log. #60069\n- Fixed Access List owners permission inheritance when the nesting depth is one. (Members of an Access List configured as an Owner of another Access List). #60056\n- Added support for loading bound keypair joining parameters from the environment. #60031\n- Deleting an AWS OIDC integration will remove associated Teleport Discovery Configs and App servers that reference the integration. #60018\n- Fixed selinux warning in teleport-update output and error during remove. #59997\n- Fixed tsh scp getting stuck in symlink loops. #59994\n- Fixed handling of local tsh scp targets that contain a colon. #59981\n- Fixed EC2 auto discovery report of failed installations. #59972\n- Fixed issue where temporarily unreachable app servers were permanently removed from session cache, causing persistent connection failures: no application servers remaining to connect. #59956\n- Fixed the issue with automatic access requests for tsh ssh when spec.allow.request.max_duration is set on the requester role. #59924\n- Fixes a bug with the check for a running Teleport process in the install-node.sh script. #59887\n- Fixed handling SFTP file transfers when the SSH agent is enforced by SELinux. #59874\n- Periods of inactivity in SSH session playback can now be skipped. #59701\nEnterprise:\n- Oracle database local proxies started with tsh proxy db will now accept connections to any database name.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.2.10","version":0,"site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}