{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.6.7","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.6.7.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\n- Revised help messages for event handler CLI commands. #63620\n- Fixed tsh ssh user@foo=bar uptime from running serially if users did not have role:read permissions. #63612\n- The minimum version of macOS required to run Teleport or associated client tools is now macOS 12 (Monterey). #63587\n- The minimal macOS version required by Teleport Connect is now macOS 12. #63569\n- Fixed bug where event handler would throw an error on Athena backend when handling large events. #63550\n- Updated Go to 1.25.7. #63539\n- Fixed an issue where a role requiring a trusted device could incorrectly block access to all applications. #63527\n- Fixed bug where event handler would get stuck on DynamoDB backend when handling large events. #63526\n- Updated tsh/Linux to correctly capture the OS login user for device trust. #63452\n- Fixed a server error when rejecting a headless authentication request in the Web UI. #63431\n- Added opt-in support to use cert-manager certificates for teleport-plugin-event-handler helm chart. #63420\n- Modified tbot helm chart with default token value to simplify deployment. #63360\n- Improved GitHub + Kubernetes guide experience. #63185\n- Fixed teleport join openssh on recent versions of Ubuntu. #63040\nEnterprise:\n- Extend Access Monitoring feature to Teleport Cloud customers using External Audit Storage.\n- Added recording and validation for the fixed OS login user values from tsh.\n- Mitigated a race in the Slack token refresh logic.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.6.7","version":0,"site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}