{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.6.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.6.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\nIdentifier-first login enhancements\nTeleport now automatically passes the username to the identifier provider when performing Identifier-first login with OIDC or SAML IdPs.\nGitHub Actions Kubernetes Wizard\nTeleport now ships with a new guided flow for setting up GitHub Actions workflows that connects to Teleport-protected Kubernetes clusters without secrets.\nOther changes and improvements\n- Fixed unspecified proxy address breaking moderated SFTP when mixing IPv4 and IPv6. #62296\n- Added full configuration file for teleport-plugin-event-handler helm chart. #62280\n- Added full environment variable configuration for event handler CLI. #62280\n- Added support for extraArgs/extraEnv/extraLabels patterns for teleport-plugin-event-handler helm chart. #62266\n- Fixed issue where AltGr key combinations did not work correctly in remote desktop sessions. #62198\n- Added annotations support for teleport-plugin-event-handler helm chart. #62188\n- Added a new global configuration section auth_connection_config allowing users to configure the backoff behavior for Proxy and Agent instances connecting to the Auth Service. #62139\n- Fixed a potential SSRF vulnerability in the Azure join method implementation. #62406\n- Support for v8 roles has been added to the Terraform provider. #62380\n- Added support for selecting Kube agents as Managed Updates v2 canaries. Important: the default update group is corrected to \"default\" from \"stable/cloud\". #62211","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.6.0","version":0,"site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}