{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.2.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.2.2.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\n- Fixed a regression in Teleport Connect for Windows that caused the executable to be unsigned. #59302\n- Fixed an issue that prevented uploading encrypted recordings using the S3 session recording backend. #59281\n- Fix issue preventing auto enrollment of EKS clusters when using the Web UI. #59272\n- Terraform provider: Allow creating access lists without setting spec.grants. #59217\n- Fixes a panic that occurs when creating a Bound Keypair join token with the spec.onboarding field unset. #59178\n- Added desktop name for Windows Directory and Clipboard audit events. #59146\n- Added the ability to update the AWS Identity Center SCIM token in tctl. #59114\n- Added services to correctly choose Access Request roles in remote clusters. #59062\n- Install script allows specifying a group for agent installation with managed updates V2 enabled. #59059\n- Added support for ElastiCache Serverless for Redis OSS and Valkey database access. #58891\nEnterprise:\n- Fixed an issue in the Entra ID integration where a user account with an unsupported username value could prevent other valid users and groups to be synced to Teleport. Such user accounts are now filtered.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"18.2.2","site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}