{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.2.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.2.3.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\n- Fixed auto-approvals in the Datadog Incident Management integration by updating the on-call API client. #59668\n- Fixed auto-approvals in the Datadog Incident Management integration to ignore case sensitivity in user emails. #59668\n- Database recordings now show the session summary if it is available. #59634\n- Added automatic @<project-id>.iam suffix to GCP Postgres usernames (Teleport Connect). #59629\n- Fixed tsh play not returning an error when playing a session fails. #59625\n- Fixed an issue in Teleport Connect where clicking 'Restart' to apply an update could close the window without actually restarting the app. #59592\n- Added automatic @<project-id>.iam suffix to GCP Postgres usernames (tsh, web UI). #59590\n- Introduced application-proxy service to tbot for HTTP proxying to applications protected by Teleport. #59587\n- MWI: Added support for customizing cluster names with a template to the kubernetes/argo-cd output. #59575\n- Fixed persistence of metadata.description field for the Bot resource. #59570\n- Fixed a crash in Teleport's Windows Desktop Service introduced in 18.2.0. Compaction of certain shared directory read/write audit events could result in a stack overflow error. #59515\n- Added tctl tokens configure-kube helper command to easily trust Kubernetes clusters and allow secure repeatable joining. #59497\n- Made the check for a running Teleport process in the install-node.sh script more robust. #59496\n- Fixed tctl edit producing an error when trying to modify a Bot resource. #59480\n- Added support for generating VSCode and Claude Code MCP servers configurations to the tsh mcp config and tsh mcp db config commands. #59473\n- Fixed a bug where session IDs were tied to the client connection, resulting in issues when combined with multiplexed connection features (OpenSSH ControlPath/ControlMaster/ControlPersist). #59472\n- Improved app access error messages in case of network error. #59468\n- Fixed database IAM configurator potentially getting stuck and never recovering (#59290). #59417\n- Added tbot copy-binaries command to simplify using tbot as a Kubernetes sidecar. #59404\n- Fixed tsh config binary path after managed updates. #59384\n- Updated Entra ID integration to support group filters. #59378\n- Fixed regression allowing SAML apps to be included when filtering resources by 'Applications' in the Web UI. #59327\n- Allow controlling the description of auto-discovered Kubernetes apps with an annotation. #58817","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"18.2.3","site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}