{"appId":"w:Gravitational.TeleportConnect","appShortcutName":"Teleport Connect","appDisplayName":"Teleport Connect","authorId":"w:winget","releaseTagName":"winget-18.5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.teleport.dev/Teleport%20Connect%20Setup-18.5.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Teleport Connect provides easy and secure access to SSH servers, databases, applications, Windows desktops, and Kubernetes clusters.\n\n\nKubernetes support for Relay Service\nThe relay service now facilitates Kubernetes connections.\nShared state between tsh and Teleport Connect\nTeleport Connect and tsh now share the same local state. Logins from one app will automatically be reflected in the other.\nSCIM PATCH support in SailPoint integration\nTeleport SCIM server now natively supports PATCH operations to improve reliability of bulk SCIM operations in integrations like SailPoint.\nOther changes and improvements\n- Updated Go to 1.24.11. #61953\n- Added support for discovering EC2 instances in all regions, without enumerating them. Requires access to account.ListRegions in the IAM Role assumed by the Discovery Service. #61924\n- Fixed a bug where JWT-SVID timestamp claims would be represented using scientific notation. #61921\n- Fixed \"SSH cert not found\" errors in Teleport Connect. #61846\n- Added support for authenticating Azure resource discovery using Azure OIDC integrations. #61830\n- Fixed a bug in Proxy recording mode where Teleport Node sessions would result in duplicate audit events with a different session ID. #61246\n- Tuned teleport-cluster, teleport-kube-agent, and teleport-relay Helm charts to reduce the probability of Teleport exceeding its memory limits and being OOM-Killed. GOMEMLIMIT defaults to 90% of the configured memory limits.\nEnterprise:\n- Added support for AWS Account name and ID labels (teleport.dev/account-id, teleport.dev/account-name) on AWS Identity Center resources (aws_ic_account_assignment and aws_ic_account). These labels improve compatibility with Access Monitoring Rules, allowing users to more easily target and audit AWS IC accounts.\n- Updated the Access Automation Rules dialog to display rules in a paginated view.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"18.5.0","version":0,"site":null,"source":"Gravitational, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}