{"appId":"w:GregGalloway.OLAPPivotTableExtensions","appShortcutName":"OLAP PivotTable Extensions","appDisplayName":"OLAP PivotTable Extensions","authorId":"w:winget","releaseTagName":"winget-0.9.7","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OlapPivotTableExtensions/OlapPivotTableExtensions/releases/download/v0.9.7/OLAP.PivotTable.Extensions.Setup.v0.9.7.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An Excel add-in which extends the functionality of PivotTables on Analysis Services cubes, Excel Data Model (Power Pivot), and Power BI\n\nOLAP PivotTable Extensions is an Excel add-in which extends the functionality of PivotTables on all types Analysis Services cubes. It supports Analysis Services Tabular, Analysis Services Multidimensional, Azure Analysis Services, and Power BI (both Analyze in Excel and the XMLA endpoint).\nThe Excel API has certain PivotTable functionality which is not exposed in the UI. OLAP PivotTable Extensions provides an interface for some of this functionality. It also adds some new features like searching cubes, configuring default settings, and filtering to a list in your clipboard. The add-in can be launched from the menu option in the right-click menu for PivotTables.\nThis release contains support for Excel 2013 and Excel 2016 and Excel in Office 365 (Microsoft 365). The installer supports both 32-bit and 64-bit Excel.\nTo run OLAP PivotTable Extensions in Excel 2007 or Excel 2010, use Release 0.8.4. Release 0.8.4 is not supported to be run side-by-side with newer releases.\nNew Features\n- Upgraded to latest ADOMD.NET driver and forced TLS1.2 which fixed support for:\n  - Azure Analysis Services\n  - Power BI Analyze in Excel\n  - Power BI XMLA endpoints\nBug Fixes\n- Fixed Problem Getting Power BI access Token\n- Fixed Can't Filter List with Power BI Connection again\n- Fixed Error message: App property was not recognized\nThis release requires the .NET Framework 4.5.2 and will install it if it is not installed already.\nJust download and run the EXE. There is no need to uninstall the previous release. If you have problems getting the add-in to work, see the Troubleshooting Installation wiki page.\nOLAP PivotTable Extensions documentation is at https://olappivottableextensions.github.io/","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.9.7","version":0,"site":"https://olappivottableextensions.github.io/","source":"OLAP PivotTable Extensions","license_or_tos":"MS-PL","resources":null,"verified":false}