{"appId":"w:Guru3D.Afterburner","appShortcutName":"MSI Afterburner","appDisplayName":"MSI Afterburner","authorId":"w:winget","releaseTagName":"winget-4.6.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"MSI Afterburner monitoring and GPU overclocking tool\n\n\n- Ported to VC++ 2022 compiler. Please take a note that due to this change MSI Afterburner will no longer be able to start under Windows XP. Please stay on the previous versions of the product if you need this OS support\n- Please take a note that size of mandatory VC++ 2022 runtime redistributables roughly doubled comparing to the previously used VC++ 2008 redistributables, and we’d like to avoid providing overblown application distributive, drastically increased in size due to bundling newer and much heavier VC++ redistributables with it. To deal with this issue we provide our own original tiny web installer for VC++ redistributables, which allowed decreasing the size of final application distributive drastically even comparing to the previous VC++ 2008 based version. Please take a note that install time can be increased slightly due to downloading VC++ 2022 runtimes redistributables on the fly during installation. If you install MSI Afterburner offline, you can always deploy required VC++ 2022 distributives later with web installer by launching .\\Redist\\VCRedistDeploy.bat\n- Now the installer and uninstaller are performing active application instance checking on earlier stages before displaying any GUI\n- Added NVIDIA GeForce RTX 50x0 series graphics cards support\n- Added quad fan control support for reference design NVIDIA GeForce RTX 50x0 series graphics cards\n- Added software interface for future G-Assist integration\n- MSI Windows 11 Dark skin is selected as default application skin now. Please take a note that quad fan control GUI is currently available in Dark and Light editions of MSI Windows 11 skins only. If you prefer to use some older legacy skins on NVIDIA GeForce RTX 50x0 with 3 or 4 independently controllable fans, you may still switch between all fans in async fan control mode by pressing <Shift>+<F> repeatedly\n- Added new MSI Special and MSI H2O skins by Drerex design. New skins natively supports quad fan control feature on reference design NVIDIA GeForce RTX 50x0 series graphics cards\n- Extended +3000MHz memory clock overclocking range tweak for NVIDIA RTX 5000 series graphics cards\n- Added AMD RDNA4 GPU family and AMD RADEON RX 9000 series cards support. Please take a note that MSI do not sell any AMD RDNA4 based graphics cards, so RDNA4 support is completely unofficial\n- Added MP2988 and MP29816A voltage controllers support. New PWM controllers support is reserved for future extreme overclocking oriented graphics card models with triple/quad channel voltage control. Please take a note that such voltage controllers are also used on the most of currently existing NVIDIA RTX 5080 and RTX 5090 series cards, but unfortunately I2C address range of PWM controllers on reference cards is blacklisted by NVIDIA display driver, making extended voltage control on currently existing NVIDIA RTX 50x0 series cards impossible\n- Added voltage control support for AMD RADEON RX 7800XT series graphics cards\n- Added voltage control support for new low-cost revisions of NVIDIA GeForce RTX 40x0 GPUs\n- Added new GPU hiding functionality. Added \"Hide GPU\" button to GPU selection panel of default Dark and Light editions of MSI Windows 11 skins. Alternately, you may use <Ctrl> + <H> keyboard shortcut to hide currently selected GPU if you prefer to use legacy or third party GUI skins with no such button. You may use it to completely remove some GPUs from MSI Afterburner's GUI, including both hardware control and hardware monitoring sections. The functionality is intended for hiding integrated iGPUs\n- Relaxing preemptive sleep delay is now excluded from cumulative polling time displayed by performance profiler on Overdrive8 capable graphics cards to avoid confusing beginners\n- Name of voltage rail mapped to AUX or AUX2 voltage slider (e.g. VDDCI, MSVDD, PEXVDD or 1V8) is now displayed in context help of AUX or AUX2 GUI controls and inside MSI Afterburner system info window (\"i\" button)\n- Added internal database format improvements, allowing us to remap AUX/AUX2 GUI controls to different physical voltage rail if multiple optional controllable voltage rails are available\n- Empty compact names of some iGPUs in GPU selection panel are now replaced with abstract \"AMD GPU\" / \"NVIDIA GPU\" / “Intel GPU\" names\n- Fixed GUID, PCI location and registry key info displayed in MSI Afterburner system info window (\"i\" button) for secondary Intel GPUs\n- I2C cache of secondary GPUs is now saved inside proper hardware profile file. Previously it was always written to and read from the primary GPU's profile\n- Asynchronous fan control buttons are no longer displayed in GUI on GPUs with no fan control support (e.g. iGPUs)\n- Now MSI Afterburner reinitializes skin scaling engine on DPI scaling change events to prevent cases when GUI looks cut off in some cases (e.g. after switching between display resolutions with different DPI scaling settings)\n- Now MSI Afterburner is forcibly uninstalling IO driver on OS shutdown to prevent the driver from being hibernated and reloaded due to fast startup till the next clean system boot event\n- Fixed instances enumeration for some performance counters with no localized names (e.g. GPU related Windows performance counters) in PerfCounter.dll plugin\n- Added experimental support for \"Beta : Use Unicode UTF-8 for global language support\" option enabled in administrative regional OS settings. Now each localization description file contains additional \"Codepage\" field, defining runtime ANSI to UTF8 conversion rule for selected language pack\n- Refactored CPU info database format provides more simplified and unified future database updates for MSI Afterburner monitoring HAL, CPU.dll sample plugin and RivaTuner Statistics Server’s own monitoring HAL\n- Added experimental support for AMD Ryzen 9xxx CPUs\n- Added experimental support for Intel Arrow Lake CPUs\n- Added alternate Voltage/Frequency point locking mode inside Voltage/Frequency curve editor. Now you may repeatedly press <L> key inside V/F curve editor to switch between voltage locking and max frequency locking mode\n- Optimized GPU context switching implementation in HAL. This provides slightly faster GPU selection in GUI and slightly reduced CPU polling time for the systems with multiple GPUs\n- Now MSI Afterburner uses extended 32KB RivaTuner Statistics Server’s text slot instead of previously used 4KB slot to display On-Screen Display. Due to this improvement legacy MSI Afterburner On-Screen Display can fit up to 8x more text items without hitting the limit\n- Updated HwInfo.dll plugin. Now the plugin can automatically spawn new versions on HwInfo, which now store path to installed application in slightly different installer’s registry key\n- Added Bulgarian localization\n- Seriously revamped German and Ukrainian localizations\n- Fixed ACL bypass vulnerability and NULL ptr dereferencein RTCore driver (reported by Andres Roldan)\n- RivaTuner Statistics Server has been upgraded to v7.3.7:\n- New version’s changes list is huge, it includes more than 150 compatibility enhancements, changes and new features including programmable conditional layers support, PresentMon, LibreHardwareMonitor and NVIDIA Reflex integration","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.6.6","version":0,"site":null,"source":"MSI Co., LTD","license_or_tos":"Freeware","resources":null,"verified":false}