{"appId":"w:Headlamp.Headlamp","appShortcutName":"Headlamp","appDisplayName":"Headlamp","authorId":"w:winget","releaseTagName":"winget-0.38.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/kubernetes-sigs/headlamp/releases/download/v0.38.0/Headlamp-0.38.0-win-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes web UI.\n\nA Kubernetes web UI that is fully-featured, user-friendly and extensible.\n✨ Enhancements:\n- Add custom local port input dialog for port forwarding. Thanks @jaehanbyun\n- Add concept of \"shipped\", \"user-installed\", and \"dev\" plugin types\n- Add ability to specify priorityClassName in the Headlamp Helm chart. This allows setting the relative priority of Headlamp compared to other Pods when Headlamp is deployed in a cluster. Thanks @mcg1024\nCustom Local Port Forwarding Dialog\nA custom local port selection dialog for port forwarding was added. Allowing people to specify their preferred local ports (e.g., 8080) instead of only using auto-assigned ports.\nScreen.Recording.2025-11-08.at.10.41.28.PM.mov\nEnhanced Plugin System to Handle Different Types of Plugins Better\nThe plugin loading system has been enhanced. It now differentiates plugins by type (shipped with app/user-installed/development) and loads them according to a priority-based system. Development plugins have the highest priority, followed by user-installed, then shipped plugins. When multiple versions of the same plugin exist, only the highest priority enabled version is loaded.\nThe UI has been enhanced to show the different types of plugins. To also make finding where they are easier.\nNew Plugins setting view showing the different types of plugins. It shows if they are loaded, if they are user, dev, or shipped plugins.\n🐞 Bug fixes\n- Fix useAccessToken arg not set when using external secrets in Helm chart. Thanks @rickliujh\n- Fix missing PKCE arg in Helm charts. Thanks @rayshoo\n- Fix Add Local Cluster Provider link on Add Cluster view\n- Fix so username is displayed in Top Bar for when Headlamp is behind an Oauth2Proxy\n- Remove extra 1px border on top of the Side Bar\n- Improve headlamp port clashes for the Headlamp app when it is starting and ports are already used\n- Fix reloading of app after plugin install when using Windows app\nPort Clashes Fixed in Headlamp Desktop App\nBefore Headlamp tried to listen on port 4466 with the desktop app. If that port was already used then Headlamp would just try to use that existing port. This was problematic of course if there are other apps using that port, or other users on the same machine using that port. Now Headlamp will use another port if that port is already used.\n💻 Development\n- Remove our homebrew and winget package creation automation, because they are handled by them now\n- Add action to push chocolatey package automatically\n- Update dependencies for security updates\n- Fix storybook theme for plugins, and use correct new logo in storybook for plugins\nFor Plugin Developers: Find Plugin Folder in the UI\nTo make it easier for plugin developers to find where on the local file system plugins are there is an open plugin folder button. In Plugin Settings select the plugin being developed, and then click the open folder icon to open the plugin path with the Desktop file Finder.\nShows the UI for finding the plugin folder and the open folder where the plugin is\n📖 Documentation\n- Improve Projects Learn section in docs\n- Add Local Cluster Learn section to docs\n- Fix missing commas in OIDC scopes in some OIDC installation tutorials\nFull Changelog: v0.37.0...v0.38.0\nContainer image: 🐳 ghcr.io/headlamp-k8s/headlamp:v0.38.0\nDesktop Apps:\n🐧 Flatpak / Linux (AMD64)\n🐧 Linux AppImage AMD64, ARM64, ARMv7l\n🐧 Linux Tarball AMD64, ARM64, ARMv7l\n🐧 Debian / Linux AMD64\n🍏 Mac (AMD64)\n🍏 Mac (ARM/M1)\n🟦 Windows (AMD64)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.38.0","version":0,"site":"https://headlamp.dev/","source":"Headlamp","license_or_tos":"Apache-2.0","resources":null,"verified":false}