{"appId":"w:Headlamp.Headlamp","appShortcutName":"Headlamp","appDisplayName":"Headlamp","authorId":"w:winget","releaseTagName":"winget-0.36.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/kubernetes-sigs/headlamp/releases/download/v0.36.0/Headlamp-0.36.0-win-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes web UI.\n\nA Kubernetes web UI that is fully-featured, user-friendly and extensible.\n✨ Enhancements:\n- Add support for EndpointSlice resources.\n- Add memory for table sorting column and direction across navigation. Thanks to @krrish-sehgal\n- Enhance global search to support searching by labels and improve multi-term queries.\n- Add a button to copy a resource's name to the clipboard. Thanks to @farodin91\n- Standardize resource naming behavior across all resource types. Thanks to @farodin91\n- Add support for more rule types in HTTPRoute resources. Thanks to @farodin91\n- Fix and improve the log viewer inputs for responsiveness and usability.\n- Add a default security context and allow the plugins manager to use the global security context in Helm charts. Thanks to @jda258\n- Add optional backend TLS termination support.\n- Add support for an optional PodDisruptionBudget in the Helm chart. Thanks to @jcpunk\n- Add the ability to specify custom podLabels in the Helm chart. Thanks to @vnea\n- Add snackbar notifications for plugin deletion actions.\n- Add support for opening external URLs from the sidebar in a new tab. Thanks to @Exar04\n- Add namespaceOverride support to the Helm chart. Thanks to @rstribrn\n- Allow plugins to override default tabs in the project details view.\n- Add an isEnabled method to allow plugins to conditionally render project detail tabs.\n- Add support for HEADLAMP_APP_ and REACT_APP_ environment variables in plugins.\n- Add support for running Headlamp embedded within Backstage.\n- Add the ability for plugins to register a custom delete button for projects.\n- Add a loader and error page for the initial backend connection.\nCopy resource name to clipboard\nimage\nPersistent Table sorting\nTables will now remember your sorting choices\nimage\nSearch improvements\nYou can now search by labels and combine multiple terms by separating them with spaces\nimage\nAdded support of EndpointSlices\nEndpointsSlices are now available in Network sidebar\nimage\n🐞 Bug fixes\n- Fix the text contrast of notification menu items on dark themes.\n- Fix the base URL feature to ensure the application loads correctly when a base URL is configured. Thanks to @DanielLeone\n- Fix an issue where deleting one dynamic cluster removed all clusters from the same kubeconfig.\n- Prevent stale entries from appearing after renaming a dynamic cluster.\n- Fix truncated Chinese text in the resource map's graph view buttons. Thanks to @wingerx\n- Update the \"Type\" column header to \"Kind\" in resource tables for consistency. Thanks to @LinPr\n- Fix bundling for icons to ensure they are visible in offline mode.\n- Add backward compatibility to createRouteURL to accept URL paths for route names.\n- Restore the GetTokenFromCookie call within the ParseClusterAndToken function.\n- Handle cases where routeName is undefined in getRoute to prevent crashes.\n- Correct the positioning of CPU/Memory tooltips in the Nodes table. Thanks to @jaehanbyun\n- Close the actions menu when the \"Edit\" button is clicked. Thanks to @jaehanbyun)\n- Add a fallback for idpIssuerURL to prevent issues with token expiration. Thanks to @lszczepaniak-XM\n- Fix security context rendering in Helm charts for CI jobs.\n- Fix a glob pattern in setup-plugins.js to support Windows paths.\n- Fix createRouteURL to correctly look up routes registered from plugins.\n- Fix project creation when multiple clusters are involved.\n- Prevent dialog checkbox clicks from triggering table row selection. Thanks to @jaehanbyun\n- Disable the backend loader to prevent an error page on application load.\n💻 Development\n- Refactor the GetExpiryUnixTimeUTC function into the auth package.\n- Refactor the configuration parsing function for clarity and reduced complexity.\n- Extract DropZoneBox into its own reusable component.\n- Update application dependencies, removing electron/notarize and adding glob.\n- Replace usages of the deprecated makeKubeObject() function with the KubeObject class.\n- Fix circular dependencies in the lib/k8s folder by using import type.\n- Extract functions from fetch.ts to new files to avoid circular imports.\n- Resolve circular dependencies in the k8s API proxy imports.\n- Refactor the router implementation to untangle module imports.\n- Add Storybook stories for the DateLabel component.\n- Refactor the CacheRefreshedToken function into the auth package.\n- Use import type in more files to separate type and value imports.\n- Bump the Vite dependency to version 6.3.6 in the frontend and plugins.\n- Refactor the IsTokenAboutToExpire function into the auth package.\n- Add logging to the plugin npm start command to show where files are copied.\n- Fix Storybook support for plugins.\n- Export missing functions and types from the headlamp-plugin package.\n- Fix the return type for HeaderActionFuncType to correctly include ReactNode.\n- Refactor the GetNewToken function into the auth package.\n- Fix the Docker extension release process to consistently use the latest tag.\n- Disable the nightly build workflow on forked repositories.\n- Update the failing EndpointSlice snapshot test.\n- Improve the plugin create command's speed and security by using npm ci.\n- Update GitHub issue templates to use correct repository labels. Thanks to @jaehanbyun\n📖 Documentation\n- Enhance the AKS cluster OAuth documentation with clearer steps and Helm-based deployment instructions.\n- Update the project name in the NOTICE file.\n- Add a note about the removal of libgconf-2-4 on newer Ubuntu releases.\n- Add VKS (VMware Kubernetes Service) to the list of supported platforms. Thanks to @papivot\n- Fix a broken link to the architecture page from the plugins documentation.\n🧩 Shipped Plugins\n- Update shipped plugin prometheus 0.8.0\n  - Update dependencies\n- Update shipped plugin plugin-catalog 0.4.1 (desktop only)\n  - Update dependencies\n  - Fix contrast on loading install button\n  - Fix origin link\n- Update shipped plugin app-catalog 0.6.3 (desktop only)\n  - Update dependencies\n  - Add package script\nContainer image: 🐳 ghcr.io/headlamp-k8s/headlamp:v0.36.0\nDesktop Apps:\n🐧 Flatpak / Linux (AMD64)\n🐧 Linux AppImage AMD64, ARM64, ARMv7l\n🐧 Linux Tarball AMD64, ARM64, ARMv7l\n🐧 Debian / Linux AMD64\n🍏 Mac (AMD64)\n🍏 Mac (ARM/M1)\n🟦 Windows (AMD64)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.36.0","site":"https://headlamp.dev/","source":"Headlamp","license_or_tos":"Apache-2.0","resources":null,"verified":false}