{"appId":"w:Headlamp.Headlamp","appShortcutName":"Headlamp","appDisplayName":"Headlamp","authorId":"w:winget","releaseTagName":"winget-0.39.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/kubernetes-sigs/headlamp/releases/download/v0.39.0/Headlamp-0.39.0-win-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes web UI.\n\nA Kubernetes web UI that is fully-featured, user-friendly and extensible.\n✨ Enhancements:\n- Add cluster column to CRD list. Thanks to @kahirokunn\n- Add attach-based node debugger workflow that mirrors kubectl debug-node. Thanks to @dorser\n- Add count column to events list view\n- Display Node and Loadbalancer ports in Service list view. Thanks to @jaehanbyun\n- Add missing details to Pod, ReplicaSet, NetworkPolicy, Namespace, Services and DaemonSets\n- Open headlamp address in default browser when running in Headless mode\n- Add support for adding custom header actions to project detail view\nThe CRD list view with cluster column\nScreenshot showing Custom Resource Instances table with highlighted Cluster column in Headlamp dashboard\nAttach-based node debugger in Node detail view\nScreenshot showing Headlamp node details page with Debug Node button highlighted\nThe events list view with the event count column\nScreenshot showing Headlamp Events table with highlighted Count column displaying event occurrence numbers\n🐞 Bug fixes\n- Deduplicate CRDs in sidebar items. Thanks to @kahirokunn\n- Deduplicate namespaces from multi-cluster list in autocomplete. Thanks to @kahirokunn\n- Allow templating in Helm chart pod labels. Thanks to @rickliujh\n- Fix tooltip jittering issue. Thanks to @jaehanbyun\n- Fix image digests in Dockerfiles\n- Replace custom contains with slices.Contains in Backend. Thanks to @jongwooo\n- Fix wrong apiVersion used when CRUDing a CustomResource. Thanks to @damsien\n- Fix Custom CA not being used when refreshing token. Thanks to @mlbiam\n- Fix useKubeObject to use standard websocket connection instead of multiplexed\n- Fix the runCommand to properly take into account user and static plugins\n- Fix errors caused due to null resource in Header actions. Thanks to @kahirokunn\n- Fix ReplicaSetGlance props to include Statefulset\n- Fix ID and kind clashes in Map component\n- Fix plugin watch doing a loop on mac\n- Fix uninstalling plugins to use user's plugin directory instead of default plugins directory\n🌍 Internationalization\n- Update chinese translations. Thanks to @lou-lan and @hsiangjenli\n- Add i18n helper tools for extracting and copying translations\n🧩 Shipped Plugins\n- Update shipped plugin Prometheus\n  - Update headlamp-plugin to 0.13.0\n- Update shipped plugin Plugin Catalog (Desktop only)\n  - Update headlamp-plugin to 0.13.0\n- Update shipped plugin App catalog (Desktop only)\n  - Fix artifacthub charts searching in App catalog plugin. Thanks to @xqm32\n  - Update headlamp-plugin to 0.13.0\n💻 Development\n- Update dependencies on plugins examples, app, pluginctl and frontend\n- Add verify-image-digests make recipe for verifying image digests\n- Update releaser cli to handle triggering app builds\n- Add e2e test for in-cluster deployment\n- Remove unused deps from headlamp-plugin\n- Add Activity to pluginLib\n📖 Documentation\n- Fix typo and missing links in docs. Thanks to @BublikTV, @SinghaAnirban005, and @SQLJames\n- Add User Guides, Development Guides, Learn and Develop sections to docs\n- Add documentation and example for Activitiy feature that allows devs to create resizeable popup windows\n- Add example showcasing how to register header functions to projects\nFull Changelog: v0.38.0...v0.39.0\nContainer image: 🐳 ghcr.io/headlamp-k8s/headlamp:v0.39.0\nDesktop Apps:\n🐧 Flatpak / Linux (AMD64)\n🐧 Linux AppImage AMD64, ARM64, ARMv7l\n🐧 Linux Tarball AMD64, ARM64, ARMv7l\n🐧 Debian / Linux AMD64\n🍏 Mac (AMD64)\n🍏 Mac (ARM/M1)\n🟦 Windows (AMD64)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.39.0","version":0,"site":"https://headlamp.dev/","source":"Headlamp","license_or_tos":"Apache-2.0","resources":null,"verified":false}