{"appId":"w:Headlamp.Headlamp","appShortcutName":"Headlamp","appDisplayName":"Headlamp","authorId":"w:winget","releaseTagName":"winget-0.37.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/kubernetes-sigs/headlamp/releases/download/v0.37.0/Headlamp-0.37.0-win-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes web UI.\n\nA Kubernetes web UI that is fully-featured, user-friendly and extensible.\n✨ Enhancements:\n- Load time of Desktop app up to 60% faster\n- Add Default and Parameters columns to Ingress Class List. Thanks to @jaehanbyun\n- Add cluster links to project details status section\n- Add default indicator column to StorageClassesTable. Thanks to @jaehanbyun\n- Set namespace from search\n- Enabled Helm support in the backend via --enable-helm flag. Thanks to @muraliinformal\n- Add Helm support to in-cluster Headlamp with vanilla Helm repos. Thanks to @shahvrushali22 and @muraliinformal from Oracle\n- Add an authenticated \"service proxy\" used by the new helm repo support. Thanks to @shahvrushali22 and @muraliinformal from Oracle\n- Add missing fields and subsection to Network Policy\n- Implement kebab menu for table row actions. There is now a consistent kebab menu (vertical dots) for all table row actions across the application, replacing the previous horizontal dots icon. Thanks to @jaehanbyun\n- Add Headlamp user agent and Headlamp version to Kubernetes API requests\n- Show user information in OIDC authenticated clusters users per cluster-scoped user info via endpoint\n- Add PKCE OIDC support to improve OIDC security. Off by default. To enable with helm add config.oidc.usePKCE: true. Or add -oidc-use-pkce=true to headlamp-server flags.\nUser information for OIDC Clusters Displayed\nThe user that is logged in is displayed in the top bar for clusters configured with OIDC.\nScreenshot of username in the top bar of headlamp\nNetwork Policy now with all the missing fields\nSome of the fields were reported missing, and now they are shown.\nScreenshot of some fields in the Network Policy section of Headlamp\nSetting the namespace from search\nIn the global search there is a shortcut for setting up the current namespace. This is to avoid having to select the namespace from the dropdown.\nScreenshot of the search field with a namespace in it\n🐞 Bug fixes\n- Fix Monaco Editor with custom base url. Thanks to @DanielLeone\n- Include baseURL in Cookie Path. Thanks to @appare45\n- Fix baseURL handling in embedded spa handler\n- Fix Release Notes rendering in the app of img tags that github now uses\n- Fix isDrawerMode fetch when state not there\n- Align Actions column and disable sorting/filtering in Cluster Table. Thanks to @jaehanbyun\n- Fix status color for labels on Deployments List\n- Align PortForward table with Cluster Table pattern. Thanks to @jaehanbyun\n- Display valid dates on map view for events\n- Fix loadBalancerSourceRanges formatting in the headlamp helm chart. Thanks to @caymard\n- If there is an empty cluster list on the home view show the \"Add Cluster\" link\n💻 Development\n- Add e2e-tests for react-hotkeys dependency. Thanks to @adwait-godbole\n- Extract RefreshAndCacheNewToken from headlamp.go and add tests\n- Improve app in development to start up to 8.3x faster\n- Add stories for NetworkPolicy\n- Add root npm build scripts as an alternative to Make to reduce requirements for developers\n- Fix on-hover display of documentation and types for some plugin APIs for plugin developers\n- Fix for container test check on github to cleanup disk space to avoid running out\n- Small fixes to projects and KubeMetadata types so plugins using them don't raise type errors\n- Add storybook stories for Layout component with various states. Thanks to @hxrshxz\n- Add isScalable attribute for resources, if true ScaleButton will show for these resources\n📖 Documentation\n- Add instructions for people who want to install headlamp plugins in the desktop app docs/installation/desktop/plugins-install-desktop.md\n- Add page showing people wanting to use plugins some of the plugins\n- Improve Plugin Manager related instructions to help with issues people were reporting\nPlugins showcase\nTo go along with the new docs on installing plugins, there is now a page dedicated to showing off some of the plugins. To give people a bit of an idea about what plugins are available.\nA screenshot of a page showing some plugins that are available\nLearn section in docs\nA new section was added within Headlamp official docs, aimed to help users learn how to navigate Headlamp. Available at Headlamp docs. The first section in there describes how to use the new \"Projects\" feature. More documentation on how to use different Headlamp features will go into the Learn section of the docs in the future.\nScreen shot of some documentation describing how to use the Projects feature\n🧩 Shipped Plugins\n- Update shipped plugin plugin-catalog 0.4.2 (desktop only)\n  - Fixes for a number of display issues\n  - Minor bug fixes found with new type checker config\n- Update shipped plugin app-catalog 0.7.0 (desktop only)\n  - Support for Vanilla Helm repos along with Artifact Hub ones\nFull Changelog: v0.36.0...v0.37.0\nContainer image: 🐳 ghcr.io/headlamp-k8s/headlamp:v0.37.0\nDesktop Apps:\n🐧 Flatpak / Linux (AMD64)\n🐧 Linux AppImage AMD64, ARM64, ARMv7l\n🐧 Linux Tarball AMD64, ARM64, ARMv7l\n🐧 Debian / Linux AMD64\n🍏 Mac (AMD64)\n🍏 Mac (ARM/M1)\n🟦 Windows (AMD64)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.37.0","version":0,"site":"https://headlamp.dev/","source":"Headlamp","license_or_tos":"Apache-2.0","resources":null,"verified":false}