{"appId":"w:Hetman.InternetSpy","appShortcutName":"Hetman Internet Spy","appDisplayName":"Hetman Internet Spy","authorId":"w:winget","releaseTagName":"winget-4.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://hetmanrecovery.com/download/hetman_internet_spy.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"This program analyzes the contents of both existing and deleted browser system files and collects detailed information on a user’s online activity.\n\nThis program analyzes the contents of both existing and deleted browser system files and collects detailed information on a user’s online activity. The utility allows you to analyze browsing history, social media messages, search history, emails, videos watched on YouTube, etc.\n\nThe user-friendly interface is good not only for parents who would like to monitor their children’s online activity, but also for detectives working on digital evidence. The application will give you certain information even if the browsing history was deleted, the data was removed, or the disk was formatted.\n\n- You can view the browsing history of any person who works with the target computer. The application supports all popular browsers such as Chrome, Yandex, Mozilla Firefox, Opera, Microsoft Edge, Internet Explorer, and more.\n- This utility provides access to messaging history on any social media site like Facebook, Twitter, Instagram, YouTube, etc. All user accounts logged into, the time spent communicating, and many other things will be clearly visible.\n- Analyzes a user’s online activity on social media\n- Analyzes search queries and use of machine translation\n- Shows created bookmarks and downloads\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.0","version":0,"site":"https://hetmanrecovery.com/","source":"Hetman Software","license_or_tos":"Proprietary","resources":null,"verified":false}