{"appId":"w:Hetman.Uneraser","appShortcutName":"Hetman Uneraser","appDisplayName":"Hetman Uneraser","authorId":"w:winget","releaseTagName":"winget-7.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://hetmanrecovery.com/download/hetman_uneraser.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Uneraser™ quickly recovers deleted files and folders from just about any kind of storage media. Hard drives, memory cards, external storage, USB drives – you name it!\n\nUneraser™ quickly recovers deleted files and folders from just about any kind of storage media. Hard drives, memory cards, external storage, USB drives – you name it! The tool will reliably recover accidentally deleted files even if you used the “permanent delete” function with Shift + Delete, and restore data cleared from the Recycle Bin.\nUneraser™ can successfully recover files of all formats with no exceptions. However, for certain data it can go one extra step, offering an even better chance of recovering essential information such as Office documents, PDF files, pictures and videos including RAW files and Photoshop designs, email messages, archives and backups, and many other types of data you would rather not lose. For these formats, software can do a context-aware analysis of the entire disk surface, looking for deleted files by their unique signatures. Such files can be recovered even if there is no record about them left in the file system. - Binary settings; - Webmoney Keys; - Text documents (Word and Writer included): DOC, DOCX, RTF, PDF, etc. - Spreadsheets: XLS, XLSX, etc. - Presentations: PPT, PPTX, etc. - Source codes: PAS, C, H, PHP, HTML, etc. - Vector and bitmap images: JPEG, PSD, etc. - Compressed archives: ZIP, RAR, etc. - Virtual disk images ISO, VHD, NRG, MDF, etc. - Video and audio files: AVI, DAT, MKV, MPG, VOB, MP3, etc. - Image files: JPEG, PNG, TIFF, PSD, etc.\n\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.1","version":0,"site":"https://hetmanrecovery.com/","source":"Hetman Software","license_or_tos":"Proprietary","resources":null,"verified":false}