{"appId":"w:Hetman.PartitionRecovery","appShortcutName":"Hetman Partition Recovery","appDisplayName":"Hetman Partition Recovery","authorId":"w:winget","releaseTagName":"winget-5.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://hetmanrecovery.com/download/hetman_partition_recovery.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Partition Recovery™ reliably restores data from damaged FAT/exFAT, NTFS/ReFS, APFS/HFS+, Ext4/3/2/ReiserFS, ZFS, Btrfs, HikvisionFS, and XFS/UFS drives, preserving the original file and folder structure.\n\nPartition Recovery™ reliably restores data from damaged FAT/exFAT, NTFS/ReFS, APFS/HFS+, Ext4/3/2/ReiserFS, ZFS, Btrfs, HikvisionFS, and XFS/UFS drives, preserving the original file and folder structure. Beyond existing partitions, it detects all previously created volumes, allowing users to search and recover files from deleted or lost partitions. The tool can also save the entire logical drive while maintaining the original directory structure.\n\n- The software can undelete all types of files accidentally removed from hard drives, USB drives, memory cards, and other storage media, regardless of the file system. Advanced low-level, content-aware algorithms are available to handle even the most complex recovery cases.\n- Recovers data from formatted partitions, deleted volumes, and repartitioned hard drives, regardless of the file system. Partition Recovery™ can detect deleted partitions and locate missing file systems with ease.\n- The program can successfully undelete files removed using Shift + Del, erased by third-party applications, or deleted from the Recycle Bin.\n- Recovers data destroyed or locked due to virus attacks, power outages, or hardware failures. Viruses, Trojans, and other types of malware can intentionally destroy information or make it inaccessible by corrupting or erasing critical system structures.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.1","version":0,"site":"https://hetmanrecovery.com/","source":"Hetman Software","license_or_tos":"Proprietary","resources":null,"verified":false}