{"appId":"w:Hetman.PhotoRecovery","appShortcutName":"Hetman Photo Recovery","appDisplayName":"Hetman Photo Recovery","authorId":"w:winget","releaseTagName":"winget-6.9","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://hetmanrecovery.com/download/hetman_photo_recovery.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Photo Recovery™ recovers digital pictures from all types of storage media. Undelete photos from hard disks, recover from USB drives, or restore from formatted, corrupted or inaccessible memory cards – it can do all this, and more.\n\nPhoto Recovery™ recovers digital pictures from all types of storage media. Undelete photos from hard disks, recover from USB drives, or restore from formatted, corrupted or inaccessible memory cards – it can do all this, and more. The tool can even recover pictures directly from the smartphones, tablets and many digital camera models. Simply connect your device to the computer via a USB cord and run our software.\n\nUsing our software is easy as 1-2-3. You’ll run a step-by-step wizard guiding you through the entire recovery process from choosing the device that has your files to selecting pictures to recover and finally saving them onto another disk.\n\nIt can recover pictures in all popular image formats. This includes raster and vector images in JPEG, PSD, TIFF, PNG, BMP, GIF and many other formats. The list of supported formats is constantly growing. In addition, software fully supports the recovery of RAF files (“digital negatives”) produced by Canon, Nikon, Pentax, SONY, Olympus, Panasonic and other cameras. The tool recognizes CR2, CRW, RAW, TIFF, TIF, NEF, PEF, X3F and many other RAW formats.\n\nPhoto Recovery™ can recover images stored in the internal memory of many digital cameras. On order to recover the pictures, connect your camera to the PC via a USB cord and make sure a new drive letter appears. You can then use product to recover photos from that new drive.\nWe tested multiple camera models manufactured by Canon, Casio, Ergo, Fujifilm, HP, Kodak, Logitech, Leica, Nikon, Olympus, Panasonic, Pentax, Praktica, Premier, Samsung, Sony, Toshiba, UFO and other makers.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.9","version":0,"site":"https://hetmanrecovery.com/","source":"Hetman Software","license_or_tos":"Proprietary","resources":null,"verified":false}