{"appId":"w:HulubuluSoftware.AdvancedRenamer","appShortcutName":"Advanced Renamer","appDisplayName":"Advanced Renamer","authorId":"w:winget","releaseTagName":"winget-4.18","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.advancedrenamer.com/down/win/advanced_renamer_setup_4_18.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Batch file renaming utility for Windows and Mac.\n\nAdvanced Renamer is a program for renaming multiple files and folders at once. By configuring renaming methods the names can be manipulated in various ways.\nIt is easy to set up a batch rename using multiple methods on a large amount of files. The 13 different methods enables you to change the names, and timestamps of files in one go. The files can also be copied or moved to new locations based on information in the files.\nWith Advanced Renamer you can construct new file names by adding, removing, replacing, changing case, or giving the file a brand new name based on known information about the file.\nBefore performing the operations on the files you can verify that the output will be correct and if you perform the rename and regret it, you can undo the complete batch.\nCommand search\n\nThe program now has a command search feature, which can be opened with Ctrl+P (Windows) or ⌘P (Mac). It can be used to quickly find and execute commands in the program, like adding a specific method, opening settings, or adding files. Most features shown in toolbars and menus are available through the command search. Just start typing to filter the list of commands and press Enter to execute the selected command.\n\nConfigure favorite folders\n\nA list of favorite folders can now be configured on the folder panel. Use it to quickly navigate to the folders you use the most. Right click a folder and click \"Add to favorites\" to add it to the list.\n\nQuick change UI settings\n\nVarious parts of the UI can be customized to fit your liking. These configurations are available in the settings window, but to make it easier to change these settings, some of them are now available through a right click menu on selected UI elements in the main window.\n\nThe Insert Tag and Pattern windows have been merged\n\nInstead of two separate windows for inserting tags and patterns, there is now only one window with all the functionality of both. This means that all windows that support tags also have the option to save the pattern for later use. Can also be used to store your favorite regex patterns.\n\nFull list of changes in version 4.18\n- Added support for searching commands by name through a new search field\n- Folder panel: Configure list of favorite folders\n- Right click menu on certain UI elements to quickly change UI related settings\n- The Insert Tag window and the Tag Pattern window has been merged into one window\n- Fixed some issues with email tags: Did not support names containing comma (,). Also fixed issue with the FromEmail tag not working\n- Progress bar in batch progress window was too wide for the window\n- Updated JavaScript engine to a newer version\n- Fixed <RSubstr> tag being off by one when second parameter is a search pattern instead of a numeric value\n- Added row move buttons to list replace method when shown in a separate window\n- When loading a method list with more than 500 methods, the program will now show a message and only load the first 500 methods, instead of crashing\n- Properly read framerate from .mkv files and .mp4 files\n- Read audio bitrate from QTFF based file formats, like .mp4, .mov, and .m4a\n- Added two new tag modifiers :multiply and :divide","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.18","version":0,"site":"https://www.advancedrenamer.com/","source":"Hulubulu Software","license_or_tos":"Proprietary","resources":null,"verified":false}