{"appId":"w:HulubuluSoftware.AdvancedRenamer","appShortcutName":"Winget Application","appDisplayName":"Advanced Renamer","authorId":"w:winget","releaseTagName":"winget-4.11","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.advancedrenamer.com/down/win/advanced_renamer_setup_4_11.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Batch file renaming utility for Windows and Mac.\n\nAdvanced Renamer is a program for renaming multiple files and folders at once. By configuring renaming methods the names can be manipulated in various ways.\nIt is easy to set up a batch rename using multiple methods on a large amount of files. The 13 different methods enables you to change the names, and timestamps of files in one go. The files can also be copied or moved to new locations based on information in the files.\nWith Advanced Renamer you can construct new file names by adding, removing, replacing, changing case, or giving the file a brand new name based on known information about the file.\nBefore performing the operations on the files you can verify that the output will be correct and if you perform the rename and regret it, you can undo the complete batch.\nFull list of changes in version 4.11\n- Fixed an issue where the menu bar would have the wrong height when starting the program with menu in super compact mode\n- Script: Re-added the item.GPSExists property\n- Fixed move method, when moving in backwards mode and using Move To value longer than filename length\n- Fixed not being able to change filename and timestamp in a single batch\n- Could not load Norwegian language file","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.11","site":"https://www.advancedrenamer.com/","source":"Hulubulu Software","license_or_tos":"Proprietary","resources":null,"verified":false}