{"appId":"w:HulubuluSoftware.AdvancedRenamer","appShortcutName":"Advanced Renamer","appDisplayName":"Advanced Renamer","authorId":"w:winget","releaseTagName":"winget-4.20","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.advancedrenamer.com/down/win/advanced_renamer_setup_4_20.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Batch file renaming utility for Windows and Mac.\n\nAdvanced Renamer is a program for renaming multiple files and folders at once. By configuring renaming methods the names can be manipulated in various ways.\nIt is easy to set up a batch rename using multiple methods on a large amount of files. The 13 different methods enables you to change the names, and timestamps of files in one go. The files can also be copied or moved to new locations based on information in the files.\nWith Advanced Renamer you can construct new file names by adding, removing, replacing, changing case, or giving the file a brand new name based on known information about the file.\nBefore performing the operations on the files you can verify that the output will be correct and if you perform the rename and regret it, you can undo the complete batch.\nTag builder\n\nThe pattern window has been extended with a tag builder for helping setting up the right parameters for a tag. Can also be used to correctly add tag modifiers and tag fallbacks.\n\nFull list of changes in version 4.20\n- Pattern window: Tag builder for easy configuration of tag parameters and modifiers\n- Fixed method list not loading when double clicking .aren file in Windows Explorer\n- Improved support for long filenames\n- Script Method: Upgraded JS engine to a newer version\n- Script Method: Added optinal parameters, index and count, to app.readFileText(filename, index, count)\n- Metadata: Improved reading metadata from certain WAV files","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.20","version":0,"site":"https://www.advancedrenamer.com/","source":"Hulubulu Software","license_or_tos":"Proprietary","resources":null,"verified":false}