{"appId":"w:HulubuluSoftware.AdvancedRenamer","appShortcutName":"Winget Application","appDisplayName":"Advanced Renamer","authorId":"w:winget","releaseTagName":"winget-4.10","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.advancedrenamer.com/down/win/advanced_renamer_setup_4_10.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Batch file renaming utility for Windows and Mac.\n\nAdvanced Renamer is a program for renaming multiple files and folders at once. By configuring renaming methods the names can be manipulated in various ways.\nIt is easy to set up a batch rename using multiple methods on a large amount of files. The 13 different methods enables you to change the names, and timestamps of files in one go. The files can also be copied or moved to new locations based on information in the files.\nWith Advanced Renamer you can construct new file names by adding, removing, replacing, changing case, or giving the file a brand new name based on known information about the file.\nBefore performing the operations on the files you can verify that the output will be correct and if you perform the rename and regret it, you can undo the complete batch.\nAutomatic method titles\n\nWhen multiple methods of the same type are used in a batch, the title of the method will show basic information about the method configuration. This makes it easier to see what each method does without having to open the method panel. The default setting is to only show the configuration when there are multiple of the same type, but this can be changed in the Settings window on the Program tab.\n\nNot all methods will support this (Script, List, List Replace, and Trim). Those that are list based does not have an obvious basic info to show.\n\nNew modes for Remove method\n\nThe Remove method has been extended with new remove types to make it easier to perform certain types of removals from filenames.\n\nThe new types are:\nPosition - Like the existing functionality of the Remove method.\nPattern - Works like the Remove pattern method.\nAccents and special marks - For easy removal of accents and special marks, also known as diacritics.\nWord characters\nNon-word characters\nUpper case - Remove all characters that are upper case.\nLower case - Remove all characters that are lower case.\nCharacter list - A list of characters to remove.\nNumbers - Remove all numeric values.\n\nThis change effectively makes the Remove pattern method redundant. Later versions of Advanced Renamer might not be able to create new Remove pattern methods, but full backwards compatibility will be maintained.\n\nRemove character accents\n\nAs mentioned in the paragraph above, the new remove type Accents and special marks can be used to remove accents and special marks from filenames. This is useful when you want to remove accents from characters like é, è, ê, and ë. Only accent and special mark is removed, leaving the clean character behind.\n\nLayout changes for Timestamp method\n\nThe user interface Timestamp method was getting too tall and was diverging from the layout of other methods. The \"Set to\" controls have been changed from radio buttons to a dropdown.\n\nSome settings have moved\nThe Program tab in the Settings window was getting too crowded, so some settings have been moved to other tabs, for the most part the Renaming tab.\n\nFull list of changes in version 4.10\n- Always show all batch modes, but show an error if copy mode is chosen in folder mode\n- When multiple methods of the same type is used, the title will show basic information about the method configuration\n- Reorganized the settings window\n- Remove method changed to support several remove types: Position, Pattern, Accents and special marks, Word characters, Non-word characters, Upper case, Lower case, Character list, and Numbers\n- Various performance improvements\n- Changed how method panels are rendered\n- New layout for the timestamp method","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.10","site":"https://www.advancedrenamer.com/","source":"Hulubulu Software","license_or_tos":"Proprietary","resources":null,"verified":false}