{"appId":"w:HulubuluSoftware.AdvancedRenamer","appShortcutName":"Advanced Renamer","appDisplayName":"Advanced Renamer","authorId":"w:winget","releaseTagName":"winget-4.17","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.advancedrenamer.com/down/win/advanced_renamer_setup_4_17.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Batch file renaming utility for Windows and Mac.\n\nAdvanced Renamer is a program for renaming multiple files and folders at once. By configuring renaming methods the names can be manipulated in various ways.\nIt is easy to set up a batch rename using multiple methods on a large amount of files. The 13 different methods enables you to change the names, and timestamps of files in one go. The files can also be copied or moved to new locations based on information in the files.\nWith Advanced Renamer you can construct new file names by adding, removing, replacing, changing case, or giving the file a brand new name based on known information about the file.\nBefore performing the operations on the files you can verify that the output will be correct and if you perform the rename and regret it, you can undo the complete batch.\nOpen List and List replace in new window\n\nThe List method and List Replace method can now be opened in a new window. This makes it easier to work with large lists, as you can now see more lines on the screen without scrolling.\n\nSearch\n\nWhen you open the Script method, List method, or List Replace method in a new window, you can now search through the content using Ctrl+F/⌘F. You can also search the main list with the same shortcut.\n\nUpdated UI for loading and saving method lists\n\nThe buttons for loading and saving method lists has been extended with a submenu to access additional functionality, like appending a method list file with an existing list, or easily overwriting the recently opened method list file. The presets dropdown has been moved into this submenu as well for a cleaner more compact UI.\n\nScript method: formatDate()\n\nThe Script method now has a new function called formatDate(date, format), taking the same format parameter as the Datetime tags.\n\nExample of use:\nvar date = new Date(item.modifiedDate);\nreturn app.formatDate(date, 'yyyy_mm_dd hh_nn_ss');\n\nFull list of changes in version 4.17\n- List method and List Replace method can be opened in a new window\n- Added search functionality to Script method, List method, and List Replace method, when shown in a separate window\n- Added search to item list in main window\n- UI update for recent methods. Is now in a submenu of the load button instead of a dropdown\n- Scripting: The values item.newModifiedDate and item.newCreatedDate can now be updated from script\n- Added method app.formatDate(date, format) to scripting method\n- Settings: Added options to always use strict mode in scripts\n- Item details: Added Copy Tag to right click menu\n- New option in list right click: Unmark items with errors. Also updated logic behind remove items with errors\n- Fixed an issue where dates of folders could not be changed on Windows\n- When the main menu was in super compact mode, the show thumbnails button didn't work\n- Multi select support in columns window\n- Faster load time for Exiftool at startup","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.17","site":"https://www.advancedrenamer.com/","source":"Hulubulu Software","license_or_tos":"Proprietary","resources":null,"verified":false}