{"appId":"w:Hurdle.Hurdle","appShortcutName":"Winget Application","appDisplayName":"Hurdle.LIVE","authorId":"w:winget","releaseTagName":"winget-1.23.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://releases.hurdle.live/Hurdle.LIVE-Desktop/hurdle-live-app-v1.23.1-x64-web.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Simply deliver better software training online using hurdle's digital classroom\n\nhurdle is an online, live training platform built to mimic the classroom and is designed by professional system trainers. Offering inclusivity regardless of location, all learners can experience the same learning experience they would in a classroom, remotely. As trainers ourselves we understand the need for students to be confident in what they have learnt, and hurdle gives the ability for them to be demonstrated to and practice with the trainer being able to support by seeing exactly what the entire class is doing on their screen in real time.\nMajor Changes\n- Learn more about this update here https://hurdle.live/news/hurdle-april-2025-release/\n- Custom branding is now in the application!\n  - If you have already set your branding up, it will appear in the Join page, and the application, you do not need to do any changes\nChanges\n- Browser: Added a prompt for learners that have an ad-blocker when trainers want to open a link\n- Added the ability for trainers to toggle the visibility of the overlay to recording software (Screenshots, screen recorders, etc.)\n- Added confirmation before reloading a learner\n- Change Sign-Out/End Session button colour to stand out more\n- Added undock button to Picture-in-Picture\n- Added the ability to add Content Panels mid-way through a session\n  - Trainers have the ability to refresh Content Panels in-session when they have added/removed Content Panels\n- Change Content Panels for learners, when a new Content Panel is shown to learners, the Content Panel pops-out automatically\nFixes\n- Lab: Improved messaging for Unstable Bridge errors\n- Mac: Fix auto-update sometimes not updating\n- Fix echo from learners when presenting local desktop\n- Fix trainers whiteboard drawing sometimes not appearing for learners\n- Fix learners not being kicked out of a session when a session ends\n- Fix presentation stops/starts when learner leaves\n- Fix New Message notification not appearing in Chat recipient drop-down\n- Fix Chat message box losing focus if while composing a message, another message is received\n- Misc. fixes and general improvements","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.23.1","site":"https://hurdle.live/","source":"Hurdle Group Limited","license_or_tos":"Proprietary","resources":null,"verified":false}