{"appId":"w:i2van.hourglass","appShortcutName":"Hourglass","appDisplayName":"Hourglass","authorId":"w:winget","releaseTagName":"winget-1.15.51","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"This project is the modified simple countdown timer for Windows.\n\nThis project is the modified simple countdown timer for Windows.\nHourglass Changes\nInstaller\n- Adds the Hourglass executable path to the Windows App Paths, so the Hourglass command-line is available out of the box.\nWinGet\nThe Hourglass can be managed with WinGet:\nInstall\nwinget source update\nwinget install -e --id i2van.hourglass\nUpgrade\nwinget source update\nwinget upgrade i2van.hourglass\nUninstall\nwinget uninstall -e --id i2van.hourglass\nPortable\nNgen Support\nProcessing the Hourglass with the Native Image Generator (Ngen.exe) speeds up the Hourglass startup.\nTo run script as an Administrator press Win+X and select the Windows PowerShell (Admin) or Command Prompt (Admin). Copy script full path to the console opened and execute one of the following:\n- Generate the Hourglass native image and its dependencies and install in the native image cache:\nngen-Hourglass.bat install\n- Delete the native images of the Hourglass and its dependencies from the native image cache:\nngen-Hourglass.bat uninstall\nCommand-line\n- New command pause\n- New command resume\n- New option --digital-clock-time, -c, /c\n- New option --multi-timers, -mt, /mt\n- New option --activate-next, -an, /an\n- New option --show-trigger-time, -st, /st\n- New option --pause-after-loop-timer, -pl, /pl\n- New option --order-by-title, -ot, /ot\n- Renamed option --prompt-on-exit to --prompt-on-close\n- New option --save-timer-on-closing, -sc, /sc\nSee command-line usage for details.\nUI\n- Uses a Windows Task Dialog instead of a message box (GitHub).\n- The Command-line usage dialog can be accessed from the About dialog and vice versa.\n- New Accent theme which uses Windows accent color. This theme is a default one.\n- The Jump List support (disabled by default, see FAQ).\n- The thumbnail toolbar support.\nNotification Area\n- All the timer windows are arranged by the time left. The order is new, expired, paused, running. Timers can be ordered by the title first using --order-by-title, -ot, /ot command-line option or by the checking Advanced options / Order timers by title first then by time left timer window context menu option.\n- The red circle is shown over the notification area icon if at least one timer is expired.\n- The pause sign is shown over the notification area icon if at least one timer is paused.\n- The digits from 0 to 9 are the hotkeys for the timer windows in the notification area icon context menu.\n- The Double Click shows/hides all the timer windows.\n- The Ctrl+Click creates a new timer window.\n- The Shift+Click shows the first timer window.\n- The Shift+Middle Click shows the recently opened timer windo w.\n- The Middle Click or Shift+Right Click opens the timer window options menu.\n- The Pause all menu command pauses all the running timer windows.\n- The Resume all menu command resumes all the paused timer windows.\n- The Options menu command opens the timer window options menu. The shortcut is the Middle Click or Shift+Right Click on the notification area icon.\n- The Silent mode disables all the timer windows notifications. It is not preserved between runs.\n- The Exit menu command prompts for closing all the running timer windows if the Prompt on close option is set.\n- ⏺⏸⏹⏏🔁 symbols are used for the New, Paused, Stopped, Expired, Looped.\nTimer Windows\nKeyboard Shortcuts\n- The Esc shortcut minimizes the timer window.\n- The F11 shortcut makes the timer window full screen and back.\n- The Ctrl+N shortcut creates a new timer window.\n- The F2 shortcut edits the timer window title.\n- The F4 shortcut edits the timer window time.\nContext Menu\n- All the timer window commands are available in the timer window context menu.\n- The shortcuts are displayed in the timer window context menu.\n- The Window title submenu is available directly from the timer window context menu.\n- The Reset position and size menu command sets the timer window default position and size.\n- The Restore, Minimize and Maximize timer window commands are always present in the timer window context menu.\n- The Advanced options / Display time in the digital clock format timer window context menu option toggles the displayed time digital clock time format. The command-line option is --digital-clock-time, -c, /c\n- The Advanced options / Show trigger time timer window context menu option shows the trigger time in the timer window and in the notification area context menu. The command-line option is --show-trigger-time, -st, /st\n- The Advanced options / Activate next window when minimized or closed timer window context menu option enables the next timer window activation when the current timer window is minimized or closed. The command-line option is --activate-next, -an, /an\n- The Advanced options / Order timers by title first then by time left timer window context menu option orders the timers by the title first then by the time left. The command-line option is --order-by-title, -ot, /ot\n- The Advanced options / Save timer on closing timer window context menu option enables timer window save on closing. The command-line option is --save-timer-on-closing, -sc, /sc\n- The Pause all timer window context menu command pauses all the running timers. Command-line command is pause\n- The Resume all timer window context menu command resumes all the paused timers. Command-line command is resume\n- The Pause after each loop timer window context menu command pauses the loop timer when it expires. Command-line command is --pause-after-loop-timer, -pl, /pl\nOther\n- All the timer windows are arranged by the time left. The order of the timer windows is new, expired, paused, running.\n- The minimum timer window size is limited by the Windows only.\n- The timer tooltip is shown if the timer window size is too small.\n- The progress bar changes direction to vertical when the height is more than the width and vice versa.\n- When the timer window is minimized or closed the next visible non-minimized timer window is activated.\n- The time left is now used for editing instead of the original launch time.\n- The timer window pops up on the current virtual desktop.\n- The mouse double-click on progress border toggles full screen.\n- The sound file can be placed to the %LOCALAPPDATA%\\Hourglass or %LOCALAPPDATA%\\Hourglass\\Sounds directories. It can be the symbolic link created by the mklink system command.\n- NAudioHourglassPack can be used for playing sounds on Windows with no Windows Media Player installed.\n- The .ogg sound file format is supported.\nMisc\n- The Hourglass is built deterministically using the GitHub Actions.\nFull Changelog: 1.15.50...1.15.51","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.15.51","version":0,"site":"https://github.com/i2van/hourglass","source":"2021 Chris Dziemborowicz, 2024-2025 Ivan Ivon","license_or_tos":"MIT","resources":null,"verified":false}