{"appId":"w:IdeaMK.STPViewer","appShortcutName":"STP Viewer","appDisplayName":"STP Viewer","authorId":"w:winget","releaseTagName":"winget-2.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A professional tool for viewing CAD models with outstanding speed and quality.\n\nSTP Viewer is a professional tool for viewing CAD models with excellent speed and quality. STP Viewer boast a very user-friendly interface for non-technical users while providing full range of tools for navigation and analyzing the 3D object. For advanced users of this kind viewers there are most of the known command as on any STP Viewer, and for beginners and non-technical users there is a help, and explanation on every tool how to use and what that tool do while using STP Viewer. Very interesting feature in STP Viewer is tree view where you can see all markers that are used in 3D object. You can easily hide or unhide them and see all object part by part. With STP Viewer except zooming and panning you can see the object in 2D in any of the 4 sides (top, bottom, left, right), you can add shade to the object to see how will look like as an real object or to see only wireframe. STP Viewer also allow changing color of wireframes or shade of 3D object.\nSTP Viewer screenshot STP Viewer is a software tool for viewing international STEP standard files. STEP files (.stp) for 3D and assembly are often used by all major mechanical CAD systems. With our absolutely free STP Viewer you can easily open 3D files (*.stp), rotate them and perform some basic actions like: zoom, rotate, move or change skin.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3","version":0,"site":"https://stpviewer.com/","source":"IdeaMK","license_or_tos":"Freeware","resources":null,"verified":false}