{"appId":"w:Inkscape.Inkscape","appShortcutName":"Inkscape","appDisplayName":"Inkscape","authorId":"w:winget","releaseTagName":"winget-1.4.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://media.inkscape.org/dl/resources/file/inkscape-1.4.2_2025-05-13_f4327f4-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A professional vector graphics software which runs on Linux, macOS and Windows desktop computers.\n\nInkscape is a Free and open source vector graphics editor for GNU/Linux, Windows and macOS. It offers a rich set of features and is widely used for both artistic and technical illustrations such as cartoons, clip art, logos, typography, diagramming and flowcharting. It uses vector graphics to allow for sharp printouts and renderings at unlimited resolution and is not bound to a fixed number of pixels like raster graphics. Inkscape uses the standardized SVG file format as its main format, which is supported by many other applications including web browsers.\nIt can import and export various file formats, including SVG, AI, EPS, PDF, PS and PNG. It has a comprehensive feature set, a simple interface, multi-lingual support and is designed to be extensible; users can customize Inkscape's functionality with add-ons.\nThe Inkscape project has a growing international user community, and many learning materials exist to help get you started with your creations. Help and support is provided by the community, and there are lots of ways for you to get involved if you want to help improve the Inkscape project.\nInkscape is a member of the Software Freedom Conservancy, a US 501(c)(3) non-profit organization. Contributions to Inkscape are tax deductible in the United States.\nInkscape 1.4.2 is a maintenance and bugfix release, which brings you fixes for many critical or irritating bugs, and even a few new features.\nRelease highlights\n- a new splash screen, providing a visual cue while Inkscape loads in the background\n- initial support for importing Vectornator / Linearity Curve files\n- a new extension to Clean up Paths\n- substantially improved Affinity Designer files (.afdesign) import\n- 20 crash/freeze fixes, many of which affected PDF import\n- more than 50 other bug fixes and small improvements, among them improvements to Boolean operations, layer selection, minimal window width and restoration of Spray tool buttons' functionality\n- and 15 updated translations\nRead all about Inkscape 1.4.2 in the release notes!","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.4.2","version":0,"site":"https://inkscape.org/","source":"Inkscape","license_or_tos":"GPL-2.0","resources":null,"verified":false}