{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.7.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.7.0/Hackolade-win64-setup-signed.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- Remote references: added possibility for cross-repository references to models (Polyglot or external) in a remote location, across different repositories and repository providers\n- Memory management: reduced memory footprint of application by 300 MB when opening a model\n- Browser: added possibility to create and refresh external and Polyglot references\n- ArchiMate: added support for forward-engineering of scalar custom properties at model and entity level in ArchiMate file format (not yet complex custom props, and not yet Open Exchange file format)\n- Command-Line Interface: enabled --properties argument in genDoc command\n- Documentation: added $ref for entities with external references\n- Documentation: eliminated race condition on old and slow Windows machines\n- ERD: improved performance for models with large number of relationships\n- Properties Pane: added message when number of relationships is greater than 250\n- PowerDesigner: added reverse-engineering of technical names (\"code\") of foreign key relationships\n- PowerDesigner: added support for reverse-engineering views based on views\n- PowerDesigner: enhanced reverse-engineering of view SELECT statements from Erwin models by cleaning unsupported characters and unnecessary CREATE statements\n- Undo/Redo: improved functionality after model conversion\n- Collibra: adapted forward-engineering to comply with new stricter configuration rules for complex relation types\n- Collibra: added handling of publishing when custom asset types are present\n- MariaDB, MySQL: improved reverse-engineering to handle reserved keywords in comments","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.7.0","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}