{"appId":"w:Intel.PresentMon","appShortcutName":"Intel(R) PresentMon","appDisplayName":"Intel(R) PresentMon","authorId":"w:winget","releaseTagName":"winget-2.3.1.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/GameTechDev/PresentMon/releases/download/v2.3.1/PresentMon-v2.3.1.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A gaming performance overlay and telemetry application to monitor and measure your gaming experience.\n\nPresentMon is a set of tools to capture and analyze the high-level performance characteristics of graphics applications on Windows.\nPresentMon traces key performance metrics such as the CPU, GPU, and Display frame durations and latencies; and works across different graphics API such as DirectX, OpenGL, and Vulkan, different hardware configurations, and for both desktop and UWP applications.\nNew Features\n- Introduced three new FPS overlay indicators to provide a clearer picture of frame delivery behavior, especially in scenarios involving frame generation. FPS-Presents measures how often frames are presented to the GPU, while FPS-Display captures the rate at which frames are actually shown on screen. FPS-App typically matches FPS-Presents except in frame generation scenarios.\n- Added the following GPU telemetry metrics (currently supported by Intel Arc Battlemage GPUs):\n  - GPU Effective Frequency\n  - GPU Voltage Regulator Temperature\n  - GPU Memory Effective Bandwidth\n  - GPU Overvoltage Percent\n  - GPU Temperature Percent\n  - GPU Power Percent\n  - GPU Fan Speed Percent\n  - GPU Card Power (total board power)\n- Reintroduced support for several timing metrics in the CSV, including MsBetweenPresents, MsBetweenDisplayChange, MsInPresent, MsRenderPresentLatency, and MsUntilDisplayed. MsBetweenSimulationStart and MsPCLatency are also included in the schema but are currently disabled until underlying event support is enabled.\n- Added CLI option to disable overlay alpha blending (reduces overlay impact on target present timing seen in some circumstances)\n- Added support to PresentMon console application for detection of Hybrid Presents\n- Increased default PresentMon circular buffer size to 2048 to be able to handle higher FPS applications. In addition added a command line parameter to be able to manually configure buffer size.\n- Stabilized binary version compatibility of PresentMon API by deploying PresentMonAPI.dll side-by-side with the service and moving to a dynamic loading model\n- Added Loader .dll + static import .lib to facilitate discovery and endpoint resolution of the PresentMon API\n- Added ETL trimmer utility for trimming ETL files to a timestamp range and pruning unnecessary event types (source only, currently no binary distribution provided)\n\nExperimental\n- Added ability to inject executable code into the target process to cause a flash to be drawn in-game whenever the mouse is clicked (intended for use in conjunction with specialized optical measuring instruments)\n\nBug Fixes\n- Re-engineered multi-process architecture to enable PresentMon to be run without Administrator privileges\n- Improved security by ensuring that Chromium UI frontend runs at lowered integrity even when PresentMon is run elevated\n- Upgraded frontend from Vue.js 2 (past end-of-life and unsupported) & Vuex => Vue.js 3 & Pinia","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.1.0","version":0,"site":"https://www.intel.com/","source":"Intel(R) Corporation","license_or_tos":"MIT","resources":null,"verified":false}