{"appId":"w:Intel.PresentMon","appShortcutName":"Intel(R) PresentMon","appDisplayName":"Intel(R) PresentMon","authorId":"w:winget","releaseTagName":"winget-2.4.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/GameTechDev/PresentMon/releases/download/v2.4.0/PresentMon-v2.4.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A gaming performance overlay and telemetry application to monitor and measure your gaming experience.\n\nPresentMon is a set of tools to capture and analyze the high-level performance characteristics of graphics applications on Windows.\nPresentMon traces key performance metrics such as the CPU, GPU, and Display frame durations and latencies; and works across different graphics API such as DirectX, OpenGL, and Vulkan, different hardware configurations, and for both desktop and UWP applications.\nNew Features\nEnhancements\n- Implemented paced playback of ETL files from the service, allowing the service to process ETL files at realtime cadence\n- Added automated test that uses paced ETL playback to test dynamic metric polling API\n- Enhanced the flash injection to maintain a connection with the injected code and update settings in realtime\n- Added a rainbow bar option for flash injection to help identify frames\n- Added the ability to size the flash injection background independent of foreground flash rectangle\n- Added the ability to run PresentMon client headless via CLI to perform .csv frame captures\n- Added CLI option to list/browse available stats, metrics, and devices\n- Enhanced cooperation between clients in multi-client scenarios (telemetry and ETW flush periods)\n- Added the ability to capture ETL trace logs from PresentMon client UI (experimental, primarily for issue reporting)\n- Enabled logging up to verbose level in production without requiring special build parameters (also added new Verbose2 level)\n- PresentMon Installer upgrade fixes to allow for better upgrade experience and silent installations\n- Enhanced PresentMon console ULT suite\n\nMetrics\n- MsBetweenSimulationStart - BETA support - Enabled but still ironing out some issues.\n- MsPCLatency - BETA support - Enabled but still ironing out some issues.\n\nBug Fixes\n- Fixed injection sometimes skipping drawing flash when clicking rapidly\n- Fixed bug in Streamer component (IPC ring buffer) that could lose frames in rare circumstances\n- Enhanced present event processing in CompletePresent when handling lost presents.\n- Fixed frame type bug when processing composed presents\n- Fixed small error in overlay AnimationError calculation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.4.0.0","version":0,"site":"https://www.intel.com/","source":"Intel(R) Corporation","license_or_tos":"MIT","resources":null,"verified":false}