{"appId":"w:InterceptSuite.ProxyBridge","appShortcutName":"ProxyBridge","appDisplayName":"ProxyBridge","authorId":"w:winget","releaseTagName":"winget-3.2.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/InterceptSuite/ProxyBridge/releases/download/v3.2.0/ProxyBridge-Setup-3.2.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Redirect any Windows/MacOS TCP and UDP traffic to HTTP/Socks5 proxy\n\nProxyBridge is a lightweight, open-source universal proxy client (Proxifier alternative) that provides transparent proxy routing for applications on Windows and macOS. It redirects TCP and UDP traffic from specific processes through SOCKS5 or HTTP proxies, with the ability to route, block, or allow traffic on a per-application basis. ProxyBridge fully supports both TCP and UDP proxy routing and works at the system level, making it compatible with proxy-unaware applications without requiring any configuration changes.\nProxyBridge v3.2.0\nProxyBridge v3.2.0 introduces major improvements across all platforms, highlighted by the first stable Linux release.\n\n🚀 Major\n- Linux Support\n  ProxyBridge now fully supports Linux with its first stable Linux version.\n\n✨ New Features\n- Linux Support\n- Rule Priority Management (#60)\n  Windows users can now reorder proxy rules via drag-and-drop to set rule priority.\n- Multiple Rule Deletion (#60)\n  Windows now supports deleting multiple proxy rules at once.\n- Localhost Proxy Support (#70)\n  Windows now allows proxying localhost traffic using a new localhost proxy flag and configuration.\n- Platform-Specific Update Checker\n  The update checker now validates updates specific to the running platform.\n- Process Name Support on macOS (#68)\n  macOS now logs and applies proxy rules using the process name alongside the bundle identifier.\n- macOS Optimizations\n  - Reduced memory usage\n  - Fixed network speed degradation\n  - Improved packet handling up to 2.5 Gbps\n\n🛠 Bug Fixes\n- IPv6 Packet Handling Fix (#62)\n  Fixed an issue where IPv6 packets were dropped on Windows.\n  IPv6 proxying is still not supported, but IPv6 packets now pass through directly without being dropped.\n- GUI Cleanup (#71)\n  Removed unwanted example entries from the interface.\n- macOS Rule Evaluation Fix (#68)\n  Fixed an issue where macOS evaluated only the first rule and ignored subsequent rules.\n- IP Range Support Fix (#75)\n  Windows and macOS now fully support IP ranges in proxy rules.\n\nThank you for using ProxyBridge ❤️","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2.0","version":0,"site":"https://interceptsuite.com/","source":"InterceptSuite","license_or_tos":"MIT","resources":null,"verified":false}