{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.9.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.9.1/Hackolade-win64-setup-signed.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- ERD: improved container resize when it contains derived annotations\n- Excel: added attributes and FK relationships creation based on name references when no GUID is present\n- Mermaid: updated library to latest version 11.12.2\n- PowerDesigner: added support for reverse-engineering of sub-packages\n- PowerDesigner: added validation of PD extended attributes against Studio custom properties configuration\n- PowerDesigner: added warning for unsupported ExtendedComposition tags\n- Print Diagram: ensured display of attributes for derived entities\n- Collibra: improved relation type recognition during forward-engineering\n- Cosmos DB with SQL API: suppressed partitionKey declaration if not specified in model\n- Cosmos DB with SQL API, Cosmos DB with Gremlin API: added explicit option /* for included paths in index settings\n- Db2: added support for table changes, inclusive columns, in ALTER script of delta model\n- Db2: added support for view changes in ALTER script of delta model\n- Db2: added support for indexes change in ALTER script of delta model\n- Db2: added script with comments on Activated/Inactivated entities (table, view, column) successfully applies to DB2 instance\n- Oracle: added support for SUBPARTITION in Properties Pane, forward- and reverse-engineering","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.9.1","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}