{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.9.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.9.2/Hackolade-win64-setup-signed.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- Compare and Merge: added support for conceptual and logical Polyglot relationships\n- Graph targets and Polyglot Graph Diagram: introduced resizing controls for edge properties box\n- PowerDesigner: added support for external shortcuts with entity placeholders to be converted into Hackolade Studio external references\n- Collibra: improved assignments publishing robustness when configuration cannot be found\n- BigQuery, PostgreSQL, SQL Server/AzureSQL: updated qs and lodash libraries\n- BigQuery: added support for table and columns rename, column default, primary key and foreign key relationship constraints, add/delete of schema/table/column/view in ALTER script of delta models\n- PostgreSQL: added support for functional indexes with expressions in Properties Pane, forward- and reverse-engineering\n- Redshift: added new AWS regions\n- Redshift: updated aws-sdk and lodash libraries\n- SQL Server/AzureSQL: added support for multiline descriptions in forward-engineering with escaping of new lines\n- SQL Server/AzureSQL: added resolution of model definition references in DDL forward-engineering through hydration of objects\n- Avro, Cassandra, CockroachDB, CosmosDB w/ Gremlin API, CosmosDB w/ Mongo API, CosmosDB w/ SQL API, Db2, GraphQL, Hive, JanusGraph, MariaDB, Neo4j, Oracle, ScyllaDB, Snowflake, Synapse, Teradata, Tinkerpop, YugabyteDB: updated lodash library\n- Cassandra: updated lodash and xml-parser libraries\n- Couchbase v7+, Elasticsearch, Elasticsearch v7+, Firebase, Firestore, HBase, OpenAPI, Parquet, Swagger: js-yaml and lodash libraries\n- DocumentDB, Glue Data Catalog, Neptune: updated aws-sdk and lodash libraries\n- EventBridge: updated aws-sdk, js-yaml, and lodash libraries\n- MarkLogic: updated js-yaml, lodash, and qs libraries\n- MySQL: updated myslq-sdk and lodash libraries\n- Protobuf: updated esbuild, js-yaml, and lodash libraries","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.9.2","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}