{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.9.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.9.0/Hackolade-win64-setup-signed.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- Polyglot: introduced flexible modeling for relationships, allowing gradual refinement from conceptual to logical phases.  More info at https://hackolade.com/help/ConceptualtoLogicalwithPolyglotr.html\n- Relationships: changed Foreign Master relationship lines from dashed to dotted, so as to leave dashed lines for non-identifying relationships\n- Documentation generation: refactored to dynamically reflect the configuration in the Properties Pane\n- Excel: enabled reverse-engineering in unsaved models when the Excel file does not contain references to other models\n- Collibra: stopped running parallel GET requests to the Collibra API to ease load on customer server\n- Collibra: added retry logic if the fetch request runs into error net::ERR_INCOMPLETE_CHUNKED_ENCODING\n- Avro: ensured appropriate name validation after derivation from Polyglot\n- BigQuery: added support for choice of file granularity when generating DDLs: per model, per schema, or per table\n- BigQuery: added support for defining Unique and Alternate Keys (Natural Keys) as modeling metadata documentation\n- Cosmos DB: improved reverse-engineering to ensure correct conversion of unsupported types within union definitions\n- CosmosDB with SQL API: removed extraneous Binary data type to ensure compliance with native JSON data types\n- CosmosDB with Gremlin API, JanusGraph, Neo4j, Neptune, Tinkerpop: updated for compatibility with new Polyglot references when derive from and convert to Polyglot\n- Snowflake: updated SDK and lodash libraries, plus replaced Axios with proxy fetch library, plus reordered log file\n- Synapse: added resolution of model definition references in DDL forward-engineering through hydration of objects","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.9.0","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}