{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.8.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.8.4/Hackolade-win64-setup-signed.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- ERDVs: ensured that symbols (annotations and rectangles) are preserved during reverse-engineering from Excel\n- Command-Line Interface: added support for converting models to Polyglot data models via polyglotConvert command and related arguments\n- Compare and merge: improved rendering and merging of supertype groups\n- Custom Properties: resolved false alert regarding undeclared custom property \"multipleParentType\" for array items\n- General: improved handling of default path location in file picker to select a file other than a data model (open and save)\n- Impact Analysis: enhanced rendering of entities in tree view when changed to a subtype\n- Impact Analysis: changed default checkbox state behavior when an entity is changed to a subtype\n- Object Browser: added a delete option in the contextual menu for relationships\n- Polyglot: enhanced handling of supertype groups during updates of Polyglot definitions\n- Polyglot: resolved error when updating Polyglot definitions after changing an entity to a subtype while also modifying existing attributes to references\n- Suggest Denormalization: enhanced flexibility in embedding options by leveraging relationship cardinalities to determine whether to use arrays or sub-documents\n- Collibra: introduced configurable attribute-level lineage mapping, allowing to choose between direct simple relation and the (default) complex mapping specifications\n- Cosmos DB with SQL API, Cosmos DB with MongoDB API: added support for multiple types with complex types to eliminate need for oneOf constructs, plus updated libraries and dependencies\n- Db2: introduced flexibility in script generation for controlling constraints in CREATE scripts (3 choices: \"In CREATE statement\", \"In separate statement\" or \"Ignore\"), controllable from Tools > Options > Forward-Engineering parameters, plus from forward-engineering lower tab and via Tools > Forward-Engineer menu, plus plus updated libraries and dependencies","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.8.4","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}