{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.9.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.9.3/Hackolade-win64-setup-signed.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- Polyglot: added derivation of conceptual relationships carrying attributes in associative entities\n- Relationships: apply default technical names logic for relationships during drag-and-drop creation based on parent/child entity/attribute technical names\n- Docker: created bypass of HTTP requests when license validated offline\n- PowerDesigner: enhanced reverse-engineering of relationships to import verb and constraint type into Polyglot\n- PowerDesigner: enriched data type mapping for variations of timestamp and varchar to improve compatibility\n- Collibra: added support for publishing configurations to an empty Collibra instance\n- BigQuery: enabled flexibility in script generation for controlling constraints in CREATE scripts (3 choices: \"In CREATE statement\", \"In separate statement\" or \"Ignore\"), controllable from Tools > Options > Forward-Engineering parameters, plus from forward-engineering lower tab and via Tools > Forward-Engineer menu\n- BigQuery: added support for table description changes and partition filter changes in ALTER script of delta models\n- CosmosDB w/ Gremlin API, CosmosDB w/ Mongo API, CosmosDB w/ SQL API, Snowflake: updated axios and qs libraries\n- Db2: added support for CACHE and ORDER identity parameters in Properties Pane, forward- and reverse-engineering\n- DeltaLake/Databricks: added support for streaming tables in Properties Pane, forward- and reverse-engineering\n- DeltaLake/Databricks: added runtime 17 (default) and 18\n- Hive: added foreign key generation in the CREATE statement\n- MarkLogic, SQL Server/AzureSQL: updated qs library\n- Oracle: enabled changes on NOT NULL constraint names for attributes referencing a definition (internal, model or external), allowing for unique constraint name across multiple columns","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.9.3","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}