{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.6.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.6.1/Hackolade-win64-setup-signed.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- Compare & Merge: added support for preservation of layout and colors of graph views, ERD, and ERDVs from right-hand model\n- Compare & Merge: adjusted color coding of deleted attributes\n- ERDV print diagram: adjusted to occupy entire print area\n- Forward-Engineering: added option to skip creation of root folder named after the model, allowing for direct export of files into selected folder\n- Object Browser: enhanced search to include ERDV names\n- Polyglot: added handling of technical names and naming conventions during conversion, preserving coupling in original model\n- PowerDesigner: enhanced reverse-engineering of views generated from Erwin models\n- PowerDesigner: added handling of enums without labels\n- Command Line Interface: added support for reverse-engineering of PowerDesigner .pdm physical model files\n- Undo/Redo: fixed issue where model objects could be created with duplicate IDs after exceeding action stack limit\n- Collibra: add new checks for relation types used in assignments\n- MongoDB: restored optional relationship inference during reverse-engineering\n- PostgreSQL: adjusted timestamp data type mapping when deriving from Polyglot and converting to Polyglot","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.6.1","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}