{"appId":"w:IntegrIT.Hackolade","appShortcutName":"Hackolade","appDisplayName":"Hackolade","authorId":"w:winget","releaseTagName":"winget-8.6.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3-eu-west-1.amazonaws.com/hackolade/previous/v8.6.0/Hackolade-win64-setup-signed.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Polyglot Data Modeling for SQL and NoSQL databases, APIs, and storage formats\n\nHackolade Studio is an intuitive yet powerful application to perform the visually data modeling and schema design of many SQL and NoSQL databases, APIS, and storage formats.\nHackolade Studio combines the graphical representation of collections in an Entity Relationship Diagram, with the graphical representation of the JSON Schema definition of each collection in a hierarchical schema view. Together, these graphical representations provide the schema model for data-at-rest and data-in-motion, plus the documentation of that model. The application is specifically designed around the powerful nature of JSON nested sub-objects and denormalization.\nThe software facilitates the work of, and the dialog between analysts, architects, designers, developers, testers, DBAs, and operators of systems that are based on such technologies. It also can generate schema scripts and documentation in a variety of machine-readable formats (DDLs, JSON Schema, Avro, Parquet, Protobuf, ...) as well as database instances, or human-readable formats such as HTML, Markdown, and PDF reports.\nInstead of having to find data structures tacitly described in the application code, the creation of a database model helps to evaluate design options beforehand, think through the implications of different alternatives, and recognize potential hurdles before committing sizable amounts of development effort. A database model helps plan ahead, in order to minimize later rework. In the end, the modeling process accelerates development, increases quality of the application, and reduces execution risks.\n- Polyglot: added support for technical names and naming conventions, including handling during derive operations depending on the naming conventions in target\n- Polyglot: ensured that technical names in target are preserved when updating Polyglot references while naming conventions are inactive\n- Polyglot: ensured all technical names are preserved during convert and merge, plus added validation of the target model and improved overall convert performance\n- Command Line Interface: added argument applyTargetNamingConventions for polyglotDerive command to control whether to apply the target model’s naming conventions when deriving names\n- ERDV: improved performance for basic operations, including faster entity expand, resize, move, and undo actions, along with a delay for relationship line tooltips to reduce blinking during quick mouse movements\n- Naming Conventions: unchecked \"remove vowels\" option by default for all targets in Desktop and Browser\n- PowerDesigner: improved reverse-engineering of views in existing models for PDM files generated from Erwin\n- PowerDesigner: improved data type mapping to Delta Lake/Databricks and JSON targets, with enhanced warnings and email notifications for unmapped data type\n- Oracle, SQL Server: prevented changes in target model after conversion when dependent on Polyglot\n- Oracle: improved reverse-engineering from instance to identify new Oracle 26ai version\n- Snowflake: enhanced script generation options for alter script of delta models\n- Synapse: removed extraneous -- used for commenting","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.6.0","version":0,"site":"https://hackolade.com/","source":"Hackolade","license_or_tos":"Proprietary","resources":null,"verified":false}