{"appId":"w:Intralinks.IntralinksDesigner","appShortcutName":"Intralinks Designer","appDisplayName":"Intralinks Designer","authorId":"w:winget","releaseTagName":"winget-5.23.2.2917","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://services.intralinks.com/ILClient/autoupdate/ILD-5.23.2.2917-EN.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Intralinks Designer gives you control of your virtual data room setup — upload, organize, and manage information so you can get the deal going.\n\nIntralinks Designer provides an easy way to organize and manage the content and users of your VDRs. This Windows-based application acts as a staging area for creating and setting up new Intralinks VDRs and modifying existing VDRs.\nUsing Intralinks Designer, you can:\n- Create new VDRs\n- Make changes to VDR settings\n- Add new content from your local drives\n- View and update existing VDR content\n- Reorder VDR content items\n- Delete content from the Intralinks VDR\n- Set users’ permissions to use documents\n- Add, remove and synchronize user information with other databases\n- Configure and manage custom fields for documents, as well as apply these fields to new and existing documents\nWhen you have finished staging the VDR and updating user information, you can upload the new or modified information to the Intralinks primary service.\nUsing Intralinks Designer, you can index and freeze VDR s. You can use the indexing feature to clearly order your content and as a way to easily reference to specific content. For example, you can distinguish among exact copies of the same document in multiple locations on your VDR by its unique index number. Freezing a VDR in Intralinks Designer enables you to retain the order of existing VDR content.\nIntralinks Designer can be used by VDR managers (those with the Manager Plus, Hidden Manager Plus and Manager roles) and those with the Publisher Plus role.\n- Microsoft WebView2 and the Aspose Total libraries were updated.\n- Product copyrights were updated to 2026.\n- Resolved issue: Previously, installation files sometimes were not deleted when Intralinks Designer was uninstalled. That problem has been resolved.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.23.2.2917","version":0,"site":null,"source":"Intralinks","license_or_tos":"Proprietary","resources":null,"verified":false}