{"appId":"w:Invantive.InvantiveWebService","appShortcutName":"Invantive Web Service","appDisplayName":"Invantive Web Service","authorId":"w:winget","releaseTagName":"winget-24.0.389","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.invantive.com/current/Invantive%20Web%20Service-current.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A web service for secure and fast access to business data.\n\nBecause of the technological changes and the mobility of employees more and more traditional work spaces are disappearing. Employees work at home more often or make use of travel time work time. Work processes like the making of financial reports or the start-up of a new project take place more and more outside of the office. For companies this means that work processes are assigned differently and should be optimized. To allow for the work processes to run as efficient and effective as possible it is required to have quick and safe access to the company network through the Internet.\nThe Invantive Web Service offers various advantages:\n- The Invantive Web Service makes it easy to quickly and safely exchange data through the internet between various databases and services. For companies this means that the execution of financial calculations and the manufacturing and recording of contracts is available from every location.\n- The Invantive Web Service simplifies the exchange of information between different parties within a project. The Invantive Web Service makes it possible to give partners - through http(s) - authorized access to applications and databases. The advantage of this is that existing applications and applications based on Invantive Producer can easily exchange data. This means that partners can use one application for the planning of projects, execution of complex calculation models and the registration of work hours. Using the Invantive Web Service the data can - depending on the security model - be retrieved and processed in the own administration. This makes it possible to provide multiple clients and/or relations quick and safe access to the company network with the Invantive Web Service.\n- With the Invantive Web Service work processes can be organized even smarter and be optimized. The result is the more effective and efficient work on a project.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"24.0.389","version":0,"site":"https://cloud.invantive.com/","source":"Invantive Software B.V.","license_or_tos":"Proprietary","resources":null,"verified":false}