{"appId":"w:Invantive.InvantiveEstateForWindows","appShortcutName":"Invantive Estate for Windows","appDisplayName":"Invantive Estate for Windows","authorId":"w:winget","releaseTagName":"winget-25.0.127","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.invantive.com/current/Invantive%20Estate%20for%20Windows-current.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A real estate software solution for project management.\n\nThe real estate software Invantive Estate offers an integral project overview to your project managers. Invantive Estate aims to bring together all parties involved for the financial back-up, development, successful hand over and maintenance of real estate projects. The software supports you during the development of real estate projects from small projects to large scale (re) developments and from the early planning phase to aftercare and maintenance.\nTo support all your development needs Invantive Estate supports the integral management of planning, contracts, risks and of course costs. With these features Invantive Estate allows you to easily develop your plan, execute Monte Carlo analyses, monitor the costs and revenues and calculate the end of project forecast. The advantage of this is that you have all the necessary insights to provide financial back-up of and control over your projects. For you this means that with the real estate software solution Invantive Estate you will have a full overview over your projects, resulting in a better grasp of and control over the financial future of your real estate projects.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"25.0.127","version":0,"site":null,"source":"Invantive Software B.V.","license_or_tos":"Proprietary","resources":null,"verified":false}