{"appId":"w:IObit.AdvancedSystemCare","appShortcutName":"Advanced SystemCare","appDisplayName":"Advanced SystemCare","authorId":"w:winget","releaseTagName":"winget-19.0.1.160","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Speed up computer, clean your PC, and protect your private data. AI makes everything easier, and extraordinary.\n\nIObit Advanced SystemCare is a comprehensive PC optimization tool designed to enhance performance and security. Using AI, this software cleans junk files, optimizes system settings, and speeds up your computer. Privacy protection is a priority, with features to clear traces and block suspicious processes. With Internet Booster and real-time tune-up, Advanced SystemCare ensures your PC runs smoothly and efficiently.\nv19.0 (2025-10-14)\n- New Safe Folder - Safeguard your sensitive data against unauthorized accesses and ransomware attacks\n- Redesigned UI - Bring you a more user-friendly experience with better visual effects\n- Improved Junk File Clean - Remove various software (including Microsoft Store apps) junk files to reclaim more hard disk space\n- Expanded Anti-Spyware Database - Remove more spyware for a securer system\n- Enhanced Startup Optimization - Manage more startup items to make your PC boot and run faster\n- Enhanced Software Updater - Support updating more popular software and Microsoft Store apps\n- Enlarged Surfing Protection Database - Bring you safer browsing and block more annoying ads\n- Strengthened Privacy Sweep - Sweep more privacy traces to better protect your privacy\n- Optimized AutoCare - Smarter automatic cleanup for higher PC performance\n- Updated 37 languages","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"19.0.1.160","version":0,"site":"https://www.iobit.com/","source":"IObit","license_or_tos":"Freeware","resources":null,"verified":false}