{"appId":"w:IPU.CoolPack","appShortcutName":"CoolPack","appDisplayName":"CoolPack","authorId":"w:winget","releaseTagName":"winget-1.50","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An old collection of simulation models for refrigeration systems, such as cycle analysis, sizing of main components, energy analysis and optimization.\n\nCoolPack is an old collection of simulation models for refrigeration systems, such as cycle analysis, sizing of main components, energy analysis and optimization.\nThe following simulation purposes are covered:\n- Cycle analysis (process design)\n- System sizing\n- System simulation\n- Component calculations\n- Analysis of operating conditions\n- Transient simulation (cooling of an object/room)\n- Refrigerant calculations (property plots, thermodynamic & transport properties, comparison of refrigerants)\n- Life cycle cost (LCC)\nAs indicated by the name, CoolPack is a collection of simulation programs related to refrigeration. It consists of “Refrigeration Utilities”, “EESCoolTools”, and a transient element called “Dynamic”.\nThe first version of Refrigeration Utilities was released in 1995 and the program has since then been updated continuously with new refrigerants, more property plots etc.\nEESCoolTools has been formally introduced as part of CoolPack (March 1999). The name EESCoolTools is a combination of the three words EES, Cool and Tools:\n- “EES” refers to the name of the program used to develop the simulation models (Engineering Equation Solver – EES).\n- “Cool” refers to that the programs are related to the area of refrigeration.\n- “Tools” refers to that the programs are thought to be tools enabling you to make faster and more detailed system design and energy analysis.\nEES is developed by S. A. Klein and F .L. Alvarado, and is sold by F-Chart Software in Wisconsin, USA. You can get more information about EES and F-Chart Software on the Internet.\nThe dynamic elements are modeled and solved using a DAE-type simulation program called DALI. DALI was developed at the Refrigeration Laboratory (now part of Section of Thermal Energy at the Technical University of Denmark) in 1985. Originally, it was programmed in Pascal but the present release is updated to Delphi. So far we have included one transient element: simulation of the cooling of an object with the possibility of applying an on/off control of the compressor.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.50","version":0,"site":"https://www.ipu.dk/","source":"IPU","license_or_tos":"Freeware","resources":null,"verified":false}