{"appId":"w:IPU.PackCalculationPro","appShortcutName":"Pack Calculation Pro","appDisplayName":"Pack Calculation Pro","authorId":"w:winget","releaseTagName":"winget-5.6.5.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.ipu.dk/wp-content/uploads/2025/08/packcalculationpro-5650.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A simulation tool for calculating and comparing yearly energy consumption of refrigeration and heating systems.\n\nPack Calculation Pro is a tool to guide investment decisions for commercial/industrial refrigeration systems, as well as heat pumps.\nWhether you are retrofitting an existing refrigeration or heating system, or creating a new system from scratch, Pack Calculation Pro can provide a thorough comparison of different solutions.\nYou can compare different system designs, refrigerant choices and control strategies/settings based on yearly energy consumption, cost (Life Cycle Costing), and global warming impact (Total Equivalent Warming Impact) – and of course on ability to deliver the cooling/heating demand every hour of the year.\nWe kick-start your calculations by reducing the amount of data you should provide, among others by using load profiles and weather data to calculate the performance. We select well-proven default values for most coefficients and parameters, while allowing you to customize these defaults, import your own cooling/heating load profile data, to meet your specific needs.\nOur comprehensive database of commercially available compressors, maintained in cooperation with OEMs, makes it possible to compare performance of different products using a single definition for the operating conditions.\n- Ejector cycles:\n  - Dimensioning of vapour ejectors, low-pressure-lift and high-pressure-lift.\n  - Major improvements to all ejector cycle calculations.\n- Rating points UI:\n  - State point diagrams, table and log(p)-h diagrams fully implemented for most cycles. Supporting flooded evaporators.\n  - Log(p)-h diagram shows all available properties at mouse cursor position.\n- Refrigerant data:\n  - R290 (propane) data updated, to allow operating at high condensing temperatures in heat pumps.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.6.5.0","version":0,"site":"https://www.ipu.dk/","source":"IPU","license_or_tos":"Proprietary","resources":null,"verified":false}