{"appId":"w:IPU.CoolTools","appShortcutName":"CoolTools","appDisplayName":"CoolTools","authorId":"w:winget","releaseTagName":"winget-1.1.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.ipu.dk/wp-content/uploads/2019/06/cooltools-v111.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"CoolTools is a collection of simulation models for refrigeration systems and each of them has a specific purpose e.g. cycle analysis, sizing of main components, energy analysis and optimization\n\nCoolTools is a collection of simulation models for refrigeration systems and each of them has a specific purpose e.g. cycle analysis, sizing of main components, energy analysis and optimization. CoolTools is still under development, but it aims to become a replacement for the old CoolPack software supporting new refrigerant and cycle models.\nThe following simulation purposes are covered:\n- Cycle analysis (process design) – comparison of one stage direct expansion cycle and one stage flooded cycle.\n- System sizing – calculation of component sizes from general criteria.\n- System simulation – calculating operating conditions in a system with known components.\n- Component calculations – calculation of components efficiencies and outlet conditions.\n- Evaluation of operation – evaluation of system efficiency.\n- Process investigation – e.g. moist air calculations.\nCoolTools is modern adaptation of CoolPack, a collection of simulation models that was developed in the 90’s the Department of Mechanical Engineering (MEK), Section of Thermal Energy (TES) at the Technical University of Denmark (DTU). More info on CoolPack can be found in IPU’s homepage: https://www.ipu.dk/products/coolpack/.\n- Fixed display of process parameter units (kW), air cooler tool\n  Fixed numerical stability with fully saturated inlet/outlet air, air cooler tool","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.1","version":0,"site":"https://www.ipu.dk/","source":"IPU","license_or_tos":"Freeware","resources":null,"verified":false}