{"appId":"w:IPU.SecCool","appShortcutName":"SecCool","appDisplayName":"SecCool","authorId":"w:winget","releaseTagName":"winget-2.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.ipu.dk/wp-content/uploads/2025/11/seccool-x64-2100-1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A program for calculating, comparing and plotting thermophysical properties of secondary refrigerants.\n\nSecCool is a program for calculating, comparing and plotting thermophysical properties of secondary refrigerants.\nSecCool is a package of programs consisting of three parts:\n- SecCool Properties. Program with user interface, allowing to calculate fluid properties with different concentrations, calculating friction and pressure drops in secondary side piping systems, and comparing different fluids.\n- SecCool Datafit. Program for adding new secondary refrigerants to the package\n- SecCool API. Two Windows 32-bit and 64-bit DLLs which can be used in your own programs, one DLL specifically for EES (Engineering Equation Solver, by F-Chart Software), and one general-purpose DLL.\nThe SecCool package is developed as part of the project DESIK (Energirigtig design og regulering af sekundærsiden på indirekte køleanlæg med naturlige kølemidler) financed by ELFORSK R&D (#334-001). The project period was from 2003-04-01 to 2005-12-31. Maintenance and hosting of the project since then has been done by IPU.\n- Introduced information on HT-1, HT-2, HTX1 and HTX2 certification of specific fluids.\n- Mark one fluid as discontinued.\n- Update CRANE Temper data.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.1.0.0","version":0,"site":"https://www.ipu.dk/","source":"IPU","license_or_tos":"Freeware","resources":null,"verified":false}