{"appId":"w:IrfanSkiljan.IrfanView","appShortcutName":"IrfanView","appDisplayName":"IrfanView","authorId":"w:winget","releaseTagName":"winget-4.73","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.fileforum.com/download/967963863-1/iview473_x64_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Fast and compact image viewer and converter\n\nIrfanView is a fast, compact and innovative FREEWARE (for non-commercial use) graphic viewer for Windows XP, Vista, 7, 8, 10 and 11.\nIt is designed to be simple for beginners and powerful for professionals.\nIrfanView seeks to create unique, new and interesting features, unlike some other graphic viewers, whose whole \"creativity\" is based on feature cloning, stealing of ideas and whole dialogs from ACDSee and/or IrfanView! (for example: XnView has been stealing/cloning features and whole dialogs from IrfanView, for 10+ years).\nIrfanView was the first Windows graphic viewer worldwide with Multiple (animated) GIF support. One of the first graphic viewers worldwide with Multipage TIF support. The first graphic viewer worldwide with Multiple ICO support.\nIrfanView 64-bit for ARM is available: https://www.irfanview.com/arm64.htm\nNew File menu: Open Recent Saved Files\nNew Edit menu: Set selection shape: Round shape (circle/ellipse)\nNew Edit menu: Crop visible image area (if scrollbars visible)\nNew Wallpaper menu: Span (image over all monitors)\nNew option in Edit/Set Alpha Color dialog: Use color tolerance value\nNew selection hotkey: ALT + Left mouse button on sides: Centered resize\nNew option in custom rectangle capture mode: CTRL + click\n(to copy values to Capture dialog option 7, fixed rectangle)\nNew command line options for /jpg_rotate (4 new options, see \"i_options.txt\")\nNew hotkey: CTRL + F4 = remove current file from slideshow list\nNew hotkey: CTRL + SHIFT + O: Copy image/mouse coordinate to clipboard\nImproved Unicode support in JPG Comment dialog (Thanks to Adrie Koolen)\nLoading issue in WSQ PlugIn fixed (thanks to \"Vulnerable Potatoes\")\nSeveral PlugIns are changed/updated, please install the newest versions","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.73","version":0,"site":"https://www.irfanview.com/","source":"Irfan Skiljan","license_or_tos":"Proprietary, free for private and non-commercial use","resources":null,"verified":false}