{"appId":"w:ItchIo.Itch","appShortcutName":"itch","appDisplayName":"itch","authorId":"w:winget","releaseTagName":"winget-26.6.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Install, update and play indie games\n\nThe itch.io app, itch, lets you effortlessly download and run games and software from itch.io. All of your downloads are kept in a single place and are automatically updated. Access your collections and purchases, or browse for new games via the in-app browser.\nThis is the first stable release since v26.1.9 and includes all changes from v26.2.1-canary, v26.3.0-canary, v26.4.0-canary, and v26.5.0-canary releases.\nHighlights\nNative Apple Silicon support — The app now runs natively on arm64 macOS (Apple Silicon). The auto-updater will automatically pull the correct version for your system. All supplemental binaries (butler, itch-setup) will also be replaced with their arm64 equivalents. The app should start faster, run faster, and have less impact on your battery since it no longer needs to run through Rosetta emulation.\nNew OAuth login — The default login method is now an OAuth flow that opens your browser to complete authentication. This replaces the in-app username & password login as the default. Password login remains available as a fallback. We're making this change because password-based API login endpoints are frequent targets for credential stuffing attacks, and our previous captcha solution didn't work reliably in Electron.\nBuild System & Infrastructure\n- Fully migrated CI/CD from GitLab CI to GitHub Actions — all builds are now built, signed, notarized, and deployed through GitHub Actions\n- macOS builds are signed and notarized; Windows builds are code-signed via Azure Code Signing\n- Migrated from Webpack to esbuild for faster builds and smaller bundles\n- 32-bit binaries are fully retired\nElectron & React\n- Upgraded to Electron 25 (from Electron 22) (Note: We are prioritizing Electron updates going forward but we are doing checkpoint releases before the huge app refactor that will have to take place)\n- Updated @itchio/butlerd — fixes the Cannot read properties of undefined (reading 'pid') bug\n- Initial pass at modernizing frontend React components\nAccessibility\n- Clickable elements now use semantic HTML (<button>, <a>) for keyboard navigation and screen reader support\n- Modal dialogs use the native <dialog> element with proper focus trapping (#3292)\n- Icons have role=\"img\" and aria-label attributes for screen readers\n- Remembered profiles use flexbox layout for correct tab order\nUI Improvements\n- Broth component in preferences is now expandable, showing executable path, version, directory, and source channel\n- Playtime duration tooltips now show precise hours/minutes/seconds on hover\nBug Fixes\n- Fix errors related to /register, /random, and other system pages (#3009)\n- Fix context menus when clicking games (#2890)\n- Fix clipboard operations in the URL bar and login form\n- Fix error on SendFeedback page (#2951)\n- Fix duplicated slash in path to user profile\n- Fix protocol check for URL handling (#3236)\n- Allow refreshing the app's UI again instead of opening in system browser\n- Fix missing uninstall dialog title\n- Set user agent fallback to avoid Cloudflare issues (#3369)\nOther\n- Updated localization strings (Farsi, Chinese Simplified, Indonesian, Italian, and others)\nThank you to @botamochi0x12 and @jls47 for their contributions!\nFull Changelog: https://github.com/itchio/itch/compare/v26.1.9...v26.6.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"26.6.0","version":0,"site":"https://itch.io/","source":"itch corp.","license_or_tos":"MIT","resources":null,"verified":false}