{"appId":"w:JangaFX.GameTextureViewer","appShortcutName":"GameTextureViewer","appDisplayName":"GameTextureViewer","authorId":"w:winget","releaseTagName":"winget-2.0.1.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://jangafx-software-files.s3.amazonaws.com/gtv/installers/gtv_setup_2_0_1_5.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Game Texture Viewer (GTV) is a fast, reliable, and simple tool for artists to preview textures and sprite sheetanimations on the fly.\n\nGame Texture Viewer (GTV) is a fast, reliable, and simple tool for artists to preview textures and sprite sheetanimations on the fly.\n\nWith GTV, you can visualize large collections of textures and sprite sheets instantly without having to write any shaders or opening editing software. Easily preview channels, contrast, gamma, brightness, alpha blending, and more!\n\nOn a large scale production, artists often end up with a database of thousands of textures and atlases with no quick way of sifting through and comparing them without inserting them into an engine shader or finding the source program file. GTV solves this issue by providing a one click automatic division based on the name file.Moreover GTV can support large flipbooks, capable of playing them seamlessly.\n\n* GTV automatically splits sprite sheets with names containing ex: 8x2, 3x5, 8x8 in the file name.\n* Need to compare 2 images? No problem! Just right click on any image and select \"Open in new GTV\".\n* Open the file info window to get a full list of metadata contained in the image.\n* Click the toggle animation button at the top to toggle between the original sprite sheet and the animation.\n* Supports TIF, TGA, JPG, PNG, BMP, PSD and EXR Formats \n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0.1.5","version":0,"site":"https://jangafx.com/","source":"JangaFX LLC","license_or_tos":"Freeware","resources":null,"verified":false}