{"appId":"w:JFrog.Conan","appShortcutName":"Conan Package Manager","appDisplayName":"Conan Package Manager","authorId":"w:winget","releaseTagName":"winget-2.25.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/conan-io/conan/releases/download/2.25.0/conan-2.25.0-windows-x86_64-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An open source, decentralized package manager, to automate building and sharing of packages.\n\n\n- Feature: Make the download of package binaries more atomic to make cancellations more robust. (#19510)\n- Feature: Add public docs for InstallAPI subapi. (#19497)\n- Feature: conan new with no positional arguments creates a default CMake basic conanfile. (#19496). Docs: 📃\n- Feature: Further optimize the number of DB calls for upload, download, and package builds. (#19485)\n- Feature: Add public documentation for CacheAPI and ConfigAPI subapis. (#19479)\n- Feature: Deprecate MesonToolchain.preprocessor_definitions in favor of extra_defines. (#19468)\n- Feature: Add conan require command to add/remove requirements to/from your local conanfile. (#19457). Docs: 📃\n- Feature: Support for CPS CMake round trip with components with requires. (#19446)\n- Feature: Add a way to specify link features ($<LINK_LIBRARY:...>) in CMakeConfigDeps. (#19444). Docs: 📃\n- Feature: Update settings with new versions of supported tools. (#19442)\n- Feature: CPS CMake-Conan round trip support for components. (#19428)\n- Feature: Move CMakeConfigDeps from incubating to experimental. (#19421). Docs: 📃\n- Feature: Support CPS shared libs from CMake. (#19417)\n- Feature: Support full CPS CMake round trip in CMakeConfigDeps. (#19410)\n- Feature: Optimize package cache DB access, reducing connections and queries by half for the dependency graph construction. (#19398)\n- Feature: Add root_profile_name to the profile jinja2 context to allow tracing back the root profile from included profiles. (#19393). Docs: 📃\n- Feature: Optimize package cache DB access by doing batch updates of the LRU recipes and packages. (#19392)\n- Feature: Define the Python version used by PipEnv using UV (#19388). Docs: 📃\n- Feature: (Experimental) Support built-in xz and zstd compression for Conan artifacts. (#19337). Docs: 📃\n- Fix: Check Python version in PyEnv init. (#19520)\n- Fix: Populate <library>_DEFINITIONS legacy variables in CMakeConfigDeps for compatibility with old check_symbol_exists and similar (#19519)\n- Fix: Use dnf as the default system package manager for Almalinux, Rocky and Oracle Linux instead of legacy yum. (#19487)\n- Fix: Display packages even when a system package manager install is a no-op. (#19483)\n- Fix: Remove --lockfile-out generation arguments in workspace commands that cannot generate a lockfile (orchestrated conan workspace install/build/complete). (#19475)\n- Fix: Reduce the sqlite DB connection scope to try to optimize DB locking. Remove the yield DB return that could create operational issues. (#19394)\n- Bugfix: Avoid potential None and PackageType comparison when deducing cpp_info. (#19494)\n- Bugfix: Solve PipEnv failure when using version ranges. (#19478)\n- Bugfix: Correct pattern comparison for symlink with files.copy function. (#19437)\n- Bugfix: Solve issue in CMakeConfigDeps when building transitive libraries in the \"build\" context. (#19429)\n- Bugfix: Allow updating to newer remote revisions that already exist in the Conan cache with an older timestamp. (#19402)\n- Bugfix: Fix unintended packages showing up when using conan list ... --graph-context={build-only,host-only} when there are package binary mismatches (#19368)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.25.0","version":0,"site":"https://conan.io/","source":"JFrog","license_or_tos":"MIT","resources":null,"verified":false}