{"appId":"w:JoeTaylor.WSJT_X","appShortcutName":"WSJT-X: Digital Modes for Weak Signal Communications in Amateur Radio","appDisplayName":"WSJT-X: Digital Modes for Weak Signal Communications in Amateur Radio","authorId":"w:winget","releaseTagName":"winget-2.7.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://sourceforge.net/projects/wsjt/files/wsjtx-2.7.0/wsjtx-2.7.0-win64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Weak signal ham radio communication\n\nWSJT-X is a computer program designed to facilitate basic amateur radio communication using very weak signals. The first four letters in the program name stand for “Weak Signal communication by K1JT,” while the suffix “-X” indicates that WSJT-X started as an extended branch of an earlier program, WSJT, first released in 2001. WSJT-X implements communication protocols or \"modes\" called FST4, FST4W, FT4, FT8, JT4, JT9, JT65, Q65, MSK144, and WSPR, as well as one called Echo for detecting and measuring your own radio signals reflected from the Moon.  These modes were designed for making reliable, confirmed QSOs under extreme weak-signal conditions.\nWSJT-X 2.7.0 is a General Availability (GA) release, the first since\nversion 2.6.1. Major enhancements include a new companion program\nQMAP, new Special Operating Activities \"Q65 Pileup\" and \"SuperFox\", a\nnew \"Message System\" feature, an option to update Hamlib at the click\nof a button, and various other improvements.\n\n- QMAP is of particular interest to those engaged in Earth-Moon-Earth\n  (EME) communication. It provides single-polarization receive-only\n  capabilities for any one of the 60-second submodes of Q65 and the\n  associated 30-second submode with the same tone spacing. It lets\n  you monitor all corresponding traffic in a 90 kHz sub-band while\n  conducting EME QSOs in the usual way with WSJT-X.\n\n- Q65 Pileup mode helps DX operators using Q65 in circumstances with\n  many simultaneous callers and very weak signals, such as those\n  experienced by 6-meter EME DXpeditions.\n\n- SuperFox mode behaves operationally like the old-style Fox and Hounds\n  mode but uses a new constant envelope waveform for Fox’s transmissions.\n  Messages can be transmitted simultaneously to as many as 9 Hounds with\n  no signal-strength penalty, resulting in a system gain of about +10 dB\n  compared to the older Fox-and-Hound operation using 5 slots.\n\n- The new Message System allows structured plain text messages to be\n  sent to your QSO partner to request QSY to another band or mode, or\n  to send any one of a number of canned messages. This feature can be\n  especially useful during contests.\n\n- A button labeled \"Update Hamlib\" lets you download and install the\n  latest version of the rig-control features in Hamlib.\n\n- The cty.dat file can now be updated by clicking a single button.\n\nNumerous other enhancements and bug fixes make operation smoother and\nmore intuitive. Features for main-window switching between modes have\nbeen enhanced so that submode and status of the Sh and Fast checkboxes\nare saved and restored by mode. Note that the \"Update Hamlib\" feature\nis currently available only in Windows.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.7.0","version":0,"site":"https://wsjt.sourceforge.io/","source":"Joe Taylor, K1JT","license_or_tos":"GPL-3.0","resources":null,"verified":false}