{"appId":"w:KDE.Krita","appShortcutName":"Winget Application","appDisplayName":"Krita","authorId":"w:winget","releaseTagName":"winget-5.2.9.100","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.kde.org/stable/krita/5.2.9/krita-x64-5.2.9-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Krita is a professional FREE and open source painting program. It is made by artists that want to see affordable art tools for everyone.\n\nKrita is a FREE and open source painting tool designed for concept artists, illustrators, matte and texture artists, and the VFX industry. Krita has been in development for over 10 years and has had an explosion in growth recently. It offers many common and innovative features to help the amateur and professional alike.\nToday we're releasing Krita 5.2.9! This is a bug fix release, containing all bugfixes of our bug hunt efforts back in November. Major bug-fixes include fixes to clone-layers, fixes to opacity handling, in particular for file formats like Exr, a number of crash fixes and much more!\nSpecial thanks to Doreene Kang, Ralek Kolemios, Pedro Reis, Guillaume Marrec, Aqaao, Grum999, Maciej Jesionowski, Freya Lupen, Dov Grobgeld, Rasyuqa A. H.\n- Add shortcuts to bezier curve and freehand path\n- Fix original offsets not being accounted for when copying from another document (Bug 490998)\n- Fix updates when copy-pasting multiple nodes into a new document\n- Fix infinite loop when trying to update pass-through nodes (Bug 493774, Bug 493830, Bug 493837)\n- Fix Photobash Crash\n- Bug fix: Added A1 and A2 sizes when creating a document\n- Fix a crash when trying to merge down a layer created after a reference image addition\n- Possibly fix saving EXR files with extremely low alpha values\n- Fix infinite loop when a clone layer is connected to a group with clones\n- Dynamic brush tool shouldn't load the saved smoothing configuration (Bug 493249)\n- Fix bogus offset when saving EXR with moved layers\n- Try to keep color space profile when saving EXR of incompatible type\n- Fix crash when re-importing the same resource, but changed (Bug 484796)\n- Fix range of Saturation and Value brush options (Bug 487469)\n- Check pointer before dereferencing. (Bug 479405)\n- Fix loading .kpp files with embedded top-level resources (Bug 487866, Bug 456586, Bug 456197)\n- Fix a crash when trying to clear scratchpad while it is busy (Bug 488800)\n- Fix the current preset thumbnail to be present in the preset save dialog (Bug 488673, Bug 446792)\n- JPEG XL: Fix potential lockup when loading multipage images\n- Set the correct shortcut for zoom in in the action file (Bug 484365)\n- Fixed: some tools is interrupted by recorder. (Bug 488472, Bug 477715, Bug 484783)\n- Make sure that the text tool is not interrupted by the recorder (Bug 495768)\n- Recover \"Clean Up\" button in the Krita's Recordings Manager (Bug 455207)\n- Fix a possible saving lockout due to incorrect ownership of the saving mutex (Bug 496018)\n- Fixes to the unit spinboxes, a new context menu has been added to change the unit.\n- Make vector and raster selections to behave in the same way when creating tiny selections (Bug 445935)\n- Fix unclosed paths when intersecting two rectangular selections (Bug 408369)\n- Fix crash when closing Krita while Calligraphy Tool is active (Bug 496257)\n- Fix following existing shape in the Calligraphy Tool (Bug 433288)\n- Fix \"Copy into new Layer\" action when working with vector layers (Bug 418317)\n- Make sure that eraser button is properly initialized on Krita start (Bug 408440)\n- Fix focus issues in Canvas Size dialog (Bug 474809)\n- Disable snapping to image center by default (Bug 466718)\n- Change case of AppImage packages: .appimage -> .AppImage (Bug 447445)\n- Make sure that point-based snap points have higher priority than line-based ones (Bug 492434)\n- Implement canvas decorations for Snap-to-guides feature -Don't allow lowering/raising a mask into a locked layer\n- Fix display profile conversion flags to be updated on settigns change (Bug 496388)\n- Switch color history in the popup palette to use last-used sorting (Bug 441900)\n- Add Unify Layers Color Space action\n- Fix incorrect action text for \"Paste Shape Style\" (Bug 497035)\n- Fix backward compatibility of Per-Channel filter (Bug 497336)\n- Fix rendering of the warning icon in the composite op selector\n- Simplify path point and control point move strategies.\n- Fix an assert when modifying Mesh Gradient on a shape (Bug 496519)\n- Fix aspect ratio of Resource Manager tooltips\n- Improve rendering of pattern thumbnails\n- Fix artifacts when painting under a gaussian blus layer in WA-mode (Bug 434938)\n- Fix an assert when undoing merging of locked layers (Bug 497389)\n- Remove ignoring of the mouse events in KoPathTool (Bug 411855)\n- Use traceback instead of cgitb (Bug 497859)\n- Fix ambiguous \"break path\" shortcut in Shape Edit Tool (Bug 429503)\n- Add position indepndent property to libraqm\n- Fix python Py_SetPath() deprecation by always using qputenv()\n- JPEG XL export: Fix unable to set EPF value to -1 (encoder chooses)\n- G'Mic has been updated to 3.5.0 stable.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.2.9.100","site":"https://kde.org/","source":"Krita Foundation","license_or_tos":"GPL-3.0","resources":null,"verified":false}