{"appId":"w:KDE.Krita","appShortcutName":"Krita","appDisplayName":"Krita","authorId":"w:winget","releaseTagName":"winget-5.2.14.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.kde.org/stable/krita/5.2.14/krita-x64-5.2.14-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Krita is a professional FREE and open source painting program. It is made by artists that want to see affordable art tools for everyone.\n\nKrita is a FREE and open source painting tool designed for concept artists, illustrators, matte and texture artists, and the VFX industry. Krita has been in development for over 10 years and has had an explosion in growth recently. It offers many common and innovative features to help the amateur and professional alike.\nToday we're releasing Krita 5.2.14. This is going to be the last bug fix release for 5.2. This release in particular contains many bug and usability fixes for Android.\nTouch-and-Hold Color Picker\nThe color picker has been improved to make it look, feel and function better. The most important change is for touchscreens: you can now press the screen with one finger and hold it in the same spot to bring up the color picker. This is enabled by default in all input profiles. If it doesn't happen for you, either reset your canvas input settings to the defaults or manually assign the One Finger Hold gesture like this:\n\nNew Color Picker Preview\nAside from that, the preview has also been changed from the rectangles side by side to a circle around the cursor. This gives better visibility to the colors you are picking and also means that your right hand won't obscure the preview if you're drawing on a screen tablet. If you don't like the way this looks, you can change the appearance of the circle in the settings or go back to a two-rectangles style preview instead. Except now you can choose whether you want them on the right like before, on the left or on top of the cursor. Additionally, the long-standing issue of the preview getting rotated and mirrored along with the canvas has been fixed. It will now show up in the same spot no matter how you spin it.\n\nChangelog:\nBeyond that, we have a ton of smaller usability fixes for touch, a new icon on MacOS and much more.\nSpecial thanks to Freya Lupen, Stuffins, Joshua Goins in addition to the sponsored developers.\n- Fix brush preview outlines being aligned based on incorrect bounding box. (Bug 477164)\n- Don't require restart for touch painting change and Automatically detect touch painting\n- [android] Fix main window not showing document (Bug 488606)\n- Fix off-by-1 in BrushHud Deform Modes combobox (Bug 509741)\n- Double-click slider spin boxes to edit\n- [android] Disable long-press right-click emulation\n- Allow long-pressing to open context menus\n- Various error handling fixes on android so it tries to recover instead of asserting.\n- [android] Make IAP and supporter badge work again\n- Make curve autosmooth work with touch drawing (Bug 510363)\n- Make multi-clicking work with touch painting\n- Disable left-click kinetic scrolling on timeline (CCBug 474975)\n- Enable double and triple click with stylus when using vector tools.\n- Check whether the splash is valid (Bug 491279)\n- [android] Make main window fullscreen by default\n- [android] Don't exit fullscreen when pressing back\n- [android] Remove fullscreen toggle in status bar\n- Fix hidden brush editor titlebar (Windows + Android) (Bug 452804)\n- Add toggle eraser preset touch canvas input\n- Make sliders not show selection handles on Android\n- Properly calculate long-press slop distance\n- Make long-press context menus behave more cleanly\n- Make kinetic scrolling not delay long presses\n- Disable long-press on widgets they interfere with\n- Make popup menus appear at touch position\n- Make edit shapes tool work with touch drawing (Bug 511594)\n- [android] Enter fullscreen early to avoid flicker\n- fix Node::setChildNodes\n- fix histograms when adding a new filter layer\n- Fix various touch shortcuts with wrong actions (Bug 485161)\n- Make sampler preview not rotate/mirror with canvas (Bug 347799)\n- Implement one-finger touch and hold gesture\n- PythonPluginManager: Fix crash on Python 3.14\n- macos: update krita app icon to display in respect to system appearance\n- macos : make thumbnails of kra, krz and ora (Bug 493474)\n- Don't allow dragging layers onto their own canvas (Bug 512771)\n- Allow holding Ctrl to override drag on canvas\n- [android] Write to temporary file when saving (Bug 498257)\n- [android] Make shortcut input work properly\n- Fix crash when using a smudge brush (Bug 512243)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.2.14.0","version":0,"site":"https://kde.org/","source":"Krita Foundation","license_or_tos":"GPL-3.0","resources":null,"verified":false}