{"appId":"w:KeePassXCTeam.KeePassXC","appShortcutName":"KeePassXC","appDisplayName":"KeePassXC","authorId":"w:winget","releaseTagName":"winget-2.7.11","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/keepassxreboot/keepassxc/releases/download/2.7.11/KeePassXC-2.7.11-Win64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"KeePassXC is a cross-platform community-driven port of the Windows application “Keepass Password Safe”.\n\nKeePassXC is a modern, secure, and open-source password manager that stores and manages your most sensitive information. You can run KeePassXC on Windows, macOS, and Linux systems. KeePassXC is for people with extremely high demands of secure personal data management. It saves many different types of information, such as usernames, passwords, URLs, attachments, and notes in an offline, encrypted file that can be stored in any location, including private and public cloud solutions. For easy identification and management, user-defined titles and icons can be specified for entries. In addition, entries are sorted into customizable groups. An integrated search function allows you to use advanced patterns to easily find any entry in your database. A customizable, fast, and easy-to-use password generator utility allows you to create passwords with any combination of characters or easy to remember passphrases.\nChanges\n- Add image, HTML, Markdown preview, and text editing support to inline attachment viewer [#12085, #12244, #12654]\n- Add database merge confirmation dialog [#10173]\n- Add option to auto-generate a password for new entries [#12593]\n- Add support for group sync in KeeShare [#11593]\n- Add placeholder for use in references [#12511]\n- Add “Wait for Enter” search option [#12263]\n- Add keyboard shortcut to “Jump to Group” from search results [#12225]\n- Add predefined search for TOTP entries [#12199]\n- Add confirmation when closing database via ESC key [#11963]\n- Add support for escaping placeholder expressions [#11904]\n- Reduce tab indentation width in notes fields [#11919]\n- Cap default Argon2 parallelism when creating a new database [#11853]\n- Database lock after inactivity now enabled by default and set to 900 seconds [#12689, #12609]\n- Copying TOTP now opens setup dialog if none is configured for entry [#12584]\n- Make double click action configurable [#12322]\n- Remove unused “Last Accessed” from GUI [#12602]\n- Auto-Type: Add more granular confirmation settings [#12370]\n- Auto-Type: Add URL typing preset and add copy options to menu [#12341]\n- Browser: Do not allow sites automatically if entry added from browser extension [#12413]\n- Browser: Add options to restrict exposed groups [#9852, #12119]\n- Bitwarden Import: Add support for timestamps and password history [#12588]\n- macOS: Add Liquid Glass icon [#12642]\n- macOS: Remove theme-based menubar icon toggle [#12685]\n- macOS: Add Window and Help menus [#12357]\n- Windows: Add option to add KeePassXC to PATH during installation [#12171]\nFixes\n- Fix window geometry not being restored properly when KeePassXC starts in tray [#12683]\n- Fix potential database truncation when using direct write save method with YubiKeys [#11841]\n- Fix issue with database backup saving [#11874]\n- Fix UI lockups during startup with multiple tabs [#12053]\n- Fix keyboard shortcuts when menubar is hidden [#12431]\n- Fix clipboard being cleared on exit even if no password was copied [#12603]\n- Fix single-instance detection when username contains invalid filename characters [#12559]\n- Fix “Search Wait for Enter” setting not being save [#12614]\n- Fix hotkey accelerators not being escaped properly on database tabs [#12630]\n- Fix confusing error if user cancels out of key file edit dialog [#12639]\n- Fix issues with saved searches and “Press Enter to Search” option [#12314]\n- Fix URL wildcard matching [#12257]\n- Fix TOTP visibility on unlock and settings change [#12220]\n- Fix KeeShare entries with reference attributes not updating [#11809]\n- Fix sort order not being maintained when toggling filters in database reports [#11849]\n- Fix several UI font and layout issues [#11967, #12102]\n- Prevent mouse wheel scroll on edit username field [#12398]\n- Improve base translation consistency [#12432]\n- Improve inactivity timer [#12246]\n- Documentation improvements [#12373, #12506]\n- Browser: Fix ordering of clientDataJSON in Passkey response object [#12120]\n- Browser: Fix URL matching for additional URLs [#12196]\n- Browser: Fix group settings inheritance [#12368]\n- Browser: Allow read-only native messaging config files [#12236]\n- Browser: Optimise entry iteration in browser access control dialog [#11817]\n- Browser: Fix “Do not ask permission for HTTP Basic Auth” option [#11871]\n- Browser: Fix native messaging path for Tor Browser launcher on Linux [#12005]\n- Auto-Type: Fix empty window behaviour [#12622]\n- Auto-Type: Take delays into account when typing TOTP [#12691]\n- SSH Agent: Fix out-of-memory crash with malformed SSH keys [#12606]\n- CSV Import: Fix modified and creation time import [#12379]\n- CSV Import: Fix duplication of root groups on import [#12240]\n- Proton Pass Import: Fix email addresses not being imported when no username set [#11888]\n- macOS: Fix secure input getting stuck [#11928]\n- Windows: Prevent launch as SYSTEM user from MSI installer [#12705]\n- Windows: Remove broken check for MSVC Redistributable from MSI installer [#11950]\n- Linux: Fix startup delay due to StartupNotify setting in desktop file [#12306]\n- Linux: Fix memory initialisation when --pw-stdin is used with a pipe [#12050]","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.7.11","version":0,"site":"https://keepassxc.org/","source":"KeePassXC Team","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}