{"appId":"w:Keysight.OpenTAP","appShortcutName":"Winget Application","appDisplayName":"OpenTAP","authorId":"w:winget","releaseTagName":"winget-9.28.0+69e2fcdd","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An Open Source project for fast and easy development and execution of automated tests.\n\nOpenTAP is an Open Source project for fast and easy development and execution of automated tests.\nOpenTAP is built with simplicity, scalability and speed in mind, and is based on an extendable architecture that leverages .NET.\nOpenTAP offers a range of sequencing functionality and infrastructure that makes it possible for you to quickly develop plugins tailored for your automation needs – plugins that can be shared with the OpenTAP community through the OpenTAP package repository.\nHighlights\nEULA support in package XML\nYou can now add a End User License Agreement to the package XML. This should point to either a file located in the package or a web page containing the EULA.\nOnce the user tries to use your plugin, they will be prompted with a message to accept the EULA before proceeding.\nBetter handling of overriding a package dependency in package XML\nPreviously additional dependencies would be added when explicitly overriding dependencies in the package XML. Now, it will avoid adding dependencies that not expected to be needed.\nAPI: Allow XmlIgnore on EmbedProperties\nYou can now use XmlIgnoreAttribute on objects marked with the EmbedProperties. This will have the effect that none of the properties added by the embedded object will be serialized.\nAPI: SupportedModelsAttribute\nThis new attribute allows an instrument (usually) to specify which instrument models it supports. This information will be added to the package XML, so that other tools can use the information.\nAt the moment there is no runtime behavioral changes for instruments using it and not.\nPackage XML: Package Validation\nThis feature is mostly useful for system-wide packages, that can be uninstalled through other means than uninstalling the package. For example, the add/remove apps menu in the Windows Control panel.\nIt adds the possibility of adding a health check for a package, so that it is possible to see if a package is correctly installed or not.\nFor example, the PathWave License Manager package XML now comes with the following statement:\n<Validation>\n    <FileExists Path=\"%SystemDrive%\\Program Files\\Common Files\\Keysight\\PathWave License Manager\\bin\\pwlmgr.exe\"/>\n</Validation>\nThis means that if that file does not exist, the package should probably be reinstalled next time you run the installer.\nWhat is Changed?\nNew Features\n- Support for custom EULA in packages #1902\n- Support Nullable<T> in test steps #1852\n- Modify Mixin: Use Display Name instead of type name if no name is specified #1847\n- Improve performance when resolving images from multiple http repositories #1716\n- Allow XmlIgnore on EmbedProperties #1327\n- \"Validation\" package.xml element to validate that a package is correctly installed #1929\nBug Fixes\n- Fix cache inconsistency in MemberValueAnnotation #1947\n- Fix issue causing ParameterMemberData.Remove to not properly remove the parameter #1939\n- Fix issue causing OpenTAP NuGet package to not treat PlatformTarget correctly #1926\n- Fix AbandonedMutex causing OpenTAP to stop functioning #1913\n- Fix null reference exception in `tap sdk gitversion #1895\n- Fix signal handler on mac: Stuck on \"waiting for other package manager operation to complete\" #1834\n- Correctly detect compatiblity errors during package create when a package manually overrides a dependency version #1899\nUsability Improvements\n- Fix casing in Dialog Buttons for Dialog Step #1857\nDocumentation\n- Add license file to OpenTap Templates nuget package #1849\nCleanup\n- Prefer ordinal string comparisons over invariant string comparisons #1819","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"9.28.0+69e2fcdd","site":"https://opentap.io/","source":"Keysight Technologies","license_or_tos":"MPL-2.0","resources":null,"verified":false}