{"appId":"w:KindaBrazy.LynxHub","appShortcutName":"LynxHub","appDisplayName":"LynxHub","authorId":"w:winget","releaseTagName":"winget-3.4.0","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/KindaBrazy/LynxHub/releases/download/V3.4.0/LynxHub-V3.4.0-win_arm64-Setup.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/KindaBrazy/LynxHub/releases/download/V3.4.0/LynxHub-V3.4.0-win_x64-Setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Your All-In-One AI Platform.\n\nLynxHub offers a comprehensive suite of features designed to streamline your AI workflow and enhance your experience. Here's what you can expect:\n- Extensible Architecture\n  - Enhance LynxHub's capabilities with custom extensions.\n- Modular Design\n  - Fully modular architecture allowing third-party developers to create and publish custom modules\n  - Modules can add new AI web interfaces (WebUIs) to the app, fully customizable by the developer\n  - Developers can pre-define custom arguments, extensions, commands, and other configurations as part of the module, creating pre-configured WebUIs for users\n- AI Interface Management\n  - Install, config and update\n  - Switch branches, shallow clone, unshallow, see latest commit details\n  - Manage AI extensions with options for batch updates and auto-update settings\n  - View available extensions and install them directly\n- Arguments Manager\n  - Available arguments list, add, remove, and edit various argument types (dropdowns, checkboxes, text input, folder/file selection - relative, absolute)\n  - Search through arguments\n  - Create and manage argument presets for different setups\n- Custom Run Commands\n  - Set and manage custom terminal commands for executing WebUI\n- Pre-launch Actions\n  - Automatically execute custom terminal commands before launching AI interfaces\n  - Open specific files or folders as part of the pre-launch process\n- Browser and Terminal Integration\n  - Built-in terminal and web browser for seamless integration\n  - Automatic detection and launch of relevant addresses (URLs, files)\n  - Switch easily between terminal and browser modes\n  - Terminal customization settings\n- Markdown Viewer\n  - Built-in Markdown viewer for easy reading of documentation and notes.\n- AI Information Dashboard\n  - View developer information, installation and update status\n  - Access update tags, release notes, and disk usage statistics for each AI interface\n- UI Customization\n  - Customize the layout of cards for a flexible user interface\n  - Dark and light themes available\n  - Pin favorite AI interfaces to the home page for easy access\nLynxHub: 3.4.0, Build: 35, Chromium: 142.0.7444.235\n✨ New Features\n- Terminal\n  - Added search in terminal output.\n  - Added option to save terminal output to a file.\n  - Added cd entries to dropdown lists with history support.\n  - Added quick commands with hotkey support.\n  - Added support for font ligatures.\n  - Added support for progress tracking.\n- Browser\n  - Download Manager\n    - Added download location and behavior settings.\n    - Added option to clear all or individual items from the download list.\n  - Context Menu\n    - Added Copy Image Address for images.\n    - Added Copy Image for images.\n    - Added Cut for selections.\n    - Added Search with Google for selections.\n    - Added Inspect Element.\n  - Added autocomplete suggestions to address bar.\n  - Added link preview on hover.\n  - Added audio management (global and per-tab controls).\n  - Added stop loading page functionality.\n  - Added open DevTools hotkey and functionality.\n  - Added in-page navigation to history.\n- Settings\n  - Added search functionality with highlighting.\n  - Added advanced performance settings.\n- Modules\n  - Added ability to enable/disable module tools.\n  - Added delay configuration to URL Catching module default options.\n- Image Caching\n  - Added image caching system with settings section for overview and cleanup.\n  - Used for: card avatars, card information, plugin icons, profile pictures, browser icons, and terminal search.\n🍎 macOS\n- Added Cmd key support for terminal shortcuts.\n- Improved hotkey handling.\n- Fixed x64 build not running correctly.\n- Fixed top window grey line issue.\n- Fixed app startup reliability when clicking the dock icon.\n- Fixed browser not loading when reopening app from dock after closing window.\n- Fixed npm, Node.js, and other environment paths not being recognized.\n⚡ Improvements\n- Terminal\n  - Improved terminal colors visibility in light mode.\n  - Terminal now reliably falls back to home directory when the target folder is inaccessible.\n- Browser\n  - Middle-click now opens links in background without switching away from current tab.\n  - New tab page now shows titles for favorites and history items.\n  - Prioritized higher quality formats for favicons.\n  - Improved browser tab responsiveness and performance when resizing windows.\n  - Improved browser address bar and card list rendering.\n  - Improved browser cache and cookies clearing.\n  - Service workers are now automatically cleaned up when all browser tabs are closed. #38\n- UI/UX\n  - Improved context menu positioning logic.\n  - Improved modal handling and tab-specific opening behavior.\n  - Improved find menu with keyboard navigation and auto-refocus on input.\n  - Improved new tab page layout, animations, and style.\n  - Improved installation stepper header style and layout.\n  - Improved installation terminal output.\n- Performance\n  - Improved settings and dashboard loading performance with skeleton visuals.\n  - Improved app startup by loading all settings in a single operation.\n- Other\n  - Improved Patreon login validation and alerts.\n  - App now works with limited functionality when Git is not installed.\n🐛 Bug Fixes\n- Memory Leaks\n  - Fixed terminal timer memory leak.\n  - Fixed browser tabs event listeners memory leak.\n  - Fixed Dialog and Toast window event listeners leak.\n  - Fixed modal data not being properly cleaned up when closing.\n  - Fixed menus and clipboard copy button timer cleanup.\n  - Fixed terminal event listeners not being properly disposed. #38\n  - Fixed context menu listener cleanup in terminal.\n  - Fixed Git progress listener cleanup.\n- Terminal\n  - Fixed terminal not clearing correctly on Linux.\n  - Fixed terminal not clearing correctly during installation steps.\n  - Fixed terminal clipboard paste errors when the app window isn't focused.\n  - Fixed terminal URL handler sometimes using outdated settings when opening links.\n  - Fixed terminal processes hanging when stopping (now includes safety timeout).\n- Browser\n  - Fixed browser showing error page when websites fail to load ads.\n  - Fixed download manager not saving files correctly when duplicate filenames exist.\n  - Fixed download pause button not working correctly in some cases.\n  - Fixed address bar paste formatting.\n  - Fixed search in browser context menu not clearing properly when closing.\n  - Fixed many browser tab errors.\n- Git\n  - Fixed Git stderr operation errors.\n  - Fixed canceling Git operations preventing subsequent Git operations from working.\n- Other\n  - Fixed x64/ARM builds not loading correctly, especially on macOS.\n  - Fixed macOS not recognizing some modules or tools correctly.\n  - Fixed window handling and cleanup to prevent errors on close.\n  - Fixed changing app data folder causing app crash.\n  - Fixed warning dialog close button sometimes not responding correctly.\n  - Fixed context menu window sizing validation issues. #36\n  - Fixed clone repository dialog cards not displaying correctly in light mode.\n  - Fixed errors when cloning a repository that already exists.\n  - Fixed plugin loading when the plugins folder doesn't exist yet.\n  - Fixed rare crashes during file reading (now with automatic retry).\n📌 Minor Changes\n- UI/UX\n  - Added card appearance animation to the Tools page.\n  - Added tooltips to terminal top bar items.\n  - Added transition animation for tab icons.\n  - Updated notification styles.\n  - Updated tab loading spinner style.\n  - Updated trash icon in browser empty page to match app design.\n  - Corrected download manager icon rotation.\n  - Adjusted browser error page layout.\n  - Adjusted EmptyPage animation timing for smoother transitions.\n  - Improved plugins changelog styling and transitions.\n  - Improved active section tracking in settings and dashboard navigation.\n  - Close button in close tab confirmation is now focused by default.\n  - Fixed settings layout gaps.\n  - Fixed extra borders in browser zoom window.\n  - Fixed download button not being clickable in some situations.\n  - Fixed find in page window error.\n- Performance\n  - Improved card list rendering performance.\n  - Improved card loading performance.\n  - Minor improvement to hotkeys performance.\n- Error Handling\n  - Improved error handling for Git unavailability.\n  - Improved app updates network error handling.\n  - Improved handling of card folder validation errors.\n  - Improved handling of Markdown view URL fetching errors.\n  - Improved handling of terminal initialization errors.\n  - Migration errors now show a helpful dialog with options to retry, skip, or quit.\n  - Plugins with missing metadata are now gracefully skipped.\n  - Dashboard and notifications now handle missing data gracefully.\n- Security\n  - Enhanced image loading security by blocking potentially dangerous URL schemes.\n- Removed\n  - Removed Discord RPC integration.\n\n⚙️ API and Backend Changes\n- Added SpotlightCard and ToolsCard components.\n- Fixed storage migration write error.\nPlugins\n- Updated plugins to use protocol-based communication instead of HTTP server.\n\n💖 Powered by Community\nLynxHub is an independent project. A massive thank you to the amazing people who help keep the lights on and development active.\nLis Carter Wiktoria Adrian Deck\n⚡ Early Access ⚡ Early Access ⚡ Early Access","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.4.0","version":0,"site":"https://github.com/KindaBrazy","source":"KindaBrazy","license_or_tos":"AGPL-3.0","resources":null,"verified":false}