{"appId":"w:KindaBrazy.LynxHub","appShortcutName":"LynxHub","appDisplayName":"LynxHub","authorId":"w:winget","releaseTagName":"winget-3.2.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/KindaBrazy/LynxHub/releases/download/V3.2.0/LynxHub-V3.2.0-win_x64-Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Your All-In-One AI Platform.\n\nLynxHub offers a comprehensive suite of features designed to streamline your AI workflow and enhance your experience. Here's what you can expect:\n- Extensible Architecture\n  - Enhance LynxHub's capabilities with custom extensions.\n- Modular Design\n  - Fully modular architecture allowing third-party developers to create and publish custom modules\n  - Modules can add new AI web interfaces (WebUIs) to the app, fully customizable by the developer\n  - Developers can pre-define custom arguments, extensions, commands, and other configurations as part of the module, creating pre-configured WebUIs for users\n- AI Interface Management\n  - Install, config and update\n  - Switch branches, shallow clone, unshallow, see latest commit details\n  - Manage AI extensions with options for batch updates and auto-update settings\n  - View available extensions and install them directly\n- Arguments Manager\n  - Available arguments list, add, remove, and edit various argument types (dropdowns, checkboxes, text input, folder/file selection - relative, absolute)\n  - Search through arguments\n  - Create and manage argument presets for different setups\n- Custom Run Commands\n  - Set and manage custom terminal commands for executing WebUI\n- Pre-launch Actions\n  - Automatically execute custom terminal commands before launching AI interfaces\n  - Open specific files or folders as part of the pre-launch process\n- Browser and Terminal Integration\n  - Built-in terminal and web browser for seamless integration\n  - Automatic detection and launch of relevant addresses (URLs, files)\n  - Switch easily between terminal and browser modes\n  - Terminal customization settings\n- Markdown Viewer\n  - Built-in Markdown viewer for easy reading of documentation and notes.\n- AI Information Dashboard\n  - View developer information, installation and update status\n  - Access update tags, release notes, and disk usage statistics for each AI interface\n- UI Customization\n  - Customize the layout of cards for a flexible user interface\n  - Dark and light themes available\n  - Pin favorite AI interfaces to the home page for easy access\n💫 What's New?\n✨ New Features\n- Added Browser download manager.\n- Added screen sharing functionality.\n⚡ Improvements\n- Improve home searching performance.\n- Improve card's loading and usage performance.\n- Improve loading modules performance.\n- Improve ui performances.\n- Caching encryption and decryption of browser urls for better performance.\n- Handle Git ownership warnings and add safe directories handling\n- Added retry mechanisms for extension and modules server port selecting. (When port already in use)\n- Added error handling for the clipboard copy action in the terminal.\n- Show a window error message on calculating folder size issues.\n- Improve reloading modules and extensions and add error handling.\n- Implement smooth and robust context menu animations\n- Added the ability to clear browser history and related data.\n🐛 Bug Fixes\n- Fixed installer terminal will be add commands to terminal pre commands or assignments.\n- Fixed extensions performance issues. (By loading extension initializers just once)\n- Fixed url handing in the browser.\n  - Fixed browser freezing by validating url's. #34\n- Fixed app crash on using Statics before initialization.\n- Fixed the white screen during initialization. #34\n- Fixed the terminal installer font wasn't loaded.\n- Fixed the issue when the app tries to communicate with the closed browser tab. #34\n- Fixed Context Menu wrong sizes by validating window size before resizing.\n- Fixed app crash in some situations by ignoring system files and directories while watching.\n- Fixed some app errors by closing modules and plugins server before app exit.\n- Fixed the issue when Context Menu tries to communicate with the closed main window.\n- Fixed Update All button in modules' page causing app error.\n- Fixed terminal clear button not working correctly on Windows.\n- Fixed changing custom run behavior not working.\n- Fixed extensions items installing or updating buttons states.\n- Removed extension update state after uninstallation.\n📌 Minor Changes\n- Close the next popover in the installer and open the restart terminal popover on error.\n- Adjust padding for switch components in config cards.\n- Update close buttons cursor.\n- Improve card menu styling and structure adjustments.\n- Enhance the preview argument's UI with improved styling.\n- Open Issue's page in error page in user default browser.\n- Update unloaded styles and button in modules and extensions pages.\n  - Adjust unloaded tooltip styles and consolidate button.\n  - Update button and chip styles, add icons for unloaded and update states.\n- Update extensions button and chip color for improved clarity\n\n⚙️ API and Backend Changes\nApp:\n- chore(deps): upgrade to Tailwind CSS v4 and update related configurations. 6cce70f2\n- add support for custom notifications with actions and styling. 38078454\n- chore(tsconfig): update compiler options to support ESNext and synthetic imports. 4d909546\n- separate portable build config and fix auto-update channel settings. 53af7f0b\n- refactor(cards): migrate cards state management from mobx to zustand. 3ff6ca38\n- feat(git-manager): add method to retrieve current commit hash with short/long option. ed282b53\n- chore(build): remove obsolete releases_log.json file. 91fec2c8\nPlugins:\n- increase maxRetries and delay for channel listening retries. 2c4e60f0\n- refactor(vite_config): remove mobx-react-lite from shared dependencies. efd3b6c7\n- refactor(cards): pass useCardStore to ReplaceComponent in LynxCardWrapper.\n- feat(plugins): implement compatibility checks for plugins based on moduleApiVersion and extensionApiVersion. f1233dc0\n- feat(schema): add engine compatibility fields for module and extension schemas. dce0282e\n- fix(build): correct path for electron.vite.config in tsconfig.node.json for extension. 3f1feb1d\nModules:\n- migrate and consolidate type definitions into ModuleTypes for improved maintainability. fe9224d5\nExtensions:\n- update RefElementProps to use function-based ref type. 960b8fb9\n- reorganize and migrate type definitions and imports for better code structure and modularity. e788d2b2","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2.0","version":0,"site":"https://github.com/KindaBrazy","source":"KindaBrazy","license_or_tos":"AGPL-3.0","resources":null,"verified":false}