{"appId":"w:KindaBrazy.LynxHub","appShortcutName":"Winget Application","appDisplayName":"LynxHub","authorId":"w:winget","releaseTagName":"winget-V2.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/KindaBrazy/LynxHub/releases/download/V2.3.1/LynxHub-V2.3.1-win_x64-Setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Your All-In-One AI Platform.\n\nLynxHub offers a comprehensive suite of features designed to streamline your AI workflow and enhance your experience. Here's what you can expect:\n- Extensible Architecture\n  - Enhance LynxHub's capabilities with custom extensions.\n- Modular Design\n  - Fully modular architecture allowing third-party developers to create and publish custom modules\n  - Modules can add new AI web interfaces (WebUIs) to the app, fully customizable by the developer\n  - Developers can pre-define custom arguments, extensions, commands, and other configurations as part of the module, creating pre-configured WebUIs for users\n- AI Interface Management\n  - Install, config and update\n  - Switch branches, shallow clone, unshallow, see latest commit details\n  - Manage AI extensions with options for batch updates and auto-update settings\n  - View available extensions and install them directly\n- Arguments Manager\n  - Available arguments list, add, remove, and edit various argument types (dropdowns, checkboxes, text input, folder/file selection - relative, absolute)\n  - Search through arguments\n  - Create and manage argument presets for different setups\n- Custom Run Commands\n  - Set and manage custom terminal commands for executing WebUI\n- Pre-launch Actions\n  - Automatically execute custom terminal commands before launching AI interfaces\n  - Open specific files or folders as part of the pre-launch process\n- Browser and Terminal Integration\n  - Built-in terminal and web browser for seamless integration\n  - Automatic detection and launch of relevant addresses (URLs, files)\n  - Switch easily between terminal and browser modes\n  - Terminal customization settings\n- Markdown Viewer\n  - Built-in Markdown viewer for easy reading of documentation and notes.\n- AI Information Dashboard\n  - View developer information, installation and update status\n  - Access update tags, release notes, and disk usage statistics for each AI interface\n- UI Customization\n  - Customize the layout of cards for a flexible user interface\n  - Dark and light themes available\n  - Pin favorite AI interfaces to the home page for easy access\nApp Changes:\n⚡ Improvements\n- Repositioned \"Close\" and \"Terminate AI\" confirmation pop-up.\n- Improved module update checking behavior and performance.\n- Added stash and drop functionality to card repository menu.\n- Added animation to command items upon addition.\n- Removed markdown viewer background.\n- Removed modals footer background; close button is now minimal.\n🪲 Bug Fixes\n- Refresh modules list after installing or uninstalling a module.\n- Resolve AI interface extension installation issues\n📌 Minor Changes\n- Added security notice for extensions and modules installation.\n- Extensions Page:\n  - Added skeleton loading, updated panel colors, and changed selected item indicator.\n  - Modified tab appearance and improved empty search result text, and updated styles.\n- Modules Page:\n  - Added changelog viewer, displays unloaded state, updated \"Update All\" button, and improved list item design.\n  - Smaller tabs, button icons, homepage link, and fixed update checking with no modules.\n- Use custom array for app release log.\n- Updated design of update details and notification.\n- Close menu on \"Open Folder\" or \"Open Homepage\".\nAPI and Backend Changes\nExtensions\n- pass \"node-pty\" object to extensions utils API\n\nFull Changes:V2.2.1 to V2.3.1 | Source Point: 91e7a1f","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"V2.3.1","site":"https://github.com/KindaBrazy","source":"KindaBrazy","license_or_tos":"AGPL-3.0","resources":null,"verified":false}