{"appId":"w:Klocman.BulkCrapUninstaller","appShortcutName":"Bulk Crap Uninstaller","appDisplayName":"Bulk Crap Uninstaller","authorId":"w:winget","releaseTagName":"winget-5.9","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Bulk program uninstaller with advanced automation. It excels at removing large amounts of applications with minimal to no user input, while requiring next to no technical knowledge.\n\nBulk Crap Uninstaller (or BCUninstaller) is a free (as in speech) program uninstaller.\nIt excels at removing large amounts of applications with minimal user input.\nIt can clean up leftovers, detect orphaned applications, run uninstallers according to premade lists, and much more!\nEven though BCU was made with IT pros in mind, by default it is so straight-forward that anyone can use it.\n\nBCU is fully compatible with Windows Store Apps, Steam, Windows Features and has special support for many uninstalling systems (NSIS, InnoSetup, Msiexec, and many other).\nWhat's Changed\nPackaging Changes\n- The setup is now significantly smaller and no longer includes the portable version.\n- BCU is now distributed as a framework-dependent application. If .NET 6 is not installed, the installer will automatically download and install it. If you need a stand-alone build like in the previous releases, download the portable version.\nCode Signing\n- BCU executables and installer are no longer signed. While signing helped reduce false antivirus detections, it also caused some issues. For more details, see discussion #737. Code signing may return if a solution is found.\nFixes and improvements\n- Fix bug: Software installed by Chocolatey 2.0.0+ may not be listed due to a removed command parameter by @szw0407 in #711\n- Various fixes to SystemRestore; Should work on all versions of Windows by @Klocman in #759\n- Fix restore point confirmation message never appearing by @Klocman in #760\n- Be more careful around Known Folders (especially Downloads) by @Klocman in #761\n- Fix SubPathIsInsideBasePath returning false for exact match by @Klocman in #764 (This affects junk generation and a few other things. Fixes some random issues and potentially improves junk detection.)\n- Resolve various compiler warnings by @Klocman in #766\nInstaller\n- Installer script improvement by @bovirus in #710\n- Installer: Use AnyCPU build and auto install .NET6 if needed (portable install no longer possible) by @Klocman in #765\n- Clean up installer and fix compile under InnoSetup v6.4 by @Klocman in #762\nLocalizations\n- Add Hindi translation installer by @programmingwithprince in #702\n- pt-BR Translation Update by @diodion in #720\n- Fixed various minor localization issues, including a crash in cn locale\nNew Contributors\n- @diodion made their first contribution in #720\n- @programmingwithprince made their first contribution in #702\nFull Changelog: v5.8.3...v5.9","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.9","version":0,"site":"https://github.com/Klocman/Bulk-Crap-Uninstaller","source":"Marcin Szeniak","license_or_tos":"Apache-2.0","resources":null,"verified":false}