{"appId":"w:LadislavFoldyna.QLog","appShortcutName":"QLog","appDisplayName":"QLog","authorId":"w:winget","releaseTagName":"winget-0.46.2-1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/foldynl/QLog/releases/download/v0.46.2/qlog-installer0.46.2.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Amateur radio logbook software.\n\nQLog is an Amateur Radio logging application for Linux, Windows. It is based on the Qt framework and uses SQLite as database backend.\nQLogs aims to be as simple as possible, but to provide everything the operator expects from the log to be. This log is not currently focused on contests.\n- Fixed Spaces after QRZ.com name (issue #767)\n- Fixed SPID Rot1Prog Rotator more 360 deg (issue #775)\n- Fixed build instructions on Debian (PR #777 @leventelist)\n- Fixed Bandmap truncated output despite having space (issue #779)\n- Fixed Statistics - Anti-meridian bug on map (issue #786)\n- Fixed Binary file in the tarballs (issue #794)\n- Fixed LOTW & eQSL upload status updated even when nothing is uploaded (issue #807)\n- Fixed Imported QSOs contain incorrect My DXCC info (issue #812)\n- Fixed Statistics Dialog does not show confirmed grids\nFull Changelog: https://github.com/foldynl/QLog/compare/v0.46.1...v0.46.2\nNOTE:\n1. QLog incorrectly marked the upload status for QSOs sent to LoTW and eQSL in versions 0.45.0, 0.46.0, and 0.46.1 (from July 11, 2025, to the present). If a filter using a station profile was applied to select QSOs, all QSOs matching the filter were uploaded; however, internally QLog marked as uploaded only those QSOs that matched a filter defined by callsign and gridsquare. This issue affects eQSL and LoTW uploads. Other services were not affected.\n2. There was also an issue in QLog where, when using the combination of Import QSO with the default My Profile disabled, Updated DXCC enabled, and specific imported QSOs (those containing the my_dxcc field), QLog filled the My DXCC information (my_dxcc, my_country, my_itu_zone, my_cq_zone) with data from the contacted station. To check whether you are affected, please display the My_DXCC column and verify that it contains your correct DXCC entity.\nWindows Libraries:\nQt 6.8.2\nhamlib 4.6.5\nTimezone DB: 2025b (https://github.com/evansiroky/timezone-boundary-builder/releases)\nBinaries:\nWindows: below\nFedora 41: below\nFedora 42: below\nUbuntu 22.04, 24.04, 24.10, 25.04, 25.10: via PPA (https://launchpad.net/~foldyna/+archive/ubuntu/qlog)\nFlatpak package is available via Flathub. The package contains built-in Trusted QSL.\nMacOS DMG: https://github.com/aa5sh/QLog/releases","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.46.2-1","version":0,"site":"https://github.com/foldynl","source":"OK1MLG","license_or_tos":"GPL-3.0","resources":null,"verified":false}