{"appId":"w:leezer3.OpenBVE","appShortcutName":"openBVE","appDisplayName":"openBVE","authorId":"w:winget","releaseTagName":"winget-1.11.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/leezer3/OpenBVE/releases/download/1.11.3.1/openBVE-1.11.3.1-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A license-free, open source, free of charge train driving simulator.\n\nOpenBVE is a license-free, open source, free of charge train driving simulator.\nThis program includes detailed per-car simulation of the brake systems, friction, air resistance, toppling and more. In 3D cabs, the driving experience is augmented with forces that shake your simulated body upon acceleration and braking, as well as in curves. Besides that, OpenBVE features a 3D positional sound system best enjoyed with surround speakers, train exteriors and timetables for the current run. Finally, via the main menu, routes and trains be easily selected to start a new session, the controls can be configured to keyboard or joystick devices, and a variety of options can be selected.\nCompared to other simulators of the genre, especially compared to commercial games, OpenBVE has its main focus on realism, not necessarily on user-friendliness. You should be willing to study operational manuals for the routes and trains you want to drive, and will in many cases not get along by just memorizing a few keystrokes. If you can identify with this focus, OpenBVE might be the right simulator for you.\nOther than the significant changes listed below, this build also contains work on the internal traction modelling, and many of the assumptions that it makes.\nSignificant Changes:\n- New: Add ACCESIBILITY_NEXT_LIMIT to available controls. (Set by default to SHIFT + CTRL + L on new installs only)\n- New: Initial basic electric traction modelling available for XML trains.\n- New: Allow the driver body properties to be set via XML. (Controls head bounce)\n- New: Attempt to support WAV files containing multiple DATA / SLNT chunks.\n- Change: Sanders now have a specific emptied state.\n- Change: Show name of the currently open object in the Object Viewer title.\n- Change: Classify TFO not supported in Route Viewer message as info not error. (AmberIsFrozen)\n- Fix: Fog didn't always work as intended with the GL4 renderer.\n- Fix: Keyframe animated objects not hidden properly if used as an exterior object.\n- Fix: Error when attempting to specify name for player path of a switch. (AmberIsFrozen)\n- Fix: Compressed textual S files not working.\n- Fix: Moving a car due to collision with another train didn't move the bogies.\n- Fix: Applying the brakes at very low speed (~0.05km/h) on level track didn't work.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.11.3.1","version":0,"site":"https://openbve-project.net/","source":"The OpenBVE Project","license_or_tos":"BSD-2-Clause","resources":null,"verified":false}