{"appId":"w:leezer3.OpenBVE","appShortcutName":"openBVE","appDisplayName":"openBVE","authorId":"w:winget","releaseTagName":"winget-1.11.2.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/leezer3/OpenBVE/releases/download/1.11.2.6/openBVE-1.11.2.6-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A license-free, open source, free of charge train driving simulator.\n\nOpenBVE is a license-free, open source, free of charge train driving simulator.\nThis program includes detailed per-car simulation of the brake systems, friction, air resistance, toppling and more. In 3D cabs, the driving experience is augmented with forces that shake your simulated body upon acceleration and braking, as well as in curves. Besides that, OpenBVE features a 3D positional sound system best enjoyed with surround speakers, train exteriors and timetables for the current run. Finally, via the main menu, routes and trains be easily selected to start a new session, the controls can be configured to keyboard or joystick devices, and a variety of options can be selected.\nCompared to other simulators of the genre, especially compared to commercial games, OpenBVE has its main focus on realism, not necessarily on user-friendliness. You should be willing to study operational manuals for the routes and trains you want to drive, and will in many cases not get along by just memorizing a few keystrokes. If you can identify with this focus, OpenBVE might be the right simulator for you.\nSignificant Changes:\n- Change: Add warning for probably incorrect rotation direction vector in CSV / B3D objects.\n- Change: Improve the error logged when an incorrect argument separator is used in CSV / B3D objects\n- Change: Improve color handling in X parsers.\n- Change: If a critical error is encountered on OS-X, we attempt to show a system error dialog.\n- Change: Make Zuki capabilities detection less strict in DenshaDeGo! Input. (MarcRiera)\n- Change: Large number of internal improvements and fixes in MSTS Shapes.\n- Change: Improve draw speed when events overlay is active and large numbers of events are present.\n- Experimental Change: The distance to the closest train is now measured using world position, not track position.\n- Fix: Couple of messages not displaying correctly in 1.11.2.5 (AmberIsFrozen)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.11.2.6","version":0,"site":"https://openbve-project.net/","source":"The OpenBVE Project","license_or_tos":"BSD-2-Clause","resources":null,"verified":false}