{"appId":"w:leezer3.OpenBVE","appShortcutName":"openBVE","appDisplayName":"openBVE","authorId":"w:winget","releaseTagName":"winget-1.11.2.7","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/leezer3/OpenBVE/releases/download/1.11.2.7/openBVE-1.11.2.7-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A license-free, open source, free of charge train driving simulator.\n\nOpenBVE is a license-free, open source, free of charge train driving simulator.\nThis program includes detailed per-car simulation of the brake systems, friction, air resistance, toppling and more. In 3D cabs, the driving experience is augmented with forces that shake your simulated body upon acceleration and braking, as well as in curves. Besides that, OpenBVE features a 3D positional sound system best enjoyed with surround speakers, train exteriors and timetables for the current run. Finally, via the main menu, routes and trains be easily selected to start a new session, the controls can be configured to keyboard or joystick devices, and a variety of options can be selected.\nCompared to other simulators of the genre, especially compared to commercial games, OpenBVE has its main focus on realism, not necessarily on user-friendliness. You should be willing to study operational manuals for the routes and trains you want to drive, and will in many cases not get along by just memorizing a few keystrokes. If you can identify with this focus, OpenBVE might be the right simulator for you.\nSignificant Changes:\n- New: Add wheelslip indicator to debug overlay.\n- Change: More internal improvements to MSTS shape parser.\n- Fix: Improve play / resume sound behaviour. This hopefully fixes the case of 'stuck' run sounds experienced by a minority of users.\n- Fix: Viewing distance not working correctly with object based backgrounds.\n- Fix: Issue with an animated object using StateChangeSound and a single buffer.\n- Fix: Brightness function not working when manually added to an animated file.\n- Fix: Route Viewer rail path overlay showing ended tracks. (AmberIsFrozen)\n- Fix: If a train contained a zero-length car, it failed to show in Object Viewer.\n- Fix: Freeze with animated files containing unexpected data in certain sections.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.11.2.7","version":0,"site":"https://openbve-project.net/","source":"The OpenBVE Project","license_or_tos":"BSD-2-Clause","resources":null,"verified":false}