{"appId":"w:leezer3.OpenBVE","appShortcutName":"openBVE","appDisplayName":"openBVE","authorId":"w:winget","releaseTagName":"winget-1.11.2.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/leezer3/OpenBVE/releases/download/1.11.2.4/openBVE-1.11.2.4-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A license-free, open source, free of charge train driving simulator.\n\nOpenBVE is a license-free, open source, free of charge train driving simulator.\nThis program includes detailed per-car simulation of the brake systems, friction, air resistance, toppling and more. In 3D cabs, the driving experience is augmented with forces that shake your simulated body upon acceleration and braking, as well as in curves. Besides that, OpenBVE features a 3D positional sound system best enjoyed with surround speakers, train exteriors and timetables for the current run. Finally, via the main menu, routes and trains be easily selected to start a new session, the controls can be configured to keyboard or joystick devices, and a variety of options can be selected.\nCompared to other simulators of the genre, especially compared to commercial games, OpenBVE has its main focus on realism, not necessarily on user-friendliness. You should be willing to study operational manuals for the routes and trains you want to drive, and will in many cases not get along by just memorizing a few keystrokes. If you can identify with this focus, OpenBVE might be the right simulator for you.\nSignificant Changes:\n- Change: Implement D3DDECL_USAGECOLOR in NewXParser.\n- Change: Apply consist reversal before placing TFO.\n- Change: Allow using MSTS shapes in animated files; contained animations will be set to frame zero.\n- Fix: TrackFollowerFunction with no axles incorrectly flipped (Not fixed right in 1.11.2.3)\n- Fix: Some animated objects containing sounds might not parse correctly.\n- Fix: Some palleted PNG files with an odd width, less than a scanline length failed to load.\n- Fix: VSync option not remembered. (AmberIsFrozen)\n- Hacks: Update brackets in station name fix.\n- Hacks: Fix some buggy objects in Ryoso.\n- Hacks: Fix transparency in Kurumigasaki Railway signs.\n- Compatability: Add a large number of files to the compatability database.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.11.2.4","site":"https://openbve-project.net/","source":"The OpenBVE Project","license_or_tos":"BSD-2-Clause","resources":null,"verified":false}