{"appId":"w:LeNgocKhoa.Laragon","appShortcutName":"Winget Application","appDisplayName":"Laragon","authorId":"w:winget","releaseTagName":"winget-8.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Laragon - fast & powerful local development environment\n\nLaragon is a portable, isolated, fast & powerful universal development environment for PHP, Node.js, Python, Java, Go, Ruby.\nIt is fast, lightweight, easy-to-use and easy-to-extend.\nIt is great for building and managing modern web applications.\nIt is focused on performance - designed around stability, simplicity, flexibility and freedom.\nLaragon is very lightweight and will stay as lean as possible.\nThe core binary itself is less than 2MB and uses less than 4MB RAM when running.\nLaragon - The Dev Environment for Entrepreneurs v8.0 2025\nIf you've donated to Laragon, you're eligible for a discount equal to your donation amount. Simply email us at hi@laragon.org with your donation details, and we'll send you a discount code.\nStarting with this version, Laragon’s binaries and installer are code-signed, ensuring they’re secure and legit. Our goal is to give you a smooth, safe experience. #1038\nRef: How to upgrade to Laragon 8\nWe're excited to announce a new version of Laragon, packed with exciting new features and enhancements designed to improve your development experience!\nlaragon-8-ui\nWhat's new:\n- Significant engine improvements: Laragon now runs fully native on 64-bit, with major engine improvements for faster service start/stop and seamless performance.\n- High DPI Support: Laragon now fully supports High DPI displays, providing a crisp and clear user interface, even on 8K monitors.\n- Modern UI: Laragon 8 features a sleek, modern UI with all enabled services visible by default. Enabling HTTPS is effortless - just a single click in the UI\n  image\n  There is a License Type button on the top right menu, allow you to deactivate your license-key easier.\n  image\n- Mailpit: Laragon auto-configured Mailpit & PHP so you can send mail will PHP mail function and the email will be catched on Mailpit Web UI. Mailpit also include and integrated to the Dashboard & Laragon's Menu. You can click the email button to access Mailpit Web UI.\n  image\n- PHP Auto Update: Laragon automatically detects and adds the newest PHP version to your system. This allows you to try a new PHP version with the latest features, security updates, and bug fixes effortlessly.\n  Auto Update & Auto Backup can be toggled via Preferences:\n  image\n- cacert.pem Auto Update: An outdated cacert.pem may prevent Composer from working correctly, affecting package installations and updates. Laragon ensure cacert.pem is always up-to-date to keep your PHP environment remains compatible with newer CAs, and make your projects running smoothly.\n- Faster Quick-app & Quick-app: Experience significantly improved speed when using Quick-app and Quick-add.\n- [Quick-app]: Laragon now supports Laravel CLI, making it easier to create customizable Laravel starter kits. It automatically installs Laravel CLI, so you can start building without extra setup.\n  You can put this to your Quick-app's Configuration:\nLaravel CLI=laravel new %s\nLaravel Starterkit Vue=https://github.com/laravel/vue-starter-kit/archive/refs/tags/v1.0.2.zip\nLaravel Starterkit React=https://github.com/laravel/react-starter-kit/archive/refs/tags/v1.0.1.zip\n- MySQL improvements: By default, your MySQL password is empty. For security reasons, it's recommended to set a password. With Laragon 8, you can easily do this via: Menu > MySQL > Change root password. In case you forget, [Get root password] will provide you the password from Clipboard.\n  [Auto Backup] will automatically backup your MySQL databases. If you want to backup on-demand, just clik [Backup all databases]. [dir:backup] will open the backup folder.\nimage\n- Bug Fixes and Stability Improvements: Many issues and bugs have been addressed to improve the overall performance and reliability of Laragon.\nWith this release, Laragon remains portable and powerful, now more than ever, it's the ultimate productivity-boosting dev environment for developers. We believe this update makes Laragon faster, more reliable, and a much more comfortable tool to use, especially for developers value time and automations.\nThank you for your continued support and feedback. We're committed to making Laragon the best development tool possible, and there's more to come!\nBest wishes,\nThe Laragon Team\nIf your Quick-add's configuration is outdated, simply rename usr/packages.conf to usr/packages.conf.bak and restart Laragon. It will automatically fetch the latest version from GitHub","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"8.0.0","site":"https://github.com/leokhoa","source":"leokhoa","license_or_tos":"Copyright © 2019 by Le Ngoc Khoa","resources":null,"verified":false}