{"appId":"w:LenovoLegionToolkitTeam.LenovoLegionToolkit","appShortcutName":"Lenovo Legion Toolkit","appDisplayName":"Lenovo Legion Toolkit","authorId":"w:winget","releaseTagName":"winget-2.29.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/LenovoLegionToolkit-Team/LenovoLegionToolkit/releases/download/v2.29.0.0/LenovoLegionToolkitSetup-v2.29.0.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Lightweight replacement of Lenovo Vantage for Lenovo Legion laptops.\n\nLenovo Legion Toolkit (LLT) is a utility created for Lenovo Legion laptops, that allows changing a couple of features that are only available in Lenovo Vantage or Legion Zone.\nRelease Notes\nSettings & Configuration\n- Made FloatingGadget settings independent and further cleaned up the Settings layout.\n- Reordered settings controls and updated the description in the Excluded Processes window.\n- Fixed an issue where restore logic could trigger unexpectedly.\n- Added backup and restore functionality for application settings.\n- Moved the notifications setting to the App Behavior group.\nUI Improvements\n- Set FocusVisualStyle to null across various controls to remove the white focus border.\n- Updated the MainWindow layout for improved visual consistency.\n- Fixed dark theme display issues in the PBO window.\n- Added a new single-button message box.\nStability & Fixes\n- Fixed an issue where memory temperature was read from the incorrect sensor.\n- Resolved errors caused by the Service Disabler.\n- Fixed an issue where the System Fan section could appear unexpectedly.\n- Migrated all DialogWindow calls to MessageBoxHelper for more consistent dialog handling.\nMaintenance\n- Updated package references to the latest versions.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.29.0.0","version":0,"site":"https://github.com/LenovoLegionToolkit-Team","source":"Bartosz Cichecki","license_or_tos":"GPL-3.0","resources":null,"verified":false}