{"appId":"w:LenovoLegionToolkitTeam.LenovoLegionToolkit","appShortcutName":"Lenovo Legion Toolkit","appDisplayName":"Lenovo Legion Toolkit","authorId":"w:winget","releaseTagName":"winget-2.27.2.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/LenovoLegionToolkit-Team/LenovoLegionToolkit/releases/download/v2.27.2.1/LenovoLegionToolkitSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Lightweight replacement of Lenovo Vantage for Lenovo Legion laptops.\n\nLenovo Legion Toolkit (LLT) is a utility created for Lenovo Legion laptops, that allows changing a couple of features that are only available in Lenovo Vantage or Legion Zone.\nWhat's Changed\n- Fix device compatibility, GPU sensor reporting, and related UI behavior by @hoaug-tran in https://github.com/XKaguya/LenovoLegionToolkit/pull/148\n- Add support for Vantage Color Boost in Aurora keyboard backlight settings by @WalterWoshid in https://github.com/XKaguya/LenovoLegionToolkit/pull/157\n- Improved Floating Gadget functionality.\n- Added Argument Window for enhanced user experience.\n- Implemented check before hibernate; to prevent unexpected behavior.\n- Attempted to fix abnormal restart issues for enhanced overclocking stability.\n- Refactored code to improve compatibility and optimize sensor logic.\n- Added support for Legion 5 Pro 16ADR10.\n- Restored display of system fan controls for supported devices that were previously hidden unexpectedly.\n- Merged Game Mode and Custom Engine into a unified listener.\n- Canceled profile application when AC power is not connected to prevent improper configuration.\n- Fixed missing elements in the dashboard page.\n- Reworked Dashboard Customization features for improved usability.\n- Fixed an issue where the FloatingGadget Custom window did not adhere to theme settings.\n- Fixed an issue where CPU Core Frequency was not hidden on hybrid architecture systems.\n- Added CheckInstance validation to the Run Automation Step for improved reliability.\n- Added AMD PBO Overclocking (enable by clicking Device Info → BIOS Version 5 times).\n- Added 24-zone RGB support for 16IAX10 and 16IRX10 models.\n- Added Extreme Mode support for LOQ 15IRH8.\n- Added Dashboard support for ThinkBook and related models.\n- Added SpeakerVolume automation step and FloatingGadget \"Toggle\" action.\n- Enabled second-level interval support for Periodic Actions.\n- Updated StatusWindow style to respect the UseNewDashboard toggle.\n- Dynamically hide OverDrive and System Fan controls for unsupported devices.\n- Shortened internal queue interval for improved responsiveness.\n- Fixed fan curve adjustment issue for Legion 9 IAX10H (NX).\n- Fixed hibernation wake-up crash on ThinkBook devices.\n- Fixed DpiScaleFeature availability issue.\n- Fixed an issue where laptop wake up from hibernate will restore to Quiet mode.\n- LLT will now auto switch language when first launch.\nNew Contributors\n- @hoaug-tran made their first contribution in https://github.com/XKaguya/LenovoLegionToolkit/pull/148\n- @WalterWoshid made their first contribution in https://github.com/XKaguya/LenovoLegionToolkit/pull/157\nFull Changelog: https://github.com/XKaguya/LenovoLegionToolkit/compare/v2.27.2.0...v2.27.2.1","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.27.2.1","version":0,"site":"https://github.com/LenovoLegionToolkit-Team","source":"Bartosz Cichecki","license_or_tos":"GPL-3.0","resources":null,"verified":false}