{"appId":"w:LibrePCB.LibrePCB","appShortcutName":"LibrePCB","appDisplayName":"LibrePCB","authorId":"w:winget","releaseTagName":"winget-2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.librepcb.org/releases/2.0.0-rc1/librepcb-installer-2.0.0-rc1-windows-x86_64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Create electronics the easy way.\n\nLibrePCB is a free, cross-platform, easy-to-use electronic design automation suite to draw schematics and design printed circuit boards – for makers, students and professionals, from beginners to experts.\nThis software just lets you develop electronics the right way. No costs. No restrictions. No online account. No unnecessary complexity.\nI’m very excited to announce that LibrePCB 2.0 is feature-complete and that a first release candidate is available for download!\n\nAbout This Release Candidate\nLibrePCB 2.0 contains a huge amount of changes compared to the previous release. Even though we give our best to keep the quality high and do lots of testing, such large changes always come with the risk of bugs. Thus, we first provide a release candidate prior to the official stable release.\nNote that while we do not expect that any serious problems occur with your projects when using this release candidate, it’s still a good idea to create a backup first (e.g. by using a version control system).\nIf you experience any issues with this release candidate, please let us know (e.g. a quick notification in our Matrix chat) so we can fix them in the final release! A list of known limitations / issues is available here.\n\nWhen you open a LibrePCB 1.x workspace the first time with LibrePCB 2.x, all libraries will be migrated to the new file format in the background library scan. Therefore it is expected that the first scan takes much more time than usual.\n\nMajor Changes\nThe most exciting change of LibrePCB 2.0 is of course the completely new, tabbed, split-view, single-window user interface (#1494) as introduced in this blog post:\n\nBut of course this release comes with many more new features and improvements. A full changelog and some impressions will be provided in the final release announcement, so here’s just a short list of the most interesting new features (check out the links to the pull requests for more details):\n- Add support for schematic buses (#1646)\n- Support adding images to symbols & schematics (#1578)\n- Support adding individual pads directly to boards (#1596)\n- Support automatic via drill & annular rings from design rules (#1606, #1611)\n- Support sharing DRC settings & output jobs through libraries (#1631)\n- Signed Windows releases & compatibility with macOS 10.14 (#1604, #1557)\n- And many more!\n\nNext Steps\nWe expect the final release to be available soon, probably around the end of January. Meanwhile, we will work on migrating our official libraries to the new file format, extending our fabrication service to support LibrePCB 2.x projects, and updating the documentation accordingly.\n\nCredits\n\nThis release was part of the NGI0 Commons grant we receive from NLnet, which was a huge help for us to get this work done. We are very thankful for their support.\nStarting with this release, our executables for Windows are signed by OSSign, thanks a lot for their sponsored code-signing.\nAlso a big thank you to our sponsors and to the community helping us with translations, pull requests, donations and other contributions! 🎉\n\nDownload\nSince this is not a stable release yet, use the download links from the sidebar on our download page.\nIf you like LibrePCB, please consider making a small donation to support the ongoing development.\nThank you!","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0.0","version":0,"site":"https://librepcb.org/","source":"LibrePCB Developers","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}