{"appId":"w:LMMS.LMMS","appShortcutName":"LMMS","appDisplayName":"LMMS","authorId":"w:winget","releaseTagName":"winget-1.2.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/LMMS/lmms/releases/download/v1.2.2/lmms-1.2.2-win64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"LMMS is a free cross-platform alternative to commercial programs like FL Studio®, which allow you to produce music with your computer.\n\nLMMS is a free cross-platform alternative to commercial programs like FL Studio®, which allow you to produce music with your computer. This includes the creation of melodies and beats, the synthesis and mixing of sounds, and arranging of samples. You can have fun with your MIDI-keyboard and much more; all in a user-friendly and modern interface.\nNote for macOS users: if you're using macOS 10.14(Mojave) or newer, please use the according version. The macOS 10.13 build is buggy on 10.14 or newer.\nNew changes in 1.2.2: (2020-06-25)\n- General improvements\n  - Stop filtering out valid characters from file name while exporting tracks (#5282)\n  - Fix Invalid warning about \"dummy-MIDI-client\" (#5509)\n- UI improvements\n  - Note selection: Editing values works in dialog (#5438)\n- Bug Fixes\n  - Piano Roll - Fix retrigger with vol/pan sliders (#5271)\n  - Fix a rare crash on export (#5293)\n  - Fix LMMS not launching when AppImage has spaces in name (#5297)\n  - Fix vertical piano being unresponsive when clicked too fast (#5262)\n  - Fix crash with Grooove VST (#5300)\n  - Fix crash on deleting instrument with controller connections on knobs (#5306)\n  - Fix notes being placed at negative positions on MIDI import (#5343)\n  - Fix scrolling direction in the song editor due to stuck Ctrl/Shift (#5286)\n  - Fix stuck notes with Helm VST on tempo automation (#5365)\n  - Fix file factory delimeter position (#5378)\n  - Fix a muted demo project \"Greippi - Krem Kaakkuja (Second Flight Remix)\" (aeac24c06d1a839b242d7738e1412f068508cb4a)\n  - Fix controls linking misbehaviors (#5336)\n  - Fix loading and saving of .fxb/.fxp files on Windows (#5411)\n  - Fix crashes and hangs on importing some Hydrogen drum kit songs (#5420)\n  - Fix freeze when replacing Mallets with another instrument (#5428)\n  - DrumSynth: ensure correct envelope length in any sample rate (#5467)\n  - AFP: fix loading start and loop points if the loop point is automated (#5472)\n  - Select the correct piano key for marking semitones (#5478)\n  - Ensure consistent use of effect gate (#5475)\n  - Fix Piano roll crashing when window is vertically scaled too large (#5449)\n  - Fix some memory errors with JACK audio/MIDI (#5452)\n  - JackMidi: Remove confusing warnings at shutdown (737fcd3e55827f19fb7bda1813a80a9c0ff55920)\n  - Fix SF2 player crashing when file is not a soundfont, with FluidSynth 2 (#5487)\n  - BB editor: fix mouse event affecting wrong beats due to the cursor shape (#5489)\n  - Fix knobs moving too fast on some platforms (#5360)\n  - Fix notes created in BB editor resizing incorrectly when resizing a selection (#5515)\n  - Fix some patterns not being saved in project (#5537)\n- Localization\nKnown issues with this release:\n- Windows\n  - Software fails to load on some systems (Please see bug #1173, #512)\n  - No sound/distorted sound on some systems (Forum topics #604 #283)\n- Apple\n  - VST plugins (.dll) do not work on Apple (Please see bug #698)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.2","version":0,"site":"https://lmms.io/","source":"LMMS Developers","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}