{"appId":"w:Logtalk.Logtalk","appShortcutName":"Winget Application","appDisplayName":"Logtalk","authorId":"w:winget","releaseTagName":"winget-3.91.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nLogtalk compiler and runtime\n- FIXED: The documentation of the logtalk::expand_library_path/2 predicate to clarify that only expands library aliases (atoms) or compound terms in library notation.\nLibrary\n- FIXED: Avoid a non-tail recursive predicate linter warning when loading the random library with the tail_recursive set to warning.\nTools\n- CHANGED: The lgtunit tool messages for passed and skipped tests to also include the flaky flag.\n- ADDED: Flaky test property/note support to the lgtunit tool TAP and xUnit output formats.\n- IMPROVED: The lgtdoc tool no longer replaces the ASCII comma with the Unicode fullwidth comma when generating reStructuredText index entries for entity names.\n- UPDATED: Developer tools requirements for Ubuntu to avoid requiring the full Texlive installation.\n- FIXED: The lgtdoc tool to ignore the home and startup library names when looking for the name of the library when processing directory files.\n- FIXED: Renamed the lgtdoc tool Sphinx configuration template file to conf.py.jinja as the still documented conf.py_t name is no longer recognized by recent Sphinx versions.\n- FIXED: Bug in the lgtunit tool where the quick_check/3 test dialect would throw an error when using the pc/1 option.\n- FIXED: Bug in the lgtunit tool where broken QuickCheck tests would be reported as backend bugs.\n- FIXED: Regression in the lgtunit tool TAP and xUnit output formats where failed tests would not be reported.\n- FIXED: Missing handling of broken QuickCheck tests in the lgtunit tool TAP and xUnit output formats.\nIDEs, text editors, and syntax highlighters support\n- UPDATED: VSCode support for the changes to the lgtunit tool messages.\nInstallers and installation scripts\n- UPDATED: The Windows installation script to also detect the new SICStus Prolog 4.10.x versions.\n- UPDATED: The portable Docker image documentation on how to browse Allure reports from the host.\n- UPDATED: The portable Docker image to also include the issue_creator tool dependencies gh and glab.\n- FIXED: The portable Docker image Texlive requirements.\n- FIXED: The portable Docker image Allure installation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.91.0","site":"https://logtalk.org/","source":"Logtalk.org","license_or_tos":"Apache-2.0","resources":null,"verified":false}