{"appId":"w:LogTag.LogTagAnalyzer","appShortcutName":"Log Tag Alayzer","appDisplayName":"Log Tag Alayzer","authorId":"w:winget","releaseTagName":"winget-3.2.8.68","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://logtagrecorders.com/app/uploads/ltanalyzer_32r8.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"LogTag Analyzer software is the free companion software recommended to you if you own a LogTag product. It provides an easy-to-use, powerful platform for configuring, downloading, and displaying data from any LogTag data logger.\n\nLogTag Analyzer is a free powerful and intuitive software designed to work with LogTag data loggers, enabling users to easily download, analyze, and manage recorded data. With its streamlined interface, the software allows for bulk configuration of loggers, simplifying setup for large-scale operations. It offers advanced reporting features, such as multi-graph displays, making it easy to visualize temperature mapping results and other key metrics. Additionally, LogTag Analyzer is FDA 21 CFR Part 11 compliant, offering digital signatures that ensure the integrity of data and meet strict regulatory standards. Ideal for cold chain, healthcare, and pharmaceutical applications, the software provides seamless integration with LogTag’s suite of temperature and humidity loggers, ensuring reliable monitoring and reporting.\nLogTag Analyzer 3 supports multiple languages, including English, French, German, Russian, Spanish, Italian, Portuguese, Turkish, Japanese, and Simplified Chinese, with more languages in development.\nKey features include:\n- Advanced Reporting: Generate detailed reports with multi-graph displays for data analysis.\n- Data Logger Configuration: Configure and download data from LogTag loggers, including USB models.\n- Bulk Logger Setup: Streamline operations with bulk configuration of multiple loggers.\n- Profile Management: Import/export configuration profiles and settings for easy management.\n- Regulatory Compliance: FDA 21 CFR Part 11 compliant with digital signatures for secure data integrity.\n- Backward Compatibility: Compatible with previous software versions for seamless updates.\n- Multi-Language Support: Supports multiple languages, including English, Spanish, and more.\n- Improved User Interface: Features a user-friendly interface with customizable controls and better layout.\n- LogTag Online Integration: Seamlessly integrates with LogTag Online for cloud-based data storage.\n- Multiple Export Options: Exports data to PDF and CSV formats for easy record-keeping.\nNEW FEATURES:\n- Added support for HAXO-16U/HASO-16U\n- Added wireless probe serial number to Report and PDF/CSV export\nBUG FIXES:\n- Fixed date/time start configuration for TRED30-16U/UHADO with UTC-xx timezones\n- Corrected upper alarm statistic for UHADO-16 if more than one upper alarm is configured\n- Calibration Certificate for USRID-16W now shows after configuration\n- Updated internal 3rd party libraries with fix for security vulnerability\n- Fixed configuration window cut off on Japanese and Chinese Windows systems\n- Updated minimum log interval for TRIL/SRIL-16U to 1 minute\n- Corrected User Server Audit log message with truncated username for “Logoff”\n- Allowed to configure/download UTREx30-x single-channel loggers\n- Allowed to configure TRED30-16U/UHADO-16 loggers via profile when PC has no internet connection","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2.8.68","version":0,"site":"https://logtagrecorders.com/","source":"LogTag Recorders","license_or_tos":"Proprietary","resources":null,"verified":false}