{"appId":"w:Logtalk.Logtalk","appShortcutName":"Logtalk","appDisplayName":"Logtalk","authorId":"w:winget","releaseTagName":"winget-3.93.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nLogtalk compiler and runtime\n- ADDED: Support for declaring synchronized predicates in calls to the create_object/4 and create_category/4 built-in predicates.\nDocumentation\n- ADDED: Glossary definition for \"debug handler\".\nLibrary\n- CHANGED: The implementation of the sets library predicates member/2 and selectchk/3. Also improved the documentation of the library and fixed the mode/2 directives of several of its predicates.\n- IMPROVED: Warning messages when a library is not supported by a backend.\nTools\n- IMPROVED: The debugger tool code and documentation for a more consistent handling and description of breakpoints. Also added additional tests.\n- UPDATED: The logtalk_tester.* scripts to also print the operating-system version after the Logtalk and Prolog backend versions.\n- FIXED: The debugger tool missing tokenization for the message matching_conditional_spy_points_removed.\n- FIXED: The packs tool restore/1-2 predicates when using the default option force(true) to allow restoring a pack when a pack with the same name is installed from a different registry.\nTests\n- ADDED: Additional tests for the Prolog standard atom_concat/3 built-in predicate from WG17 work.\nIDEs, text editors, and syntax highlighters support\n- RENAMED: The coding/codemirror directory to coding/codemirror5.\n- ADDED: CodeMirror 6.x support (in the coding/codemirror6 directory).\n- ADDED: VSCode support predicates debug/0 and nodebug/0.\n- IMPROVED: TextMate 2.x and Vim support for automatic indentation.\n- IMPROVED: VSCode support to avoid spurious errors when a find predicate declaration or definition is accidentally triggered for invalid text.\n- FIXED: VSCode support finding of references to a predicate alias declared in a uses/2 directive.\n- FIXED: VSCode support finding of a local predicate (or non-terminal) definition when provided by an included file.\n- FIXED: VSCode support finding of a local predicate (or non-terminal) reference to not report calls from auxiliary predicates (as the reflection API reports line zero in these cases).\n- FIXED: VSCode support when using the code navigating features resulted in predicate property queries to the user built-in object that would throw an error.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.93.0","site":"https://logtalk.org/","source":"Logtalk.org","license_or_tos":"Apache-2.0","resources":null,"verified":false}