{"appId":"w:Logtalk.Logtalk","appShortcutName":"Logtalk","appDisplayName":"Logtalk","authorId":"w:winget","releaseTagName":"winget-3.96.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nLogtalk compiler and runtime\n- ADDED: Predicates logtalk::loaded_files_topological_sort/1-2 for sorting loaded files by their dependencies.\n- IMPROVED: The implementation of the logtalk_make/0-1 predicates for the target all to avoid or minimize compilation warnings due to out-of-order loading of modified source files. See the make tool documentation for details.\n- FIXED: Printing of the default flag values at startup to list the prolog_dialect flag as a read-only flag.\n- FIXED: The linter warning for the use of Logtalk or Prolog top-level shortcuts as directives ignored the portability flag.\nProlog adapter and integration files\n- CHANGED: Trealla Prolog adapter file to require version 2.84.29 or later.\n- UPDATED: ECLiPSe adapter file to use the new read_term/3 predicate line/1 option introduced in version 7.2#5 for accurate read term starting lines.\n- FIXED: CxProlog adapter file to workaround its implementation of the predicate_property/2 built-in predicate returning properties for unknown predicates.\n- FIXED: Quintus Prolog adapter file to avoid some spurious suspicious call warnings when loading tools such as lgtunit.\n- FIXED: Quintus Prolog adapter file missing expansions for some arithmetic functions.\nDocumentation\n- ADDED: A \"Known issues\" section to the documentation of the make tool.\n- UPDATED: The Handbook on finding an optimal file loading order using the new logtalk::loaded_files_topological_sort/1-2 predicates.\nLibrary\n- IMPROVED: The os::time_stamp/1 predicate implementation for SICStus Prolog, Trealla Prolog, XSB, and YAP.\n- IMPROVED: Tests for the os library predicates.\n- UPDATED: The format library linter checker to be aware of the ~W control sequence that uses two arguments.\nTools\n- IMPROVED: The logtalk_doclet.sh script now kills all created child processes on exit.\n- FIXED: Syntax error when loading the diagrams tool using the GNU Prolog backend.\n- FIXED: The logtalk_doclet.sh and logtalk_tester.sh scripts to also check for the gnutimeout alternative name for the GNU coreutils command timeout. Thanks to Andrew Davison for the bug report.\nIDEs, text editors, and syntax highlighters support\n- ADDED: Support for the Context7 MCP server via a context7.json file.\n- ADDED: VSCode support predicates infer_public_predicates/2 and files_topological_sort/3.\n- FIXED: The VSCode support to workaround the non-compliant implementation of multifile predicates in Ciao Prolog.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.96.0","version":0,"site":"https://logtalk.org/","source":"Logtalk.org","license_or_tos":"Apache-2.0","resources":null,"verified":false}