{"appId":"w:LopeSoft.LopeEdit","appShortcutName":"LopeEdit","appDisplayName":"LopeEdit","authorId":"w:winget","releaseTagName":"winget-5.8.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"LopeEdit is a powerful programmer's editor and a replacement of Windows Notepad. It has tabs to select between open files, supports syntax highlighting of multiple programing languages\n\nLopeEdit is a powerful programmer's editor and a replacement of Windows Notepad.\nThere are two editions of LopeEdit: LopeEdit Lite (freeware) and LopeEdit Pro (shareware). LopeEdit Lite is fully functional but does not contain all features, and LopeEdit Pro includes all features. You must purchase LopeEdit Pro if you wish to use it. You can try LopeEdit Pro for 30 days if you don't register it.\n\nBasic Features (LopeEdit Lite and LopeEdit Pro)\n- Supports visual themes: Office 2003 , Visual Studio 2005 , Office XP , Office 2000 or Windows XP .\n- Tabs to select between open files.\n- Syntax highlighting (user configurable). Pre-configured for C/C++, Java, JavaScript, Visual Basic, VBScript, XML, HTML, ASP, JSP, SQL, Cobol, C#, CSS (Cascading Style Sheets), Pascal, Perl, PHP.\n- UNICODE and UTF-8 support.\n- Support for the following new line formats: DOS/Windows, Linux/Unix, MAC.\n- Automatic highlighting of brackets/braces as typing or positioning occurs.\n- Multiple tabs for an open file.\n- The window can be divided in tab groups (horizontal or vertical). It is possible to move tabs by dragging them with the mouse.\n- Edit Box in toolbar to find quickly strings in documents.\n- Several docking windows with utilities. These windows can be docked in any place of the main window, or can be auto-hided when losing the focus.\n- File Browser Window. Build-in file browser (as Windows Explorer) to open files in the editor, or to make any operation over files or folders (copy, move, delete, etc.).\n- Find and Replace Window. Finds or replaces a string in the current document or in all open documents.\n- Find and Replace In Files Window. Finds or replaces a string in all files that a folder contains.\n- Regular expression support with tagged expressions for find/replace.\n- Find Results Windows. Allows showing search results. Double clicking over a search result, editor will open the file and will scroll until search result position.\n- Favorites Window and Favorites me\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.8.1","version":0,"site":"https://www.lopesoft.com/","source":"LopeSoft","license_or_tos":"Proprietary","resources":null,"verified":false}