{"appId":"w:LopeSoft.FileMenuTools","appShortcutName":"FileMenu Tools","appDisplayName":"FileMenu Tools","authorId":"w:winget","releaseTagName":"winget-8.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"FileMenu Tools is an application which lets you customize the context menu of Windows File Explorer\n\nFileMenu Tools is an application which lets you customize the context menu of Windows Explorer.\nThe application adds built-in utilities to perform operations on files and folders and adds custom commands which let you run external applications, copy/move to a specific folder or delete specific file types.\nWith FileMenu Tools, you also can customize the \"Send to...\" submenu, and either enable or disable context-menu commands added by other applications.\n\nBuilt-in Utilities\n- The synchronization type (unidirectional, bidirectional, etc.) and the file types to be synchronized may be specified.\n- Recursively delete specific file types from a folder. The file types may be specified with wildcards, for example: *.txt, *.t??, etc.\n- Find and replace a text string in all selected files. Regular expressions are supported.\n- Rename all selected elements according to specified rules.\n- Delete files which are locked by any application and cannot be deleted normally.\n- Delete the selected elements WITHOUT moving them to the Recycle Bin.\n- Change the icon assigned to the selected folder.\n- Run a program with parameters typed in a dialog box.\n- Open a command line window in the selected folder.\n- Display a submenu which lets you change the attributes of the selected elements. If a folder is selected, it is possible to change the attributes recursively.\n- Copy the selected elements to another folder. Filters may be specified in order to copy specific file types.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.6","version":0,"site":"https://www.lopesoft.com/","source":"LopeSoft","license_or_tos":"Proprietary","resources":null,"verified":false}