{"appId":"w:Loxone.LoxoneConfig","appShortcutName":"Loxone Config","appDisplayName":"Loxone Config","authorId":"w:winget","releaseTagName":"winget-16.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Loxone Config provides ready-to-install smart home functionality with one-click auto configuration standards.\n\nLoxone Config provides ready-to-install smart home functionality with one-click auto configuration standards. No other home automation software does the work for you like this, let alone for free. Just click and drag components – no coding and no complex programming required.\n\nAuto Configuration\nProgram basic functions like lighting or music all together in one click, all according to Loxone Standards & Recommendations. You also get full visualization with our free app for smartphones or tablets. From there, specific needs for customers can become implemented in hours – not days.\n\nSimulation & Live View\nBefore going live, you can fully test the configuration in Simulation Mode and preview how functions will deliver according to your project specifications.\nIn Live View you can see how the building operates remotely. No need to go on-site, you’ll always be able to check how the system is running no matter where you are.\n\nProject Planning\nGet ready for project planning and proposals to be created faster and easier than ever before. Helpful tools such as the ability to search and replace items makes it simple to navigate the best product selection for your project.\n\nProject Analysis\nThink “Spell Check” for your configuration. The Project Analysis feature reliably reviews your configuration as well as key points such as your password strength, unused objects or light circles, convertible objects and even offers help with statistics and data. Finish each configuration knowing you had a second set of eyes on your work!\n\nMultiplicator\nThe Loxone Multiplicator allows you to manage several Miniservers under one umbrella. For example, if a hotel has 30 rooms, each room has its own its own Miniserver, they can all be programmed and managed together under one project file – a multiplier file. You can create a multiplier file by selecting the project type or converting an existing project.\n\nFree updates\nOur software improves with every update. We continuously test and expand our software based on market feedback. We’re always exploring new features and functionality for all Loxone homes and buildings to come.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"16.1","version":0,"site":"https://www.loxone.com/","source":"Loxone Electronics GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}