{"appId":"w:LSXPrime.ProseFlow","appShortcutName":"ProseFlow","appDisplayName":"ProseFlow","authorId":"w:winget","releaseTagName":"winget-0.2.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/LSXPrime/ProseFlow/releases/download/v0.2.0/ProseFlow-win-x64-Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Your universal AI text processor, powered by local and cloud LLMs. Edit, refactor, and transform text in any application on Windows, macOS, and Linux.\n\nProseFlow is a cross-platform desktop application that integrates powerful AI text processing into your daily workflow. With a simple hotkey, you can access a menu of customizable AI actions to proofread, summarize, refactor, or transform text in any application—be it your code editor, browser, or word processor.\n🎉 ProseFlow v0.2.0 – Release Notes\nWe’re thrilled to announce ProseFlow v0.2.0, a major milestone that significantly expands the application’s capabilities with powerful new features, refined user experience, and robust infrastructure improvements. This release introduces shared workspace support, a floating action orb, diff view for safe editing, background task tracking, and much more.\n\n🌟 Highlights\n1. Shared Workspace & Team Sync\nCollaborate seamlessly with your team! ProseFlow now supports shared workspaces—a folder (local or cloud-synced) that stores your Actions and Provider configurations.\n- Connect to a shared workspace during onboarding or via Settings.\n- Encrypt sensitive data (like API keys) using a workspace password.\n- Choose between Manual or Automatic sync modes.\n- Resolve conflicts with configurable strategies: Overwrite, Skip, or Prompt.\n💡 Ideal for teams wanting consistent AI workflows across machines.\n\n2. Floating Action Orb\nA persistent, draggable orb floats on your screen—offering instant access to ProseFlow without memorizing hotkeys.\n- Click to open the Floating Action Menu.\n- Right-click for a quick context menu (Open App, Quit, Close Orb).\n- Drag & drop text onto the orb to trigger the new Arc Menu—a radial menu of your favorite or context-relevant actions.\n- Shows a live badge indicating active background tasks.\n- Fully customizable: hide it in Settings if preferred.\n\n3. Diff View for Safe Editing\nWhen using actions with Diff output mode, you’ll now see a side-by-side comparison of your original and AI-generated text.\n- Accept, Refine, Regenerate, or Cancel with confidence.\n- Powered by DiffPlex with word-level highlighting for precise changes.\n- Supports inline refinement instructions for iterative improvements.\n✅ Perfect for critical edits where you need full control over AI output.\n\n4. Background Task Tracker\nAll AI actions are now tracked in real time on the Overview Dashboard.\n- See active processes, their status (Queued/Processing), and elapsed time.\n- Cancel long-running tasks directly from the UI.\n- Visual feedback on the Floating Orb and in notifications.\n\n🛠️ Core & Infrastructure Improvements\n🔐 Enhanced Clipboard Service\nA new multi-layered fallback system ensures reliable text selection and pasting across all platforms:\n1. Avalonia API (primary)\n2. Native shell commands (xclip, pbcopy, clip.exe)\n3. TextCopy library (fallback)\nGreatly improves compatibility with WSL, remote desktops, and sandboxed environments.\n⌨️ Advanced Hotkey System\n- Hotkey recording UI in Settings with live feedback.\n- Conflict detection to prevent duplicate shortcuts.\n- Unified APIs for key registration and monitoring and enhance support for non-U.S. keyboards.\n🧠 Local Model Enhancements\n- GPU selection: Choose a specific GPU or let the system auto-select.\n- Flash Attention support for faster inference (enabled by default).\n- Thread control: Adjust CPU thread count for optimal performance.\n- Context and token limits increased to 65,536.\n📊 Hardware Monitoring\n- GPU detection and VRAM reporting (NVIDIA, AMD, Intel).\n- Polling pauses when the main window is hidden to conserve resources.\n- Hardware metrics now feed into the Local Dashboard sidebar.\n\n🎨 UI & UX Refinements\n📁 History View Overhaul\n- Searchable and filterable history (by Action Name, Input, or Output).\n- Delete individual entries or clear all.\n- Improved layout with virtualization for performance.\n⚙️ Settings Revamp\n- Workspace Sync section with full connection management.\n- Behavior toggles: Start minimized, hide Floating Orb.\n- Improved hotkey input with recording UI.\n- Preset import cards now show hover-to-reimport.\n📈 Dashboard Upgrades\n- Overview Dashboard now includes:\n  - Total tokens (cloud + local combined)\n  - Application log console (real-time)\n  - Active background processes widget\n- Local Dashboard gains inference speed metrics and hardware sidebar.\n- Animated KPIs using the new AnimatingTextBlockBehavior.\n🪟 Window Management\n- Main window now saves/restores visibility state.\n- Splash screen provides visual feedback during startup.\n- Smoother page transitions in the main window.\n\n🧪 Developer & Quality Improvements\n- Structured logging with class names and real-time UI display.\n- Enum-based output modes (InPlace, Windowed, Diff, Default) replace boolean flags.\n- Action favorites system for prioritizing frequently used commands.\n- Onboarding flow is now non-modal and runs atop a fully initialized app.\n- Database schema updated to support new features (migrations included).\n- Dependency updates: Avalonia 11.3.7, LlmTornado 3.7.45, SharpHook 7.0.3.\n\n🐞 Bug Fixes\n- Fixed issues with hardware monitoring on macOS ARM64.\n- Resolved clipboard restoration edge cases.\n- Corrected token usage reporting for cloud providers.\n- Improved error handling for network interruptions and provider failures.\n- Fixed drag-and-drop reordering in Actions and Providers grids.\n\n❤️ Thank You\nThis release represents hundreds of hours of work and community feedback.\nIf you encounter any issues or have suggestions, please open an issue on GitHub.\n— LSXPrime","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.2.0","version":0,"site":"https://github.com/LSXPrime","source":"ProseFlow","license_or_tos":"AGPL-3.0","resources":null,"verified":false}