{"appId":"w:LSXPrime.ProseFlow","appShortcutName":"ProseFlow","appDisplayName":"ProseFlow","authorId":"w:winget","releaseTagName":"winget-0.1.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/LSXPrime/ProseFlow/releases/download/v0.1.0/ProseFlow-win-x64-Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Your universal AI text processor, powered by local and cloud LLMs. Edit, refactor, and transform text in any application on Windows, macOS, and Linux.\n\nProseFlow is a cross-platform desktop application that integrates powerful AI text processing into your daily workflow. With a simple hotkey, you can access a menu of customizable AI actions to proofread, summarize, refactor, or transform text in any application—be it your code editor, browser, or word processor.\n🎉 ProseFlow v0.1.0 - Initial Release!\nWe are thrilled to announce the first public release of ProseFlow!\nProseFlow is your universal AI text processor, designed to integrate powerful AI workflows into any application on your desktop. With a simple hotkey, you can proofread, summarize, refactor, or transform text using either cutting-edge cloud models or private, offline-capable local models running on your own hardware.\nThis initial release is packed with features for power, privacy, and productivity.\n✨ Key Features\n- Global Hotkey Activation: Access the ProseFlow menu from any application with a customizable system-wide hotkey (default Ctrl+J).\n- Floating Action Menu: An elegant, searchable menu of your AI actions appears right where you need it.\n- Smart Paste: Assign a dedicated hotkey to your most frequent action for one-press text transformation.\n- Flexible Output: Choose to have results instantly replace your text or open in an interactive window for review.\n- Iterative Refinement: Conversationally refine AI output in the result window until it's perfect.\n- Context-Aware Actions: Configure actions to only appear when you're working in specific applications (e.g., show \"Refactor Code\" only in your code editor).\n🧠 Hybrid AI Engine\n- Run 100% Locally & Offline: Use GGUF-compatible models on your own hardware for maximum privacy and offline access.\n- Cloud Provider Support: Connect to services like OpenAI, Groq, Anthropic, Google, and any other OpenAI-compatible endpoint.\n- Intelligent Fallback Chain: Configure multiple cloud providers. If one fails, ProseFlow automatically tries the next one in your prioritized list.\n- Secure Credential Storage: API keys are always encrypted and stored securely on your local machine.\n🛠️ Customization & Management\n- Powerful Action Editor: Create and manage reusable AI instructions with unique names, icons, system prompts, and output behaviors.\n- Drag-and-Drop Organization: Intuitively organize your actions into custom groups.\n- Import & Export: Share your action sets with others or back them up to a JSON file. A conflict resolution dialog makes importing seamless.\n- Action Presets: Get started quickly by importing curated sets of actions for common tasks like writing and coding.\n📊 Dashboard & Analytics\n- Comprehensive Dashboard: Visualize your token usage, provider performance, and hardware status in one place.\n- Performance Monitoring: Track provider latency and tokens/second to optimize your setup.\n- Live Hardware Monitor: See real-time CPU, GPU, RAM, and VRAM usage when running local models.\n- Interaction History: Review a detailed log of all your past AI operations, including the input and output.\n💻 Platform Support\n- Cross-Platform: Native support for Windows, macOS, and Linux.\n- System Tray Control: Runs quietly in the background with a tray icon for quick access to key functions like loading/unloading models and switching provider types.\n- Launch at Login: Configure ProseFlow to start automatically with your system.\n- Guided Onboarding: A smooth setup process for new users to get configured in minutes.\n🚀 Getting Started\nDownload the installer for your operating system from the official website or from the assets below. The first time you launch ProseFlow, a guided onboarding window will help you configure your first AI provider and set your global hotkey.\n➡️ Download from the Official Website ⬅️\nWe're excited for you to try ProseFlow and look forward to your feedback","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.1.0","version":0,"site":"https://github.com/LSXPrime","source":"ProseFlow","license_or_tos":"AGPL-3.0","resources":null,"verified":false}