{"appId":"w:LukasHermann.stagetimer_io","appShortcutName":"stagetimer.io","appDisplayName":"stagetimer.io","authorId":"w:winget","releaseTagName":"winget-2.24.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://storage.googleapis.com/stagetimer-prod.appspot.com/releases/2.24.0/stagetimer.io-2.24.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Remote-controlled Countdown Timer.\n\nstagetimer.io is a cloud-based professional speaker timer specifically designed for live and hybrid event productions. It allows you to create multiple timers to keep an entire event, conference, or presentation on time. Any internet-capable device can use it and it works on all screen sizes and orientations.\nKey features are:\n- Sharable links for the controller, viewer, and agenda\n- Import tables from Microsoft Excel or Google Scheets via CSV\n- Schedule timers, link them together, and change color when approaching 0:00\n- Customizable fonts, colors, and logo\nStagetimer’s desktop app is designed for environments where internet connectivity is unavailable or unreliable, such as remote event locations, conference centers with restricted network access, or corporate environments with regulated internet use. Additionally, using the desktop app can prevent disruptions caused by unexpected internet outages.\nThis version is available as an installable application for both Mac and Windows. It mirrors the capabilities of the web version, allowing a seamless transition between online and offline modes. The basic features of the offline app are free to download. Each Stagetimer plan includes an offline license key that activates the corresponding paid features in the desktop app.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.24.0","version":0,"site":"https://stagetimer.io/","source":"Lukas Hermann","license_or_tos":"Proprietary","resources":null,"verified":false}