{"appId":"w:Makeblock.xToolStudio","appShortcutName":"xTool Studio","appDisplayName":"xTool Studio","authorId":"w:winget","releaseTagName":"winget-1.1.10","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Designer & management software for xTool laser cutters & engravers.\n\n\n1. Incremental Updates: Added support for faster incremental software updates.\n2. AImake Agent (New): Generate designs for engraving and printing from natural language prompts.\n3. Improved Shape Masks: You can now easily create masks from preset shapes or any path on the canvas.\n4. Enhanced Image Trace: Improved path accuracy to reduce overlaps and added a new fill preview.\n5. Smarter Nesting: Items that don't fit on the material will now be automatically placed outside the workspace.\n6. Upgraded Material Test Array:\n  - Now suggests parameter ranges based on your material.\n  - Added one-click reuse for saved test history.\n7. Device Connection Troubleshooter: Added a new intelligent troubleshooter to help resolve connection issues.\n8. Updated Safety Training: The safety tutorial is now more concise and required for new users. (Completed users are not affected.)\n9. Custom Default Mode: You can now set a default processing mode for your device.\nDevice-Specific Updates:\n1. P3:\n  - Quickly switch from Auto to Manual mode during a job.\n  - Batch Fill is now supported in lifting plane mode.\n  - Manually select focus points if the close-up snapshot fails.\n  - Added a \"Non-Reflective Material\" option to improve nesting success.\n2. MetalFab:\n  - Smart Parameter Suggestions: Automatically recommends air pressure and focal length based on your selected gas, nozzle, and material.\n  - New Processing Order: Added a new \"By Layer, From Center Out\" processing sequence.\n  - Manual Camera Control: Added manual camera adjustments for high-contrast lighting conditions.\n  - Clamp Collision Avoidance: The software now automatically detects clamp areas to prevent head collisions.\n3. RA3:\n  - New Cylindrical Correction: Instantly correct image distortion on cylindrical or conical objects (like tumblers) to prevent stretching and compression.\n4. AP2 Max:\n  - Quieter & More Efficient: Optimized fan speeds for different filters to reduce noise and extend filter life.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.10","version":0,"site":"https://www.xtool.com/","source":"Makeblock","license_or_tos":"Proprietary","resources":null,"verified":false}