{"appId":"w:Makeblock.xToolStudio","appShortcutName":"xTool Studio","appDisplayName":"xTool Studio","authorId":"w:winget","releaseTagName":"winget-1.3.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://storage.atomm.com/efficacy/atomm-package/prod/packages/109/330fc24d-cdb0-4af3-842a-dc138e853bc5/xTool-Studio-x64-1.3.6.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Designer & management software for xTool laser cutters & engravers.\n\n\n1. New xTool Academy: The homepage now includes the \"xTool Academy,\" where users can quickly access design and processing knowledge.\n2. New In-App Feedback: When encountering software issues or suggestions, users can directly submit feedback or report problems via the account menu > Feedback.\n3. Editor Experience Optimization:\n- The top design bar has been reorganized to provide more space for displaying important information and tools.\n- The font library now includes a \"Single-line Fonts\" collection, providing more design options.\n- The text now defaults to the last used font, weight, and size, simplifying the font setting process.\n- The row and column limits for square arrays have been increased, enabling the creation of larger arrays and improving design efficiency.\n- Mouse middle-click drag support for canvas.\n4. New Regular Hexagon Puzzle: Supports selecting puzzle direction blocks and adds puzzle border functionality.\n5. Material Grid Test Optimization: Supports automatic array generation, simplifying the operation process.\n6. Supports Custom Path Settings in Rotating Fixture Mode: Improves processing efficiency in specific scenarios.\n7. Supports Over-Cutting Settings: Solves the problem of the starting and ending points not cutting through, ensuring more complete processing results. (Only supports non-F series devices.)\n8. Supports Step-by-Step Focus Sink: Significantly improves cutting capability by gradually sinking the focus, resulting in better cutting effects. (Supported devices: P2 / P2S / P3 / S1 / F1U / F2 / F2U / F2U UV)\n9. New Lead-in Feature for P3: P3 now supports the lead-in feature, solving the blackening issue at the starting point and improving processing precision and efficiency.\n10. Apparel Printer:\n- Supports 600mm long material printing (requires 023 firmware).\n- Optimized white ink reduction function, supporting the setting of non-reduced areas through the spot color channel.\n- Added 5 self-service troubleshooting functions to help users quickly resolve common issues and avoid work interruptions.\n11. Bug Fixed:\n- Solved the issue of poor processing precision at low line density (F series only).\n- Fixed the issue of coordinate origin changes and abnormal size display after object rotation.\n- Fixed the issue of occasional font not applying when clicked.\n- Fixed other known issues.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.3.6","version":0,"site":"https://www.xtool.com/","source":"Makeblock","license_or_tos":"Proprietary","resources":null,"verified":false}