{"appId":"w:MartinBresson.Executor","appShortcutName":"Executor","appDisplayName":"Executor","authorId":"w:winget","releaseTagName":"winget-2.2.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Executor the desktop workflow application for Windows. Speed up your daily workflow, opening things and doing things.\n\nExecutor the desktop workflow application for Windows. Speed up your daily workflow, opening things and doing things.\n\nKey Features:\n- Launch applications, files, folders, websites, web services (with parameters) and prompts in milliseconds.\n- Trigger multiple actions with one text command and/or hotkey.\n- Let's be an expert in opening up the world instead of trying to put the whole world inside of Executor (as some alternatives try to do).\n- Take the clipboard to a new level, swiftly trigger system commands, do fast calculations, manage running applications and more.\n- Tailor keywords, appearance, hotkeys, and behavior to perfectly match your daily workflow.\n- Customize the look and feel with various skins and theming options to match your desktop setup.\nWhat's New\n- Added an \"experimental\" setting to have the input and list visually as one minimalistic looking window. See screenshots for difference. The setting can be found in \"settings > Visual / skin\". It only applies to scale type skins. Technically it's still two windows. It's \"experimental\" as Executor has so many visual and behavioral settings, so there could be some cases that still needs to be adjusted to support this. (Screenshot skin: scale_shattered, font: JetBrains Mono at size 14. List font can be set using \"run list appearance wizard\" in settings > List).\n\n- Added new dialog for adding and editing index paths, now being one dialog instead of several, where there's also a test button that will show which items will be indexed.\n- Added that in settings you can click the \"indexed items\" label and see a list of all indexed items (handy for troubleshooting etc.).\n\nFixes\n- Fixed pressing shift+enter to run input as admin had no effect on indexed items.\n- Fixed an issue where with certain settings the expanded edit view would not be auto closed like expected after running input from the expanded edit view.\n- Fixed an issue where trying to expand a indexed filepath item (using tab or ctrl+e) that had a identical keyword name would fail.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.2.4","version":0,"site":"https://catswithfunnyhats.com/","source":"Martin Bresson","license_or_tos":"MIT","resources":null,"verified":false}