{"appId":"w:MartinBresson.Executor","appShortcutName":"Executor","appDisplayName":"Executor","authorId":"w:winget","releaseTagName":"winget-2.2.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Executor the desktop workflow application for Windows. Speed up your daily workflow, opening things and doing things.\n\nExecutor the desktop workflow application for Windows. Speed up your daily workflow, opening things and doing things.\n\nKey Features:\n- Launch applications, files, folders, websites, web services (with parameters) and prompts in milliseconds.\n- Trigger multiple actions with one text command and/or hotkey.\n- Let's be an expert in opening up the world instead of trying to put the whole world inside of Executor (as some alternatives try to do).\n- Take the clipboard to a new level, swiftly trigger system commands, do fast calculations, manage running applications and more.\n- Tailor keywords, appearance, hotkeys, and behavior to perfectly match your daily workflow.\n- Customize the look and feel with various skins and theming options to match your desktop setup.\nImprovements\n- Added that if you use the pressing enter on invalid input will \"open text using a keyword\" option (Settings &gt Misc), you can define a list of \"starts-with text\" that should never be text launched. Per default it contains \"?\", so in case you make a typo like ?sheep (instead of ?sleep) it will not launch this using a keyword. The setting is found in executor.ini and named launchignorelist. See hidden settings for more info.\n- Keyword commands that contains double quoted filepaths will now display the icon for that filepath instead of the default Executor icon.\n- The keyword editor filter search now supports empty text values using \"\". For example comment:\"\" will list all keywords with an empty comment field.\n- The icon: filter in the keyword editor, now supports \"starts-with\" using the icon filepath. So for example icon:c:\\icons will show all matches where the icon is located in c:\\icons\n- The installer now has better versioning information for package managers etc. (once new the installer has been installed).","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.2.3","version":0,"site":"https://catswithfunnyhats.com/","source":"Martin Bresson","license_or_tos":"MIT","resources":null,"verified":false}