{"appId":"w:MaxCut.MaxCut","appShortcutName":"MaxCut","appDisplayName":"MaxCut","authorId":"w:winget","releaseTagName":"winget-2.9.5.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An easy to use tool that creates optimal cutting plans and accurate costings that you can have confidence in. Input panel sizes and materials, MaxCut does the rest…\n\nMaxCut is designed for your growing cabinetry business. An easy to use cutlist optimizer that creates optimal cutting plans and accurate costings that you can have confidence in.\n- Save a fortune on materials! Cut the sheet to its full potential. Avoid costly saw operator mistakes. No more expensive offcuts lying around your workshop or in the bin.\n- Accurate quotations. Generate cabinetry quotations quickly, accurately and efficiently, knowing you have the right price and the correct number of sheets for the job every time.\n- All the reports you need. Print to email cut lists, supplier order lists, cabinet labels, professional quotes and more with no extra effort.\nUpdates\n- Grain Match – Improved Duplication Workflow\n  - When duplicating an item that belongs to a grain match group, you’ll now be prompted whether to copy the group as well.\n  - If you choose to keep the group, the grain match dialog opens, and the copied panels are automatically shifted to the end of their rows to prevent overlapping.\n\n- Grain Match – Arrow Indicators\n  - Added arrow controls in the grain match preview to let you move selected panels more easily.\n\n- Regional Settings Visibility\n  - You can now quickly view your Windows regional settings directly in the Currency Settings menu.\n  - This makes it easier to confirm symbols (e.g., for CSV imports) when troubleshooting or debugging.\nFixes\n- Grain Match – Move Right Arrow\n  - The “move right” arrow is now correctly disabled when the panel cannot be moved further.\n\n- Panel Item List Report – Holes and Grooving\n  - The Panel Item List report now displays holes and grooving details in the correct columns.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.9.5.5","site":"https://maxcutsoftware.com/","source":"MaxCut Software Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}