{"appId":"w:MaxCut.MaxCut","appShortcutName":"Winget Application","appDisplayName":"MaxCut","authorId":"w:winget","releaseTagName":"winget-2.9.4.7","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An easy to use tool that creates optimal cutting plans and accurate costings that you can have confidence in. Input panel sizes and materials, MaxCut does the rest…\n\nMaxCut is designed for your growing cabinetry business. An easy to use cutlist optimizer that creates optimal cutting plans and accurate costings that you can have confidence in.\n- Save a fortune on materials! Cut the sheet to its full potential. Avoid costly saw operator mistakes. No more expensive offcuts lying around your workshop or in the bin.\n- Accurate quotations. Generate cabinetry quotations quickly, accurately and efficiently, knowing you have the right price and the correct number of sheets for the job every time.\n- All the reports you need. Print to email cut lists, supplier order lists, cabinet labels, professional quotes and more with no extra effort.\nNew Features\n- Export Input Items to Excel\n  You can now export your input items directly to xlsx (Excel format)—making it easier than ever to share or analyze your data outside of MaxCut.\nUpdates\n- New Labels Added\n  - Added 70 x 37 mm : A4 Page, 24 Labels with Expanded Sizes.\n  - Introduced 70 x 25.4 mm : A4 Page, 33 Labels for more compact labeling needs.\n  - The 70 x 37 mm : A4 Page, 24 Labels with Visual Edging now include a QR code in the Notes column, making tracking and scanning more efficient.\n- Improved Label Print Dialog\n  Updated the naming of the labels available to print and export, making them clearer and easier to read.\n- Export Layouts Directly from Optimization View\n  The right-click context menu on the optimization screen now includes export layouts—saving time and streamlining your workflow.\nFixes\n- Keyboard Shortcut Consistency\n  The Ctrl + Enter shortcut now works across all dialogs, giving you a smoother, more consistent experience no matter where you're working in MaxCut.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.9.4.7","site":"https://maxcutsoftware.com/","source":"MaxCut Software Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}