{"appId":"w:MaxCut.MaxCut","appShortcutName":"MaxCut","appDisplayName":"MaxCut","authorId":"w:winget","releaseTagName":"winget-2.9.6.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An easy to use tool that creates optimal cutting plans and accurate costings that you can have confidence in. Input panel sizes and materials, MaxCut does the rest…\n\nMaxCut is designed for your growing cabinetry business. An easy to use cutlist optimizer that creates optimal cutting plans and accurate costings that you can have confidence in.\n- Save a fortune on materials! Cut the sheet to its full potential. Avoid costly saw operator mistakes. No more expensive offcuts lying around your workshop or in the bin.\n- Accurate quotations. Generate cabinetry quotations quickly, accurately and efficiently, knowing you have the right price and the correct number of sheets for the job every time.\n- All the reports you need. Print to email cut lists, supplier order lists, cabinet labels, professional quotes and more with no extra effort.\nUpdates\n- Beta Optimization Engine Improvements\n  - The results of the Beta Optimization Engine have been improved to further reduce material wastage. The algorithm is now more efficient, delivering tighter layouts and better material utilization.\n- Easy Access to \"Edit Sheet Material\" on Optimized Sheets\n◦ The \"Edit Sheet Material\" option has been added to the context menu when right-clicking panels on the optimization layout.\n◦ Positioned below the existing panel options, this ensures sheet-related actions are always accessible without requiring you to enter the Materials Manager. This makes the editing experience more intuitive and consistent.\nFixes\n- Handling of Invalid Language Settings\n◦ MaxCut now safely handles invalid language settings during startup.\n◦ Users are prompted to re-select their preferred language, ensuring the application opens successfully without errors.\n- Accurate Hole Scaling in DXF Exports\n◦ Hole geometry in DXF exports (for both cut lines and panels) now scales accurately across all measurement types.\n◦ Holes are sized and positioned correctly relative to the panel edges, ensuring precise exports for production.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.6.6","version":0,"site":"https://maxcutsoftware.com/","source":"MaxCut Software Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}