{"appId":"w:MaxCut.MaxCut","appShortcutName":"MaxCut","appDisplayName":"MaxCut","authorId":"w:winget","releaseTagName":"winget-2.9.6.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An easy to use tool that creates optimal cutting plans and accurate costings that you can have confidence in. Input panel sizes and materials, MaxCut does the rest…\n\nMaxCut is designed for your growing cabinetry business. An easy to use cutlist optimizer that creates optimal cutting plans and accurate costings that you can have confidence in.\n- Save a fortune on materials! Cut the sheet to its full potential. Avoid costly saw operator mistakes. No more expensive offcuts lying around your workshop or in the bin.\n- Accurate quotations. Generate cabinetry quotations quickly, accurately and efficiently, knowing you have the right price and the correct number of sheets for the job every time.\n- All the reports you need. Print to email cut lists, supplier order lists, cabinet labels, professional quotes and more with no extra effort.\nUpdates\n- Grain Match available to all users\n  Grain Matching has been moved out of Experimental Features and is now fully available for general use. This enables easier access, a more consistent experience, and wider adoption across all workflows.\nFixes\n- Correct highlighting for right-click on hyperlinked panels\n  Right-clicking a panel hyperlink now highlights the corresponding panel in the Optimization Layout for quicker navigation and clarity.\n- Sheet dimensions on printed Job Layouts for rotated diagrams\n  Printed Job Layouts maintain clear spacing and accurate placement of sheet measurements, even when the on-screen diagram is rotated or flipped.\n- Re-Optimize prompt when including previously excluded items\n  Re-including input items, or making changes to pricing or other optimization-related settings, now prompts for re-optimization. The Re-optimize button appears when you open the Optimized Sheets tab, keeping results up to date.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.6.1","version":0,"site":"https://maxcutsoftware.com/","source":"MaxCut Software Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}