{"appId":"w:MaxCut.MaxCut","appShortcutName":"MaxCut","appDisplayName":"MaxCut","authorId":"w:winget","releaseTagName":"winget-2.9.6.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An easy to use tool that creates optimal cutting plans and accurate costings that you can have confidence in. Input panel sizes and materials, MaxCut does the rest…\n\nMaxCut is designed for your growing cabinetry business. An easy to use cutlist optimizer that creates optimal cutting plans and accurate costings that you can have confidence in.\n- Save a fortune on materials! Cut the sheet to its full potential. Avoid costly saw operator mistakes. No more expensive offcuts lying around your workshop or in the bin.\n- Accurate quotations. Generate cabinetry quotations quickly, accurately and efficiently, knowing you have the right price and the correct number of sheets for the job every time.\n- All the reports you need. Print to email cut lists, supplier order lists, cabinet labels, professional quotes and more with no extra effort.\nNew Features\nUnique panel numbering across jobs, reports, and labels\n- Each panel in a job is now assigned a unique panel number (for example #1, #2) when it’s created.\n- This identifier is consistently shown across:\n  - Input Item List\n  - On-screen optimization layouts\n  - Optimization layout reports\n  - Label reports\n  - Cutting list reports\n- Panels with quantities greater than one receive one unique ID per panel, and repeated panels in layouts correctly link to multiple IDs.\n- The panel number’s visibility and placement are configurable:\n  - It can be hidden entirely\n  - Shown before the panel name or symbol\n  - Shown after the panel name or symbol\n- A new setting, “Show unique panel number”, has been added under Settings > Layout > Panel Labelling:\n  - Enabled by default for new users\n  - Disabled by default for existing users (to avoid unexpected label changes)\n- This improves traceability across layouts, reports, and labels, reduces labeling errors, and makes it easier to match panels during cutting and assembly.\n\nUpdates\n- New material CSV import option for sub size usage\n  - A new column, Material Sub Size Usage, can now be specified when importing materials:\n    - 0 = Use any number of sub sizes\n    - 1 = Use only for the last sheet\n  - Import behavior is now smarter and safer:\n    - Existing materials keep their current sub size setting if the column is not provided\n    - If the column is provided, the imported value is applied\n    - New materials without the column continue using the existing default behavior\n\nFixes\n- Label “Sheet X of Y” now matches material sheet count\n  - Labels previously showed Y as the total number of sheets in the job, which could be misleading.\n  - Labels now correctly display Y as the total number of sheets for the specific material used by that panel.\n  - This ensures labels align with the optimization layout and makes it easier to identify the correct sheet during production.\n- Successful exports for material names with illegal Windows characters\n  - Materials containing characters like \\ / : * ? \" < > | previously failed to export PNG or DXF files.\n  - These exports now handle such names correctly, preventing the error message:\n    - \"Error Exporting: Illegal characters in path\"\n  - This improves reliability when working with externally sourced or legacy material names.\n- Label print order now matches the optimization diagram\n  - Labels are now printed in the same order they appear in the optimization layout.\n  - This makes it significantly easier to match printed labels to panels during cutting and labeling, reducing mistakes and workflow friction.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.6.2","version":0,"site":"https://maxcutsoftware.com/","source":"MaxCut Software Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}