{"appId":"w:MaxCut.MaxCut","appShortcutName":"MaxCut","appDisplayName":"MaxCut","authorId":"w:winget","releaseTagName":"winget-2.9.6.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An easy to use tool that creates optimal cutting plans and accurate costings that you can have confidence in. Input panel sizes and materials, MaxCut does the rest…\n\nMaxCut is designed for your growing cabinetry business. An easy to use cutlist optimizer that creates optimal cutting plans and accurate costings that you can have confidence in.\n- Save a fortune on materials! Cut the sheet to its full potential. Avoid costly saw operator mistakes. No more expensive offcuts lying around your workshop or in the bin.\n- Accurate quotations. Generate cabinetry quotations quickly, accurately and efficiently, knowing you have the right price and the correct number of sheets for the job every time.\n- All the reports you need. Print to email cut lists, supplier order lists, cabinet labels, professional quotes and more with no extra effort.\nUpdates\n- Grain Match: Rotation Behaviour\n  - Rotation is now disabled on grain-matched panels to preserve the group’s defined grain alignment.\n  - When attempting to rotate a grain-matched panel (either in the panel editor or during optimization), users will now see a clear warning that rotation settings will not affect panels in a Grain Match Group.\n- Quantity Changes on Grain Matched Panels\n  - Panel positions now automatically update when a panel’s Qty is reduced, removing any positions beyond the updated quantity.\n  - Increasing a panel’s quantity (e.g., from 1 to 3) prompts the user to include those panels in the grain match group.\n  - When editing or creating a grain-matched panel while only some of its quantities are included in the group, users are now prompted to add the missing quantities.\n- Grain Match Validation: Group Does Not Fit on Sheet\n  - The Grain Match Group dialog now performs early validation to detect when the group layout cannot fit on the selected sheet.\n  - Panels that cannot be placed are visually marked as invalid.\n  - On save, users receive a clear warning with the option to proceed or cancel.\n  - The grain match group is not placed on the optimization.\n- DXF Export: More Descriptive File Names\n  - DXF exports now use more meaningful file names by default.\n  - Implemented the format: Material – Layout x of y (x occurrences), helping users easily identify files by material and layout sequence.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.6.0","version":0,"site":"https://maxcutsoftware.com/","source":"MaxCut Software Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}