{"appId":"w:maximmax42.CustomRP","appShortcutName":"CustomRP","appDisplayName":"CustomRP","authorId":"w:winget","releaseTagName":"winget-1.19","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Custom Rich Presence (playing status) manager for Discord. Features run on startup and minimizing to tray.\n\n\nChanges:\n- The UI has been refreshed.\n- Supplying your own app ID is now optional (only if you need to upload images as assets).\n- Added Status display type picker to choose which field shows up as the name of your activity in the members list.\n- Added Name field to update name of the activity through CustomRP.\n- Added Details and State URL fields (links that will open up when a user clicks on your details or state text).\n- Added Since last connection timestamp.\n- Added a way to set custom start and end timestamps.\n- Added image URLs fields (links that will open up when a user clicks on your images).\n- Fixed a possible bug when importing presets exported in older versions.\n- Disabled UI elements now look better when using dark mode.\n- Updated Bulgarian, Czech, German, German (CH), French, Hungarian, Italian, Korean, Lithuanian, Dutch, Polish, Slovak, Turkish, Ukrainian (new translators, Black Cat and jostua), Vietnamese, Chinese Simplified (new translator, Aaadddsssvvvavc), Chinese Traditional. You can help translating here.\nThanks to Nekura for drawing a cute headshot of my fursona! If you want to donate monetarily or with an art, you can do so on the website!\n.exe will install the program to %appdata%\\CustomRP; .zip is a portable version of the program.\nAppVeyor Build 239","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.19","version":0,"site":"https://www.maximmax42.ru/","source":"maximmax42","license_or_tos":"MIT","resources":null,"verified":false}