{"appId":"w:MicroDicom.DICOMViewer","appShortcutName":"MicroDicom DICOM Viewer","appDisplayName":"MicroDicom DICOM Viewer","authorId":"w:winget","releaseTagName":"winget-2025.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.microdicom.com/downloads/Software/MicroDicom-2025.3-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free DICOM viewer for primary processing and preservation of medical images in DICOM format.\n\nMost of the available commercial software for manipulation of DICOM images is expensive by itself or distributed with expensive medical machinery. Free software packages on the other side are often non-intuitive and with limited functionality. There is a common situation for the user when more than one package is needed to achieve feasible results.\nThe subject of the presented work is the design and implementation of a software package aimed to overcome the problem stated above. MicroDicom DICOM Viewer is equipped with most common tools for manipulation of DICOM images, and it has an intuitive user interface. It also has the advantage of being free for use and accessible to everyone.\nFeatures:\n- Open and save medical images in DICOM format\n- Read DICOM files of any manufacturer and modality\n- Supported DICOM images - without compression and RLE, JPEG Lossy, JPEG Lossless, JPEG 2000 Lossy, JPEG2000 Lossless compressions\n- Structured Reports\n- MPEG-2 and MPEG-4 transfer syntaxes\n- Encapsulated PDF\n- Open DICOM directory files\n- Display patient list from DICOMDIR\n- Load via drag & drop or double-click\n- Open images in common graphic formats (JPEG, BMP, PNG, GIF, TIFF)\n- Convert DICOM images to JPEG, BMP, PNG, GIF, TIFF\n- Convert DICOM images to movie file format(AVI, WMV and MP4)\n- Copy DICOM image to clipboard\n- Anonymize DICOM images\n- Image orientation in overlay\n- Mouse-driven level-window, user-defined window presets\n- Zooming and panning\n- Medical image processing operation\n- Measurements and annotations\n- Brightness/contrast control\n- Image resize, Rotate, Flip, Invert\n- Displaying DICOM attributes of selected image\n- Suited for patient CD/DVD to show DICOM images without installation\n- Run on Windows Vista, Windows 7, Windows 8, Windows 8.1, Windows 10 and Windows 11\n- Available for x86 and x64 platforms\n- Portable version\n- And much more\n- New features:\n  Apply wildcard settings when download from a DICOM server via command line.\n  Make ability to apply color map on export, copy to clipboard and printing.\n  Added Preferred transfer syntax for receiving DICOM images.\n  Set MaxReceivePDULength to 65536 for better downloading and sending image to and from DICOM server.\n  Refactoring.\n  Added synchronization of inverted images when windowing synchronization is turned on. Also, all images from PET modality are inverted by default.\n  When open containing folder on a file in DICOM browser, have to select file in Windows explorer.\n  Added color map to common images.\n  Anonymize don't have to make Patient folder with name, id or birthday.\n- Defect fixing:\n  Fixed a crash related with security issue Case VU#980101.\n  Fixed a crash in scanning DICOM images.\n  Fixed windowing in MPR to be taken from the original series.\n  Fixed an issue with Custom tag values in the Download from the DICOM server dialog.\n  Fixed an issue with invert of an image from a series.\n  Fixed an issue with not restoring toolbars and panes after full-screen.\n  Fixed an issue with display information in the DICOM browser and remove modality from comparing studies.\n  Fixed a crash when default view is database view and show split screen.\n  Fixed a crash in MPR.\n  Fixed a defect with adding downloaded files from C-GET, that are used to refresh the DICOM browser.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.3","version":0,"site":"https://www.microdicom.com/","source":"MicroDicom","license_or_tos":"Proprietary","resources":null,"verified":false}