{"appId":"w:MicroDicom.DICOMViewer","appShortcutName":"MicroDicom DICOM Viewer","appDisplayName":"MicroDicom DICOM Viewer","authorId":"w:winget","releaseTagName":"winget-2025.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.microdicom.com/downloads/Software/MicroDicom-2025.4-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free DICOM viewer for primary processing and preservation of medical images in DICOM format.\n\nMost of the available commercial software for manipulation of DICOM images is expensive by itself or distributed with expensive medical machinery. Free software packages on the other side are often non-intuitive and with limited functionality. There is a common situation for the user when more than one package is needed to achieve feasible results.\nThe subject of the presented work is the design and implementation of a software package aimed to overcome the problem stated above. MicroDicom DICOM Viewer is equipped with most common tools for manipulation of DICOM images, and it has an intuitive user interface. It also has the advantage of being free for use and accessible to everyone.\nFeatures:\n- Open and save medical images in DICOM format\n- Read DICOM files of any manufacturer and modality\n- Supported DICOM images - without compression and RLE, JPEG Lossy, JPEG Lossless, JPEG 2000 Lossy, JPEG2000 Lossless compressions\n- Structured Reports\n- MPEG-2 and MPEG-4 transfer syntaxes\n- Encapsulated PDF\n- Open DICOM directory files\n- Display patient list from DICOMDIR\n- Load via drag & drop or double-click\n- Open images in common graphic formats (JPEG, BMP, PNG, GIF, TIFF)\n- Convert DICOM images to JPEG, BMP, PNG, GIF, TIFF\n- Convert DICOM images to movie file format(AVI, WMV and MP4)\n- Copy DICOM image to clipboard\n- Anonymize DICOM images\n- Image orientation in overlay\n- Mouse-driven level-window, user-defined window presets\n- Zooming and panning\n- Medical image processing operation\n- Measurements and annotations\n- Brightness/contrast control\n- Image resize, Rotate, Flip, Invert\n- Displaying DICOM attributes of selected image\n- Suited for patient CD/DVD to show DICOM images without installation\n- Run on Windows Vista, Windows 7, Windows 8, Windows 8.1, Windows 10 and Windows 11\n- Available for x86 and x64 platforms\n- Portable version\n- And much more\n- New features:\n  Added DICOMWeb support.\n  Added command: Open all MPR planes in split view.\n  Added command: Copy linked files to database folder.\n  Added command: Get current database info.\n  Added command: Delete current database.\n  Added Open Multiple Series dialog.\n  Added command: Open all series of the current patient.\n  Added ability to add DICOM tags in the Export to DICOM dialog.\n  Added ability to add DICOM tags when exporting JPG images to DICOM via batch.\n  Added ability to view all items of the Pixel Data tag.\n- Improvements:\n  Updated the manual.\n  Faster sending to PACS via standard DICOM protocol.\n  Improved DICOM browser pane behavior when selecting an image for the first time.\n  Improved importing into the database and the database view.\n  Reworked database import workflow when receiving images from a server.\n  Improved the DICOM server list.\n  Updated various strings in the Network Activity pane.\n  Additional improvements to the Network Activity pane.\n  Improved MPR loading.\n  Improved context menu of the DICOM browser.\n  Removed highlight from the Play/Pause button in Pause mode to avoid issues in split-screen mode.\n  Improved cine toolbar updates.\n  Fixed flickering in the DICOM browser pane and made keyboard navigation smoother. Also fixed keyboard handling in the DICOM tags pane.\n  Improved display of short file names throughout the UI.\n  Trimmed leading/trailing spaces when entering name, e-mail, or serial number in the Registration dialog.\n  Anonymization no longer creates a patient folder based on name, ID, or birth date.\n- Defect fixing:\n  Fixed an issue loading multiframe files where orientation was located in the Detector Information sequence.\n  Fixed a crash in the Network Activity pane.\n  Fixed PACS sending issues and improved DICOMWeb sending performance.\n  Fixed a search (find) edit issue in the DICOM browser pane.\n  Fixed selection issues with MPR series in the DICOM browser.\n  Fixed exporting DICOM files larger than 2 GB.\n  Fixed a regression causing MPR freezing on Windows 7.\n  Fixed a regression related to application behavior.\n  Each downloaded study now starts in a separate query - fixes issues when downloading multiple studies at once from ClearCanvas servers.\n  Removed loading of downloaded images on startup and during document refresh.\n  Fixed a crash occurring in MPR.\n  Fixed a defect when adding downloaded files via C-GET that were used to refresh the DICOM browser.\n  Fixed a multithreading issue in Copy to Folder when files with the same names exist in different series.\n  Fixed a regression where only series selection failed when the series were hidden in the DICOM browser.\n  Fixed a regression where context menus did not hide in the DICOM browser pane and the Tag pane.\n  Fixed synchronization issues in series and fusion modes.\n  Fixed synchronization by slice position.\n  Fixed issues in the Export to DICOM dialog.\n  Fixed hidden text in list control headers.\n  Fixed a defect where the application font would switch to a bold font after running for several hours.\n  Fixed handling of DICOM scanning in folders with very long path names.\n  Fixed unnecessary updates of the DICOM browser and DICOM pane when changing only an image frame.\n  Fixed a crash while loading data in the DICOM tags pane.\n  Fixed an issue with anonymizing nested tags.\n  Fixed an issue involving two Pixel Data tags.\n  Fixed a toolbar corruption issue when adding new tools.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.4","version":0,"site":"https://www.microdicom.com/","source":"MicroDicom","license_or_tos":"Proprietary","resources":null,"verified":false}