{"appId":"w:Microsoft.PIX","appShortcutName":"Microsoft PIX","appDisplayName":"Microsoft PIX","authorId":"w:winget","releaseTagName":"winget-2509.25","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.microsoft.com/download/6af3c4fa-0513-4e0e-a781-1126df3211a1/PIX-2509.25-Installer-x64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.microsoft.com/download/6af3c4fa-0513-4e0e-a781-1126df3211a1/PIX-2509.25-Installer-ARM64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Performance tuning and debugging for DirectX 12 games on Windows\n\n\nToday we released PIX version 2509.25, which can be downloaded here. This release includes everything in the previous 2507.11 release, plus:\n- A compatibility fix to make PIX work on Windows 11 24H2 or 25H2 with KB5065789 (KB released 24 Sept 2025)\n- An updated AMD plugin with better data accuracy and new hardware support (including ROG Xbox Ally devices)\n- Support for new features in today’s DirectX Agility SDK release\n- Misc bug fixes + improvements\nPatch Tuesday Compatibility Fix\nTL;DR: If you are hitting errors where PIX says that it can’t enable experimental features, then please update to PIX 2509.25 and try again.\nMore details: Windows 11 update KB5065789, initially released as a preview on 9/24/2025, updates the system32 copy of D3D12Core.dll to be roughly the same as DirectX Agility SDK 616.1. That new Agility SDK introduced a breaking change to the D3D12EnableExperimentalFeatures() API: it is no longer valid to call that API in a non-preview Agility SDK. Unfortunately PIX builds prior to 2509.25 unconditionally try to turn on some experimental features, so they hit errors after KB5065789 is installed. This is fixed in PIX 2509.25 and later.\nUpdated AMD Plugin\nThis release includes a new AMD plugin, which exposes hardware-specific functionality such as counter data inside PIX. The new plugin includes:\n1. Support for new devices, including the ROG Xbox Ally and ROG Xbox Ally X devices\n2. Greatly improved accuracy of counter and occupancy data on the GPU Capture timeline, on all AMD devices\nMany thanks to our partners at AMD for their work and support!\nSupport for new Agility SDK Features\nToday the DirectX team released DirectX Agility SDK version 618. This primarily includes support for new Advanced Shader Delivery (ASD) tooling. This tooling is independent of PIX, so today’s PIX build doesn’t include new corresponding functionality. However, PIX is fully compatible with all new Advanced Shader Delivery APIs, and in the future we will add PIX features to make it easier to integrate ASD into your application – such as showing ASD cache misses in Timing Captures. Stayed tuned to this blog for more updates in the coming months!\nAgility SDK 618 also promotes several features out of preview, and today’s PIX release includes full support for them. These features include:\n- Application-Specific Driver State\n- Recreate-At-GPUVA\n- Tight Alignment\nThe first two features were added to D3D specifically to improve capture/replay accuracy in tools like PIX:\n- Application-Specific Driver State: this captures an opaque blob from the driver that represents any app-specific settings or workarounds enabled by the driver. PIX then passes this blob back to the driver at replay-time, so that the driver can apply the same settings or workarounds. This improves capture/replay reliability on many drivers.\n- Recreate-At-GPUVA: during playback, this feature lets PIX recreate buffers at exactly the same GPUVA as they used at capture time. This means that features that use GPU buffers that contain GPUVAs, such as ExecuteIndirect argument buffers or DXR Shader Tables, can be replayed more easily and accurately.\nThese features are turned off by default in PIX, but they can be enabled via the Settings page. They will be turned on by default in a future version of PIX.\nMisc Bug Fixes + Improvements\nGPU Captures (capture time)\n- Fix capture-time crash when buffer is created in UAV state but without the ALLOW_UAV flag\n- Fix capture-time issue with deadlock during resource destruction\nGPU Captures (replay time)\n- Show DiscardResource() resources in Pipeline View and Resource History\n- Event List: Fix scroll resetting after first expansion of a PIX event\n- Shader debugger: enable viewing of typedefed values\n- Custom visualizers: support multiple CBVs from a single resource\n- DXR Invocations: fix issue when shaders with different global root signature are used in same state object\n- Timeline: add ability to remove counter lane from context menu\n- Timeline: add shortcut for zoom to selected range\n- Acceleration Structure viewer: add some camera options to the Camera panel, not just the toolbar\n- State view: Fix “D3D12_STENCIL_OP_DECR” display (was showing as INCR)\n- Settings: add option to disable HLSL colorization\n- Settings: fix broken Diff Tool option\n- Settings: fix MaxGpuCaptureFrameCount slider\nTiming Captures\n- Timing Captures: fix cputimes virtual table execution and stall calculations\n- Timing Captures: fix sporadic crash when opening a capture\nMisc\n- Fix maximized window getting cut off with taskbar on some PCs\n- Don’t immediately close PIX when Alt+F4 is hit, if there are unsaved documents\n- Launch page: align recents page to the left, instead of center","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2509.25","version":0,"site":"https://www.microsoft.com/","source":"Microsoft Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}