{"appId":"w:Microsoft.PowerAutomateDesktop","appShortcutName":"Power Automate for desktop","appDisplayName":"Power Automate for desktop","authorId":"w:winget","releaseTagName":"winget-2.65.00145.26040","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.microsoft.com/download/8d57003b-c928-4ddd-b763-a5b259ad8275/Setup.Microsoft.PowerAutomate.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Automate workflows across modern and legacy applications on your desktop by recording actions such as mouse and keyboard clicks.\n\nDesktop flows broaden the existing robotic process automation (RPA) capabilities in Power Automate and enable you to automate all repetitive desktop processes. Automating is quicker and easier than ever with the new intuitive Power Automate desktop flow designer using the prebuilt drag-and-drop actions or recording your own desktop flows to run later.\nDesktop flows are addressed to essentially everyone who is performing simple or complex rule-based tasks on their workstations. Users at home, small businesses, enterprises, or larger companies can leverage automation capabilities in Power Automate to create flows, interact with everyday tools like email and Excel, or work with modern and legacy applications. Examples of simple and complex tasks you can automate are:\n- Quickly organize your documents using dedicated files and folders actions\n- Accurately extract data from websites and store them in Excel files using web and Excel automation\n- Apply desktop automation capabilities to put your work on autopilot\nIf you're a home user who is accessing a weather website to see tomorrow's forecast or a self-employed businessperson extracting information from vendors' invoices or even an employee of a large enterprise who automates data entry on an ERP system, Power Automate is designed for you.\nIt allows you to automate both legacy applications, such as terminal emulators, modern web and desktop applications, Excel files, and folders. You can interact with the machine using application UI elements, images, or coordinates.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.65.00145.26040","version":0,"site":"https://www.microsoft.com/","source":"Microsoft Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}