{"appId":"w:MiTeC.ProjectMaker","appShortcutName":"MiTeC Project Maker","appDisplayName":"MiTeC Project Maker","authorId":"w:winget","releaseTagName":"winget-1.9.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.mitec.cz/wp/files/PMInstall.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Tool for batch Delphi project building, code signing, version info patching and many other tasks\n\nMiTeC Project Maker is tool for automated batch Delphi projects building. With Project Maker, you can set compiler and its configuration, define actions processed before and after building, patch version information of built binary, sign this binary with specified certificate, apply 3rd-party software protection and many more.\n\nMiTeC Project Maker offers clear powerful interface for project building task definition. Every project can contain unlimited number of tasks. Task represents Delphi project, defined in dpr or dproj file. In addition Project Maker features Profiles, where you can define common properties for project. The project can have unlimited number of profiles. Using profiles you can simply switch between variety of build configurations.\n\nMiTeC Project Maker is targeted on developers who need to make various build scenarios and make repeated actions automatic. Project Maker is simple but powerful and provides one-click building of very complex and dependent projects.\n\nIt is compatible with Borland Delphi 5-8, CodeGear Delphi 2005-2007, 2010 and Embarcadero Delphi XE-D12 (32bit and 64bit where applicable).\n\nFull featured 30-day trial version\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.9.0","version":0,"site":"https://www.mitec.cz/","source":"MiTeC","license_or_tos":"Proprietary","resources":null,"verified":false}