{"appId":"w:mlocati.GetText","appShortcutName":"gettext + iconv","appDisplayName":"gettext + iconv","authorId":"w:winget","releaseTagName":"winget-1.0+1.18+r2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/mlocati/gettext-iconv-windows/releases/download/v1.0-v1.18-r2/gettext1.0-iconv1.18-shared-64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GNU gettext and GNU iconv tools\n\nThis package provides the GNU gettext and GNU iconv tools for Windows, which are used for internationalization and localization of software applications.\n\nThe GNU gettext tools include the following command-line utilities used for managing translation files and generating localized resources:\n\n- gettext: display native language translation of a textual message\n- msgattrib: filters the messages of a translation catalog according to their attributes, and manipulates the attributes\n- msgcat: concatenates and merges the specified PO files\n- msgcmp: compare two Uniforum style .po files to check that both contain the same set of msgid strings\n- msgcomm: find messages which are common to two or more of the specified PO files\n- msgconv: convert a translation catalog to a different character encoding\n- msgen: create an English translation catalog\n- msgexec: apply a command to all translations of a translation catalog\n- msgfilter: apply a filter to all translations of a translation catalog\n- msgfmt: generate binary message catalog from textual translation description.\n- msggrep: extract all messages of a translation catalog that match a given pattern or belong to some given source files\n- msginit: create a new PO file, initializing the meta information with values from the user's environment\n- msgmerge: merge two Uniforum style .po files together\n- msgpre: pretranslate a translation catalog\n- msgunfmt: convert a binary message catalog to Uniforum style .po file\n- msguniq: unify duplicate translations in a translation catalog\n- ngettext: display native language translation of a textual message whose grammatical form depends on a number\n- recode-sr-latin: recode Serbian text from Cyrillic to Latin script\n- spit: pass standard input to a Large Language Model (LLM) instance and prints the response\n- xgettext: extract translatable strings from given input files\n\nThe GNU iconv tool is used for converting text between different character encodings.\n\nThe package comes with Unicode CLDR data, which is used by msginit to create translation catalogs with the plural rules defined in CLDR (this requires setting the GETTEXTCLDRDIR environment variable to the path of the CLDR data).\n## Components\n* gettext 1.0\n* iconv 1.18\n* libcurl 8.18.0\n* libjson-c 0.18\n* CLDR 48.1            \n\n\n## What's Changed\n* Allow publishing new releases with workflow_dispatch events by @mlocati in https://github.com/mlocati/gettext-iconv-windows/pull/71\n* Don't include curl/json-c stuff in dev archives by @mlocati in https://github.com/mlocati/gettext-iconv-windows/pull/72\n\n\n**Full Changelog**: https://github.com/mlocati/gettext-iconv-windows/compare/v1.0-v1.18-r1...v1.0-v1.18-r2","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0+1.18+r2","version":0,"site":"https://github.com/mlocati/gettext-iconv-windows","source":"Michele Locati","license_or_tos":"MIT","resources":null,"verified":false}