{"appId":"w:MoonchildProductions.PaleMoon","appShortcutName":"Pale Moon","appDisplayName":"Pale Moon","authorId":"w:winget","releaseTagName":"winget-34.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://rm-eu.palemoon.org/release/palemoon-34.0.0.win64.installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The best browser with fast site rendering, advanced privacy, a sleek design and innovative features.\n\nPale Moon is an Open Source, Goanna-based web browser available for Microsoft Windows and Linux (with other operating systems in development), focusing on efficiency and ease of use.\nPale Moon offers you a browsing experience in a browser completely built from its own, independently developed source that has been forked off from Firefox/Mozilla code a number of years ago, with carefully selected features and optimizations to improve the browser's stability and user experience, while offering full customization and a growing collection of extensions and themes to make the browser truly your own.\nThis is a new milestone release! There are many changes in this milestone; the most important ones are highlighted here.\n\nNew features:\n- Our default theme on Windows received a refresh and update. It should integrate better with Windows 11 now, and be more responsive to dark accent colors, among other things.\n- Implemented WeakRef. See implementation notes.\n- Implemented URL.canParse().\n- Implemented the inset-block and inset-inline CSS shorthands.\n- Added a preference (privacy.forgetaboutsite.clearPasswords) to control clearing of passwords when using \"forget about this site\" in the permissions manager, and disabled clearing of passwords by default, since it was considered unexpected behavior by the community.\n- Changed our JavaScript PRNG to Xoroshiro128++ to make it more robust while keeping high performance.\nImportant updates and fixes:\n- Re-landed CSS Cascade Layers support after the previous back-out.\n- Re-landed CSS color-mix support after the previous back-out. RGB and HSL color spaces only, like previous.\n- Implemented viewport overflow propagation logic. See implementation notes.\n- Unprefixed CSS -moz-appearance; Pale Moon now accepts the unprefixed CSS appearance keyword. For compatibility, -moz-appearance and -webkit-appearance (if enabled) have been retained, although the long-term plan is to eventually remove the -moz prefixed one, so if you are an extension or theme developer, please consider switching your CSS to use appearance without a prefix.\n- Fixed an intermittent but fairly prominent crash-to-desktop due to JavaScript garbage collection on certain modern sites.\n- Fixed a crash on sites with certain types of CSP handling.\n- Fixed a crash in WASM.\n- Updated NSS to 3.90.9 (custom) to pick up several security and stability fixes.\n- Updated ICU to v78.1. This is a major uplift for our internationalization subsystem, allowing further future developments for the Internationalization API.\n- Updated Emoji support to Unicode 17.\n- Updated our expat parser code to a more recent version (2.7.3), fixing various issues.\n- Improved handling and rendering of emoji clusters.\nOther changes:\n- Added support for building on Sparc64 hardware.\n- Added support for building for NetBSD on Alpha.\n- Added basic support for building on Mac PowerPC (still a work in progress).\n- Added basic support for building on LoongArch64 hardware (龍芯 CPUs).\n- Added support for running on FreeBSD 15.\n- Removed automatic coloring of auto-filled login fields as it would interfere with various browser and system color schemes.\n  If preferred, this can be reinstated by users with a userContent.css document or e.g. the Stylem extension by leveraging the :autofill CSS pseudo-class.\n- Restored support for in-process NPAPI plugins, allowing plugin use on systems where out-of-process is undesirable.\n- Improved JavaScript IonMonkey stability on ARM and Mac SoC hardware.\n- Linux GTK builds now always build with gio, and gconf support has been removed.\n- Security issues addressed: CVE-2025-13015, CVE-2026-0879 (DiD), CVE-2026-0880 (DiD), CVE-2026-0889 (DiD), CVE-2026-0883, CVE-2026-0886 (DiD), and several others without a CVE designation.\nImplementation notes:\n- This milestone implements WeakRef in the platform in 2 modes, controlled by a new preference javascript.options.weakrefs. In the default mode (false), WeakRef does not allow page content to reach into the JavaScript engine to coerce garbage collection, while still offering the front-end API to web content (effectively creating a stub). The other mode (true) allows this coersion and gives potentially malicious web scripting some* control over the JavaScript garbage collector. It is not recommended to set this to true for general use. Only enable this if your situation is running trusted code and explicitly requires nudging the JavaScript engine to dereference objects. We resisted having this strongly discouraged and potentially dangerous API at all, but some sites started to use WeakRef unconditionally and breaking without the API front-end, so this compromise was implemented, leaving control in the hands of the user.\n  * The spec only allows for code to hint/coerce and does not guarantee if or when dereferencing happens.\n- A number of sites (including some top Internet sites) have started using overflow-x: clip without overflow-y on full-document elements (document root/<html> or <body>). While doing this makes little to no logical sense, our strict implementation of clip (since 33.9.0, also see the implementation notes there) would, as a result, create unscrollable pages.There is some special logic for this (viewport overflow propagation) described in the relevant drafts which we have now implemented, updating our overflow: clip implementation to avoid the previously problematic strict behaviour in these particular cases.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"34.0.0","version":0,"site":"https://www.palemoon.org/","source":"Moonchild Productions","license_or_tos":"MPL-2.0","resources":null,"verified":false}