{"appId":"w:MoritzBunkus.MKVToolNix","appShortcutName":"Winget Application","appDisplayName":"MKVToolNix","authorId":"w:winget","releaseTagName":"winget-90.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://mkvtoolnix.download/windows/releases/90.0/mkvtoolnix-64-bit-90.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"MKVToolNix is a set of tools to create, alter and inspect Matroska files under Linux, other Unices and Windows.\n\n\nNew features and enhancements\n- MKVToolNix GUI: header editor: double-clicking on one of the three flag indicators (\"Default track\", \"Forced display\", \"Enabled\") for a track in the tree view will now toggle the corresponding flag. Implements #3773.\n\nBug fixes\n- mkvmerge: AAC parser: LOAS/LATM streams: fixed use of uninitialized data when the StreamMuxConfig element doesn't contain the audioMuxVersion element; version 0 must be assumed in such a case. The result was that sometimes certain valid AAC packets were dropped. Fix by Stefan Pöschel.\n- mkvmerge: HEVC/H.265 parser: fixed calculation of picture order count calculation that was triggered under rare circumstances. Fixes #3775.\n- mkvmerge: Matroska reader: enabled limits for how much data a single Matroksa reader instance might buffer when the muxing core looks for packets for specific tracks, avoiding huge memory consumption in cases where tracks have huge gaps between packets. This might happen when appending files containing forced-only subtitle tracks, for example. Fixes #3771.\n- mkvmerge: TrueHD reader: increased the probe range for TrueHD sync frames from 128 KB to 512 KB to avoid mis-detection with certain files with a lot of data between sync frames. Fixes #3783.\n- mkvmerge: MP4/QuickTime reader: fixed detection of Big Endian LPCM audio. Fixes #3788.\n\nBuild system changes\n- The bundled fmt library was updated to v11.1.2.\n- added a new option to configure called --disable-dbus to disable looking for & using QtDBus even if it's present on the system. Default remains to probe for its existence. Patch by Anthony Ryan.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"90.0.0","site":"https://www.bunkus.org/","source":"Moritz Bunkus","license_or_tos":"GPL-2.0","resources":null,"verified":false}