{"appId":"w:Movavi.MovaviPhotoManager","appShortcutName":"Movavi Picverse","appDisplayName":"Movavi Picverse","authorId":"w:winget","releaseTagName":"winget-2.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cs18.movavi.com/dl/MovaviPhotoManagerSetup_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Keep your photos organized\n\nWant to know how to organize photos into folders with no effort? Movavi is developing a new program that is designed to help you save time when managing your digital photo collection. You will be able to easily create albums and sort them by date and location. This photo organizing software for Windows and Mac also offers basic editing tools.\nSearching through photos on your PC will no longer take all your time. The program will filter all your images while you sit back and relive those precious moments with your family or share vacation photo collections with your friends.\nThe photo organizer from Movavi will be an essential tool for anyone who values their time as well as their photo collection.\n- New People tab: here you can find automatically created albums by people in your photos. Easily find all the photos with a specific person on it.\n- Backup copying. Now you can backup your photo archive and transfer it to another computer. Or save it in a safe place in case of data loss.\n- Photo Editor got smarter and now better recognizes objects in photos. Simply type in a search, for example, \"cat\" to find all the photos in this category.\n- Lots of small but important tweaks for your convenience.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0.0","version":0,"site":"https://www.movavi.com/","source":"Movavi","license_or_tos":"Proprietary","resources":null,"verified":false}