{"appId":"w:Mozilla.Firefox","appShortcutName":"Mozilla Firefox (en-US)","appDisplayName":"Mozilla Firefox (en-US)","authorId":"w:winget","releaseTagName":"winget-147.0.3","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/147.0.3/win64-aarch64/en-US/Firefox%20Setup%20147.0.3.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/147.0.3/win64/en-US/Firefox%20Setup%20147.0.3.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.\n\nFirefox Browser, also known as Mozilla Firefox or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. Firefox uses the Gecko layout engine to render web pages, which implements current and anticipated web standards. In 2017, Firefox began incorporating new technology under the code name Quantum to promote parallelism and a more intuitive user interface. Firefox is officially available for Windows 7 or newer, macOS, and Linux. Its unofficial ports are available for various Unix and Unix-like operating systems including FreeBSD, OpenBSD, NetBSD, illumos, and Solaris Unix.\nNew\n- Interoperability improvements for the CSS anchor positioning and Navigation web APIs.\nFixed\n- Fixed a regression where position: sticky elements on some webpages could appear stuck or fail to update while mousewheel-scrolling after certain :hover interactions. (Bug 2010481)\n- Fixed an issue where the Firefox Developer Tools could fail to re-open after using the Inspector’s node picker and reloading a page containing cross-origin iframes. (Bug 2003810)\n- Fixed an issue where the DNS over HTTPS provider settings section could appear as a blank box, preventing users from seeing the current setting or changing it. (Bug 2010501)\n- Fixed an issue on Windows systems with a large number of fonts installed where parts of the Firefox UI (tabs, menus, and Settings) could display garbled characters or symbols instead of readable text. (Bug 2012950)\n- Reference link to 147.0.2 release notes.\nUnresolved\n- On Linux (Wayland) systems, certain popups and context menus will sometimes open in the wrong place, such as the top-left corner of the window. Firefox 147.0.3 has a partial mitigation for this problem and remaining instances will be addressed in a future release. (Bug 2003045)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"147.0.3","version":0,"site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}