{"appId":"w:Mozilla.Firefox","appShortcutName":"Winget Application","appDisplayName":"Mozilla Firefox","authorId":"w:winget","releaseTagName":"winget-137.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/137.0/win64/en-US/Firefox%20Setup%20137.0.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/137.0/win64-aarch64/en-US/Firefox%20Setup%20137.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.\n\nFirefox Browser, also known as Mozilla Firefox or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. Firefox uses the Gecko layout engine to render web pages, which implements current and anticipated web standards. In 2017, Firefox began incorporating new technology under the code name Quantum to promote parallelism and a more intuitive user interface. Firefox is officially available for Windows 7 or newer, macOS, and Linux. Its unofficial ports are available for various Unix and Unix-like operating systems including FreeBSD, OpenBSD, NetBSD, illumos, and Solaris Unix.\nNew\n- Tab groups begin rolling out today! Stay productive and organized with less effort by grouping related tabs together. One simple way to create a group is to drag a tab onto another, pause until you see a highlight, then drop to create the group. Groups can be named, color-coded, and are always saved. You can close a group and reopen it later.\n\n  This feature is part of a progressive roll out.\n  What is a progressive roll out?\n  Certain new Firefox features are released gradually. This means some users will see the feature before everyone does. This approach helps to get early feedback to catch bugs and improve behavior quickly, meaning more Firefox users overall have a better experience.\n- Firefox Address Bar Refresh 2025 - new ways to search for things new, previously viewed, and more - all from the address bar:\n  Features\n  Unified Search Button: A new, easy-to-access button in the address bar helps you switch between search engines and search modes with ease. This feature brings the simplicity of mobile Firefox to your desktop experience.\n\n  Search Term Persistence: Now when you refine a search in the address bar, the original term sticks around, making it easier to adjust your queries and find exactly what you're looking for.\n\n  Secondary Action Buttons: Suggestions for common Firefox features.\n\n  Contextual Search Mode: Firefox detects if you are on a page that has search capability and offers that option for you to directly search with the page engine from the address bar. Use this option at least 2 times and Firefox will suggest adding the search engine to your Firefox.\n\n  Contextual Search Engine Options: Use a Contextual Search mode option at least 2 times and Firefox will suggest adding the search engine to your Firefox so that it’s always available to you.\n\n  Intuitive Search Keywords: You can access various address bar search modes with convenient and descriptive keywords (e.g. @bookmarks,@tabs,@history, @actions).\n\n  This feature is part of a progressive roll out.\n  What is a progressive roll out?\n  Certain new Firefox features are released gradually. This means some users will see the feature before everyone does. This approach helps to get early feedback to catch bugs and improve behavior quickly, meaning more Firefox users overall have a better experience.\n- Firefox now identifies all links in PDFs and turns them into hyperlinks.\n- Support HEVC playback on Linux.\n- Now you can sign PDFs without leaving Firefox. Save your signatures to re-use later.\n\n  This feature is part of a progressive roll out.\n  What is a progressive roll out?\n  Certain new Firefox features are released gradually. This means some users will see the feature before everyone does. This approach helps to get early feedback to catch bugs and improve behavior quickly, meaning more Firefox users overall have a better experience.\n- You can now use the Firefox address bar as a calculator. Simply type an arithmetic expression and view the result in the address bar drop-down. Clicking on this result will copy it to your clipboard.\n\n  This feature is part of a progressive roll out.\n  What is a progressive roll out?\n  Certain new Firefox features are released gradually. This means some users will see the feature before everyone does. This approach helps to get early feedback to catch bugs and improve behavior quickly, meaning more Firefox users overall have a better experience.\nFixed\n- Various security fixes.\nEnterprise\n- You can find information about policy updates and enterprise specific bug fixes in the Firefox for Enterprise 137 Release Notes.\nDeveloper\n- In the Inspector Fonts panel, we now display fonts metadata, like the font version, designer, vendor, license…\n\n- The Network panel now allows overriding network request responses with local files.\n\nWeb Platform\n- Support for the SVG 2 path API is now available.\n- Support for the hyphenate-limit-chars property is now available. This property enables authors to have greater control over the use of automatic hyphenation.\nCommunity Contributions\n- With the release of Firefox 137, we are pleased to welcome the developers who contributed their first code change to Firefox in this release, 17 of whom were brand new volunteers! Please join us in thanking each of these diligent and enthusiastic individuals, and take a look at their contributions:\n  - [:anutrix]: 1727389, 1948502\n  - abe hanoka: 1930779\n  - ansah: 1882102\n  - Bakir Grbic: 1930780\n  - cpplearner: 1610833\n  - Gintaras Žulys [:gzulys]: 1634662\n  - h.nuchi: 1642310\n  - Hazhar Sabir: 1941949\n  - James Stuckey Weber: 1949953\n  - Jonathan: 1943789\n  - krish.patel: 1267242\n  - Phil [:phigl]: 1701557\n  - qcms upstreamer: 1948768\n  - Steven Novaryo: 1946679\n  - Tan Junjian: 1943846\n  - WANG Xuerui [:xen0n]: 1778177, 1948207","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"137.0","site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}