{"appId":"w:Mozilla.Thunderbird.ESR.uz","appShortcutName":"Mozilla Thunderbird ESR (uz)","appDisplayName":"Mozilla Thunderbird ESR (uz)","authorId":"w:winget","releaseTagName":"winget-140.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/thunderbird/releases/140.3.1esr/win64/uz/Thunderbird%20Setup%20140.3.1esr.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The official annual extended support release of Thunderbird intended for users who want all available new features on an annual basis and stability/security fixes on a monthly basis.\n\nThunderbird is a free and open source email, newsfeed, chat, and calendaring client, that’s easy to set up and customize. One of the core principles of Thunderbird is the use and promotion of open standards - this focus is a rejection of our world of closed platforms and services that can’t communicate with each other. We want our users to have freedom and choice in how they communicate.\nThis is the official annual extended support release. Thie release is intended for users who want all available new features on an annual basis and stability/security fixes on a monthly basis.\nWhat’s Fixed\nfixed\nCertificate viewer tab would not load when opened from exception dialog\nfixed\nLayout inside a pane could cause performance degradation in other panes\nfixed\nThunderbird could crash in various scenarios\nfixed\nAdding an account could fail and cause UI hang\nfixed\nAddress book items with mixed case email addresses were not recognized\nfixed\nNo way to distinguish between Thunderbird Release/ESR in Windows registry\nfixed\nInitial launch had long load times and UI lag while messages downloaded\nfixed\nSending emails via servers with self-signed certificate did not work\nfixed\nOpening Website header link in RSS feed incorrectly re-encoded URL parameters","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"140.3.1","version":0,"site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}