{"appId":"w:Mozilla.Thunderbird","appShortcutName":"Mozilla Thunderbird (en-US)","appDisplayName":"Mozilla Thunderbird (en-US)","authorId":"w:winget","releaseTagName":"winget-147.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/thunderbird/releases/147.0/win64/en-US/Thunderbird%20Setup%20147.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Thunderbird is a free email application that is easy to set up and customize - and it's loaded with great features!\n\nThunderbird is a free and open source email, newsfeed, chat, and calendaring client, that’s easy to set up and customize. One of the core principles of Thunderbird is the use and promotion of open standards - this focus is a rejection of our world of closed platforms and services that can’t communicate with each other. We want our users to have freedom and choice in how they communicate.\nWhat’s New\nnew\nAdd \"Show Full Path\" folder pane option for compact view modes\nnew\nAdd `mail.useLocalizedFolderNames' to toggle special folder name localization\nWhat’s Changed\nchanged\nSpecial folders are now localized based on a restricted set of names\nWhat’s Fixed\nfixed\nSelected status and priority was not displayed in search widgets\nfixed\nCompacting multiple folders failed and did not compact\nfixed\nResetting manual folder sorting did not work for sub folders\nfixed\nUnified archive subfolders could show wrong names and no messages\nfixed\nFolders with deep hierarchy and long folder names could fail to display\nfixed\nMoving saved search/virtual folder under IMAP could fail\nfixed\n\"Open and Show\" for OpenPGP-signed message (.eml) did not work\nfixed\n\"Search Messages\" search did not finish due to unparsable local folders\nfixed\nCompose command line flag no longer worked correctly\nfixed\nSearch for \"Attachment\" in Settings menu did not find \"Files and Attachments\"\nfixed\nAccount Hub did not show error message on failure when creating OAuth2 EWS account\nfixed\nThunderbird could crash during exchange address account setup\nfixed\nJapanese locale users could not create message filters\nfixed\nMoving virtual folder within maildir based IMAP or local folder could fail\nfixed\nThunderbird could crash when marking all messages as read\nfixed\nStartup could be slow with large number of folders not using subscriptions\nfixed\nEWS message send that required a password errored instead of prompting\nfixed\nEWS HTTP 500 backoff errors were not handled gracefully\nfixed\nSMTP sending could hang when when multiple messages queued for sending\nfixed\nThunderbird could crash when emptying EWS trash\nfixed\nBroken feed icon could prevent updating of feeds\nfixed\nCalendar did not alert user for connection issues\nfixed\nCreation of tasks with Start or Due date was not possible\nfixed\nVisual and UX improvements\nfixed\nSecurity fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"147.0","version":0,"site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}