{"appId":"w:Mozilla.Firefox.DeveloperEdition.mr","appShortcutName":"Firefox Developer Edition (mr)","appDisplayName":"Firefox Developer Edition (mr)","authorId":"w:winget","releaseTagName":"winget-144.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/devedition/releases/144.0b5/win64/mr/Firefox%20Setup%20144.0b5.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/devedition/releases/144.0b5/win64-aarch64/mr/Firefox%20Setup%20144.0b5.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Firefox Browser Developer Edition\n\nGet the latest features, fast performance, and the development tools you need to build for the open web using Firefox Browser Developer Edition.\nNew\n- You can now close a Picture-in-Picture window without pausing the video. Press Shift + Click on the close button or use Shift + Esc to exit while keeping playback uninterrupted.\n- Logins in the Firefox Password Manager are now encrypted using a more modern encryption scheme, switching from 3DES-CBC to AES-256-CBC. This change only affects the local encryption of logins on the disk; logins synced through Firefox Sync are end-to-end encrypted independently and have already been using a strong encryption scheme (AES-256-GCM) previously.\nChanged\n- On Windows, when opening a link from another application, Firefox will only use a window on the current virtual desktop or open a new window if needed.\n- On Firefox for Android, the \"Allow screenshots in private browsing\" setting has been removed.\nDeveloper\n\nWeb Platform\n- Firefox now supports the Element.moveBefore API.\n- Firefox now supports math-shift compact.\n- Firefox now supports the WebGPU GPUDevice.importExternalTexture API on Windows.\n- Firefox now supports PerformanceEventTiming.interactionId, allowing developers to group related input events. This enables support for the Interaction to Next Paint (INP) responsiveness metric.\n- Firefox now supports the command and commandfor attributes.\n- Firefox now supports the View Transitions API Level 1. The View Transitions API provides a mechanism for easily creating animated transitions between different website views.\n- The resizeMode getUserMedia constraint is now available, allowing developers to crop and downscale video captured from a camera to any resolution they choose.\n- Dithering is now applied when linear-gradient, conic-gradient, and radial-gradient are rendered using hardware WebRender.\n- Firefox now supports the upsert proposal. This adds getOrInsert and getOrInsertComputed methods to Map and WeakMap. These methods either return the value associated with a key, or insert a default value, and then return that value, simplifying handling of cases where it's not known if a key is already present in the Map or WeakMap.\n- Firefox now supports the lock() and unlock() methods of ScreenOrientation interface on Windows tablets and Android devices.\n- Implemented worker transfer for RTCDataChannel.\n- WebCodecs on Windows now has a batch-encoding path for VideoEncoder, improving performance with higher throughput and lower submission latency due to a larger default batch size.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"144.0","site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}