{"appId":"w:Mozilla.Firefox","appShortcutName":"Mozilla Firefox (en-US)","appDisplayName":"Mozilla Firefox (en-US)","authorId":"w:winget","releaseTagName":"winget-147.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/147.0/win64/en-US/Firefox%20Setup%20147.0.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/147.0/win64-aarch64/en-US/Firefox%20Setup%20147.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.\n\nFirefox Browser, also known as Mozilla Firefox or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. Firefox uses the Gecko layout engine to render web pages, which implements current and anticipated web standards. In 2017, Firefox began incorporating new technology under the code name Quantum to promote parallelism and a more intuitive user interface. Firefox is officially available for Windows 7 or newer, macOS, and Linux. Its unofficial ports are available for various Unix and Unix-like operating systems including FreeBSD, OpenBSD, NetBSD, illumos, and Solaris Unix.\nNew\n- WebGPU support is now enabled for devices with Apple Silicon processors on all supported macOS versions.\n- Improved video playback performance on systems with AMD GPUs by enabling zero-copy playback for hardware-decoded video where supported, bringing them to parity with Intel and NVIDIA GPUs.\n- Firefox now supports the Safe Browsing V5 protocol and is migrating from Safe Browsing V4 to the local list mode of Safe Browsing V5 protocol.\n- Users with Enhanced Tracking Protection (ETP) set to Strict will have local network access restrictions enabled by default. Firefox will now require users to explicitly allow public websites to access local network resources.\n  This feature is part of a progressive roll out.\n  What is a progressive roll out?\n  Certain new Firefox features are released gradually. This means some users will see the feature before everyone does. This approach helps to get early feedback to catch bugs and improve behavior quickly, meaning more Firefox users overall have a better experience.\n- Firefox now supports the Freedesktop.org XDG Base Directory Specification.\n- A Picture-in-Picture player window can now optionally be opened automatically for a video playing in a tab when that tab goes into the background. A special thanks to volunteer Daniele Ferla for contributing this feature!\n\nFixed\n- Fixed an issue that prevented some Windows users from selecting a tab when the cursor was at the top of the screen and the Firefox window was maximized.\n- Fixed a bug that made HTTP/3 requests containing non-UTF-8 header values time out or fall back to HTTP/2 after a while.\n- A draggable button can now be dragged if initiated from the button itself.\n- For Linux GNOME Mutter users, window and rendering surface sizes were updated to match the actual pixel grid so Firefox delivers sharp rendering on fractionally scaled displays regardless of the actual window size.\n- Various security fixes.\nChanged\n- Firefox now uses the same quality values (q-values) in Accept-Language headers as other major browsers. The second language preference is now sent as q=0.9 instead of q=0.5, with subsequent language preferences decreasing by 0.1 each (minimum 0.1). This change fixes compatibility issues with some servers that incorrectly rejected requests with lower quality values.\nEnterprise\n- You can find information about policy updates and enterprise-specific bug fixes in the Firefox for Enterprise 147 Release Notes.\nDeveloper\n- View Transitions: View transition pseudo-elements now appear in the elements panel and the associated animations appear in the animations panel.\n- Anchor positioning: Elements with a valid anchor-name are given an 'anchor' badge in the elements view, and @position-try CSS rules are now displayed in the CSS rules panel when an element using position-try-fallbacks is selected.\n- The JSON viewer now has a button to import the resource into Firefox Profiler to get a breakdown of its size.\n- Pseudo-element selectors can now be added/edited in the CSS rules panel.\nWeb Platform\n- Added support for the Navigation API. This API provides the ability to initiate, intercept, and manage browser navigation actions. It is a successor to previous web platform features such as the History API and window.location, which solves their shortcomings.\n- The Unicode ICU library was updated to release 78, bringing support for Unicode 17 and new locales.\n- ES modules in service workers are now supported, aligning Firefox with other major browsers and improving compatibility for modern web apps.\n- Support for CSS Module Scripts was added, allowing stylesheets to be imported using the JavaScript module system and import attributes.\n- The CSS counter-* and quotes properties are now supported in the ::marker pseudo-element.\n- Both CompressionStream and DecompressionStream now support the Brotli format.\n- Firefox now supports the :active-view-transition-type selector and associated View Transitions API changes.\n- Firefox now exposes the view transition currently active on the document via the Document.activeViewTransition property.\n- Support for CSS anchor positioning was added, enabling tethering elements. The anchor-positioned elements can then have their size and position set relative to the anchor elements to which they are bound.\n- Firefox now supports Storage-Access-Headers, allowing servers to opt into unpartitioned cookies via HTTP headers if storage-access was granted prior to the Storage Access API.\n- Implemented CSS root-font-relative units rcap, rch, rex and ric.\nCommunity Contributions\n- With the release of Firefox 147, we are pleased to welcome the developers who contributed their first code change to Firefox in this release, 14 of whom were brand new volunteers! Please join us in thanking each of these diligent and enthusiastic individuals, and take a look at their contributions:\n  - [:Joe Cardoso] Loan de Deus Vieira Cardoso: 1730474, 1897620\n  - Aaron Kriegman: 1955625\n  - Aloys: 2002985, 2003194\n  - Areeba: 2000792\n  - Daniel Singer: 1895228, 1981571\n  - Dominique: 1995325, 2000957\n  - James Hay: 1864284\n  - Kipchumba Chelilim [:mrchumbastic]: 1905323, 1956817, 1994752\n  - Lorenz A: 983296, 1632071, 1665702, 1709063, 2004038, 2004205\n  - Michal Bozon: 1998963\n  - Scott Venkataraman: 1995324, 1999325\n  - Sick Leviathan: 1362499, 1918733, 1960699\n  - Tom Forbes: 1897424\n  - witty.31.06: 2000613, 2000765","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"147.0","version":0,"site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}