{"appId":"w:Mozilla.Thunderbird","appShortcutName":"Mozilla Thunderbird (en-US)","appDisplayName":"Mozilla Thunderbird (en-US)","authorId":"w:winget","releaseTagName":"winget-144.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/thunderbird/releases/144.0/win64/en-US/Thunderbird%20Setup%20144.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Thunderbird is a free email application that is easy to set up and customize - and it's loaded with great features!\n\nThunderbird is a free and open source email, newsfeed, chat, and calendaring client, that’s easy to set up and customize. One of the core principles of Thunderbird is the use and promotion of open standards - this focus is a rejection of our world of closed platforms and services that can’t communicate with each other. We want our users to have freedom and choice in how they communicate.\nWhat’s Changed\nchanged\nFlatpak runtime has been updated to Freedesktop SDK 24.08\nWhat’s Fixed\nfixed\nCopying text from some error alerts was not possible\nfixed\nFastmail CalDAV app password access failed due to forced OAuth regression\nfixed\nDelete key failed to prevent deleting attachments in OpenPGP messages\nfixed\nNewly created folder was missing under \"Recent\" when moving a message\nfixed\nSender avatar displayed incorrectly for 'Name' via address sender format\nfixed\nSorting by threads only brought threads with unread top messages to the top\nfixed\nNews message marked read after NNTP error prevented retrieval from server\nfixed\nInbox 'Location' column was not translated in French locale installation\nfixed\nNot all headers were signed when creating digitally signed OpenPGP email\nfixed\nUsers could not read mail signed with OpenPGP v6 and PQC keys\nfixed\nTesting a configured personal S/MIME certificate for a sub-identity did not work\nfixed\nTesting an S/MIME certificate did not work for an old invalid certificate\nfixed\nChanging identity in compose window caused modified draft not to be saved\nfixed\nShift-click 'Compose Message To' on 'mailto' link did not open in plain text\nfixed\nImage preview in Insert Image dialog failed with CSP error for web resources\nfixed\nThunderbird could crash in various scenarios\nfixed\n'Copy Message to' action in a newsgroup filter did not work\nfixed\nThunderbird could not import profile located at the top level of zip file\nfixed\nThunderbird did not clearly fail when importing profile from a bad source\nfixed\nNo way to distinguish between Thunderbird Release/ESR in Windows registry\nfixed\nMulti-attachment delete/detach confirmation only cited first attachment\nfixed\nThunderbird hung when auto-checking multiple accounts for new messages\nfixed\nReply All button was missing when using a Microsoft Exchange account\nfixed\nSending emails via servers with self-signed certificate did not work\nfixed\nTask reminders could fail for tasks without end dates or with shifted due dates\nfixed\nCould not copy an event in multiweek or month view by drag-and-drop\nfixed\nCalendar discovery with certificate error displayed multiple exceptions\nfixed\nVisual and UX improvements\nfixed\nSecurity fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"144.0","version":0,"site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}