{"appId":"w:Mozilla.Thunderbird","appShortcutName":"Mozilla Thunderbird (en-US)","appDisplayName":"Mozilla Thunderbird (en-US)","authorId":"w:winget","releaseTagName":"winget-145.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/thunderbird/releases/145.0/win64/en-US/Thunderbird%20Setup%20145.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Thunderbird is a free email application that is easy to set up and customize - and it's loaded with great features!\n\nThunderbird is a free and open source email, newsfeed, chat, and calendaring client, that’s easy to set up and customize. One of the core principles of Thunderbird is the use and promotion of open standards - this focus is a rejection of our world of closed platforms and services that can’t communicate with each other. We want our users to have freedom and choice in how they communicate.\nWhat’s New\nnew\nEnable support for DNS over HTTPS\nnew\nAccount Hub email manual config option added\nnew\nAdd manual configuration to EWS account creation\nnew\nEnable support for Microsoft Exchange via Exchange Web Services\nWhat’s Changed\nchanged\nSkype has been retired and therefore dropped from Address book IM selection\nchanged\nRemoved pref default_supports_diskspace.{HOST}\nchanged\nRemoved pref default_offline_support_level.{HOST}\nchanged\nUse of the string \"Junk\" has been replaced with \"Spam\"\nchanged\nStop shipping 32-bit Linux x86 binaries\nWhat’s Fixed\nfixed\n'Save All' attachments with same names overwrote existing files without warning\nfixed\nMessage headers were re-downloaded at every startup\nfixed\nCould not drag and drop ICS file to Today Pane\nfixed\n'Show remote content' did not display remote content for EML message\nfixed\nEmoji sequences were not properly handled in subject lines\nfixed\nUnified toolbar Spam button did not switch to \"Not Spam\" when spam message selected\nfixed\nUpgrading Thunderbird hid the Menu bar\nfixed\nWhen configuring external GnuPG, user was not promted to import public key\nfixed\nMessage compose window could incorrectly disappear from Task Bar on Windows\nfixed\nAdd-on account creation did not work with Account Hub\nfixed\nOwl install did not show link to website in Account Hub\nfixed\nUsername field did not appear in Account Hub when exchange authentication failed\nfixed\nDisabled inputs could be toggled in Account Hub address book\nfixed\nManual account setup in Account Hub defaulted Connection Security to None\nfixed\nClose button from Account Hub was not narrated\nfixed\nAccount Hub email creation error notifications were not narrated\nfixed\nUsers could not disable spinning overlay in Account Hub for email\nfixed\nDeleted account data remained in \"Export to mobile device\" menu\nfixed\n'Sent' and 'Spam' folders were not always created when setting up new IMAP accounts\nfixed\nSome third-party hosted accounts could not be created in Account Hub\nfixed\nAccount Hub allowed keyboard shortcuts to be executed in background screen\nfixed\nSpam was not checked with mail.server.default.check_all_folders_for_new on\nfixed\nUpgrade from 128.x->140.x broke authentication for @att.net using Yahoo backend\nfixed\nTask reminders could fail for tasks without end dates or with shifted due dates\nfixed\nVisual and UX improvements\nfixed\nSecurity fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"145.0","version":0,"site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}