{"appId":"w:Mozilla.Thunderbird","appShortcutName":"Mozilla Thunderbird (en-US)","appDisplayName":"Mozilla Thunderbird (en-US)","authorId":"w:winget","releaseTagName":"winget-148.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/thunderbird/releases/148.0/win64/en-US/Thunderbird%20Setup%20148.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Thunderbird is a free email application that is easy to set up and customize - and it's loaded with great features!\n\nThunderbird is a free and open source email, newsfeed, chat, and calendaring client, that’s easy to set up and customize. One of the core principles of Thunderbird is the use and promotion of open standards - this focus is a rejection of our world of closed platforms and services that can’t communicate with each other. We want our users to have freedom and choice in how they communicate.\nWhat’s New\nnew\nAccessiblity is improved in various tree views\nnew\n'Favorites' added as destination for 'Move To' and 'File' buttons\nnew\nAdd mail.openpgp.load_untested_gpgme_version to load untested GPGME version\nnew\nNTLM is exposed as an available authentication method for EWS accounts\nWhat’s Changed\nchanged\nRead folders are now removed from Unread Folders view\nchanged\nYahoo, AT&T, AOL accounts are switched to PKCE, a more secure auth protocol\nWhat’s Fixed\nfixed\nPeriodic new mail checks silently stopped after sleep or network outages\nfixed\nDonation banner stole focus when Thunderbird was running in the background\nfixed\nStatus bar messages displayed unlocalizedd folder names or IMAP mailbox names\nfixed\nNew Folder dialog allowed invalid folder creation without a selected parent folder\nfixed\nNew/unread messages in collapsed thread were not obvious enough\nfixed\nInvalidly signed unencrypted emails were indicated as worse than unsigned ones\nfixed\nUntagged messages were not working correctly with quick filter\nfixed\nCalendar/address book sections were shown in Account Hub when there were none\nfixed\nShortcuts could be executed on background mail window while in Account Hub\nfixed\nAdding a Gmail account prompted for OAuth during auto config\nfixed\nNew password-based Exchange accounts failed to save passwords in login manager\nfixed\n'Move Message to' filter action was not logged\nfixed\nUnknown OAuth providers were not allowed during EWS manual config in AccountHub\nfixed\nSaved search in unified folder resulted in server error\nfixed\nEWS password prompt looped endlessly if the password was empty\nfixed\nAccount Hub manual configuration flow for Exchange accounts was incorrect\nfixed\nGoogle calendars had broken RSVP logic and wrong organizer on new events\nfixed\nCalDAV calendars that invited calendar alias did not give all response options\nfixed\nCalDAV calendar with multiple addresses could crash on multi-attendee invites\nfixed\niCal imports misread unknown timezones as GMT, creating events at wrong times\nfixed\nVisual and UX improvements\nfixed\nSecurity fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"148.0","version":0,"site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}