{"appId":"w:MullvadVPN.MullvadVPN","appShortcutName":"Mullvad VPN","appDisplayName":"Mullvad VPN","authorId":"w:winget","releaseTagName":"winget-2025.12","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/mullvad/mullvadvpn-app/releases/download/2025.12/MullvadVPN-2025.12_x64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/mullvad/mullvadvpn-app/releases/download/2025.12/MullvadVPN-2025.12_arm64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mullvad is an open-source commercial virtual private network service based in Sweden.\n\nMullvad is an open-source commercial virtual private network service based in Sweden.\nThis release is for Windows only.\nThis release is based on 2025.10 with the addition of a fix for a BSOD that some users experienced.\nHere is a list of all changes since last stable release 2025.11:\nAdded\n- Add helpful warnings when clearing account history. This helps users not lose their account\n  numbers.\nWindows\n- Add additional logging for tunnel devices and split tunneling to problem reports.\n- Log WFP sessions when transaction lock timeout occurs.\nChanged\n- Move placement of login button from inside the account number input to under account number.\nWindows\n- Implement UDP GSO for QUIC on client socket. This improves download speeds slightly.\nFixed\n- Fix version being labeled unsupported unexpectedly. So far, this only an issue when using\n  development builds.\n- QUIC obfuscation only using one in-address when connecting. It will now randomly select one of\n  the available in-addresses for each connection attempt.\n- quinn_udp crate flooding mullvad-daemon.log with warnings.\nWindows\n- Mitigate BSOD caused by split tunnel driver during boot.\nmacOS\n- Fix apps attempting to use IPv6 with in-tunnel IPv6 disabled.\n- Re-add missing loopback alias if removed. This fixes some issues with DNS resolution.\nSecurity\nWindows\n- Block traffic to exit node from non-Mullvad processes. This fixes a leak where traffic could be\n  encrypted once, but leave the entry node unencrypted, if and only if the destination were the exit\n  node. E.g., this might occur if a browser tries to open a TCP connection to the exit node IP.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.12","version":0,"site":"https://mullvad.net/","source":"Mullvad VPN","license_or_tos":"GPL-3.0","resources":null,"verified":false}