{"appId":"w:Musescore.Musescore","appShortcutName":"MuseScore","appDisplayName":"MuseScore","authorId":"w:winget","releaseTagName":"winget-4.6.0.252730940","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/musescore/MuseScore/releases/download/v4.6.0/MuseScore-Studio-4.6.0.252730940-x86_64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Create, play back and print beautiful sheet music with free and easy to use music notation software MuseScore.\n\n\nMuseScore Studio 4.6.0 is now available!\nPlayback\n- Realtime note preview now supports duration and velocity control, as well as the sustain pedal, allowing an intuitive playing experience with a connected MIDI keyboard\n- Count-in is back! (Playback toolbar > Playback settings cog)\n- MuseSounds playback no longer fades-in when pressing play\n- Play count for repeated sections can be controlled in Properties, with options to add appropriate text to score (e.g. \"Play N times\")\n- Fixed regression where instruments were muted after undoing their deletion with Ctrl+Z\nEngraving\n- A comprehensive new system allows localised control over showing and hiding empty staves\n- Any SMuFL-compliant music font can now be applied\n- Measure numbers are now treated as system markings and can also be shown below the system, with many new options for customisability in Styles\n- All system markings can now go below the bottom staff\n- Better alignment options for repeat & jump markers, voltas, etc.\n- Better alignment of rests in multiple voices\n- Better rhythmic grouping of rests and beams in local time signatures\n- New properties for frames to control padding to notation above & below\n- Harp pedal diagrams can be anchored at arbitrary beat positions (not just on notes and rests)\n- Enharmonic spelling: new options added in Tools menu\n- Fixed regression where slurs from grace notes were placed incorrectly and not saved in the MSCX file\n- Fixed issue saving and loading of scaling/spatium size in parts\n- Fixed regression in placement of whole measure rests in secondary voices\n- Adding breath marks no longer hides courtesy clefs in cutaway staves\n- Barlines are no longer masked by invisible text lines\n- Ties are no longer shortened by chord symbols that contain a slash\n- Hairpin ending on final beat of final measure is no longer excluded from parts\n- Collision avoided between dynamics and left barlines\n- Collision avoided between arpeggios and clefs\n- Added 19th century French tenor clef (G clef ottava bassa with C clef)\n- Repeat-dot position in these fonts was tweaked for better SMuFL compliance: Gootville, MuseJazz, Emmentaler\nGuitar\n- Engraving support for hammer-on, pull-off, and tapping techniques (playback supported in MuseSounds Guitars Vol. 2 and upwards)\n- Fretboard diagrams now auto-fill based on their associated chord symbol\n- Fretboard diagram legend can be automatically generated based on chord symbols in score\n- Any text font can now be used for tab numbers\n- Improved engraving and playback support for bends to grace notes after main notes\n- Fret number in fretboard diagram is not repositioned unnecessarily when text is edited\n- Circular markers are no longer added to fretboard diagrams when masked by barrés\n- Fixed spacing of minimum length ties, glissandos, and frets\n- Fixed adding and masking of parentheses around fret number in TAB staves\n- Import TablEdit v3.00+ files — thanks to Leon Vinken (PR author) and Matthieu Leschemelle (TablEdit creator)\nChord symbols\n- Chords galore! New individual scaling, offset, and alignment options for extensions and modifiers, plus the ability stack and parenthesise modifiers\n- Ability to create polychords with the pipe \"|\" character (N.b. playback support is planned for a future release)\nNew style options\n- Volta alignment relative to key signatures and barlines\n- Partial slur shape across repeats and breaks\n- Minimum header distance (used when clefs are only shown on first system)\n- Show barline before key & time signatures at start repeats\n- Tuplet bracket position\nText\n- New text formatting popup appears when characters are selected in a text element\n- New editing shortcut Ctrl+Delete (Mac: Cmd+Fn+Backspace) to delete entire word after caret\n- Square brackets and multiplication signs are allowed in time signatures\n- New lyrics styles for hyphens/dashes\n- Lyric extender lines no longer extend over rests\n- Fixes to header, footer, page number & copyright styles\n- Fixed overlapping '6' and '9' characters in chord symbols\nWorkflow improvements\n- New welcome screen enables quick access to tutorials, free MuseSounds, and other relevant information\n- Selection filter now enables selection of individual notes in chords\n- New mouse shortcut Alt+click to paste the current selection elsewhere\n- Improvements to 'Repeat selection' command when used with 2 or more voices\n- Fixed issue preventing diatonic shifting of enharmonically equivalent notes\n- Slurs entered from the palettes can now be resized\n- Joining/splitting measures no longer corrupts ties at the measure boundary\n- Durations are better accounted for when merging rests\n- Pasting notes near a page break no longer spoils engraving of slurs that span the break\n- Fixed crash on closing score after undo of dragging a measure with partial tie\n- Fixed crash on range selection over multi-measure rest\nPercussion\n- The number of drumpad columns in the Percussion Panel can now be modified\n- Added Handbells palette and playback with MuseSounds\n- Added Handchimes instrument\nUI\n- Removed delay in showing three-dots (...) context menu icon when switching panel tabs (Palettes, Layout, Properties, etc.)\n- Element colors are now inverted in the palettes when score color inversion is enabled via Preferences > Appearance\n- Improved appearance of rounded corners on popups and dropdown lists\nImport/export\n- Support for importing TablEdit files (v3.00+ only, see Guitar section above)\n- MIDI: Exported lyrics now have a space appended after each word\n- MEI: exported title page receives func=\"first\" attribute to show it's the first page\n- MusicXML\n  - Import for string mute element, harp pedal diagrams, colors for more element, various other fixes\n  - Export fixes for TAB & percussion clefs\n  - Import & export support added for guitar tapping, hammer-on, pull-off, hairpin styles\nAccessibility\n- Screen reader announcements for more in-score actions (e.g. adding articulations, changing voices)\n- Fixed input and viewing announcements in the Braille panel\nLinux\n- VST3 support (please raise an issue on GitHub if a specific Linux VST is not working for you)\n- Enabled fractional scaling (previously disabled to avoid an element offset bug—possibly in Qt—that appears to be fixed now)\n- Fixed Linux-only crash on Alt+Left/Alt+Right navigation in continuous mode\n- Distributions released prior to Ubuntu 22.04 can no longer run the AppImage due to an outdated GLIBC version\nPerformance\n- Significant performance gains when saving and loading large scores\n- Changes in Page settings dialog are more efficient and properly undoable (press Ctrl+Z after closing dialog)\nPlugins\n- Retrograde: Fixed handling of consecutive ties\n- Plugin API: Now includes all new elements and properties added between MuseScore 4.0 and 4.6 (thanks @XiaoMigros!)\nQt fixes\nUpdating to Qt 6.9.1 has resolved these issues:\n- #22416 Right-aligned text is not properly aligned\n- #24690 Some toolbar buttons don't work with pen / touch input on Windows\n- #24232 Menus appear on wrong monitor on Windows\n- #24579 Transparent UI on second monitor on Windows\n- #24613 Score draggable behind Staff/part properties dialog\n- #24667 Changing UI accent colour breaks Qt Widget dialogs\n- #23970 Crash at launch on macOS Sonoma\nSee our GitHub Project for more details.\nUpcoming\n- Support for online MuseSounds added for Windows & macOS (will become functional when applicable sound libraries are released)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.6.0.252730940","version":0,"site":"https://musescore.org/en","source":"MuseScore BVBA and Others","license_or_tos":"GPL-3.0 License","resources":null,"verified":false}