{"appId":"w:MusicBrainz.Picard","appShortcutName":"MusicBrainz Picard","appDisplayName":"MusicBrainz Picard","authorId":"w:winget","releaseTagName":"winget-2.13.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://data.musicbrainz.org/pub/musicbrainz/picard/picard-setup-2.13.3.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A cross-platform music tagger powered by the MusicBrainz database.\n\nMusicBrainz Picard is a cross-platform music file tagger.\nYour music files don’t just contain music. They also contain “metadata”, consisting of “tags” which consist of a tag name or type and associated data, for example the album or track name, the name of the artist, the record label, the year of issue etc. Unless you rip the music files yourself with a very basic tool, your music files probably already contain some basic metadata, however there are literally hundreds of tags that can be applied to your music if you are interested.\nObviously, if you wanted to you could painstakingly research all this information for each album and track individually, and type the data into a tagging tool, but clearly it makes more sense in this internet connected age for one person to do this for each album and track, to upload that data to a shared database and then for the tagging tool to access that database and use the data to tag the music files. And that is what MusicBrainz Picard does.\nMusicBrainz is the database, and Picard is the tool that tags the music files.\nBugfixes\n- PICARD-2909 - libopus fails to read METADATA_BLOCK_PICTURE without bit depth set\n- PICARD-3034 - Windows: SSL errors if conflicting libssl is installed system wide","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.13.3","version":0,"site":"https://musicbrainz.org/","source":"MusicBrainz","license_or_tos":"GPL-2.0","resources":null,"verified":false}