{"appId":"w:Nanome.Nanome","appShortcutName":"Nanome","appDisplayName":"Nanome","authorId":"w:winget","releaseTagName":"winget-1.24.6","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"AI assisted scientific copilot + multi-user spatial computing to accelerate scientific discovery drug discovery.\n\nNanome is the ultimate interface for scientific discovery, starting with molecular data. With Nanome, top R&D labs conduct cutting-edge research but, Nanome isn’t just for experts, it’s also used by students and amateur scientists studying chemistry and biology. Anyone can build 3D molecules or simulate an entire protein made of hundreds of atoms, all in one collaborative environment. Transform the way you learn and design molecular structures with Nanome.\nNew Features and Improvements\n- Added Passthrough Mixed Reality support for the Meta Quest 2 and Meta Quest Pro devices via the wrist menu\n- Added support for Meta Avatars which enable avatar customization on Meta devices and presets for Non-meta devices enhancing social presence\n- Added support for the Meta Quest Pro Device\n- Changed the Locomotion mechanism to a discrete state now activated through the “Edit Position” button on the wrist menu\n- Added a Content Discovery Menu to replace Advanced Tutorials\n- Added the time to the wrist menu and removed the wrist watch\n- Added the X button to be a hotkey for mute/unmute the microphone\n- Added transition states (fade to black) during loading states for a smoother user experience\n- License locked Atom Labels\n- License locked Surfaces\n- License Locked Spatial Playback functionality (Rewind, Fast-forward, and interact)\n- License locked the Duplicate Molecule feature\n- Removed the “Open All” button from the wrist menu\n- Adjusted all menus sizes to be smaller for Mixed Reality\n- Added ability to have guests steal presenter by grabbing an unlocked molecule\n- Added a “Internet Connection is lost” prompt in the lobby when disconnected from internet\n- Hide avatars for when a user is too close to another user\n- Changed notifications prompt to spawn in front of the user\n- Added a prompt for adding Microphone Permissions to the Nanome App when first launching\n- Removed “Teleport Out” from the Action menu\n- Changed the Wrist Menu design\n- Moved the Spatial Recording button in the wrist menu into the Room button on the Wrist menu\n- Combined the View Presenter Requests and Request Presenter Button in the wrist menu\n- Added Parental Control lock for the web browser accessible via https://home.nanome.ai\n- Removed automatic user teleportation from the Spatial Recordings\n- Removed automatic face-center of room when teleporting tiles via locomotion\n- Added a specific Alphafold Coloring Schema\n- Added a toggle between desktop and mobile view for the in-VR Web Browser\n- Added a quick-save button on the wrist menu\n- Added ability to anchor a workspace to a physical room via Spatial Anchors\n- Added the ability to bring your desk into XR and snap the whiteboard to it\n- Changing the Complex name now emits a complexUpdate event to the Plugin System\n- Disabled Merging two proteins\n- Increased the accuracy of the Device Limiter\n- Adjusted Wrist menu location due to new avatars\n- Updated Quick tool switch interaction to ignore trigger action\n- Added a notification if a user tries to search from the load menu without any text\n- Inverted the Fo-Fc Colors for Electron Density Maps to be more scientifically accurate\n- Added new substructure ID Filters\n- Added a voice indicator and mute button  to the Lobby’s avatar preview mirror\n- Added a cancel button to the Load Menu\n- Added the option to Combine molecules with and without chain renaming\n- Enabled rendering backsidee of surfaces for PCVR\n- SDF v2000 parsing captures formal charges\n- Hydrogens computation now stores formal charges on all involved atoms\n- Removed disabled Change Avatar button from Avatar Menu when inside a room\n- Default disabled automatic height adjustment for users in Mixed Reality\n- Added Auto-join and Auto Idle Rejoin\n- Supporting Self-hosted Quickdrop for Enterprise\n- Added Presentation Setup Options to config and Action Menu. The presenter can choose to have these options trigger when guests join the room: Position all guests to presenter’s current position, Hide only guests, Hide all users\n\nOptimizations and Fixes\n- Patched Unity security vulnerability that was present in the current Unity Project Version. Updated to the safe version, 6000.0.58f2.\n- Fixed bug where complex markers appeared offset to the complex\n- Fixed Vive Cosmos Support\n- Fixed inconsistent Grid Lock default behavior\n- Fixed time warps occurring on undo/redo\n- Fixed bugs when entering and exiting a scene\n- Adjusted text and spacing for residue and atom count since it wasn't showing\n- Fixed bug where Ribbons weren't accounted for by DeviceLimiter\n- Prevent lobby from always rejoining when clicking on first tab\n- Fixed plugin reconnection\n- Disable snap rotation when a tool using joysticks is on\n- Fixed a bug causing the creation of duplicates in grids\n- Fix a bug with Periodic Table and Med Chem Library not opening\n- Fixed upgrade prompt grabbing\n- Removed Wave packages from Oculus builds\n- Fixed lobby settings not being saved\n- Fixed universal menu pause\n- Fixed loading not finishing on connection lost\n- Fixed a standalone bug when taking pictures with InVR camera of webbrowser\n- Fixed user leaving room on Headset Pause (headset off for short period of time)\n- Fixed voice lag for networked rooms\n- Fixed plugin menu's automatic UI updates that were only happening for the presenter\n- Moved Whiteboard panel so that it's in a similar location as MedChem tool\n- Removed unnecessary Android permissions\n- Fixed notifications not following user\n- Fixed product name for some Android configurations\n- Fixed teleport targeting\n- Disable 2D toggle button in lobby settings for standalone\n- Fixed issue with residueCollider aggressively unhighlighting selection\n- Spent significant time on performance optimization!\n- Greatly reduced lag generated by creating and updating labels\n- Reworked internal behavior to reduce lag spikes overall\n- Reduced lag when reading a spatial recording\n- Reduced lag when joining & leaving a room\n- Reduced lag in network deserialization\n- Reduced lag caused by surface generation on Android\n- Optimized web browser time first launch\n- Optimized entry menu display\n- Fixed a potential crash in a web browser stream on android\n- Fixed issue where users would be stuck with a black screen while joining a room\n- Fixed bug where Audio and Voice would stop working when joining a room\n- Fixed audio blips that occurred while Web Browser audio was playing\n- Fixed issue where Spatial Recording avatar pose would be stuck in the initial pose\n- Fixed issue where .PSE files would load with incorrect selections\n- Fixed issue where workspaces saved in v1.23.3 and earlier could not be opened in v1.24.2\n- Tryptophan residue is now correctly aromatic\n- Fixed EDM maps not loading properly (regression after supporting PSE maps)\n- Fixed incomplete proteins being flagged as ligand fragments\n- Fixed Chemical Interactions Free Menu’s Hide and Show actions.\n- Fixed Chemical Interactions Free Menu not opening for non-stacks-enabled guests\n- Fixed issue where cryo-em maps weren’t being fully deleted if they were modified by the user.\n- Fixed issues where MOE files would be imported without the correct ribbon visualization.\n- Fixed parsing issue with MAE files that contain more than one item in a given line\n- Fixed parsing issue with MAE files that come from LiveDesign\n- Fixed parsing issue with PSE files that are missing certain “entity” fields\n- Fixed parsing issue with MMCIF where atom and residue  names were not being read correctly","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.24.6","version":0,"site":"https://nanome.ai/","source":"Nanome","license_or_tos":"Proprietary","resources":null,"verified":false}