{"appId":"w:NCHSoftware.MixPad","appShortcutName":"MixPad","appDisplayName":"MixPad","authorId":"w:winget","releaseTagName":"winget-13.40","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"With MixPad multi-track recording and mixing software, you can access all the power of professional recording and mixing equipment through a single platform that streamlines the process and makes mixing a breeze.\n\nMixPad is a multi-track audio mixing and recording software developed by NCH Software. It is designed for both beginners and professionals to mix, record, and produce audio tracks for music, podcasts, broadcasts, and other sound projects.\n\nMixing Software Features\n- Mix an unlimited number of audio, music, sounds, and voice tracks\n- Record single or multiple tracks simultaneously\n- Load any audio file; more supported formats than any other mixer.\n- Add audio effects including EQ, compression, reverb and more\n- Includes a royalty-free sound effect and music library with hundreds of clips to use in your productions\n- Craft your own beats or start with a sample pattern using beat designer\n- VST plugin support for added studio effects and instruments\n- Very low latency, ASIO support for sample accurate recording\n- Supports sample rates from 6 kHz to 192 kHz\n- Export at all popular bit depths up to 32 bits floating point audio\n- Mix to MP3, burn to CD or upload your productions\n- Save in any file type you need, from studio quality wav files to high compression formats such as MP3 for sharing online\n- Upload to SoundCloud, YouTube, Dropbox, or Google Drive\n- Edit MIDI files with the MIDI Editor\n- Automatically detect tempo and location of beats\n- Perfect vocals with Pitch Correction and Pitch Change tools\n- Analyze your mix with FFT and TFFT sound frequency tools\n- Create and edit MIDI tracks\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"13.40","version":0,"site":"https://www.nch.com.au/","source":"NCH Software","license_or_tos":"Proprietary (EULA)","resources":null,"verified":false}