{"appId":"w:NCHSoftware.WavePad","appShortcutName":"WavePad Sound Editor","appDisplayName":"WavePad Sound Editor","authorId":"w:winget","releaseTagName":"winget-20.40","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Audio Editing Software for Everyone\n\nThis audio editing software is a full-featured professional audio and music editor for Windows and Mac. Record and edit music, voice and other audio recordings. When editing audio files, you can cut, copy and paste parts of recordings, and then add effects like echo, amplification and noise reduction. WavePad works as a WAV or MP3 editor, but it also supports a number of other file formats including VOX, GSM, WMA, real audio, M4A, AU, AIF, FLAC, OGG, and more.\n\n- Sound editing tools include cut, copy, paste, delete, insert, silence, auto-trim, compression, pitch shifting and more\n- Audio effects include amplify, normalize, equalizer, envelope, reverb, echo, reverse and many more\n- DirectX and Virtual Studio Technology DLL (VST) plugin support gives producers access to thousands of additional tools and effects\n- Supports almost all audio and music file formats including MP3, WAV, VOX, GSM, WMA, AU, AIF, FLAC, real audio, OGG, AAC, M4A, MID, AMR, and many more\n- Batch processing allows you to apply effects and/or convert thousands of files as a single function\n- Scrub, search and bookmark audio for precise editing\n- Create bookmarks and regions to easily find, recall and assemble segments of long audio files\n- Advanced tools include spectral analysis (FFT), AI powered speech synthesis (text-to-speech), and voice changer\n- Audio restoration features including noise reduction and click pop removal\n- Supports sample rates from 6 to 192kHz, stereo or mono, 8, 16, 24 or 32 bits\n- Edit the audio from your video files\n- Integrates seamlessly with MixPad Multi-Track Audio Mixer\n- Easy to use interface will have you utilizing non-destructive audio editing in minutes\n- Export your audio file to video with waveform, FFT or image visualization\n- Sound effect library includes hundreds of sound effects and royalty free music clips\n- Tutorials and guides available for beginners to quickly master the audio cutting software\n- User-friendly drag-and-drop functionality for easy importing and editing of audio files\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"20.40","version":0,"site":"https://www.nch.com.au/index.html","source":"NCH Software","license_or_tos":"Proprietary (EULA)","resources":null,"verified":false}