{"appId":"w:NDI.NDITools","appShortcutName":"NDI Tools","appDisplayName":"NDI Tools","authorId":"w:winget","releaseTagName":"winget-6.2.1.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.ndi.tv/Tools/NDI%206%20Tools.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"All the tools and plugins you need to connect, stream and share your content.\n\nNDI Tools contains all the tools and plugins needed to connect, stream and share your content. Contains Access Manager, Remote, Router, Test Patterns, Studio Monitor, Webcam Input, Screen Capture, Bridge and plugins for Audio Direct, VLC, Premiere Pro, After Effect.\nOur latest release brings an update to the NDI SDK terms, bringing these in line with our commitment to the health and growth of the NDI ecosystem. The NDI SDK remains royalty-free, subject to the SDK terms and conditions. For more details including a full explanation and updated list of exclusions please consult the terms and conditions by downloading the NDI 6.2.1 SDK. These changes apply to the NDI SDK only and are not applicable to the NDI Advanced SDK. For more information see the Community Announcement in our Forums.\n- Updated the NDI Tools installer to display the Privacy Policy on the data collection agreement page.\n- Fixed an issue with silent installation of NDI Tools.\n- Fixed an issue where the NDI Discovery Server running as a service would not start automatically after windows restart.\n- Added URL connection reporting in the Discovery UI when monitoring NDI receivers connected to HX1 sources.\n- Fixed a localization issue in the NDI Bridge statistics window.\n- Fixed a crash that could occur when destroying an NDI receiver during an active connection attempt to a source. Improved handling of deinterlacing in NDI Studio Monitor.\n- A new 'deinterlacing' option has been added to the Video Settings menu.\n- Fixed incorrect byte order handling when using NDIlib_recv_color_format_RGBX_RGBA.\n- Fixed an issue where NDI output from Adobe Premiere could change resolution when clips on the timeline ended.\n- Resolved an issue where NDI Bridge could incorrectly select a temporary GPU adapter, which might become unavailable when remote desktop sessions end.\n- Fixed a potential issue where an NDI Finder could block indefinitely in certain environments.\n- Removed the NDI Remote application from the NDI Tools Suite. See here for more details","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.2.1.0","version":0,"site":"https://ndi.video/","source":"NDI","license_or_tos":"Proprietary","resources":null,"verified":false}