{"appId":"w:NDI.NDITools","appShortcutName":"NDI Tools","appDisplayName":"NDI Tools","authorId":"w:winget","releaseTagName":"winget-6.3.0.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.ndi.tv/Tools/NDI%206%20Tools.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"All the tools and plugins you need to connect, stream and share your content.\n\nNDI Tools contains all the tools and plugins needed to connect, stream and share your content. Contains Access Manager, Remote, Router, Test Patterns, Studio Monitor, Webcam Input, Screen Capture, Bridge and plugins for Audio Direct, VLC, Premiere Pro, After Effect.\nNDI Tools\nSender Monitoring Enhancements: The NDI Discovery app now includes sender discovery and monitoring on both Windows and macOS.\nDefault Sender Monitoring Support: Enabled by default in existing sender-based NDI Tools apps.\n- Windows: NDI Test Patterns, NDI Screen Capture, NDI Screen Capture HX, NDI VLC Plugin.\n- macOS: NDI Test Patterns, NDI Scan Converter.\nNDI Discovery Server Improvements: Enhanced sender discovery and monitoring capabilities. The NDI server utility is now available as a standalone installer for Windows and Linux and can run as a service. See documentation for setup details.\n\nFixed\n- Fixed an issue in the NDI plugin for Adobe Premiere where the field sequence was incorrectly displayed when playing SpeedHQ progressive clips in interlaced sequences.\n- Resolved poor NDI HX encoding performance on AMD GPU/CPU systems in Screen Capture HX and NDI Bridge.\n- Fixed NDI Virtual Input on macOS failing to receive video when connected via Discovery Server and Access Manager.\n- Resolved an issue where NDI Webcam would stop receiving video from the NDI HX Camera app when the camera resolution was changed.\n- Corrected video preview rendering in NDI Webcam to properly respect the source aspect ratio.\n- Fixed NDI Router terminating active streams upon application closure.\n\nNDI SDK\nNew APIs: Introduced APIs for sender discovery and monitoring, designed for integration with the NDI Discovery Server. See documentation for details.\nPerformance Improvements: Enhanced SpeedHQ codec quality across multiple generations.\nEnabled passthrough of the NDI capabilities message from NDI receiver to the NDI sender.\nEnhanced Receiver Passthrough Control: Introduced per-codec passthrough override control via receiver creation JSON in the NDI Advanced SDK, enabling selective decompression of compressed formats. Please refer to the SDK documentation for details.\nImprovements to FPGA reference design. Please refer to the ChangeLog files for more details.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.3.0.3","version":0,"site":"https://ndi.video/","source":"NDI","license_or_tos":"Proprietary","resources":null,"verified":false}