{"appId":"w:Netbird.Netbird","appShortcutName":"Netbird","appDisplayName":"Netbird","authorId":"w:winget","releaseTagName":"winget-0.64.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.64.0/netbird_installer_0.64.0_windows_amd64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.64.0/netbird_installer_0.64.0_windows_arm64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect your devices into a secure WireGuard®-based overlay network with SSO, MFA and granular access controls.\n\nNetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.\nConnect. NetBird creates a WireGuard-based overlay network that automatically connects your machines over an encrypted tunnel, leaving behind the hassle of opening ports, complex firewall rules, VPN gateways, and so forth.\nSecure. NetBird enables secure remote access by applying granular access policies while allowing you to manage them intuitively from a single place. Works universally on any infrastructure.\nWhat's New\nDebugging & Observability\n- Added the ability to trigger debug bundle generation directly from the API and Dashboard.\n  #4832\nClient Improvements\n- Improved error handling by adjusting notifyDisconnected behavior on receiveJobRequest failures.\n  #5138\n- Added support for wildcard custom DNS records.\n  #5125\n- Fixed profile switching issues and repeated down / up command failures.\n  #5142\n- Fixed Rosenpass connectivity issues for Android peers.\n  #5044\nManagement Enhancements\n- Added support for local user password changes when using the embedded IdP.\n  #5132\n- Included missing activity events in management API responses.\n  #5140\nInfrastructure\n- Added embedded STUN support to the getting-started setup to simplify initial deployments.\n  #5141\nFull Changelog: v0.63.0...v0.64.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.64.0","version":0,"site":"https://netbird.io/","source":"NetBird GmbH","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}