{"appId":"w:Netbird.Netbird","appShortcutName":"Netbird","appDisplayName":"Netbird","authorId":"w:winget","releaseTagName":"winget-0.64.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.64.1/netbird_installer_0.64.1_windows_amd64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.64.1/netbird_installer_0.64.1_windows_arm64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect your devices into a secure WireGuard®-based overlay network with SSO, MFA and granular access controls.\n\nNetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.\nConnect. NetBird creates a WireGuard-based overlay network that automatically connects your machines over an encrypted tunnel, leaving behind the hassle of opening ports, complex firewall rules, VPN gateways, and so forth.\nSecure. NetBird enables secure remote access by applying granular access policies while allowing you to manage them intuitively from a single place. Works universally on any infrastructure.\nWhat's New\nClient Improvements\n- Fixed RFC 4592 wildcard matching for existing domain names.\n  #5145\n- Extended the WireGuard watcher to also monitor ICE connections.\n  #5133\n- Added IPv6 support to userspace bind.\n  #5147\n- Fixed IPv4-only limitation in the bind proxy.\n  #5154\n- Improved DNS reliability by trying the next upstream on SERVFAIL / REFUSED responses.\n  #5163\n- Hid forwarding rules from status output when the count is zero.\n  #5149\n- Added CPU profiling to the debug bundle.\n  #4700\n- Fixed health result reporting in the debug bundle.\n  #5164\n- Changed the default Rosenpass log level.\n  #5137\n- Fixed exit node menu behavior on reconnect and removed tooltips in the GUI.\n  #5167\nManagement Enhancements\n- Fixed activity event initiator reporting for user group changes.\n  #5152\n- Ensured ephemeral peers are correctly added to the ephemeral list on login.\n  #5165\n- Moved activity store encryption into the shared crypt package.\n  #5111\nFull Changelog: v0.64.0...v0.64.1","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.64.1","version":0,"site":"https://netbird.io/","source":"NetBird GmbH","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}