{"appId":"w:Netbird.Netbird","appShortcutName":"Winget Application","appDisplayName":"Netbird","authorId":"w:winget","releaseTagName":"winget-0.43.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.43.0/netbird_installer_0.43.0_windows_amd64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect your devices into a secure WireGuard®-based overlay network with SSO, MFA and granular access controls.\n\nNetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.\nConnect. NetBird creates a WireGuard-based overlay network that automatically connects your machines over an encrypted tunnel, leaving behind the hassle of opening ports, complex firewall rules, VPN gateways, and so forth.\nSecure. NetBird enables secure remote access by applying granular access policies while allowing you to manage them intuitively from a single place. Works universally on any infrastructure.\nWhat's New\nClient Improvements\n- Fixed exit node deselection behavior. #3722\n- Dynamic firewall rules now set up for DNS routes based on DNS responses. #3702\n- Userspace ACL received additional filter test cases to improve robustness. #3730\n- GRPC error handling improved to catch flow errors better. #3727\n- Ensured destination-type local marks can overwrite NAT marks. #3738\n- Fixed macOS privacy warnings when accessing static system information. #3496\nThese updates enhance reliability and system compatibility across platforms.\nManagement Improvements\n- Introduced a new Auditor Role for account access. (API only, dashboard support is coming soon) #3721\n- Introduced a Network Admin Role for network-specific administration. (API only, dashboard support is coming soon) #3720\n- Impersonation via PATs (Personal Access Tokens) is now supported for streamlined troubleshooting. #3739\nOther Changes\n- Improved static checks when running in foreground mode. #3742\n- Ran container tests in a more generic way for broader coverage. #3737\nFull Changelog: v0.42.0...v0.43.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.43.0","site":"https://netbird.io/","source":"NetBird GmbH","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}