{"appId":"w:Netbird.Netbird","appShortcutName":"Netbird","appDisplayName":"Netbird","authorId":"w:winget","releaseTagName":"winget-0.65.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.65.3/netbird_installer_0.65.3_windows_arm64.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.65.3/netbird_installer_0.65.3_windows_amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect your devices into a secure WireGuard®-based overlay network with SSO, MFA and granular access controls.\n\nNetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.\nConnect. NetBird creates a WireGuard-based overlay network that automatically connects your machines over an encrypted tunnel, leaving behind the hassle of opening ports, complex firewall rules, VPN gateways, and so forth.\nSecure. NetBird enables secure remote access by applying granular access policies while allowing you to manage them intuitively from a single place. Works universally on any infrastructure.\n🛡️ Security Fix: Race Condition in Role Update Validation\nWhat was affected\nA race condition in the user role validation logic could allow permission checks to succeed based on stale role data. Under very specific timing conditions, concurrent requests during a role change (e.g., while an admin was being demoted to user) could bypass role validation when changing another users role.\nExploit Potential\nIf an administrator account was being demoted while simultaneously performing acocunt ownership transfer actions, a race window existed where the system could treat the user as having elevated permissions to change owners.\nIn a coordinated scenario involving two administrator accounts, this could potentially allow privilege escalation — for example, promoting a user to Owner during the demotion window.\nConditions Required\nExploitation required:\n- Two administrator accounts.\n- One administrator being actively demoted.\n- Concurrent ownership transfer requests executed precisely during the demotion process.\n- Precise timing to trigger the race condition.\nThis issue required intentional coordination and timing, making it unlikely to occur accidentally and will require access to two admin accounts.\nWhat's New\nClient & Mobile Improvements\n- Batched macOS DNS domains to avoid truncation issues.\n  #5368\n- Ensured route settlement on iOS before handling DNS responses.\n  #5360\n- Added logging of lock acquisition time in message handling for improved observability.\n  #5393\nRelay Improvements\n- Reduced QUIC initial packet size to 1280 bytes (IPv6 minimum MTU) for better compatibility.\n  #5374\nManagement Improvements\n- Fixed possible race condition on user role change.\n  #5395\n- Added docker login step in management tests.\n  #5323\nSelf-Hosted Updates\n- Added a migration script for upgrading from pre-v0.65.0 to post-v0.65.0 combined setup.\n  #5350\n- Removed unused configuration example from self-hosted setup.\n  #5383\nMiscellaneous\n- Updated timestamp format to include milliseconds.\n  #5387\nFull Changelog: v0.65.2...v0.65.3","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.65.3","version":0,"site":"https://netbird.io/","source":"NetBird GmbH","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}