{"appId":"w:Netbird.Netbird","appShortcutName":"Netbird","appDisplayName":"Netbird","authorId":"w:winget","releaseTagName":"winget-0.61.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.61.0/netbird_installer_0.61.0_windows_arm64.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.61.0/netbird_installer_0.61.0_windows_amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect your devices into a secure WireGuard®-based overlay network with SSO, MFA and granular access controls.\n\nNetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.\nConnect. NetBird creates a WireGuard-based overlay network that automatically connects your machines over an encrypted tunnel, leaving behind the hassle of opening ports, complex firewall rules, VPN gateways, and so forth.\nSecure. NetBird enables secure remote access by applying granular access policies while allowing you to manage them intuitively from a single place. Works universally on any infrastructure.\nWhat's New\n🔐 Fine-Grained SSH Access Control (Breaking Change)\nNetBird introduces fine-grained SSH access control with support for explicit local OS users on target machines.\nAdministrators can now define which NetBird users or groups are allowed to connect as specific local system users, enabling safer, more predictable SSH access without relying on shared or implicit credentials.\n⚠️ Breaking change for self-hosted deployments\nSelf-hosted installations must upgrade the Management server before upgrading their clients and enabling or using the new SSH access model.\nFailing to upgrade may result in SSH access issues or unexpected behavior.\nLearn more at: https://docs.netbird.io/manage/peers/ssh#fine-grained-access-control\n🔄 Automatic Client Updates (Windows & macOS) - Beta\nNetBird adds automatic client update support for Windows and macOS, helping users stay up to date with the latest fixes and features while maintaining full control over update behavior. This feature is currently in beta and administrators will be able to enable, disable, and configure a custom max version.\nA few notes on the behavior:\n- Update check will happen on connection\n- Supported on Windows and macOS only\n- Disabled by default\n- Can be enabled via Settings → Client in the NetBird application. See image below:\nLearn more at: https://docs.netbird.io/manage/peers/auto-update\nManagement Enhancements\n- Added fine-grained SSH access control across client and management.\n  #4969\nClient Enhancements\n- Introduced auto-update support for the client to simplify upgrades.\n  #4732\n- Improved management domain lookup by adding an additional timeout.\n  #4983\n- Added Android profile switching for easier multi-profile usage.\n  #4884\n- Fixed Linux UI flickering during state updates.\n  #4886\n- Applied DNS host configuration only on changes to reduce unnecessary updates.\n  #4695\nMISC\n- Added FreeBSD port release job to GitHub Actions.\n  #4916\n- Added conditional checks for FreeBSD diff file generation in CI.\n  #5001\n- Updated to new signing pipelines v0.1.0.\n  #4993\n- Fixed a broken image link in the README.\n  #4876\n- Preset signal port on templates #5004\nNew Contributors\n- @hey-august made their first contribution in #4876\nFull Changelog: v0.60.8...v0.61.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.61.0","version":0,"site":"https://netbird.io/","source":"NetBird GmbH","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}