{"appId":"w:Netbird.Netbird","appShortcutName":"Netbird","appDisplayName":"Netbird","authorId":"w:winget","releaseTagName":"winget-0.64.6","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.64.6/netbird_installer_0.64.6_windows_arm64.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.64.6/netbird_installer_0.64.6_windows_amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect your devices into a secure WireGuard®-based overlay network with SSO, MFA and granular access controls.\n\nNetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.\nConnect. NetBird creates a WireGuard-based overlay network that automatically connects your machines over an encrypted tunnel, leaving behind the hassle of opening ports, complex firewall rules, VPN gateways, and so forth.\nSecure. NetBird enables secure remote access by applying granular access policies while allowing you to manage them intuitively from a single place. Works universally on any infrastructure.\nWhat's New\n🚨 Security Fix\nSecurity: Fixed account impersonation validation in management API\nFixed a vulnerability in the management server's authentication middleware where the ?account= query parameter could be used to impersonate arbitrary accounts without proper validation when getting a list of accessible peers. It requires the attacker to have prior knowledge of the target accounts' and peer IDs.\nThe fix adds explicit validation via IsValidChildAccount() before allowing account switching. Account impersonation is now only permitted when the target account is confirmed as a legitimate child account of the\nrequesting user's parent account.\nAffected component: Management server HTTP middleware (auth_middleware.go) and /api/peers/<peer_id>/accessible-peers endpoint\nSeverity: High — an authenticated user could potentially access or act on behalf of accounts they should not have access to by passing an arbitrary account parameter and fetching the list of accessible peers.\nRecommendation: All self-hosted deployments should upgrade to this version.\nClient Improvements\n- Added missing BSD flags to the debug bundle.\n  #5254\n- Cached the result of wgInterface.ToInterface() using sync.Once for better performance.\n  #5256\n- Fixed nil pointer panic in the ICE agent during sleep/wake cycles.\n  #5261\n- Always log DNS forwarder responses for improved troubleshooting.\n  #5262\n- Fixed netstack detection and added a WireGuard port option.\n  #5251\n- Corrected wrong URL logging for DefaultAdminURL.\n  #5252\n- Added timing measurements to handleSync for better observability.\n  #5228\n- Fixed duplicate firewall rules in USP filter.\n  #5269\n- Added environment variable to skip DNS probing when needed.\n  #5270\n- Fixed race condition and ensured correct message ordering in Relay.\n  #5265\n- Ensured login is checked in foreground mode when required.\n  #5295\n- Fixed multiple panics in device and engine code.\n  #5287\n- Cleaned up stale nftables entries without handle.\n  #5272\nManagement Improvements\n- Fixed incorrectly setting disconnected status for connected peers.\n  #5247\n- Added gRPC debounce for message types to reduce noise.\n  #5239\n- Added validation of stream start time for connecting peers.\n  #5267\n- Fixed ischild check logic.\n  #5279\nNew Contributors\n- @eyJhb made their first contribution in #5252\nFull Changelog: v0.64.5...v0.64.6","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.64.6","version":0,"site":"https://netbird.io/","source":"NetBird GmbH","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}