{"appId":"w:Netbird.Netbird","appShortcutName":"Netbird","appDisplayName":"Netbird","authorId":"w:winget","releaseTagName":"winget-0.65.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.65.0/netbird_installer_0.65.0_windows_arm64.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/netbirdio/netbird/releases/download/v0.65.0/netbird_installer_0.65.0_windows_amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect your devices into a secure WireGuard®-based overlay network with SSO, MFA and granular access controls.\n\nNetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.\nConnect. NetBird creates a WireGuard-based overlay network that automatically connects your machines over an encrypted tunnel, leaving behind the hassle of opening ports, complex firewall rules, VPN gateways, and so forth.\nSecure. NetBird enables secure remote access by applying granular access policies while allowing you to manage them intuitively from a single place. Works universally on any infrastructure.\nRelease Notes for v0.65.0\nWhat's New\n🔀 Reverse Proxy\nNetBird now includes a built-in reverse proxy in the management server, enabling proxied access to backend services through your NetBird network. Allowing you to expose your services to the public with the option to secure them with SSO, PINs, or passwords.\nNo VPN client required for end users. Just point a custom domain at your NetBird server, configure the proxy in the dashboard, and your internal services are securely accessible from any browser. Think of it as a self-hosted alternative to Cloudflare Tunnels, but without the MITM and fully under your control.\nKey features:\n- Custom domains - Map your own domains to internal services and let NetBird handle TLS and routing via CNAME verification\n- Built-in authentication - Protect exposed services with SSO (via your configured IdP), PIN codes, passwords, or magic links directly from the dashboard\n- Multiple targets - Route traffic to one or more backend peers or resources with optional path-based routing\n- Access logs - Monitor who's accessing your proxied services with built-in logging\n- Proxy settings - Fine-tune behavior with options like host header passthrough and redirect rewriting\nAdd a Service\nExpose any internal service by selecting a subdomain and adding one or more backend targets. Each target points to a peer or resource on your network.\nCustom Domains\nBring your own domain by adding a CNAME record pointing to your NetBird proxy cluster. NetBird handles TLS certificate provisioning automatically.\nAuthentication\nSecure your exposed services with multiple authentication methods. Enable one or combine several for layered protection.\nSettings\nFine-tune proxy behavior with options like passing the original Host header to your backend or rewriting redirect URLs to use the public domain.\nLearn more:\n- Reverse Proxy Overview\n- Custom Domains\n- Authentication\nNetBird cloud support is coming soon, with hosted reverse proxy nodes.\n🏗️ Self-Hosted Improvements\n- Added combined NetBird server binary for simplified self-hosted deployments, reducing the number of containers needed to run NetBird.\n  #5232\n🔒 Management Improvements\n- Enforced access control on accessible peers, ensuring proper authorization checks when querying the accessible peers endpoint.\n  #5301\n- Added cloud API spec to the public OpenAPI definition with REST client support.\n  #5222\n🖥️ Client Improvements\n- Added early message buffer for the relay client, preventing message loss during connection establishment.\n  #5282\n- Refactored relay connection container for improved reliability and code maintainability.\n  #5271\nWhat's Changed\n- [misc] Update sign pipeline version by @mlsmaycon in #5296\n- [self-hosted] add netbird server by @braginini in #5232\n- [management] Enforce access control on accessible peers by @bcmmbaga in #5301\n- [misc] Add cloud api spec to public open api with rest client by @bcmmbaga in #5222\n- [client] Add early message buffer for relay client by @pappz in #5282\n- [client] Refactor/relay conn container by @pappz in #5271\n- [management, reverse proxy] Add reverse proxy feature by @pascal-fischer in #5291\nFull Changelog: v0.64.6...v0.65.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.65.0","version":0,"site":"https://netbird.io/","source":"NetBird GmbH","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}