{"appId":"w:NetSetMan.NetSetMan","appShortcutName":"NetSetMan","appDisplayName":"NetSetMan","authorId":"w:winget","releaseTagName":"winget-5.4.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Manage all your network settings with ease\n\nNetSetMan is a network settings manager software for easily switching between your preconfigured profiles. Combined with an outstanding Wi-Fi management and practical networking features, it is an essential tool for every laptop user.\n- IP Addresses (IPv4 & IPv6)\n- Gateway, DNS, WINS\n- WiFi Management\n- Computer Name\n- Workgroup\n- Default Printer\n- Network Drives\n- NIC Status\n- Connections (RAS/DUN/PPP/VPN)\n- DNS Suffix\n- Route Table\n- SMTP Server\n- Hosts File\n- System Settings (Display, Audio, Firewall, …)\n- Driver Settings (Speed/Duplex, MTU, Flow Control, VLAN-ID, Protocol Bindings)\n- MAC Address\n- Scripts (BAT, VS, JS, …)\n- Program execution\nNetSetMan offers what you've been missing in Windows until now:\nA powerful, easy-to-use interface to manage all your network settings at a glance. Give it a try and you'll never want to be without it again.\nAll settings and changes are automatically saved in a separate file (netsetman.xml) so that they can be easily backed up and transferred.\nActivate a stored profile with one click or even completely automatically!\n- Windows 11 build 24H2 compatibility\n- Security update:\n  For security reasons, the application can now only be run without\n  administrative privileges if the program file is located in the\n  installation folder. If executed from any other location, a UAC prompt\n  will be triggered.\n- Windows 11 24H2 Wi-Fi compatibility:\n  Starting with Windows 11 build 24H2, access to the Wi-Fi API is\n  secured by location privacy settings, as nearby wireless networks\n  can be used to determine a device’s location. To continue using\n  WiFi-Management and AutoSwitch, desktop applications must be granted\n  location access. A new information dialog now allows you to adjust\n  the required settings with a single click.\n- New language: Japanese\n- New language: Korean\n- Fix: Setting default printer with Windows 11 printer management enabled\n- Fix: Multiple issues with the Driver dialog UI","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.4.0","version":0,"site":"https://www.netsetman.com/","source":"NetSetMan GmbH","license_or_tos":"Freeware","resources":null,"verified":false}