{"appId":"w:Nevercenter.Pixelmash","appShortcutName":"Pixelmash","appDisplayName":"Pixelmash","authorId":"w:winget","releaseTagName":"winget-2025.2.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://nevercenter.com/pixelmash/download/filearchive/Install_Pixelmash_2025_2_0_win.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Resolution-independent pixel art software. A revolutionary new approach to pixel art, now available on MacOS and Windows.\n\nPixelmash is a new kind of pixel art and animation tool that makes quick work of some of the hardest parts of pixel art, letting you use high-res and vector-based layers alongside low-res per-pixel layers.\nHigh-res and vector layers are non-destructively pixelated to low resolution in real-time, giving you incredibly powerful new ways to make pixel art using transforms, tweening, and advanced layer effects!\n\n- Create rigged characters using parented layers for easy character animation with keyframes.\n- Create template files with layers and effects pre-set-up to easily create amazing art.\n- Mix and match traditional pixel-perfect, vector, and dynamic-resolution layers.\n- It's easy to make a ton of assets at different resolutions from vector and high-res artwork.\n- There are infinite ways to combine layer effects for easily-editable, non-destructive pixel art.\n- Import high-res art or SVG files, animate it with transforms, and use layer effects for outlines and other effects.\n\nYou can try Pixelmash free for 7 days. At any point, you can purchase a license to unlock the time restriction and register the program on your system.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.2.0","version":0,"site":"https://nevercenter.com/","source":"Nevercenter","license_or_tos":"Proprietary","resources":null,"verified":false}