{"appId":"w:Nevercenter.CameraBagPhoto","appShortcutName":"CameraBag Photo","appDisplayName":"CameraBag Photo","authorId":"w:winget","releaseTagName":"winget-2025.2.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://nevercenter.com/camerabag/download/filearchive/Install_CameraBag_Photo_2025_2_0_win.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"CameraBag lets you instantly apply one of hundreds of beautiful presets to your photos, and then dive deeper with ultra-intuitive professional adjustments.\n\nCameraBag lets you instantly apply one of hundreds of beautiful presets to your photos, and then dive deeper with ultra-intuitive professional adjustments.\n\n- What really sets CameraBag apart are powerful advanced tools that are also intuitive and easy to learn. High-bit-depth RAW support, unique curve tools, adjustment re-ordering/layering, and precise controls let you do things you simply can’t do in other editing software.\n- From one-click Auto Exposure, to standard Exposure, Contrast, and Brightness, and on to professional Advanced Contrast, Shadows/Midtones/Highlights, Tone Curve, and Gamma Curve adjustments (each with extra options if you want!), CameraBag gives you incredible flexibility and control.\n- CameraBag's tools are designed for simplicity, but give you advanced control when you want it. You can also apply Text Overlay and Watermark effortlessly and elegantly to whole batches of images, even when they are different sizes or proportions.\n\nSupported file formats:\n- Image loading: Standard image files - jpeg, png, tiff; RAW files - crw, cr2, nef, nrw, dng, arw, sr2, raf, mrw, pef, rw2, orf, rwl (some may require additional OSX software from Apple or camera manufacturer)\n- Image saving: jpeg, png, tiff\n\nYou can try CameraBag free for 7 days. At any point, you can purchase a license to unlock the time restriction and register the program on your system.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.2.0","version":0,"site":"https://nevercenter.com/","source":"Nevercenter","license_or_tos":"Proprietary","resources":null,"verified":false}