{"appId":"w:NickGasson.NVC","appShortcutName":"NVC VHDL Simulator","appDisplayName":"NVC VHDL Simulator","authorId":"w:winget","releaseTagName":"winget-1.18.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/nickg/nvc/releases/download/r1.18.0/nvc-1.18.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free software VHDL compiler and simulator implementing almost all of IEEE 1076-2008.\n\n\nThe main focus of this release has been improving support Verilog and mixed-language simulation and some non-trivial designs can now be simulated, for example axis2mm from ZipCPU. Additionally:\n- Scheduling of blocking and non-blocking assignments in mixed-language simulation now more accurately reflects Verilog semantics (#1227).\n- Aliases of component declarations are now allowed (#1276).\n- Added missing check that partial associations appear in a contiguous sequence (#1254).\n- The new -I analysis option adds search directories for the Verilog include directive.\n- Fixed compatibility with LLVM 21.\n- Fixed a crash when --cover-file is specified with a non-existent directory (#1287).\n- The -f analysis option can now interpolate environment variables in the file list using $var.\n- Constraints for variables and signals declared with partially constrained subtypes are now correctly propagated from the initial\n  value (#1274).\n- VHDL-2002 changes for buffer port connections are now implemented correctly (#1290).\n- The --precompile elaboration option is deprecated and will be removed in the next release. Please get in touch if you are still\n  using this.\n- Passing array out arguments using the non-standard VHPIDIRECT calling convention now works correctly (#1301).\n- Several other minor bugs were resolved (#1253, #1269, #1277, #1279, #1280, #1281).\nSpecial thank you to @bpadalino, @tmeissner, @Blebowski, @amb5l, @m42uko, @a-panella, @cmarqu, @albydnc, @johonkanen, and @augustofg for sponsoring me!","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.18.0","site":null,"source":"Nick Gasson","license_or_tos":"GPL-3.0","resources":null,"verified":false}