{"appId":"w:NitroSoftware.NitroPro","appShortcutName":"Nitro PDF Pro","appDisplayName":"Nitro PDF Pro","authorId":"w:winget","releaseTagName":"winget-14.42.0.34","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://downloads.gonitro.com/professional_14.42.0.34/en/retail/nitro_pro14_ba_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Nitro PDF Pro is an application used to create, edit, sign, and secure PDF files and digital documents.\n\n\nFixed Issues & Improvements\nImproved PDF/A Compliance & Expanded Archival Format Support\n- Nitro PDF Pro 14.42 delivers a major upgrade to its PDF/A engine. The core conformance library has been updated to ensure more reliable, standards-aligned PDF/A output after conversion, and Nitro now supports the full family of PDF/A-3 variants:\n  - PDF/A-3a\n  - PDF/A-3b\n  - PDF/A-3u\n- The expanded PDF/A-3 support significantly increases Nitro's compatibility with modern archival, accessibility, and document-exchange standards and empowers users to create archival-grade PDFs with embedded data, accessibility, and enhanced search-ability.\nStability & Reliability\n- Crash prevention improvements:\n  - Added robust memory checks to prevent rare crashes when rendering large or complex images.\n  - Fixed a crash that occurred when editing documents with corrupt page trees — the app now handles such files gracefully without crashing.\n- Improved error handling:\n  - Fixed scenarios where documents could become locked and undeletable after failed PDF/A conversions.\n  - Resolved two issues that previously prevented successful FDF data imports for documents with template pages or nested form fields.\n- Display & character handling:\n  - Fixed corruption issues when editing documents containing Macron characters (used in Māori and similar languages).\n  - Annotations with Chinese or other non-Latin text now display and can be edited correctly in Adobe Acrobat.\nCompatibility & Feature Enhancements\n- Annotation standardization:\n  - Corrected a minor spec typo in text annotation intent (FreeTextTypeWriter), improving compatibility with third-party viewers like MuPDF. Backward compatibility with older annotations is maintained.\n- Signature handling:\n  - Improved consistency by displaying signer names only from the certificate, ensuring accuracy even when annotations contain inconsistent data.\n- Redaction enhancements:\n  - Refined overlay text behavior:\n    - Fixed font sizing logic for \"Auto\" mode to ensure text fully fits within the redaction area.\n    - Disabled \"Repeat text\" when auto-sizing is enabled.\nSecurity & Compliance\n- Updated core components: Upgraded the FreeType library to v2.14.1, addressing known vulnerabilities.\n- Enhanced registry protection: Closed a potential loophole where URLs could be injected via registry keys.\n- Safer timestamp handling: Fixed parsing issues for timestamps from Entrust timestamp servers, ensuring signature verification consistency.\nCloud & Integration Improvements\n- iManage integration:\n  - Added options to follow redirections in all iManage calls.\n  - Introduced new feature flag imanage.redirect_to_default_if_wrong_server for flexible connection handling.\n  - Fixed an issue that caused auto-tagging to fail when opening documents from iManage remote storage.\n- SharePoint integration:\n  - Streamlined auto-tagging workflow to reduce redundant confirmation prompts during document opening.\nUX & Productivity Enhancements\n- Batch processing: The \"Ask before overwriting an existing file\" option is now enabled by default, helping users avoid accidental data loss.\n- UI consistency:\n  - Disabled drag-and-drop reordering in the signature tree to prevent confusion.\n  - Exposed the former skip_image_merge registry option in the Printer Preferences UI, improving accessibility for power users.\nInternal & Engineering Improvements\n- Fixed internal build job failures and removed redundant dependencies to simplify maintenance.\n- Added new automated test coverage to strengthen regression protection for future updates.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"14.42.0.34","version":0,"site":"https://www.gonitro.com/","source":"Nitro","license_or_tos":"Proprietary","resources":null,"verified":false}