{"appId":"w:NSIS.NSIS","appShortcutName":"Nullsoft Install System","appDisplayName":"Nullsoft Install System","authorId":"w:winget","releaseTagName":"winget-3.11","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A professional open source system to create Windows installers\n\nNSIS (Nullsoft Scriptable Install System) is a professional open source system to create Windows installers. It is designed to be as small and flexible as possible and is therefore very suitable for internet distribution.\nBeing a user's first experience with your product, a stable and reliable installer is an important component of successful software. With NSIS you can create such installers that are capable of doing everything that is needed to setup your software.\nNSIS is script-based and allows you to create the logic to handle even the most complex installation tasks. Many plug-ins and scripts are already available: you can create web installers, communicate with Windows and other software components, install or update shared components and more.\nF.1.1 Release Notes\nYour installer will still fit on a single floppy disk. Or even eight.\n\nF.1.2 Changelog\n\nF.1.2.1 Security\n- Retry creating restricted $PLUGINSDIR (thanks Sandro Poppi for responsibly disclosing, bug #1315)\n  This stops a possible privilege escalation. A malicious actor can create the temporary plugins directory ($PLUGINSDIR) at just the right time and fill it with malicious files that the installer might use. Installers running as SYSTEM use C:\\windows\\temp which is accessible by all users on the system. Any user can use this bug to gain SYSTEM privileges by winning the race condition with an installer that starts as SYSTEM.\n\nF.1.2.2 Minor Changes\n- Retry opening self if there is a sharing error (partial patch #316)\n- Support setting source file decoding charset with magic comment (patch #292)\n- Fixed LicenseBkColor for uninstaller (bug #1314)\n- Handle CHARSET command line parameter in MakeNSISW (patch #315)\n- Make System/Resource.dll reproducible (patch #312)\n- Zip2Exe accepts .zip as command line parameter\n\nF.1.2.3 Translations\n- Updated Finnish (patch #313)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.11","version":0,"site":"https://nsis.sourceforge.io/","source":"Nullsoft and Contributors","license_or_tos":"Zlib or Libpng","resources":null,"verified":false}