{"appId":"w:Objective.Trapeze","appShortcutName":"Objective Trapeze","appDisplayName":"Objective Trapeze","authorId":"w:winget","releaseTagName":"winget-25.10.29460.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://s3-ap-southeast-2.amazonaws.com/trapezedownload.objective.com/Objective_Trapeze_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Software purpose-built for planning and building teams. All the tools you need to assess, compare, annotate and approve digital plans.\n\n\nChanges\n- Changed the Customize Toolbar and Customize Keyboard dialogs to include Add Page Numbers, Add To Favourites, Append Files, Append Scanned Pages, Delete Selected Pages, Duplicate Selected Pages, Find, Find Next, Find Previous, Go To Page, New Bookmark, New Bookmark Folder, Replace Current Page with Scanned Pages, Save Current Page, Scan After Current Page, Scan Before Current Page, Show Settings Dialog Before Scanning, Stamp Selected Pages, Undo, View Annotations, View Bookmarks, View Selected Thumbnails, View Thumbnails\n- Changed to support keyboard shortcuts for script commands\n- Increased the size of the Customize Toolbar dialog\nFixes\n- Fixed a potential memory issue\n- Fixed an issue causing bookmarks to have incorrect destination page numbers\n- Fixed issues compressing PDFs larger than 2 GB in size\n- Fixed PDF compression errors not being shown to the user\n- Fixed vertical scroll bars in the Customize Toolbar dialog not updating when dragging between toolbar list boxes causes scrolling","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"25.10.29460.1","version":0,"site":"https://www.objective.com/","source":"Objective Corporation Limited.","license_or_tos":"Proprietary","resources":null,"verified":false}