{"appId":"w:Omnissa.HorizonClient","appShortcutName":"Omnissa Horizon Client","appDisplayName":"Omnissa Horizon Client","authorId":"w:winget","releaseTagName":"winget-8.17.0.42163","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download3.omnissa.com/software/CART26FQ4_WIN_2512/Omnissa-Horizon-Client-2512-8.17.0-20184583317.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect to your Omnissa Horizon virtual desktop from your device of choice.\n\nOmnissa Horizon Clients for Windows, Mac, iOS, Linux, Chrome and Android allow you to connect to your Omnissa Horizon virtual desktop from your device of choice giving you on-the-go access from any location.\nOmnissa Horizon Client for Windows Release Notes\nHorizon Client for Windows 2512 | 16 DEC 2025\nWith Horizon® Client™ for Windows 2512, you can access remote desktops and published applications from your Windows computer with the best possible user experience on the Local Area Network (LAN) or across a Wide Area Network (WAN).\nWhat’s New\nHorizon® Client™ for Windows 2512 includes the following new features:\n- Video Rendering\n  Horizon Client for Windows now handles video rendering with improved Direct3D 11 (D3D11) hardware acceleration support. This setting allows you to configure the client’s video rendering path.\n- On-Demand Clipboard Rendering\n  The clipboard redirection size limit has now been increased to 4GBs, with support for all Windows data formats for copy-paste between the virtual desktop and the local endpoint machine.\n- Broker Management\n  The new Horizon Client Restrictions option blocks or warns users from connecting to administrator-specified Horizon Client versions.\n- Multiple Monitor Nested Mode\n  Nested mode is now supported for multiple monitors.\n- Public IP telemetry reporting\n  The Horizon Client for Windows DEEM plug-in now collects the client device’s public IP address from the DEEM agent when a user connects to a remote session.\n- RDP Session Detection Policy\n  This release adds an agent-configurable policy that allows Horizon to detect active RDP sessions on a Windows device running the Horizon Windows Client. This new capability adds to session awareness and supports sites that need to control or track Horizon usage that is started from RDP connections.\n- FIDO2 / WebAuthn Redirection Support for UWP and Win32 Applications\n  The Horizon Windows Client now supports FIDO2 (WebAuthn) redirection for both UWP applications and traditional Win32/Desktop applications running inside the remote session. This enhances end-user authentication scenarios, such as signing into the new Outlook for Windows (UWP) and Microsoft Teams, by enabling secure and seamless FIDO2 device usage directly inside the virtual desktop.\n- Updated proxy authentication to use SPNEGO/Kerberos\n  The Windows client now establishes proxy connections using SPNEGO with Kerberos. This aligns Microsoft’s security guidance and leverages authentication flows already supported by modern browsers like Edge and Chrome.\nBefore You Begin\n- For the Windows operating systems that this release of Horizon Client for Windows supports, see the Horizon Client for Windows Guide.\n- Horizon Client for Windows is supported with the latest maintenance release of the following deployment types:\n  - Omnissa Horizon 8 version 2006 and later\n  - Omnissa Horizon Cloud Service - Next-Gen\n  - Horizon Cloud in Microsoft Azure\n- To use Horizon Client in FIPS mode, you must use Connection Server version 2309 or later; if using Unified Access Gateway, you must also use Unified Access Gateway 2309 or later. For more information, see Omnissa Knowledge Base (KB) article 95144.\n- To install Horizon Client for Windows, download the installer from the Horizon Clients download page.\n- For installation instructions, see the Horizon Client for Windows Guide.\n- For information about the features that are supported in nested mode, see Omnissa Knowledge Base article 80509, “Horizon Guidelines for Nested Mode.”\nResolved Issues\nThe following issues are resolved in this release.\n- Spaces are input in published applications during keyboard input instead of complete text strings.\n- Black box flickering appears briefly in the user interface before interface elements were loaded in published applications.\n- Monitor selection changes don’t apply correctly in multi-monitor environments.\n- The display freezes when moving applications between monitors in multi-monitor RDP sessions deployed as RDSH applications.\n- Horizon Client freezes during VDI connections due to a thread deadlock.\n- Audio issues with Teams virtualization during call including transfers.\n- USB device is unexpectedly treated as redirected under SDR.\nKnown Issues\n- Jumplist, URI, and Shortcuts may not work for Horizon Client Next.\n  Workaround: Rename horizon-client-next to horizon-client. You can also rename the existing horizon-client binary to any name of your choice to avoid conflicts.\nDocumentation\nHorizon Client for Windows documentation is in the Omnissa Product Documentation.\nLocalized Content for Omnissa Docs\nFor details on Omnissa’s localization strategy, see Announcing Omnissa Localization Support.\nSupport Contact Information\nTo receive support and to learn more about support policies, see Omnissa Customer Connect.\nFor information on filing a support request in Customer Connect and via Cloud Services Portal, see Omnissa Knowledge Base article 6000005.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.17.0.42163","version":0,"site":"https://www.omnissa.com/","source":"Omnissa, LLC","license_or_tos":"Proprietary","resources":null,"verified":false}