{"appId":"w:Omnissa.HorizonClient","appShortcutName":"Winget Application","appDisplayName":"Omnissa Horizon Client","authorId":"w:winget","releaseTagName":"winget-8.15.0.24358","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download3.omnissa.com/software/CART26FQ1_WIN_2503/Omnissa-Horizon-Client-2503-8.15.0-14236595709.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Connect to your Omnissa Horizon virtual desktop from your device of choice.\n\nOmnissa Horizon Clients for Windows, Mac, iOS, Linux, Chrome and Android allow you to connect to your Omnissa Horizon virtual desktop from your device of choice giving you on-the-go access from any location.\nOmnissa Horizon Client for Windows Release Notes\nHorizon Client for Windows 2503 | 15 APR 2025\nWith Horizon® Client™ for Windows 2503, you can access remote desktops and published applications from your Windows computer with the best possible user experience on the Local Area Network (LAN) or across a Wide Area Network (WAN).\nWhat’s New\nHorizon Client for Windows is released along with the Horizon 8 2503 release.\nBefore You Begin\n- For the Windows operating systems that this release of Horizon Client for Windows supports, see the Horizon Client for Windows Guide.\n- Horizon Client for Windows is supported with the latest maintenance release of the following deployment types:\n  - Omnissa Horizon 8 version 2006 and later\n  - Omnissa Horizon Cloud Service - Next-Gen\n  - Horizon Cloud in Microsoft Azure\n- To use Horizon Client in FIPS mode, you must use Connection Server version 2309 or later; if using Unified Access Gateway, you must also use Unified Access Gateway 2309 or later. For more information, see Omnissa Knowledge Base (KB) article 95144.\n- To install Horizon Client for Windows, download the installer from the Horizon Clients download page.\n- For installation instructions, see the Horizon Client for Windows Guide.\n- For information about the features that are supported in nested mode, see Omnissa Knowledge Base article 80509, “Horizon Guidelines for Nested Mode.”\nLimitations\nThis release may not work with existing Zoom, Cisco, Nuance, and Imprivata integrations.\nResolved Issues\nThere are no major issue resolutions to report in this release.\nKnown Issues\n- Horizon Client for Windows Auto-Update The auto-update for Horizon Client for Windows versions 2406.1 (8.13.1) or earlier to 2503 will not work.\n  Workaround: Perform a two-step upgrade. You need to be on a minimum version of 2406.1 (8.13.1) to auto-update Horizon Client for Windows. The auto-update for Horizon Client for Windows versions 2406.1 (8.13.1) and later to the 2503 Omnissa-branded Client for works.\n- UDP and IPv6 conflict\n  UDP-only mode does not work in IPv6 environments.\n  Workaround: None.\n- Enable Relative Mouse feature does not work on touch-enabled screen\n  If you use a touch-enabled screen on your client system to work in a remote desktop, do not use the Enable Relative Mouse feature. This feature provides improved mouse performance for 3D and CAD applications, but for touch-enabled screens and tablets, the mouse coordinates are not translated properly, even in 3D and CAD applications.\n  Workaround: None.\n- Tax issues for IBM Credit Memos\n  N/A\n- Remote application launches and displays a black area after legal notice confirmation\n  After confirming the legal notice, the remote application launches and displays a black area in the UI.\n  Workaround: Disconnect then reconnect the remote application.\n- Keylogger blocking does not work in nested sessions\n  When users attempt to open a nested session in which both the host and guest desktops have keylogger blocking enabled and all required drivers installed, the connection is denied.\n  Workaround: None.\n- When a remote desktop is reconnected, Powermic Speechmic does not work with DMO 2022.2\n  When a remote desktop is reconnected after being disconnected, Powermic device does not work with dictation on DMO 2022.2. This happens when using a USB split and RTAV solution.\n  Workaround: Use Nuance extension to redirect Powermic devices on the remote desktop.\n- Horizon Client for Windows quits when launching a remote desktop\n  Horizon Client for Windows might quit unexpectedly when launching a remote desktop with multiple monitors at a high resolution.\n  Workaround : Check the supported multiple monitor configurations in the documentation to resolve this issue. If you still encounter this issue, consider the following workarounds:\n  - Configure your monitor layout so that it’s not very wide or very tall (for example, use a tile/matrix layout instead of using single row/column of monitors).\n  - Try not to launch multiple desktops with multiple monitors in one client instance, but start a new client instance to launch another remote desktop.\n  - Use the Omnissa Horizon Blast protocol to start the remote desktop.\n- Limited context menu with Browser Redirection feature\n  With the Browser Redirection feature, the context menu options on right click are limited to open link in new tab, open link in new window, back, and forward.\n  Workaround: None.\n- Incorrect event log report\n  With the clipboard audit feature, the event log reports one byte more than the actual length of the data that was copied from the agent machine to the client machine. For example, if you copy 10 bytes of data from a remote desktop to the client machine, the event log reports “XXX copy 11 bytes CPFORMAT_TEXT data from Horizon Agent to Horizon Client XXX with clipboard.” Also, if “\\r\\n” is in the copied text, the event log records only the length of “\\r.” For example, if you copy the following text, the audit message records the length as 12 bytes:\n\n  aaa\n  bbb\n  ccc\n\n  Workaround : None.\n- Error when connecting to a remote desktop with the Microsoft RDP display protocol\n  A “Pending session expired” error might occur when you try to connect to a remote desktop with the Microsoft RDP display protocol. This problem only occurs in large-scale environments where a Unified Access Gateway appliance is used, and virtual printing is enabled.\n  Workaround : Establish a connection to the remote desktop without using a Unified Access Gateway appliance, or disable virtual printing and establish a connection using RDP.\n- RDP session ends on the physical machine\n  If you use the RDP protocol to connect to a published desktop from a physical machine, and then you try to connect to the same published desktop from a zero client, the RDP session ends on the physical machine and the zero client cannot connect.\n  Workaround : Relaunch the same desktop pool with RDP from the physical machine, select Options > Disconnect and logoff in the launched RDP session, and then reconnect to the same desktop pool from the zero client.\n- Client’s “log in as current user” function is not available\n  If you install Horizon Agent and then install Horizon Client on the same Windows machine (a nested mode installation), and you later uninstall Horizon Agent, the client’s “log in as current user” function is lost after Horizon Agent is uninstalled. This problem occurs because the wsnotify.dll file is removed after Horizon Agent is uninstalled.\n  Workaround : Reinstall Horizon Agent or Horizon Client to bring back the “log in as current user” function.\n- Windows Fax and Scan hangs\n  On Windows 10, Windows Fax and Scan hangs when using a CardScan 800 device.\n  Workaround: None.\n- Mouse pointer does not move downward\n  If you have multiple monitors with different screen resolutions and expand Horizon Client to all monitors and then select the Enable Relative Mouse feature, occasionally, the mouse pointer might not be able to move downward beyond a certain position.\n  Workaround: Press Ctrl+Alt.\n- Horizon Client may stop responding when Automatically Connect at Startup is selected\n  If you select Connect USB Device > Automatically Connect at Startup for a camera in nested mode, Horizon Client may stop responding when you reconnect the second hop agent but the USB audio devices are removed immediately in the client side.\n  Workaround: None.\n- Bandwidth Limit setting for serial port redirection fails to take effect\n  The serial port redirection group policy setting Bandwidth Limit does not set a limit on the bandwidth.\n  Workaround : Use third-party software to limit the bandwidth.\n- Performance of Horizon Blast slows down with serial port redirection at high baud rate\n  With serial port redirection at a high baud rate such as 115200, the performance of Horizon Blast slows down, and the connection might sometimes hang.\n  Workaround : Use a baud rate of 9600.\n- IPv6 IP mapping for LBP results in issues\n  In an IPv6 environment, if you configure IP address mapping for location-based printing, users might encounter a problem accessing the printer because the client can have multiple IPv6 addresses. Anytime the client connects, it can use any one of the addresses.\n  Workaround : Use the location-based printing group policy setting IP Range to include the multiple addresses. However, the printing problem might still occur because the client might use a temporary address, which is not in the specified range.\n- White border appears to the right side of the desktop window\n  On a Windows 11 client machine, a white border appears to the right side of the desktop window. When you launch a desktop in All Monitors mode and then quit the All Monitors mode and maximize the desktop, a white border is displayed to the right side of the desktop window.\n  Workaround: This is a Microsoft Windows 11 issue. Until Microsoft fixes this issue, launch the desktop directly in large mode.\n- Wacom500B cannot be unshared from agent\n  If you enable Automatically Connect when Inserted for Wacom500B, it is not unshared on the local client after the device is redirected. This is because the arbitrator deletes the device when unsharing it from agent to client but if the device is still plugged in on the client side, it is re-added.\n  Workaround: None.\nDocumentation\nHorizon Client for Windows documentation is in the Omnissa Product Documentation.\nLocalized Content for Omnissa Docs\nFor details on Omnissa’s localization strategy, see Announcing Omnissa Localization Support.\nSupport Contact Information\nTo receive support and to learn more about support policies, see Omnissa Customer Connect.\nFor information on filing a support request in Customer Connect and via Cloud Services Portal, see Omnissa Knowledge Base article 6000005.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"8.15.0.24358","site":"https://www.omnissa.com/","source":"Omnissa, LLC","license_or_tos":"Proprietary","resources":null,"verified":false}