{"appId":"w:OpenCPN.OpenCPN","appShortcutName":"OpenCPN","appDisplayName":"OpenCPN","authorId":"w:winget","releaseTagName":"winget-5.12.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A concise ChartPlotter/Navigator. A cross-platform ship-borne GUI application supporting * GPS/GPDS Postition Input * BSB Raster Chart Display * S57 Vector ENChart Display * AIS Input Decoding * Waypoint Autopilot Navigation\n\n\n16 September, 2025\nFOR IMMEDIATE RELEASE\nThe OpenCPN Development Team is proud to announce the release of OpenCPN Version 5.12.4.\nOpenCPN Version 5.12.4 is available for immediate download.\nThis version is a service/maintenance release of OpenCPN.\nOpenCPN is a cross platform electronic navigation system (ECS) supporting a variety of cartography standards and hardware interface protocols. Versions are available for linux, Windows, Raspberry Pi, and MacOS computer architectures.\nSome features of OpenCPN include:\nQuilted Raster(RNC) and Vector(ENC) digital chart display.\nSupport for MBTiles photo and geographical chart overlays.\nIndustry standard GPS receiver interfacing, with \"moving map\" on-screen vessel tracking.\nAIS receiver interfacing with configurable target safety monitoring.\nIntegrated Route, Track, and Waypoint database, with industry standard Import/Export capabilities.\nTide and Current prediction, with on-screen overlay of predicted data.\nBroad International Language support.\nPlugIn architecture allowing on-going third-party functional enhancements.\nOpenCPN is released under the GPLV2 license. The executable program and its source code are available for immediate, free, and unlimited download from github.com.\nOpenCPN Version 5.12. series contains many new features and enhanced functions.\nNew and upgraded features and capabilites:\nImproved Connections management dialog.\nRevised Data Monitoring Subsystem\nUpgraded internal storage method for nav objects such as points, routes, and tracks.\nNew on-screen Notification system, increasing user access to critical events.\nEnhanced Plugin API, enabling advanced plugin features.\nUpdated Chart Canvas display options, including 10 Hz updates and inertia physics.\nAdd \"official\" signatures to MacOS installation packages.\nImproved OpenGL graphics support and performance on all platforms.\nIncorporate extensive user feedback to resolve various UI flaws and functional errors.\nImproved embedded UserManual, mirroring evolving online Wiki presentation.\nImproved reliability and stability across all platforms.\nWe hope you enjoy the new features of OpenCPN Version 5.12.4, and look forward to your continued feedback.\nFor Download links, plugins, documentation, and other useful information, visit our support website at:\nhttps://opencpn.org/\nThe OpenCPN Development Team\nDave Register, Lead Developer","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.12.4","version":0,"site":"https://github.com/OpenCPN","source":"opencpn.org","license_or_tos":"GPL-2.0","resources":null,"verified":false}