{"appId":"w:OpenRCT2.OpenRCT2","appShortcutName":"OpenRCT2","appDisplayName":"OpenRCT2","authorId":"w:winget","releaseTagName":"winget-0.4.31","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OpenRCT2/OpenRCT2/releases/download/v0.4.31/OpenRCT2-v0.4.31-windows-installer-x64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OpenRCT2/OpenRCT2/releases/download/v0.4.31/OpenRCT2-v0.4.31-windows-installer-arm64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Open source re-implementation of RollerCoaster Tycoon 2\n\nAn open-source re-implementation of RollerCoaster Tycoon 2, a construction and management simulation video game that simulates amusement park management.\n- Feature: [#25844] The sprite builder now also supports adding JSON-based palettes.\n- Improved: [#3788] Self-intersecting track designs can now be placed.\n- Improved: [#25719] The weather change dropdown now shows icons next to the weather types for easier selection.\n- Improved: [#25765] The ‘View options’ and ‘Special track elements’ dropdowns no longer need click-and-hold.\n- Improved: [#25858] macOS now supports the onboarding menu.\n- Improved: [#25882] Maze construction now auto-removes trees.\n- Improved: [objects#421] The vehicle tab of some rides now shows more of the vehicle.\n- Change: [#25018] Add upkeep cost to booster pieces.\n- Fix: [#4643, #25167] Many metal supports draw with a filled in top when they didn’t in vanilla, causing some slight misalignment and glitching.\n- Fix: [#15009] Landscaping tools do not display estimates when the game is paused (original bug).\n- Fix: [#18441] Replacing footpaths sometimes results in a spurious “Footpath in the way” error (original bug).\n- Fix: [#20620] In-game console caret does not update when pasting.\n- Fix: [#20652] Twister Roller Coaster design ‘u(0241)’ has no preview and cannot be built (bug in track design).\n- Fix: [#23859] Wrong banner text displayed after loading a different park.\n- Fix: [#25221] When trying to cancel game file discovery, the prompt reappears.\n- Fix: [#25703, #25889] Crash when scanning scenarios with packed objects in parallel.\n- Fix: [#25739] Game freezes when a tab in the New Ride window contains more than 384 items.\n- Fix: [#25745] Crash when a player connection is aborted early.\n- Fix: [#25775] Network download sizes are in bytes instead of the listed kibibytes.\n- Fix: [#25799] The animated options tab icon of the news window does not always redraw.\n- Fix: [#25850] Guests do not have their happiness penalised by low energy, high hunger, high thirst, high toilet.\n- Fix: [#25850] Ride nausea generation is different compared to vanilla.\n- Fix: [#25854] When a guest is at 0 happiness or energy, the game draws too big of a bar in the guest stats window.\n- Fix: [#25862] Diagonal and inclined brakes are not counted when calculating upkeep cost.\n- Fix: [#25873] Repainting a banner in OpenRCT2-specific colours results in an error message.\n- Fix: [#25879] Guest window viewport doesn’t follow vehicle when they board a ride.\n- Fix: [#25908] Crash from use-after-free in banner text formatting during multithreaded rendering.\n- Fix: [objects#419] Alignment of RCT2 red, yellow and green queue previews is off.\n- Fix: [objects#424] Jet Aeroplane decor has a hole in it.\n- Fix: [objects#425] Capacity of ‘Blob from outer space ride’ is incorrectly listed.\nRelease created in https://github.com/OpenRCT2/OpenRCT2/actions/runs/21565272977","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.4.31","version":0,"site":"https://openrct2.io/","source":"OpenRCT2","license_or_tos":"GPL-3.0","resources":null,"verified":false}