{"appId":"w:OpenSight.FlashFXP","appShortcutName":"FlashFXP","appDisplayName":"FlashFXP","authorId":"w:winget","releaseTagName":"winget-5.4.0.3970","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure FTP Client Software for Windows. Upload, Download, and Synchronize your files.\n\nFlashFXP is a FTP, FTPS, SFTP client for Windows. Secure, reliable, and efficient file transfers.\nUse FlashFXP to publish and maintain your website. Upload and download files, such as documents, photos, videos, music and more! Transfer or backup local and remote files, plus (FXP) server to server ftp transfers.\nFlashFXP offers unique and complimentary advanced features for client configuration. Share files with your friends and co-workers (FTP or SFTP server required).\nAvailable in over 20 languages: Bulgarian, Chinese Simplified, Chinese Traditional, Czech, Danish, Dutch, English, Estonian, French, German, Hungarian, Italian, Norwegian, Polish, Portuguese-European, Romanian, Russian, Spanish, Swedish, Turkish.\nAt OpenSight Software, we pride ourselves on delivering an outstanding user experience, from less technical individuals to industry class professionals, anyone can master FlashFXP.\n- Added a new Character Encoding setting \"Strict character encoding\" in the Site Manager / Options tab. When checked, FlashFXP will not attempt to detect UTF-8 mixed with non-UTF-8 text. On servers that do not use UTF-8 certain character encodings may incorrectly detect as UTF-8 and as a result garble the text, checking this setting can avoid the issue. We have seen this issue on Xlight FTP server software when using the character encoding Chinese Simplified (GBK/GB2312)\n- Fixed: A slow performance startup issue under a remote terminal session when the window state was maximized.\n- Change: When running under a remote terminal session we've reduced the amount of memory allowed to be allocated for remote directory caching. The original memory allocation limit was calculated based on a desktop PC and now we a different method for server environments to make FlashFXP more server resource friendly.\n- The crash report dialog is now dpi-aware.\n- Updated SecureBlackBox library.\n- Fixed: In a site profile if the login type was previously set to \"Key based\" and then changed to \"Normal\" the previously saved key was still used during authentication and before the password authentication. Now the key authentication is not attempted.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.4.0.3970","version":0,"site":"https://www.opensightsoftware.com/","source":"OpenSight Software LLC","license_or_tos":"Proprietary","resources":null,"verified":false}