{"appId":"w:OpenShot.OpenShot","appShortcutName":"OpenShot Video Editor","appDisplayName":"OpenShot Video Editor","authorId":"w:winget","releaseTagName":"winget-3.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OpenShot/openshot-qt/releases/download/v3.3.0/OpenShot-v3.3.0-x86_64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An award-winning, open-source video editor\n\nOpenShot Video Editor is an award-winning, open-source video editor, available on Linux, Mac, Chrome OS, and Windows. OpenShot can create stunning videos, films, and animations with an easy-to-use interface and rich set of features.\nHighlights & Features:\n- New Default Theme: \"Cosmic Dusk\" brings a modern and stylish look to OpenShot.\n- Comprehensive Ripple Editing Improvements:\n  - Playhead Alignment: The playhead now aligns automatically after ripple slice operations, keeping your edits precise.\n  - Ripple Slice Enhancements: Ripple slicing supports multi-selection across different layers, allowing simultaneous slicing and realignment.\n  - Ripple Delete Optimization: Deleting clips with ripple now adjusts the timeline seamlessly, preventing gaps and maintaining synchronization.\n  - Ripple Select: Added Alt+Click for ripple selection, allowing users to select all items to the right of the clicked position, making timeline adjustments faster and more intuitive.\n  - Keyboard Shortcut for Ripple Delete: Introduced Shift+Delete for quick ripple deletion, streamlining the editing process.\n  - Focus Improvements: UI focus stays consistent on the timeline after ripple operations, ensuring uninterrupted workflow.\n- Recovery Menu: Restore previous project versions with a streamlined recovery menu, including timestamps for easy navigation.\n- Wayland-Compatible Color Picker: New color picker supports Wayland, ensuring compatibility with modern Linux systems.\n- Tutorial Dock Enhancements: Enhanced design and navigation with left/right arrows and word-wrap for wide translations.\n- Updated About Dialog: Redesigned layout with Cosmic Dusk theme alignment, word-wrap support, and a \"Copy Version Info\" option.\n- Zoom Slider Improvements: Enhanced zoom precision, frame boundary banding, and seamless navigation along the timeline.\n- Copy/Paste Overhaul: Smarter copy-paste for effects and timeline elements, with improved clipboard management.\n- Faster Timeline Updates: Significant performance boost when handling large projects or batch operations.\n- Audio Buffer Size Control: Customizable audio buffer size in preferences for optimal playback on various systems.\n- Track Resizing Fixes: Improved resizing behavior with better snapping to FPS precision.\n- Multi-Drag and Drop: Simplified handling of large clip batches with faster operations and better snapping.\n- Keyboard Shortcut Enhancements: Refined shortcuts for improved consistency and usability, aligned with industry standards.\n- Export Settings Refinements: Persistent export settings tied to projects, with \"Restore Defaults\" option.\n- No More Timeline Gaps: Automatically fixes tiny gaps during profile changes or exports to different FPS settings.\n- Translation Updates: Comprehensive updates to support additional languages and improve existing ones.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.3.0","version":0,"site":"https://www.openshot.org/","source":"OpenShot Studios, LLC","license_or_tos":"GPL-3.0","resources":null,"verified":false}