{"appId":"w:OpenRCT2.OpenRCT2","appShortcutName":"Winget Application","appDisplayName":"OpenRCT2","authorId":"w:winget","releaseTagName":"winget-0.4.21","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OpenRCT2/OpenRCT2/releases/download/v0.4.21/OpenRCT2-v0.4.21-windows-installer-arm64.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OpenRCT2/OpenRCT2/releases/download/v0.4.21/OpenRCT2-v0.4.21-windows-installer-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Open source re-implementation of RollerCoaster Tycoon 2\n\nAn open-source re-implementation of RollerCoaster Tycoon 2, a construction and management simulation video game that simulates amusement park management.\n- Feature: [#22646] New scenario files now contain a minimap image, shown in the scenario selection window.\n- Feature: [#23774] Climates can now be customised using objects.\n- Feature: [#23876] New park save files now contain a preview image, shown in the load/save window.\n- Improved: [#24078] Handrails on Wooden Roller Coaster station sprites with no platforms have been removed.\n- Improved: [objects#379] Add additional colour schemes to Mine Train.\n- Change: [#23932] The land rights window now checks “Land Owned” by default.\n- Change: [#23936] The ‘guests prefer less/more intense rides’ settings have been turned into a dropdown.\n- Change: [#24059] The ‘select other ride’ button is now available in the track designs manager.\n- Change: [#24067] [Plugin] Registered menu items are now listed alphabetically.\n- Change: [#24070] Footpath selection menus now show object names on hover using a tooltip.\n- Change: [#24101] Frozen peeps are no longer removed when using the 'remove all guests' cheat.\n- Fix: [#4225] Ride Construction window offers non-existent banked sloped to level curve (original bug).\n- Fix: [#5281] Missing supports on miniature railways built backwards.\n- Fix: [#7222] Transparent pixels in sloped path tunnels (original bug).\n- Fix: [#10379] Banners outside the park can be renamed and modified (original bug).\n- Fix: [#10582] Low clearance tunnels below water are drawn incorrectly (original bug).\n- Fix: [#17524, #23710] Station bases are drawn on many ride types when the “No entrance, no platform station” style is selected.\n- Fix: [#18169] CJK, Arabic and Vietnamese display all text as ‘???’ on Android.\n- Fix: [#18309] Flying and Multi Dimension trains glitch when changing between inverted and uninverted track when uncap fps is on.\n- Fix: [#19506] Queue paths can be placed on level crossings by replacing an existing regular path.\n- Fix: [#21803] The park fence is drawn differently in OpenGL compared to software rendering when zoomed out.\n- Fix: [#21824] Some sprites are drawn incorrectly when zoomed out in OpenGL rendering.\n- Fix: [#21908] Ride mode warnings when hovering track designs.\n- Fix: [#22820] OpenGL does not draw masked sprites correctly.\n- Fix: [#22961] Clicking on the construction preview places duplicate flat rides and stalls.\n- Fix: [#23359] Scripting: Add car.moveToTrack, an easier API than setting car.trackLocation directly.\n- Fix: [#23443] New GOG version of RCT2 is not extracted correctly.\n- Fix: [#23484] Stray coloured pixels on castle-themed stations and Roman-themed entrances/exits (original bug).\n- Fix: [#23486] Object selection minimum requirements can be bypassed with close window hotkey.\n- Fix: [#23743] Parks with guest goals over 32767 do not appear in the scenario list.\n- Fix: [#23844] Sound effects keep playing when loading another save.\n- Fix: [#23881] Compiling on Raspbian/arm-linux-gnueabihf fails.\n- Fix: [#23891] Inverted Hairpin Coaster track can draw over things above it (original bug).\n- Fix: [#23892] Gentle banked Wooden Roller Coaster track glitches as trains pass (original bug).\n- Fix: [#23897] Reverse Freefall Coaster slope up to vertical track piece does not draw a vertical tunnel.\n- Fix: [#23910] Heartline Twister Coaster track can draw over things above it (original bug).\n- Fix: [#23939] Incorrect assertion when trying to load heightmap.\n- Fix: [#23941] Underflow in “Repay loan and achieve a certain park value” objective when using Japanese.\n- Fix: [#23949] Walls draw over sloped rear water edges and those edge sprites are misaligned (original bug).\n- Fix: [#23960] Corner path fences can draw over adjacent sloped land (original bug).\n- Fix: [#23961] Lamps and queue line tvs draw incorrectly on paths with fences.\n- Fix: [#23983] Ordering files by size does not work and occasionally crashes the game.\n- Fix: [#24009] [Plugin] The object manager API does not identify recently introduced object types.\n- Fix: [#24028] Giga and LSM Launched Coaster booster sprites have pixels that draw over transparent pixels.\n- Fix: [#24077] Track Designer crashes when clicking the park fence.\nRelease created in https://github.com/OpenRCT2/OpenRCT2/actions/runs/14284640361","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.4.21","site":"https://openrct2.io/","source":"OpenRCT2","license_or_tos":"GPL-3.0","resources":null,"verified":false}