{"appId":"w:openmolecules.DataWarrior","appShortcutName":"DataWarrior","appDisplayName":"DataWarrior","authorId":"w:winget","releaseTagName":"winget-6.1.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://openmolecules.org/datawarrior/datawarrior610.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An Open-Source Program for Data Visualization and Analysis with Chemical Intelligence\n\nDataWarrior is an open-source program for data visualization and analysis with chemical intelligence. DataWarrior combines dynamic graphical views and interactive row filtering with chemical intelligence. Scatter plots, box plots, bar charts and pie charts not only visualize numerical or category data, but also show trends of multiple scaffolds or compound substitution patterns. Chemical descriptors encode various aspects of chemical structures, e.g. the chemical graph, chemical functionality from a synthetic chemist’s point of view or 3-dimensional pharmacophore features. These allow for fundamentally different types of molecular similarity measures, which can be applied for many purposes including row filtering and the customization of graphical views. DataWarrior supports the enumeration of combinatorial libraries as the creation of evolutionary libraries. Compounds can be clustered and diverse subsets can be picked. Calculated compound similarities can be used for multidimensional scaling methods, e.g. Kohonen nets. Physicochemical properties can be calculated, structure activity relationship tables can be created and activity cliffs be visualized.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.1.0","version":0,"site":"https://openmolecules.org/","source":"openmolecules.org","license_or_tos":"GPL-3.0","resources":null,"verified":false}