{"appId":"w:OpenRCT2.OpenRCT2","appShortcutName":"Winget Application","appDisplayName":"OpenRCT2","authorId":"w:winget","releaseTagName":"winget-0.4.22","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OpenRCT2/OpenRCT2/releases/download/v0.4.22/OpenRCT2-v0.4.22-windows-installer-x64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/OpenRCT2/OpenRCT2/releases/download/v0.4.22/OpenRCT2-v0.4.22-windows-installer-arm64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Open source re-implementation of RollerCoaster Tycoon 2\n\nAn open-source re-implementation of RollerCoaster Tycoon 2, a construction and management simulation video game that simulates amusement park management.\n- Feature: [#24206] [Plugin] Add APIs for breaking down rides, reading the current breakdown, and for fixing broken down rides.\n- Improved: [#20073] The OpenGL drawing engine now supports screen invalidation which avoids the redrawing of unchanged regions.\n- Improved: [#21767] RCT Classic for macOS can now be used as the source game.\n- Improved: [#23590] Title bars are now drawn bigger when “Enlarged UI” is enabled.\n- Improved: [#23626] Add small, medium and large flat and sloped turns, S-bends and diagonal track to the Go-Karts.\n- Improved: [#23982] The scenario objective window has been merged into the scenario options window.\n- Improved: [#24233] RCT Classic+ from Apple Arcade can now be used as the source game, and is detected automatically.\n- Improved: [#24260] Better performance on parks that have a lot of Guests and Entertainers.\n- Improved: [#24319] RCT Classic installs via Steam are now detected automatically on Windows.\n- Change: [#23803] Lightning strikes and thunder now happen at the same frequency independently of the game speed.\n- Change: [#23857] Replace display options tab with custom sprites.\n- Change: [#24069] [Plugin] Plugins are now available in the scenario editor and track designer.\n- Change: [#24135] Compress Emscripten js/wasm files.\n- Change: [#24194] The advanced options tab has been reworked to make it easier to find the RCT1 path setting.\n- Change: [#24235] Small changes to RCT1 theme.\n- Change: [#24236] Controls and Interface options now both have their own tabs in the Options window.\n- Change: [#24308] “Software” and “Software (hardware display)” renderers have been merged into a single “Software” renderer.\n- Change: [#24317] The scenery window now shows at least one row of scenery objects, even if there are multiple rows of tabs.\n- Fix: [#18479] Tile elements ordered beneath water do not draw correctly.\n- Fix: [#19782] Game stops counting inversions and golf holes after 31 (original bug).\n- Fix: [#21207] Track List window gets positioned incorrectly.\n- Fix: [#21919] Non-recolourable cars still show colour picker (original bug).\n- Fix: [#22182] [Plugin] Crash when using map.getAllEntities(\"car\").\n- Fix: [#22634] Asset packs with sound effect overrides are not loaded correctly at startup.\n- Fix: [#23108] Missing pieces on Hypercoaster and Hyper-Twister, even with the ‘all drawable track pieces’ cheat enabled.\n- Fix: [#24013] Failure to load a scenario preview image (minimap) could lead to an uncaught exception error message.\n- Fix: [#24045] [Plugin] Data storage is not cleared when converting save game to scenario.\n- Fix: [#24121] Checkbox labels run beyond the edge of the window if they’re too long to fit.\n- Fix: [#24142] [Plugin] Track origin is miscalculated on downward slopes.\n- Fix: [#24220] Narrow station platforms have missing sides on certain rotations.\n- Fix: [#24286] Steam installs of RCT1 and RCT2 are not autodetected on macOS.\n- Fix: [#24310] [Plugin] Missing invalidation on various plugin api setters for entities.\nRelease created in https://github.com/OpenRCT2/OpenRCT2/actions/runs/14823522563","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.4.22","site":"https://openrct2.io/","source":"OpenRCT2","license_or_tos":"GPL-3.0","resources":null,"verified":false}