{"appId":"w:Orica.SHOTPlus","appShortcutName":"SHOTPlus","appDisplayName":"SHOTPlus","authorId":"w:winget","releaseTagName":"winget-6.25.1.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.blastiq.com/installers/shotplus6/production/shotplus6.installer.production.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Advanced blast design and modelling software for complex blasts.\n\nOur SHOTPlus™ range of blast design and modelling software enable users to design, visualise and analyse blast initiation sequences across surface mine, quarry and construction applications.\n6.25.1\nVersion 6.25.1 of SHOTPlus™, first offered to users on Monday, 29th September 2025.\nA notification will appear on start-up in SHOTPlus™ once the update is available.\nFor further information on updating SHOTPlus™, please contact the BlastIQ™ Support Team via support.blastiq.com.\n\nNew\n1. The \"Edit loading rules\" window now features improved visualisation for table presence in loading rules. 1\n2. Analytics View: A new feature to display the Average Penetration Rate is now available in the Drilling view. 2\n3. Accessories recorded using the BlastIQ™ Mobile are now included in the Summary and Accessories tabs of the Quantities Report.\nInformation\n1. Visual indication of a table in Loading Rules.\n2. Average penetration rate in Analytics view.\n3. Accessories in Quantities Report.\n\nImproved\n1. Hole volume calculations now use individual hole burden values instead of row burden, resulting in more accurate design volumes. 1\n2. Exclusion Zone Tool: Updated calculator to accurately model holes with less than 1 metre of explosive charge.2\n3. The Line offset tool is now available for all users of SHOTPlus™.\n4. Included a drilling legend in \"BlastIQ™ Blast Report\", even if no legend is chosen in \"Analytics View\".\n5. Tie Legend Printing Improvements:\n   - Printing now correctly handles connector variants in the tie legend.\n   - All ties display arrows when the tie legend is visible.\n   - Arrow lengths have been increased for better visibility in printed plans.\n6. Ability to use either the actual loading or the design loading for MSW modelling. 3\n7. An update to the warning messages for better understanding of holes with Type 2 Rules. 4\n8. Improvement in Drill Data Import using text files to support True and False flags as string values, in addition to 0 and 1.\n9. Enabled option to import \"IREDES Plan files\".\n10. Updated the Vibration Prediction to support unloaded and dummy holes.\nInformation\n1.  1. Previously, SHOTPlus™ used the row burden value when calculating hole volumes if the hole was part of a row. This approach was based on legacy logic but often led to inaccurate results, especially after holes were laid out. The updated method now uses the hole-specific burden value for volume calculations, ensuring that the design reflects the actual layout and characteristics of each hole more precisely.\n   2. Exclusion Zone Tool updates as below:\n      - For holes where Length - Stemming < 1m, use of kgs for the calculation of charge mass per metre (m).\n      - For holes where Length - Stemming > 1m, continue using the current method (utilising diameter and density).\n   3. MSW Calculation by using either design or actual weight.\n   4. New Warning messages as below:\n      - Manual Edits Detected: The loading information for one or more holes in this plan has been manually edited. Please be aware that manually edited holes will not have loading rules automatically applied.\n      - Non BlastIQ™ Loading Rule Applied: One or more holes in this plan have been assigned a loading rule that does not conform to the BlastIQ™ system.\n      - Non-BlastIQ™ Condition Detected: A loading rule in this plan has been identified with a condition that does not conform to the BlastIQ™ system.\n\nFixed\n1. Fixed an Issue with the Tie Tool where product type selection retained the previous product name incorrectly. 1\n2. Graphical charging rules now correctly retain min/max hole depth values while in Imperial units.\n3. Updated the view where depth values in the loading table appeared in metric units, even when Imperial units were chosen. Now, everything should display correctly based on your selection.\n4. Fixed an issue where older rules files without profile alternatives caused errors. SHOTPlus™ now automatically adds an empty alternative entry, ensuring smoother loading and editing of legacy load rule files.\n5. Stability improvements were implemented to prevent crashes when opening and using the Row Check view at certain distances on specific files.\n6. Resolved an issue where the EBS Time Set tool incorrectly applied timing changes to deselected holes. Timing adjustments now correctly apply only to actively selected holes in the Time Set tool.\n7. Fixed an issue preventing offset times from being added for Unitronic products when using the \"Mixed Pyrotechnic/EBS products\" initiation rule.\n8. Discrepancy in Harness Wire Length calculation for EBS Tie-ups, in the Summary at \"Edit EBS Lead-in\" window and the \"EBS Field Report\".\n9. Missing DRX ID in Exported WebGen™ Report.\n10. Fixed an issue where personalised reports were not displayed when using a custom report location. Custom report paths now correctly load all available reports in the Report Designer.\n11. Users were able to simultaneously initiate more than one instance of the BlastIQ™ import workflow.\n12. Hole Loading Diagram doesn't display product names for Actual loading.\n13. DXF Import: Fixed an issue where the imported lines were thick.\n14. An issue occurred when attempting to change the colour of a surface in the Visibility Manager.\n15. Fixed an issue where the Hole Design History was throwing an error due to an empty first entry.\n16. SHOTPlus™ was posting the incorrect design to BlastIQ™ when holes contained measurements.\n17. The range for hole bearing values has been limited to [0°, 360°].\n18. Resources List:\n    1. An issue where unsupported products were displaying in the resource list.\n    2. Difference in recorded lead lengths between BlastIQ™ Mobile and SHOTPlus™.\n    3. An issue with the UNITronic™ Product Depth Display in the Hole.\n19. Exclusion Zone Tool:\n    - The calculations for the Stemming Ejection Polygon were not merged correctly when clipping polygons to Surface Topography.\n    - Stemming Ejection Surface Merging Error affecting the merging of the Stemming Ejection Surface with other surfaces. This issue occurs specifically for 3D surfaces and affects both 2D and 3D surfaces when the \"Max. distance all source\" option is selected.\n    - An issue with inconsistent predicted travel distances due to the charge mass per metre calculation for packaged explosives. The calculation method has been adjusted to ensure consistent results across identical holes.\n    - The burden calculation has been updated to use the actual hole deviation and face profile values, ensuring a more precise safety analysis.\n    - Fixed an issue where the tool shows a NaN error for a specific condition.\nInformation\n1.  1. If no valid products exist, the field displays an empty value or “N/A” on the first click.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.25.1.0","version":0,"site":null,"source":"Orica","license_or_tos":"Proprietary","resources":null,"verified":false}