{"appId":"w:ossia.score","appShortcutName":"score","appDisplayName":"score","authorId":"w:winget","releaseTagName":"winget-3.7.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ossia/score/releases/download/v3.7.1/ossia.score-3.7.1-win64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ossia score, an interactive sequencer for the intermedia arts.\n\n\nDiscord Open Collective backers and sponsors GitHub Sponsors\nossia score is a sequencer for audio-visual artists, designed to create interactive shows.\nSequence OSC, MIDI, DMX, sound, video and more, between multiple software and hardware. Create interactive and intermedia scores, script and live-code with JavaScript, ISF Shaders, Faust, PureData or C++. Leverage IoT protocols such as CoAP or MQTT, interact with joysticks, Wiimotes, Leapmotions, Web APIs and BLE sensors and integrate programs from a wealth of creative programming languages such as Structure Synth, Context-Free Art and Bytebeat. Load any kind of audio or video format and process visuals through Spout, Syphon, NDI, Shmdata or Sh4lt ; sonify large datasets with CSV and HDF5 support.\nossia score 3.7.1 is a small bugfix release on top of the large 3.7.0 release, mainly to fix MSYS2 packaging.\nFull Changelog: v3.7.0...v3.7.1\nBugfixes\n- Fix build on clang-21, necessary for MSYS2 packages.\n- Fix that Wavecycle process had been inadvertently removed.\n- Minor graphics pipeline improvements.\n- Fix an issue with the drop of preset in hotswap mode.\n- Math expressions: fix that pos was not always set to the correct value.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.7.1","version":0,"site":"https://ossia.io/","source":"ossia","license_or_tos":"GPLv3","resources":null,"verified":false}