{"appId":"w:OwenMarshall.PerlPrimer","appShortcutName":"PerlPrimer","appDisplayName":"PerlPrimer","authorId":"w:winget","releaseTagName":"winget-1.1.21","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free, open-source GUI application written in Perl that designs primers for standard PCR, bisulphite PCR, real-time PCR (QPCR) and sequencing.\n\nPerlPrimer is a free, open-source GUI application written in Perl that designs primers for standard PCR, bisulphite PCR, real-time PCR (QPCR) and sequencing. It aims to automate and simplify the process of primer design.\nPerlPrimer's current features include the following:\n- Calculation of possible primer-dimers\n- Retrieval of genomic or cdna sequences from Ensembl (including both sequences automatically for QPCR)\n- Ability to BLAST search primers using the NCBI server or a local server\n- Results can be saved or optionally exported in a tab-delimited format that is compatible with most spreadsheet applications.\n- ORF and CpG island detection algorithms\n- Ability to add cloning sequences to primers, automatically adjusted to be in-frame\n- QPCR primer design without manual intron-exon boundary entry\nPerlPrimer calculates primer melting temperature using J. SantaLucia's extensive nearest-neighbour thermodynamic parameters. To adjust for the salt conditions of the PCR, PerlPrimer uses the empirical formula derived by von Ahsen, et al. (2001) and allows the user to specify the concentration of Mg2+, dNTPs and primers, or use standard PCR conditions. The result is a highly accurate prediction of primer melting temperature, giving rise to a maximum yeild of product when amplified.\nPerlPrimer is written in Perl and Perl/Tk. In addition, for QPCR functionality PerlPrimer uses the open-source Spidey executable from NCBI, and restriction enzyme data from the REBASE project is used when adding cloning sites. The program is designed to be cross-platform compatible and has been developed and tested on both Microsoft Windows and GNU/Linux-based operating systems. Users have also reported success using the program under Mac OS X.\nPlease cite the reference below if this program is useful.\nMarshall OJ. PerlPrimer: cross-platform, graphical primer design for standard, bisulphite and real-time PCR. Bioinformatics 2004 20(15):2471-2472 [Pubmed]\nEnsembl compatibility again restored (thanks to Nick Kennedy for the fix)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.21","version":0,"site":"https://perlprimer.sourceforge.net/","source":"Owen Marshall","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}