{"appId":"w:PaperCutSoftware.MobilityPrint","appShortcutName":"PaperCut Mobility Print","appDisplayName":"PaperCut Mobility Print","authorId":"w:winget","releaseTagName":"winget-2025.10.08.0903","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.papercut.com/web/products/mobility-print/installers/server/windows/pc-mobility-print-1.0.3790.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Delivers network print services for iOS, Windows, macOS, Android, and ChromeOS devices across mixed fleet environments.\n\nMobility Print delivers network print services for iOS, Windows, macOS, Android, and ChromeOS devices across mixed fleet environments.\nIt enables all end-user clients (for example, iPhones, Chromebooks, Android phones, and laptops) that are not managed by your organization to securely print to any printer in your network. It also works with managed Chromebooks.\nWith Mobility Print’s Cloud Print feature, users can also print directly to the Mobility Print server over the internet while keeping their device’s native printing experience. This makes PaperCut Mobility Print a great replacement for the deprecated Google Cloud Print.\nCloud Print is currently available for Chromebooks, Windows, and macOS.\nSecure print release and authenticated printing are available when you set up Mobility Print together with PaperCut NG/MF.\nIt’s simple really. Mobility Print:\n- makes printing so easy it ‘just works’ from any client\n- provides a consistent print experience irrespective of the make and model of the printer.\nAnd it achieves both by having the Mobility Print server do the heavy lifting.\nFor users, Mobility Print is so easy to set up they don’t need to reach out to a SysAdmin for help. And behind the scenes, Mobility Print can scale from a small single subnet to the most complex enterprise network that serves tens of thousands of users.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2025.10.08.0903","version":0,"site":"https://www.papercut.com/","source":"PaperCut Software International Pty Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}