{"appId":"w:PatchMyPC.PatchMyPC","appShortcutName":"Patch My PC Home Updater","appDisplayName":"Patch My PC Home Updater","authorId":"w:winget","releaseTagName":"winget-5.3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://homeupdater.patchmypc.com/public/PatchMyPC-HomeUpdater.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Easily Install and Update Apps on Your Home PC\n\nProtect and Update Your PC — Did you know your computer needs regular updates to stay secure? In fact, 70% of successful malware attacks exploit outdated vulnerabilities (aka not “patching” your PC).\nInstead of spending time manually updating every single program on your home computer, our free software does it for you—updating over 500 applications automatically! This keeps your PC safe from security risks without the hassle. It’s easy, free, and helps keep hackers away.\nDon’t be part of the 55% of home users who are unaware of the importance of updating their software. The Home Updater will make patching your PC easy.\nThis release introduces multi-selection support in the List UI, significant UI and usability improvements, enhanced behavior for the self-update scheduled task, and a wide range of bug fixes.\n\nNew Features\n- Added multi-selection support in the List UI layout for the applications catalog.\n- Added support to extract compressed portable apps after downloading.\n- Implemented a compact UI layout mode for more streamlined use.\n- Added ‘Open Web Page’ command to the context menu in the app catalog.\n\nEnhancements\n- Updated headers on the startup view.\n- Enhanced behavior for the self-update scheduled task:\n- Ensures only one instance of the app runs when triggered via scheduled task.\n- Automatically recreates the scheduled task if deleted.\n- Re-enables the task during next startup if the user disabled it manually.\n- Improved the Uninstaller view for better usability.\n- Enhanced performance in the Startup Manager.\n- General UI improvements throughout the application.\n- Unified visual template for app display names across views.\n- Updated color scheme for Light Mode for better visual consistency.\n- Startup performance improvements.\n\nFixed Bugs\n- Resolved an issue where the app could hang if launched via the self-update scheduled task when no update was available.\n- Fixed an issue with installing Sumatra PDF in both UI and silent modes.\n- Resolved a UI issue where the App Types dropdown overlapped the app catalog tabs when display scaling was set above 100%.\n- Fixed an issue preventing deletion of import templates in Settings.\n- Fixed downloading issue for the Display Driver Uninstaller app.\n- Fixed extraction issue for the StaxRip app.\n- Resolved issue with removing items in the Startup view.\n- Fixed issues with Dell Command and RustDesk applications.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.3.0.0","site":"https://patchmypc.com/","source":"Patch My PC","license_or_tos":"Proprietary","resources":null,"verified":false}