{"appId":"w:PersepolisDownloadManager.Persepolis","appShortcutName":"Persepolis Download Manager","appDisplayName":"Persepolis Download Manager","authorId":"w:winget","releaseTagName":"winget-5.2.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/persepolisdm/persepolis/releases/download/5.2.0/persepolis_5.2.0.0_windows_64bit.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Persepolis is a Download Manager & a GUI For aria2.\n\nPersepolis is a download manager & a GUI for Aria2. It's written in Python. Persepolis is a sample of free and open source software. It's developed for GNU/Linux distributions, BSDs, MacOS, and Microsoft Windows.\nWe are happy to announce the release of version 5.2.0 of Persepolis Download Manager.\nThis version includes several new features and important bugs have been fixed. Therefore, we strongly recommend all users to update to the new version.\nThose who have kindly taken the responsibility of maintaining Persepolis for various distributions should note that some prerequisites for Persepolis have changed. Please visit this Persepolis wiki page before creating the Persepolis package.\nAdded Bundle for Linux Distributions\nUsers have often requested that Persepolis, like Windows and Mac, have a standalone version or a bundle for Linux distributions that can be downloaded and run with one click without worrying about installing prerequisites. This has happened in this version. You just need to download the Persepolis Linux bundle, make it executable if necessary, and easily run it with a double click. If you prefer this method, we recommend uninstalling previous versions before doing so. After the first run, the Persepolis bundle will automatically copy the .desktop file and the necessary icons to the required paths under the user's /home directory. It is important to note that we use nuitka to create the Persepolis Linux bundle, and for building for Mac and Windows, we use pyinstaller. The build process is fully automated and done via GitHub actions. Check out the automatic build repository.\nWe still welcome any one who are interested in creating and maintaining the Persepolis package for a distribution.\nPersepolis Video finder has been improved.\n- Nowadays, many video sharing sites use the m3u8. The Persepolis Video Downloader had issues downloading from some of these sites. This issue has been improved.\n- In the new version of Persepolis, when you use the Persepolis Video Finder, the video thumbnail will be displayed for you, and the highest quality version will be automatically selected for download. However, you can choose lower quality versions if you wish.\nimage\nYou can install Persepolis on FreeBSD and its derived distributions.\nRunning Persepolis on FreeBSD and its derivatives had some issues. These issues have been resolved. Persepolis does not have an official package for FreeBSD, and the version available in the official FreeBSD repositories is very old. If anyone is interested in maintaining this package for the official FreeBSD repositories, we welcome it. This link provides installation instructions for Persepolis on FreeBSD.\nScreenshot of the GhostBSD distribution with the Mate desktop env.:\nVirtualBox_ghost bsd_14_07_2025_19_27_40\nNew styles have been added or modified for different operating systems.\n- In Linux distributions and FreeBSD derivatives, by installing the Breeze package, the appearance of Persepolis will be aligned with GTK+ and QT desktops. If you are using the PySide6 version of Persepolis, we highly recommend installing the Breeze package on your operating system. We also kindly ask the respected maintainers to add this package to the prerequisites of Persepolis. This package is available in the Debian and Arch Linux repositories as breeze, in the Fedora repositories as plasma-breeze, and in the openSUSE repositories as breeze6. By installing this package and selecting the breeze style from the Persepolis settings window, the appearance of Persepolis will be reasonably aligned with your desktop. For example, the image below shows Persepolis on the Mate desktop env. .\nVirtualBox_ghost bsd_14_07_2025_19_29_45\nThis image shows Persepolis on the XFCE desktop env., and as you can see, the breeze style has been selected from the style settings window.\nimage\nThe Breeze style is not available for the Persepolis Linux bundle.\n- The Windows 11 style has also been added for Windows users.\nCapture\n- The Fusion style of Persepolis, which is available for the Persepolis Linux bundle and all operating systems, has been redesigned using the BreezeStyleSheets project.\n  Dark theme\nimage\nLight theme\nimage\nNew notification sounds have been created for Persepolis.\nPersepolis uses new notification sounds on Linux, FreeBSD, and Mac operating systems. These notification sounds are created with a setar(a Persian instrument). Therefore, there is no need to install the sound-theme-freedesktop package for Linux and FreeBSD distributions, and it should be removed from the prerequisites.\nMany bugs have been fixed.\n- In previous versions of Persepolis, long downloads encountered a Read timed out error, and the user had to resume the download. This issue has been improved.\n- Persepolis used to occupy a large amount of user RAM when downloading large files. This issue has been resolved.\n- Persepolis had issues downloading files of unknown size. This issue has been fixed.\n- New downloads sometimes caused overwriting of incomplete downloads with the same file name. This issue has been resolved.\n- The issue with the video finder not working on the Windows operating system has been fixed.\n  We thank all contributors who reported bugs or help us in fixing them. Special thanks to @eajaykumar\nThe packages for Linux, Mac, and Windows will be uploaded soon.\nRegards,\nAliReza AmirSamimi\nبسیار خرسندیم که انتشار نسخه ۵.۲.۰ دانلود منجر پرسپولیس را به اطلاع شما برسانیم.\nدر این نسخه چند قابلیت جدید اضافه شده و باگ‌های مهمی حل شده است. برای همین به همه‌ی کاربران بسیار توصیه می‌کنیم که به نسخه جدید برزورسانی کنند.\nکسانی که لطف کردند و قبول زحمت کردند و نگهداری پرسپولیس را برای توزیع‌های مختلف به عهده دارند، دقت کنند که بعضی پیش‌نیازهای پرسپولیس تغییر کرده است. لطفا قبل از ساختن بسته پرسپولیس، سری به این صفحه از ویکی پرسپولیس بزنند.\nاضافه شدن باندل برای توزیع‌های لینوکسی\nبسیار پیش می‌آمد که کاربران درخواست داشتند که پرسپولیس مانند ویندوز و مک، برای توزیع‌‌های لینوکسی هم یک نسخه stand alone یا یک باندل داشته باشد که کاربر آن را دانلود و بدون نگرانی از نصب پیش‌نیازها با یک کلیک اجرا کند. این اتفاق در این نسخه افتاده است. شما کافی است که باندل لینوکس پرسپولیس را دانلود کنید و در صورت لزوم به آن قابلیت اجرایی دهید و به راحتی با یک دابل کلیک آن را اجرا کنید. اگر به این شکل تمایل دارید توصیه می‌کنیم قبل از این کار نسخه‌های قبلی را از نصب خارج کنید. باندل پرسپولیس بعد از اولین اجرا به شکل خودکار فایل .desktop و آیکون‌های مورد نیاز را در مسیر‌های مورد نیاز در زیر شاخه /home کاربر کپی می‌کند. ذکر این نکته ضروری است که برای ساختن باندل لینوکس پرسپولیس از nuitka استفاده می‌کنیم و برای بیلد گرفتن برای مک و ویندوز از pyinstaller استفاده می‌کنیم, فرآیند بیلد گرفتن کاملا خودکار و به وسیله Github actions انجام می‌شود. مخزن بیلد خودکار پرسپولیس را ببینید.\nالبته همچنان از افرادی که تمایل دارند بسته پرسپولیس را برای یک توزیع ایجاد و نگهداری(maintain) کنند، استقبال می‌کنیم .\nویدیویاب پرسپولیس ارتقا پیدا کرده است.\n- امروزه سایت‌های ویدیویی بیشتری به سمت استفاده از m3u8 رفتند. ویدیویاب پرسپولیس برای دانلود از بعضی از این سایت‌ها دچار مشکل بود. این مشکل بهبود پیدا کرده است.\n- در نسخه جدید پرسپولیس وقتی از ویدیویاب پرسپولیس استفاده می‌کنید، تصویر Thumbnail ویدیو برای شما نمایش داده می‌شود و به شکل خودکار با کیفیت‌ترین نسخه برای دانلود مشخص می‌شود. البته شما در صورت تمایل می‌توانید نسخه‌های با کیفیت کمتر را انتخاب کنید.\nimage\nپرسپولیس را می‌توانید روی FreeBSD و توزیع‌های مشتق شده از آن نصب کنید.\nاجرای پرسپولیس روی FreeBSD و مشتقات آن با مشکلاتی همراه بود. این مشکلات رفع شده است. پرسپولیس بسته رسمی برای FreeBSD ندارد و نسخه‌ی موجود در مخازن رسمی FreeBSD بسیار قدیمی است. اگر کسی تمایل دارد که این بسته برای مخازن رسمی FreeBSD نگهداری کند، استقبال می‌کنیم. این لینک راهنمای نصب پرسپولیس روی FreeBSD است.\nاین اسکرین‌شات مربوط به توزیع GhostBSD با میزکار mate است.\nVirtualBox_ghost bsd_14_07_2025_19_27_40\nاستایل‌های جدید برای سیسم‌عامل‌های مختلف اضافه یا اصلاح شده است.\n- در توزیع‌های لینوکسی و مشتقات FreeBSD با نصب بسته Breeze ، ظاهر پرسپولیس با میزکارهای GTK+ و QT هماهنگ می‌شود. اگر از نسخه PySide6 پرسپولیس استفاده می‌کنید، بسیار توصیه می‌کنیم که بسته Breeze را روی سیستم‌عامل خود نصب کنید. از maintainer های محترم هم خواهش می‌کنیم که این بسته را به پیش‌نیازهای پرسپولیس اضافه کنند. این بسته در مخازن دبین و آرچ‌لینوکس breeze و در مخازن فدورا plasma-breeze و در مخازن اپن‌سوزه breeze6 نام دارد. با نصب این بسته و انتخاب استایل breeze از پنجره تنظیمات پرسپولیس، ظاهر پرسپولیس تا حد قابل قبولی با میزکار شما هماهنگ خواهد شد. مثلا تصویر زیر مربوط به پرسپولیس در میزکار Mate است.\nVirtualBox_ghost bsd_14_07_2025_19_29_45\nاین تصویر مربوط به پرسپولیس در میزکار XFCE است و همانطور که مشخص است، از پنجره تنظیمات استایل breeze انتخاب شده است.\nimage\nاستایل Breeze برای باندل لینوکس پرسپولیس در دسترس نیست.\n- استایل windows11 هم برای کاربران ویندوز اضافه شده است.\nCapture\n- استایل Fusion پرسپولیس که برای باندل لینوکسی پرسپولیس و همه سیستم‌عامل‌ها در دسترس است، با استفاده از پروژه‌ی BreezeStyleSheets دوباره طراحی شده.\n  رنگ‌بندی تیره\nimage\nرنگ‌بندی روشن\nimage\nهشدارهای صوتی جدیدی برای پرسپولیس ساخته شده است.\nپرسپولیس در سیستم‌عامل‌های لینوکسی، FreeBSD و مک از صداهای هشدار جدیدی استفاده می‌کند. این هشدارها با ساز سه‌تار ساخته شده است. برای همین برای توزیع‌های لینوکسی و FreeBSD نیازی به نصب بسته‌ی sound-theme-freedesktop نیست و باید از پیش‌نیارها حذف شود.\nباگ‌های زیادی برطرف شده است.\n- در نسخه‌های قبلی پرسپولیس دانلود‌های طولانی با خطای Read timed out error مواجه می‌‌شد و کاربر باید دوباره دانلود را resume میکرد. این مشکل بهبود پیدا کرده است.\n- پرسپولیس در دانلود فایل‌های با حجم زیاد مقدار زیادی از رم کاربر را اشغال می‌کرد. این مشکل برطرف شده است.\n- پرسپولیس در دانلود فایل‌های با حجم نامشخص مشکل داشت. این مشکل برطرف شده است.\n- دانلود جدید گاها باعث overwrite دانلود‌های نیمه‌کاره‌ای میشد که اسم فایل یکسان داشتند. این مشکل برطرف شده است.\n- مشکل کار نکردن ویدیویاب در سیستم‌عامل ویندوز حل شده است.\n  از همه مشارکت‌کنندگان که باگها را اطلاع دادند یا در رفع آنها ما را یازی کردند، سپاسگزاریم. تشکر ویژه از @eajaykumar\nبسته‌های مربوط به لینوکس و مک و ویندوز به زودی آپلود خواهد شد.\nبا احترام\nعلیرضا امیرصمیمی","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.2.0","version":0,"site":"https://github.com/persepolisdm/persepolis","source":"Persepolis Team","license_or_tos":"GPL-3.0","resources":null,"verified":false}