{"appId":"w:PeterPawlowski.foobar2000","appShortcutName":"foobar2000","appDisplayName":"foobar2000","authorId":"w:winget","releaseTagName":"winget-2.25.2","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.foobar2000.org/files/foobar2000-arm64ec_v2.25.2.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.foobar2000.org/files/foobar2000-x64_v2.25.2.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"foobar2000 is an advanced freeware audio player for the Windows platform.\n\n\n- Workaround for \"database is readonly\" crash.\n- Fixed bad interaction of TAK album art reader with decoder merit management.\n- Enabled album art reading & editing for: AC3/EAC3, DTS.\n- RTSP appears no longer supported by Microsoft WMA runtime - made fail with correct message.\n- Increased size limit for cover pictures embedded in MP4/M4A files or APE tags to 64MB; made refuse to write covers too large for foobar2000 to read back.\n- Made MP4/M4A publisher field recognized.\n- Fixed false errors when seeking in Matroska/FLAC with \"verify integrity of played files\".\n- Made odd-sized covers rendered with correct aspect ratio in Properties dialog.\n- Matroska seeking/chapters fixes:\n  - Fixed seeking accuracy regression introduced in 2.24.\n  - Verifier no longer complains about decoded vs reported duration mismatch on affected files (did in pre-2.24).\n- Fixed a bug causing various window positions not to be restored if too close to screen edges.\n- Suppressed flushing of pending visualization data when only running visualization momentarily disappears, fixes visualization going blank when resizing window with just one visualization running.\n- Fixed issues with implicit resampling (WASAPI shared) vs low latency in smooth seeking mode.\n- When doing both implicit resampling and channel remapping, do it in order that costs less CPU (resample then upmix, or downmix then resample).\n- Console now sanitizes bad UTF-8 in received text instead of going off the rails.\n- Fixed a bug that made files where tag reading fails impossible to add to playlist.\n- Fixed glitches in playback error log on Wine.\n- Fixed incorrect handling of non-alphanumeric characters in network passwords.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.25.2","site":"https://perkele.cc/","source":"Peter Pawlowski","license_or_tos":"Freeware","resources":null,"verified":false}