{"appId":"w:PhotoVariantsSoftware.PhotoVariants","appShortcutName":"Photo Variants","appDisplayName":"Photo Variants","authorId":"w:winget","releaseTagName":"winget-2.4.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.photovariants.com/download/pv-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Photo Variants offers an intuitive image processing tool designed to help you adjust, edit, and retouch your photos.\n\nPhoto Variants offers an intuitive image processing tool designed to help you adjust, edit, and retouch your photos. With a comprehensive suite of features, this software addresses various aspects of photo enhancement, making it easy to achieve your desired results.\n\nPhoto Variants showcases a well-thought-out design that balances functionality with simplicity. Its streamlined layout ensures that users can access a wide range of image-processing features without feeling overwhelmed by complexity or clutter. It features a comprehensive toolbar, along with dedicated panels that facilitate layer management and editing history. Additionally, it provides separate tools designed specifically for image geometry transformation, color adjustments, and the application of filters.\n\nPhoto Variants Features:\n- Color Adjustment: Control brightness, hue, saturation, contrast, levels, GRB balance, white balance, replace colors, and many more.\n- Retouching: Enjoy professional retouching tools: healing, cloning, smudge, blur, sharpness, lightening, and colorization. Сorrect minor flaws in the photo!\n- Drawing: Use brushes, pencil, and filling tools to create raster graphics or to correct existing photos. Blend the images and apply effects.\n- Transformation: Crop, flip, resize, warp, and rotate. Apply changes to a layer, a group of layers, or the entire image.\n- Filters: Take advantage of layer support and create texts, shapes, polygons, and masks. Combine images and apply effects. Use a ready-made collection of fonts, icons, and other vector graphics.\n- Graphic Design: Take advantage of layer support and create texts, shapes, polygons, and masks. Combine images and apply effects. Use a ready-made collection of fonts, icons, and other vector graphics.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.4.0.0","version":0,"site":"https://www.photovariants.com/","source":"Photo Variants Software","license_or_tos":"Freeware","resources":null,"verified":false}