{"appId":"w:Picorims.wav2bar","appShortcutName":"Wav2Bar","appDisplayName":"Wav2Bar","authorId":"w:winget","releaseTagName":"winget-0.3.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/Picorims/wav2bar/releases/download/v0.3.3-beta/Wav2Bar-win32-x64-0.3.3-beta.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Wav2Bar is a tool to make custom audio visualization and export production videos for the audio and music industry.\n\n\nThis release addresses a critical issue spoted in 0.3.2.\nChangelog\nFixed\n- Fixed: FPS, screen size and JPEG export inputs are completely broken (MSI installation) (#59)\n- Fixed: The open logs folder is broken (#58)\nKnown issues\n- none\nNote on Betas\nWav2Bar is currently in beta, which means that things actively change (UI, saves, etc.)! Please backup your saves, especially when updating Wav2Bar.\nNote for Linux\nRight now Linux is not very well supported, but I try my best to make it better bit by bit. For now you should be able to use Wav2Bar without much problem by using the zipped version or using the source code after installing the dependencies (see the README or the wiki). There are some predefined (but not tested) configs to make some other linux packages that you can try.\nNote for Mac\nMac is not supported at this moment, but you can give it a try using the source code (see the README or the wiki).\nSupport\nFor bug reports, please use the issues section of GitHub. For other support, use the discussions section or go over to my Discord server (https://discord.gg/EVGzfdP)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.3.3","version":0,"site":"https://github.com/Picorims","source":"Picorims","license_or_tos":"GPL-3.0","resources":null,"verified":false}