{"appId":"w:PioneerDevelopers.Pioneer","appShortcutName":"Pioneer","appDisplayName":"Pioneer","authorId":"w:winget","releaseTagName":"winget-20260203","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Pioneer is a space adventure game set in our galaxy at the turn of the 33rd century.\n\n\nThe Pioneer development team is proud to announce the release of Pioneer 2026-02-03, our ninth annual \"Pioneer Day\" release! This past year was mostly spent on laying frameworks for new content to be created and improving old code - but that doesn't mean this release is devoid of new exciting features.\nThis release touts an entirely new mission with 12 unique variations, major additions to the system and sector map interfaces, animated ship thrusters, gameplay changes to police and pirates, a completely new underlying economic simulation for station markets, the ability to bookmark systems and trade routes for later return, and more!\nWe've also continued to improve our custom system editor, making it easier (and more bug-free) than ever before to create custom systems. We gladly welcome contributors interested in expanding the Pioneer universe with hand-crafted systems for the player to visit - feel free to stop by #pioneer on Libera.chat and discuss it with us!\nAnimated Thruster Flames\nThrusters are a static glow volume no longer; your ship has embraced chaos and now merrily spits a lively tongue of flame into the empty void of space!\n2026-02-02.04-25-24.mp4\nPlanck Star Colors\nAll stars in game now calculate their lighting based on a real-world spectral formula, yielding much more believable lighting based on star temperature. We've attached a development comparison here so you can see the effects:\nPreview\n512039975-ff67adbb-cf6d-4716-9d4a-14d46fed3574\nUser Interface\nThe map interfaces have received some polish and new features. Both map screens now follow a common layout, with sidebars containing information panels and options, with navigation controls available in a centralized toolbar at the bottom.\nA headlining new feature is the ability to bookmark systems, and (with a trade computer) commodity trading routes between the current station and a destination. These bookmarks can have custom notes attached, so you will always be able to remember which system you were waylaid by pirates in.\nSpeaking of pirates, the new layout for system information displays a \"security rating\" for the targeted system. While you're never guaranteed to be attacked (or safe) in a system, you'd do well to minimize time spent in high-risk systems unless you're spoiling for a fight. You can now also view the extended description for a system - if a contributor has written one. Pssst... you could write one yourself and contribute it to the game!\nscreenshot-20260131-211547\nFor those pilots not looking to take in the sights, the sector map now has the ability to trigger a legal hyperjump directly from the map screen via a button on the toolbar. This pairs nicely with the gameplay setting to leave the map screen open during a hyperjump!\nThe system map now shows information about a ship or hypercloud target, if a Target Scanner or Hypercloud Analyzer is installed on the ship.\nscreenshot-20260131-210613\nThe HUD now displays this target information in a similar way as well. And the target context menu now provides a way to set your hyperspace destination to the other \"end\" of a hypercloud if an analyzer is installed.\nscreenshot-20260131-211951\nPolice and Pirates\nHave you ever found yourself running afoul of the law because you fired your weapons at the wrong time? Station police now have a much more generous threshold before they attempt to shoot you down and take you in the old-fashioned way. You'll still be fined for shooting in a no-fire zone, so be careful!\nPirates have become much sneakier. Instead of hanging out right next to your arrival cloud to ambush your ship as it comes out of hyperspace, they will loiter around planets in the target system, burning to intercept you and steal all your valuables as you approach.\nFinding people\nA new mission type is introduced, where the player is tasked with finding a person and either bringing them back, or to deliver a message to them.\nimage\nEconomy Changes\nThe economic simulation that determines commodity prices and availability at a station has undergone a major rewrite. Starports now determine their commodity market based on a randomized set of industries in operation at that starport. Industries consume goods to produce other goods, meaning that if you find a starport producing a lot of ore, they will likely need mining machinery to keep producing that ore.\nStarports also participate in a \"local network\" of trade, shuffling goods back and forth between starports orbiting the same major body. If they need a commodity that isn't produced in sufficient quantity within this local network, they'll be willing to pay higher prices to enterprising players willing to sell it to them (and inversely for buying commodities).\nThis information is currently only visible via the Ctrl+I debug menu, but we hope to make it visible to players during the next release cycle.\nAbout menu\nPioneer now has an in-game about menu containing lots of useful information about the project and where to find help. We hope this will guide curious players seeking information on how to contribute.\n2026-01-17-174629_1114x625_scrot\nFull Changelog\nMajor changes and new features\n- Animate thruster flame (#6204)\n- Add system lawlessness rating to sector map (#6265)\n- Add context-based station economic industries (#6199)\n- Cargo Run custom risk message (#6192)\n- New mission: Find person (#4746)\n- Advice module - Three new advises (#6234)\n- Calculate star colors using Planck's law (#6210)\n- Added 'About' button in Main Menu (#6145)\n- Assassination - minor string improvements and code refactor (#6218)\n- UI of system view reworked (#6173)\n- Improve the follow modes for too far ranges (#6190)\n- Show the return location in the mission list, if available (#6200)\n- UI: target radial support hyperspace clouds (#6180)\n- UI: rework target scanner display (#6181)\n- Redesign Sector Map interface, allow jumping from Sector Map (#6148)\n- Add System and Trade Route Bookmark Interface (#6154)\n- ECM crime - Don't allow ECM use near stations (#5916)\n- Show main mission parameters for regular scoop missions (#6279)\n- Increase the probability of being intercepted by pirates (#6248)\n- Make ships translatable (#6103)\n- Several new tweaks to tame the police (#6128)\n- Add tooltip for pump down buttons on info view (#6193)\n- Allow custom systems to override randomly-generated ones (#6238)\n- Support 'custom_only' key in station.json file (#6153)\nBugfixes / Tweaks\n- Fix crime record error on loading saved games (#6268)\n- Fix mapping missions not \"failing\" if overdue (#6258)\n- Fix Planet layer flicker on zoom, FOV->Radians before Frustum (#6121)\n- Fix bugs in fixed division (#5698)\n- Only add systems once in system search function GetNearbyStarSystemsByName (#6244)\n- Add trailing newlines to model files (#6243)\n- Fix correct temperature display units (#6239)\n- ConfigParser: fix read-past-end-of-string (#6246)\n- Fix payment for delayed Scout mission (#6250)\n- Fix icon for find missing person (#6250)\n- Reduce number of find missing person adverts (#6250)\n- Fix station staff face - only set stationSeed from one place (#6236)\n- Prevent spiky asteroids in random systems (#6209)\n- Correctly capitalize names of goods (#6252)\n- fmt::arg(\"unit\", counter.unit) causes crash, hard code counter.unit (#6256)\n- Fix missing station manager in the lobby of Torvalds station (#6224)\n- Fix wrong station message at starting in space (#6220)\n- Fix game slowdown after jettisoning A LOT of cargo (#6139)\n- Fix crash when weapons fired (#6203)\n- Prevent invoking SDL_PauseAudioDevice when it's already paused (#6156)\n- fix: select correct star for hyperspace target after route planned (#6158)\n- fix: crash in info screen (#6176)\n- SecondHand equipment market: add clearer error messages (#6159)\n- Fix/minor fixes: (un)muting settings, saving settings, UI events, etc. (#6175)\n- Fix hyperspace fuel cheat (#6129)\n- Explore system on game start (#6132)\n- CrewContracts - add onUpdateBB, to spawn new crew with time (#5596)\n- Formatting fixes (#6058)\n- Fix crash jettisoning in player Economy & Trade window (#6276)\n- Fix duplicate faction home systems (#6278)\n- Fix use-after-free with multiple custom system redefinition (#6274)\n- Fix infinite galaxy, remove visible density \"blocks\" in sector generation (#6273)\n- Pre-release bugfixes, see below (#6282)\n- Fix Equipment rewrite: Market allows to buy yet installed equipment repeatedly (#6182)\n- Fix No warning, confirmation, or criminal charges for selling an occupied passenger cabin (#5954)\n- Fix Unexpected thruster flames on the ship view in the \"Ship information\" tab (#6272)\n- Fix Input mappings are ignored on master (#6262)\n- Fix Rotation damping and Cruise mode share key mapping (#6263)\n- Fix Crash to desktop when landing on a procedurally generated planet (#6118)\n- Changing seed for Impression to avoid station being partially underground (#6283)\nInternal Changes\n- Alias Vector3 ZERO (#6259)\n- Minor fixes and additions (#6266)\n- Update to Assimp 6.0.2 lib name (PR #6267)\n- Dump all current faction home systems to JSON (#6271)\n- Clean up API code documentation strings: Remove 'Availability' & 'Status' in C++ (#6242)\n- Update Ship JSON Files (#6241)\n- Update About menu with newly added fast_float copyright info (#6247)\n- Upgrade nlohmann::json, fix #include ciso646 warnings (#6253)\n- Minor (terrain) performance optimizations and tweaks (#6087)\n- Update transifex script (#6254)\n- Clean up API code documentation strings (#6228)\n- CMakeList and scan_enums update to python3 (#6217)\n- CMake: Generalize to any OpenGL binding (#6050)\n- Updating all .model files to v2 format (#6213)\n- Fix CMake OpenGL binding for MSVC (#6237)\n- Scenegraph .model Format v2 (#6206)\n- Save settings to disk when closing the settings window (#6179)\n- Migrate renderer to use explicit vertex attribute format descriptors (#6141)\n- Cleaning up unused icons (#6147)\n- Update to Windows 2022 build runner (#6149)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"20260203","version":0,"site":"https://pioneerspacesim.net/","source":"Pioneer Developers","license_or_tos":"MIT License","resources":null,"verified":false}