{"appId":"w:Piriform.CCleaner","appShortcutName":"CCleaner 7","appDisplayName":"CCleaner 7","authorId":"w:winget","releaseTagName":"winget-7.5.1241.1512","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"CCleaner for PC helps you clean up your Windows computer, optimize performance, and maintain your online privacy.\n\nInject instant speed into your machine by freezing resource-hogging apps and programs and by removing the unnecessary files taking up room on your hard drive. Clear out errors, broken settings, and update drivers to improve stability. Protect your privacy by securely erasing tracking cookies and history.\nTaking the hassle out of PC maintenance\nShutdown after Custom Clean  - You can now automatically shut down your PC after a Custom Clean finishes. Find this option in Custom Clean advanced settings.\nEasier license activation - We've added a Paste button to the license activation screen, so entering your license key is quicker and simpler.\n\nHelping you to keep your PC running fast and smooth\nFaster scans - We've fine-tuned our scanning engine, so Health Check and Custom Clean scans now run noticeably faster.\nUpdate status confirmation - You'll now see a clear \"You're up-to-date\" message when you check for updates and your app is already on the latest version.\n\nSimplifying the app\nBetter layout on all screen sizes - The app now adapts more smoothly to different window sizes for a cleaner, more consistent look.\nTidier interface throughout - We've polished up a few visual details, including button alignment, menu visibility, scrollbar spacing, and layout consistency across languages.\n\nFixing bugs\nFirefox history now cleans properly - Your Firefox browsing history is now fully removed during Health Check and Custom Clean scans.\nSmoother experience on all Windows devices - We've improved compatibility so that manual updates, scheduled tasks, and Startup Manager work reliably across all supported Windows devices.\nScheduled cleans now respect your exclusions - Files and folders you've added to your exclusion list are now properly preserved during scheduled cleans.\nSoftware Uninstaller displays results correctly - The Software Uninstaller no longer shows a blank screen after completing a scan, you'll see your results as expected.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.5.1241.1512","version":0,"site":"https://www.ccleaner.com/","source":"Piriform","license_or_tos":"Freeware","resources":null,"verified":false}