{"appId":"w:Piriform.CCleaner","appShortcutName":"CCleaner 7","appDisplayName":"CCleaner 7","authorId":"w:winget","releaseTagName":"winget-7.0.984.1153","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"CCleaner for PC helps you clean up your Windows computer, optimize performance, and maintain your online privacy.\n\nInject instant speed into your machine by freezing resource-hogging apps and programs and by removing the unnecessary files taking up room on your hard drive. Clear out errors, broken settings, and update drivers to improve stability. Protect your privacy by securely erasing tracking cookies and history.\nSay hello to CCleaner 7. It’s faster, smarter, and easier to use. Enjoy a cleaner interface, dark mode options, and support for even more devices. We’ve also improved key tools like the Uninstaller and Disk Analyzer to give you more control over your PC’s performance.\nEnhanced Uninstaller\n- Remove apps more reliably with our new built-in uninstall engine,no need to rely on clunky default uninstallers.\n- Skip annoying pop-ups and prompts during uninstall.\n- Uninstall multiple programs at once with batch mode.\n- Clean up leftover files that apps usually leave behind.\n- Temporarily remove apps to test performance impact and easily restore them later if needed.\nImproved Disk Analyzer\n- Detect and delete duplicate files in bulk to free up space faster.\n- Preview image thumbnails.\n- Choose to keep the newest or oldest version of each duplicate file.\n- Decide whether to delete files permanently or send them to the Recycle Bin.\nSleek new design + expanded support\n- Enjoy a more modern and responsive interface.\n- Pick the theme that suits you: light, dark, or automatic.\n- Now supports ARM64 architecture for improved compatibility with modern devices.\nTry the new CCleaner 7 now!\nYou can download CCleaner for Android and iOS here.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.0.984.1153","version":0,"site":"https://www.ccleaner.com/","source":"Piriform","license_or_tos":"Freeware","resources":null,"verified":false}