{"appId":"w:Piriform.CCleaner","appShortcutName":"CCleaner 7","appDisplayName":"CCleaner 7","authorId":"w:winget","releaseTagName":"winget-7.3.1120.1339","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"CCleaner for PC helps you clean up your Windows computer, optimize performance, and maintain your online privacy.\n\nInject instant speed into your machine by freezing resource-hogging apps and programs and by removing the unnecessary files taking up room on your hard drive. Clear out errors, broken settings, and update drivers to improve stability. Protect your privacy by securely erasing tracking cookies and history.\n- New features to expand cleaning and optimization capabilities\n-  - Cloud Drive Cleaner now supports Dropbox, so you can tidy cloud clutter safely in just a few clicks.\n-  - Startup Manager now lets you view and manage apps that run via Windows scheduled tasks and services, giving you more control over what starts in the background.\n- Updates to improve user experience\n-  - Driver Updater: the “Up-to-date drivers” tab is clearer, with better grouping structure and icons.\n-  - Driver Updater: Skipped and Ignored drivers now have their own tab, making it easier to review and manage them in one place.\n-  - Software Updater now shows a clear “Restart required” screen for updates that need a reboot\n-  - Cleaning safeguards: added clear warnings when enabling rules that clean your Downloads folder, so you don’t remove files you still need by accident.\n-  - We improved Temporary Uninstall to give you more control. You can now choose how long an app stays temporarily removed before CCleaner fully uninstalls it. Adjust this anytime in the feature settings.\n- Fixed bugs\n-  - Fixed an issue where the Recycle Bin icon didn’t always show as empty after cleaning with Health Check.\n-  - Fixed a display issue where the new tab layout showed white gaps when the window was maximized.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.3.1120.1339","version":0,"site":"https://www.ccleaner.com/","source":"Piriform","license_or_tos":"Freeware","resources":null,"verified":false}