{"appId":"w:Poly.PolyStudio","appShortcutName":"Poly Studio","appDisplayName":"Poly Studio","authorId":"w:winget","releaseTagName":"winget-5.0.0.160","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://swupdate.lens.poly.com/lens-desktop-windows/5.0.0.160/0/PolyStudio-5.0.0.160-x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://swupdate.lens.poly.com/lens-desktop-windows-arm/5.0.0.160/0/PolyStudio-5.0.0.160-ARM64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Manage Your Devices and Improve Communication with Ease\n\nSeamless setup with automatic device discovery and pre-configured IT settings\nConfigure, monitor, and update rooms with device health monitoring, alerts, and analytics\nGet a consistent and optimized experience that supports how and where they work.\nWindows x64, Windows ARM, Mac\nIMPORTANT The Poly Lens Desktop App has been updated to a new brand name and design with several key changes as highlighted here. Please note that Poly Lens Cloud and device management functionality has not changed. Poly Lens Desktop is now known as the HP Poly Studio Desktop App, or Poly Studio Desktop for short. With this rebrand, we have also updated our app’s look and feel, and further enhanced the end user experience with new functionality as described below. To read more about this change, please read about blog article for our Poly Studio announcement here.\nWhat’s New\n- Updated UI/UX – HP Poly Studio Desktop 5.0 introduces an exciting new, modernized end user experience with a new home page, device dashboard page, and flat inventory view. Wellness reminders have also been redesigned for an updated look and feel, and the application support and device support pages have been combined for more seamless switching between these areas.\n- ARM-Based PC Support – Poly Studio Desktop 5.0 adds support for ARM-based PCs with an ARM-native version.\n  Note: Please see the Known Issues section below for specific ARM limitations in this release.\n- HP Docks Support – HP G6 docks are now fully supported.\n- HP Displays Support – For HP Series 3, 5, and 7. (Supported on Windows x64 Platform only)\n- Light/Dark Modes – Poly Studio Desktop App adds support for light and dark modes throughout the app, including the ability to follow OS system theme for these modes.\n- Calendar Integration – Poly Studio Desktop App adds a new calendar page with the option to connect a user’s Microsoft O365 Calendar to view events and start Teams and Zoom meetings from this page for easy access.\n  Note: Some organizations may require IT Admins to grant end user access to connect their O365 Calendar. See Poly Studio Desktop Calendar Integration for detailed information.\n- Enhanced Accessibility Support – Added support for Windows contrast themes and improved Windows Narrator support.\n- Poly Studio A2 Microphone – Poly Studio Desktop now automatically detects Poly Studio A2 Table microphone when connected to Poly Studio V12, enabling seamless mic switching and real-time accessory status across Windows and macOS.\nFixed Issues\n- The issue with updating the HP 960/965 4k streaming webcam from software version 1001 to 1002 has now been resolved.\nKnown Issues\n- Headset Issues:\n  - Poly Voyager Focus 2 headsets may fail to update after downgrading via custom update.\n  - Some Poly Savi headsets do not allow for the device language to be changed in the device settings.\n- Video Issues:\n  - The provisioning server type appears as Cloud; however, for Poly Studio V52 and V72, it is actually NTLM.\n  - For proxy implementation for Poly Studio V12:\n    - The proxy configuration will only work if the proxy has a username and password.\n    - The enable/disable toggle is not updated correctly and will always show disabled unless a specific server address is specified.\n  - During the initial setup for Poly Studio V12, the Static IP network parameters are not saved after the first attempt when applying the LAN configuration, but this works on the second attempt.\n  - If the 802.1 and Proxy settings are configured on Poly Studio V12 through the Poly Lens Desktop app, the changes won't be visible in the App UI after saving if the device software is at 1.4.6.430149 or lower.\n  - HP webcam 960/965 does not support software updates in the MacOS app.\n- Display Issues:\n  - Some display settings may not appear when two or more displays with built-in cameras are connected.\n- Windows ARM Version Only:\n  - Cisco Webex, Cisco Jabber, and Avaya Workplace and Avaya One-X Agent softphones are not supported.\n  - HP webcams 430/435, 620/625 and 960/965 are not yet supported for software updates. Device settings are supported, however.\n  - Poly Studio USB video devices cannot perform software updates in ARM.\n  - When using Zoom for a call, when the mute button is pressed on the headset being used for the call, the mute status is not updated in the Zoom app, even though the headset is now muted.\n  - For softphone calls, when the mute button is pressed on the headset being used for the call, a mute ON notification is followed by a mute OFF notification, even though the headset is now muted.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.0.0.160","version":0,"site":"https://www.hp.com/us-en/poly.html","source":"HP Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}