{"appId":"w:PremiumSoft.NavicatOracle","appShortcutName":"Navicat for Oracle","appDisplayName":"Navicat for Oracle","authorId":"w:winget","releaseTagName":"winget-17.3.6","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download3.navicat.com/download/navicat17_ora_en_x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Navicat for Oracle enhances the efficiency and productivity of Oracle developers and administrators with a streamlined working environment.\n\nNavicat for Oracle enhances the efficiency and productivity of Oracle developers and administrators with a streamlined working environment. It comprises intuitive data modeling tools for visual database design, advanced SQL editing features for efficient query writing, and seamless data transfer options for easy migration, as well as automated task scheduling to manage routine operations, among many other capabilities.\n\nView, update, and delete records seamlessly in Grid View through our built-in editors. Integrate a data profiling tool for comprehensive and visual analysis of your data. You can also interact with the visual charts to further explore the data.\n\nManage database objects through a clear and responsive interface that breaks down query writing into structured tabs. Allow you to write complex queries with greater confidence and accuracy at every step.\n\nData Transfer, Data Synchronization and Structure Synchronization help you migrate your data easier and faster for less overhead. Deliver detailed, step-by-step guidelines for transferring data across databases. Compare and synchronize data and structure between databases. Set up and deploy the comparisons in seconds, and get the detailed script to precisely outlines the changes you want to execute.\n\nSupported Cloud Providers and Vendors:\n* Amazon AWS\n* Oracle Cloud\n* Alibaba Cloud\n* OceanBase\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"17.3.6","version":0,"site":"https://www.navicat.com/","source":"PremiumSoft CyberTech Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}