{"appId":"w:PremiumSoft.NavicatSQLServer","appShortcutName":"Navicat for SQL Server","appDisplayName":"Navicat for SQL Server","authorId":"w:winget","releaseTagName":"winget-17.3.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download3.navicat.com/download/navicat17_sqlserver_en_x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Navicat for SQL Server offers a fully graphical approach to efficient database management. It enables quick creation, editing, and deletion of database objects, along with the execution of SQL queries.\n\nNavicat for SQL Server offers a fully graphical approach to efficient database management. It enables quick creation, editing, and deletion of database objects, along with the execution of SQL queries. Our intuitive interface allows you to modify the data model interactively, while insightful analytics on query performance and database interactions empower you to optimize your SQL Server environments effectively.\n\nView, update, and delete records seamlessly in Grid View through our built-in editors. Integrate a data profiling tool for comprehensive and visual analysis of your data. You can also interact with the visual charts to further explore the data.\n\nManage database objects through a clear and responsive interface that breaks down query writing into structured tabs. Allow you to write complex queries with greater confidence and accuracy at every step.\n\nAccelerate your coding process with Code Completion and Code Snippet, and gain valuable insights into query-database interaction by visualizing the execution plan. You can also visually construct queries using a set of interactive tools, without having to worry about syntax and proper usage of commands.\n\nImport data into a database from various formats, or through an ODBC connection after setting up a data source connection. Seamlessly export data from tables, collections, views, or query results to popular formats such as Excel, Access, CSV and more.\n\nWe offer a 14-day fully functional FREE trial of Navicat.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"17.3.5","version":0,"site":"https://www.navicat.com/","source":"PremiumSoft CyberTech Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}