{"appId":"w:PremiumSoft.NavicatBI","appShortcutName":"Navicat BI","appDisplayName":"Navicat BI","authorId":"w:winget","releaseTagName":"winget-2.3.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download3.navicat.com/download/navicatbi02_en_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Navicat BI turns your data into effective visualizations to have clear insights in data through charts and graphs.\n\nNavicat BI turns your data into effective visualizations to have clear insights in data through charts and graphs.\n\nTransform your data into impactful visualizations during the data exploration and visualization phase of your Business Intelligence (BI) process. By simplifying data analysis and leveraging interactive dashboards, you can easily share your workspaces with colleagues, facilitating collaborative decision-making and aligning your business strategies with data-driven intelligence.\n\n* Create a data source from various types of databases. You can also import data into the workspace, or link the data source to the data in a supported external file.\n* Integrate a data profiling tool in Data Preview to provide a comprehensive view of your data. You can interact with the visual charts to further explore the data, such as drilling down into specific data segments, filtering data based on certain criteria, or highlighting data points of interest.\n* Extend your data with customized fields. You can capture data not available in the standard fields to better suit your unique requirements.\n* Specify and integrate data from any chosen data source with ease.\n\nSupported Databases: MySQL, PostgreSQL, SQL Server, Oracle, SQLite, MariaDB, MongoDB, Snowflake\n\nWe offer a 14-day fully functional FREE trial of Navicat BI.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.6","version":0,"site":"https://www.navicat.com/","source":"PremiumSoft CyberTech Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}