{"appId":"w:PremiumSoft.NavicatDataModelerLite","appShortcutName":"Navicat Data Modeler Lite","appDisplayName":"Navicat Data Modeler Lite","authorId":"w:winget","releaseTagName":"winget-4.3.7","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download3.navicat.com/download/navicatdatamodeler04_lite_en_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Navicat Data Modeler is a powerful and cost-effective database design tool which helps you build high-quality conceptual, logical and physical data models.\n\nNavicat Data Modeler is a powerful and cost-effective database design tool which helps you build high-quality conceptual, logical and physical data models. It allows you to visually design database structures, perform reverse/forward engineering processes, import models from ODBC data sources, generate complex SQL/DDL, print models to files, and much more.\n\nSimplify the task of creating complex entity relationship models and generate the script SQL with a simple click. Navicat Data Modeler supports various database systems, including MySQL, PostgreSQL, MongoDB, MariaDB, SQL Server, Oracle, SQLite, and Snowflake.\n\nCreate, modify, and design your models using professional object designers, available for Tables, Views, Functions and Procedures. Without the need to write complex SQL to create and edit objects, you’ll know exactly what you are working on. Also, Navicat Data Modeler supports three standard notations: Crow’s Foot, IDEF1x and UML. Using our feature-rich, simple, and user-friendly drawing tools, you can develop a complete data model with just a few clicks.\n\nNavicat Data Modeler enables you to build high-quality conceptual, logical and physical data models for a wide variety of audiences. Using the Model Conversion feature, you can convert a conceptual business-level model into a logical relational database model and then into a physical database implementation. From sketching a big picture of your system design to viewing relationships and working with attributes and columns from linked entities, tables and views. You can easily deploy accurate changes to database structures and build organized and more effective database systems.\n\nMaximum of 5 Users per Organization.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.3.7","version":0,"site":"https://www.navicat.com/","source":"PremiumSoft CyberTech Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}