{"appId":"w:PremiumSoft.NavicatOnPremServer","appShortcutName":"Navicat On-Prem Server","appDisplayName":"Navicat On-Prem Server","authorId":"w:winget","releaseTagName":"winget-3.0.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download3.navicat.com/onpremsvr3-download/windows/navicatonpremserver3.0.1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Navicat On-Prem Server provides you with the option to host a cloud environment for storing Navicat objects internally at your location. Enjoy complete control over your system and maintain 100% privacy.\n\nNavicat On-Prem Server is an on-premise solution for organizations that need to manage their Navicat files and facilitate team collaboration internally. It creates a centralized, private environment where distributed teams can share data, coordinate tasks, and communicate efficiently in real time.\n\nWith Navicat On-Prem Server, you maintain full control over your system and ensure 100% data privacy, while still benefiting from the convenience and features of a cloud-based solution. Beyond secure file management, it offers robust capabilities for administering, monitoring, and managing your MySQL, MariaDB, PostgreSQL, and Fujitsu Enterprise Postgres (FEP) databases.\n\nSynchronize your connection settings, queries, aggregation pipelines, snippets, model workspaces, BI workspaces and virtual group information across all your devices. Invite your co-workers to the project, where they can create and edit files together so that you can collaborate with your team in real-time from anywhere.\n\nAssign a role to coworkers for each project they work on and grant them access to projects based on the role they play. Each role determines whether they can create, view, and modify project files.\n\nAll activities that involve collaboration are kept in real time under the Activity Log. It enables you to quickly view all activities taking place in your project. You can also oversee the recent activity of a specific team member, and each member will get a clear picture of what everyone’s working on.\n\nWe offer a 14-day fully functional FREE trial of Navicat On-Prem Server.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.0.1","version":0,"site":"https://www.navicat.com/","source":"PremiumSoft CyberTech Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}