{"appId":"w:PROSA.Log4View","appShortcutName":"Log4View","appDisplayName":"Log4View","authorId":"w:winget","releaseTagName":"winget-2.1.1.51","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.log4view.com/fileadmin/redaktion/log4view/Log4ViewSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A powerful and comfortable viewer for Log4Net, NLog, log4j and log4cxx output\n\nLOG4VIEW is a convenient viewer for XML formated log4net and logging output. It can visualize and filter logging output from various log appenders such as UDP appenders, file appenders or even from a special TCP appender.\nLOG4VIEW reads all log messages from the configured log appenders and stores them in an internal buffer. The user decides, which loggers should be displayed at which level. When the user decides to change the filter settings, previously hidden log messages are now displayed and vice versa.\nLOG4VIEW is designed to present the logging information to the developer as efficiently and comfortably as possible. Log4View is a pure .NET application, written in C#.\nLOG4VIEW allows merging of different log sources in a single view. This can make debugging of distributed applications much easier.\nFeatures:\n- Log viewer with multiple open logs\n- Dynamically growing logger tree shows all known loggers\n- Type and layout of the visualized information is fully customizable\n- Font and color of log messages can be individually selected, depending on logger name, log level, message text and other criteria\n- Easy configuration of individual logger filter levels\n- UDP receiver enables visualization of messages with the original log4net UDP appender\n- TCP receiver can be used in conjunction with a special TCP Appender, developed for reliable message transmission to Log4View\n- File receiver enables visualization of messages with the log4net File- and RollingFileAppender; can also read rolled files\n- Database receiver reads from SQL-Server, Oracle, DB2 and MySQL DBMS\n- Can read XML formatted log files as ell as pattern formatted files\n- Linked receivers allow direct editing of log4net config settings\n- Messages of different receivers can be consolidated in a common window or displayed in separate message windows\n- Reads ands shows very large log files (>100000 lines) quickly\n- Individual log levels and additional content fields possible\nSetup: Log4ViewSetup now contains .NET 6. So, .NET 6 is no longer a prerequisite before installing Log4View.\nBug: Log4View crashes at startup in certain situations when not connected with the internet.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.1.1.51","version":0,"site":"https://www.log4view.com/","source":"PROSA GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}