{"appId":"w:pseymour.MakeMeAdmin","appShortcutName":"Make Me Admin","appDisplayName":"Make Me Admin","authorId":"w:winget","releaseTagName":"winget-2.4.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/pseymour/MakeMeAdmin/releases/download/v2.4/MakeMeAdmin.2.4.0.x64.en-us.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Make Me Admin is a simple application for Windows that allows standard user accounts to be elevated to administrator-level, on a temporary basis.\n\n\nAdded\n- Added an optional dialog box to prompt the user to enter their reason for needing administrator rights.\n- Added the ability to log off a user when their administrator rights expire. The message displayed before log off is customizable.\n- Added logging of elevated processes.\n- Added the ability to prompt the user for authentication before rights are granted.\n- Added a setting to control which port the remote feature uses.\n- Added feature to allow renewal of rights after expiration.\n- Added a setting to control whether the UI closes after the user's rights expire.\n- Added Danish translation, thanks to Bjørn Kelsen.\n- Modified the installer to remove the added user XML file upon uninstallation.\n- Modified the installer to add the product version to the registry.\n  - The version number will be stored in the value InstalledVersion at HKEY_LOCAL_MACHINE\\SOFTWARE\\Sinclair Community College\\Make Me Admin.\nChanged\n- Significant speed improvement in the code that checks the user against the allowed and denied lists, thanks to Martin Sheppard.\n- Changed the service's Event Log source name to \"Make Me Admin,\" adding spacing between the words.\n- Updated group policy templates to reflect change from SIDs only to SIDs or names, thanks to Jakob Dahl.\n- Migrated from .NET Framework version 4.5.2 to version 4.8.\nRemoved\n- Removed the Exit button from the UI.\n- Turned off automatic logging for service start and stop events.\nFixed\n- Fixed an issue that would prevent syslogging from working if the syslog server was not in DNS.\n- Fixed an issue where the service would check the authorization of the wrong principal, in automatic-add scenarios. (Issue #50)\n- Fixed typos in French translation.\n- Added better error handling in the UI app if the service is not listening.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.4.0","version":0,"site":"https://github.com/pseymour","source":"Sinclair Community College","license_or_tos":"GPL-3.0","resources":null,"verified":false}