{"appId":"w:PSTWalker.PSTWalker","appShortcutName":"PST Walker","appDisplayName":"PST Walker","authorId":"w:winget","releaseTagName":"winget-7.31","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"View all items in OST or PST file, whether they're emails, tasks, contacts, notes, calendar events, or attachments, you can easily open them all.\n\nView all items in OST or PST file, whether they're emails, tasks, contacts, notes, calendar events, or attachments, you can easily open them all.\n- Open healthy, corrupted, and orphaned PST and OST files\n- Recover deleted emails and folders, and export them to various file formats\n- Analyze email headers and all message properties using HEX analysis\n\nWhether it's an archived, corrupted, or orphaned Outlook file, OST PST Viewer opens all types of Outlook data files – .pst, .ost, and .msg – without accessing Outlook.\n- Open Corrupt PST Files: No need to worry about repairing corrupt Outlook data files to view their content. The tool scans and repairs every PST file, ensuring you can access your content.\n- Open Password Protected Files: Access PST files without requiring a password, and in cases where the password is forgotten, you can still get access to the file.\n- Protect the privacy of an email message: Support for digitally signed and encrypted secure messages, as well as Active Directory/Exchange x.500 email addresses.\n- PST File Locations: You have the flexibility to open any .pst or .ost file, or select a data file from the list of the recently opened files in Outlook.\n- Recover Deleted Emails and Folders: Restore accidentally deleted emails and folders, and items that are no longer associated with any folder in Outlook (orphaned items). Learn more...\n- Recover Rules and Alerts: Recover disappeared Rules and Alerts in Outlook and export the rules to .rwz file. \n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.31","version":0,"site":"https://www.pstwalker.com/","source":"PST Walker Software","license_or_tos":"Proprietary","resources":null,"verified":false}