{"appId":"w:PureDevSoftware.10x","appShortcutName":"10x","appDisplayName":"10x","authorId":"w:winget","releaseTagName":"winget-1.0.404.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A High-Performance C++ Editor\n\nThere are many code editors and IDEs on the market, so why does the world need another editor? 10x is designed to be a fast and responsive editor, that understands C++ out of the box and performs well with the largest of codebases (>5 million loc).\nThere are Editors/IDEs that can handle many languages and have plugins for every eventuality, but due to the sheer size and complexity of these IDEs, they can become unresponsive and start failing for very large projects.\nConversely, there are many fast and lightweight code editors, but they often don't parse C++, or they require complicated setup with 3rd party parsers.\n10x is designed to fill the gap between a lightweight text editor and a full IDE. 10x has many of the features of an IDE but doesn't compromise on speed, even on the largest of projects.\n10x has a custom C++ parser that works out of the box, no setup required. The parser is fast and robust and incrementally parses as you type. It provides syntax highlighting, goto-definition, autocomplete and a lot more.\nThere are many editors/IDEs that promise everything, but it often comes at a cost, either in terms of responsiveness, robustness, or complexity of setup. With 10x, there is no need to compromise. You get the features you need with a fast and responsive editing experience.\n10x is aimed predominantly at the professional developer working on large and complex C++ codebases where productivity is vital. 10x makes it easy to quickly navigate around a large project and find what you need. 10x keeps you in the flow.\nCoding at 60fps with instant workspace search is something you just have to experience. You may not think your current editor is slow until you try 10x.\n10x supports opening of Visual Studio projects, opening folders, and the creation of custom 10x workspaces.\n10x is currently Windows only. Support for other platforms is planned for the future.\nAs well as a custom built C++ parser, 10x also has syntax highlighting for many other languages.\n10x also has a powerful python API, which allows functionality to be added using python scripts.\nSummary\n\nGeneral fixes and parser fixes. Improved 10xEditorLink syncing. Improved quality of map s roll bar rendering. Crash fixes.\n\nNew Features\n\n- Added IndentRequires setting to indent requires statements (defaults to true)\n\n- Syntax highlighter now supports nested comment blocks\n\nOptimisations\n\n- Optimisation to map scroll bar updating\n\nGeneral Fixes\n\n- Fixed crashes and lockups with 10xEditorLink communication\n\n- Now tries to reconnect to 10xEditorLink on communication failure\n\n- Improved exception handling in 10xEditorLink (2.1)\n\n- Fixed memory leak when syntax highlighting or colour scheme files are modified\n\n- Fixed 10 second stall opening folder and selecting file if File Pilot is enabled\n\n- Fixed Open Folder not using File Pilot\n\n- Fixed divide by zero crash using invalid font that results in a zero line height\n\n- Fixed OpenFolder sometimes failing\n\n- Fixed potential memory corruption crash\n\n- Improved map scroll bar rendering quality\n\n- Increased map scroll bar contrast for light colour schemes\n\n- Fixed Perforce Checkout not updating the read-only icon on the tab\n\n- Fixed search panel closing on submit and escape if it's in a tab of a floating panel\n\n- Fixed 10xEditorLink connection timing out on StartDebugging if VS is set to build before debugging\n\n- Increased 10xEditorLink timeout to 60 seconds\n\n- Fixed perforce sub menu of tree node context menu not closing when losing focus\n\n- Fixed drag dock target boxes not clearing if panel close while dragging\n\n- Fixed 10x Workspace tree updating. New file would be put a the root and cause crashes\n\n- Fixed ColorBracesByDepth counting braces strings\n\n- Fixed ColorBracesByDepth counting braces in block comments for non-C++ comment blocks\n\n- Fixed syntax highlighter sometimes not updating comment blocks correctly after edits\n\n- Fixed indent lines showing past the file end\n\nParser Fixes\n\n- Fix for parser lockup\n\n- Fixed parsing of operator overload functions\n\n- Fixed parsing of unnamed designated initializers\n\n- Fixed resolving of templated function return types declared in parent classes (fixes TNotNull)\n\n- Fixed AutoFixIndirection for lines with preprocessor statements\n\n- Fixed occasional main thread stalls from the parser\n\n- Fixed using alias and typedefs not showing up in autocomplete\n\n- Fixed crash reading truncated cache file\n\n- Fixed wrong indent for some ternary expressions\n\n- Fixed reparse errors after function definition changed\n\n- Fixed autocomplete prioritising functions over macros\n\n- Fixed parsing of extern variables. Goto-def now goes to the original variable instead of the extern.\n\n- Added parser support for __unaligned keyword\n\n- Fixed parser lines getting out of sync with the file, causing syntax highlighting mismatches and crashes\n\nMisc\n\n- Added Undo stack size to memory stats\n\n- Added warning opening Unreal Engine with 10x workspace","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0.404.0","version":0,"site":"https://www.puredevsoftware.com/","source":"PureDev Software","license_or_tos":"Proprietary","resources":null,"verified":false}