{"appId":"w:PureDevSoftware.10x","appShortcutName":"10x","appDisplayName":"10x","authorId":"w:winget","releaseTagName":"winget-1.0.434.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A High-Performance C++ Editor\n\nThere are many code editors and IDEs on the market, so why does the world need another editor? 10x is designed to be a fast and responsive editor, that understands C++ out of the box and performs well with the largest of codebases (>5 million loc).\nThere are Editors/IDEs that can handle many languages and have plugins for every eventuality, but due to the sheer size and complexity of these IDEs, they can become unresponsive and start failing for very large projects.\nConversely, there are many fast and lightweight code editors, but they often don't parse C++, or they require complicated setup with 3rd party parsers.\n10x is designed to fill the gap between a lightweight text editor and a full IDE. 10x has many of the features of an IDE but doesn't compromise on speed, even on the largest of projects.\n10x has a custom C++ parser that works out of the box, no setup required. The parser is fast and robust and incrementally parses as you type. It provides syntax highlighting, goto-definition, autocomplete and a lot more.\nThere are many editors/IDEs that promise everything, but it often comes at a cost, either in terms of responsiveness, robustness, or complexity of setup. With 10x, there is no need to compromise. You get the features you need with a fast and responsive editing experience.\n10x is aimed predominantly at the professional developer working on large and complex C++ codebases where productivity is vital. 10x makes it easy to quickly navigate around a large project and find what you need. 10x keeps you in the flow.\nCoding at 60fps with instant workspace search is something you just have to experience. You may not think your current editor is slow until you try 10x.\n10x supports opening of Visual Studio projects, opening folders, and the creation of custom 10x workspaces.\n10x is currently Windows only. Support for other platforms is planned for the future.\nAs well as a custom built C++ parser, 10x also has syntax highlighting for many other languages.\n10x also has a powerful python API, which allows functionality to be added using python scripts.\nSummary\n\nFixed parser missing Unreal defines\n\nParser Fixes\n\n- Fixed parser missing Unreal defines","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0.434.0","version":0,"site":"https://www.puredevsoftware.com/","source":"PureDev Software","license_or_tos":"Proprietary","resources":null,"verified":false}