{"appId":"w:PureDevSoftware.10x","appShortcutName":"10x","appDisplayName":"10x","authorId":"w:winget","releaseTagName":"winget-1.0.378.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A High-Performance C++ Editor\n\nThere are many code editors and IDEs on the market, so why does the world need another editor? 10x is designed to be a fast and responsive editor, that understands C++ out of the box and performs well with the largest of codebases (>5 million loc).\nThere are Editors/IDEs that can handle many languages and have plugins for every eventuality, but due to the sheer size and complexity of these IDEs, they can become unresponsive and start failing for very large projects.\nConversely, there are many fast and lightweight code editors, but they often don't parse C++, or they require complicated setup with 3rd party parsers.\n10x is designed to fill the gap between a lightweight text editor and a full IDE. 10x has many of the features of an IDE but doesn't compromise on speed, even on the largest of projects.\n10x has a custom C++ parser that works out of the box, no setup required. The parser is fast and robust and incrementally parses as you type. It provides syntax highlighting, goto-definition, autocomplete and a lot more.\nThere are many editors/IDEs that promise everything, but it often comes at a cost, either in terms of responsiveness, robustness, or complexity of setup. With 10x, there is no need to compromise. You get the features you need with a fast and responsive editing experience.\n10x is aimed predominantly at the professional developer working on large and complex C++ codebases where productivity is vital. 10x makes it easy to quickly navigate around a large project and find what you need. 10x keeps you in the flow.\nCoding at 60fps with instant workspace search is something you just have to experience. You may not think your current editor is slow until you try 10x.\n10x supports opening of Visual Studio projects, opening folders, and the creation of custom 10x workspaces.\n10x is currently Windows only. Support for other platforms is planned for the future.\nAs well as a custom built C++ parser, 10x also has syntax highlighting for many other languages.\n10x also has a powerful python API, which allows functionality to be added using python scripts.\nSummary\n\nThis build focuses on stability and parser improvements. Some new minor features added and lots of bug fixes. A complete rewrite of VS syncing making it much more reliable (now communicates with 10xEditorLink extension for all commands)\n\nNew Features\n\n- Support for Ime toolbar and composition window. Composition window is now placed correctly for the current edit position.\n\n- Added MovePrevTabPanel and MoveNextPanelTab commands (moves tabs left/right)\n\n- Added GotoResultScrollMode setting for setting the scroll into view mode when going to the next result (Center, Visible, Current)\n\n- Added Prioritised Files setting for workspaces. Use for unity builds or as a fix for multiple defines symbols\n\n- Added Language.ControlFlowKeyword colour setting\n\n- Added Language.NewDeleteKeyword colour setting\n\n- Added Language.UsingKeyword colour setting\n\n- Added Language.CppLiteralKeyword colour setting (nullptr, true, false)\n\n- Fixed PrevEditLocation and added NextEditLocation\n\nOptimisations\n\n- Fixed unnecessary reparsing (high CPU usage) after edits of commonly used symbols and external updates\n\n- Parser optimisation to finding header files (signiticant speedup for workspaces with lots of additional include paths such as Unreal)\n\n- Optimisation for find text highlighting on very large files\n\nGeneral Fixes\n\n- Improved VS syncing reliability (now all syncing uses 10xEditorLink if installed)\n\n- Improved reliability of alt+X 10x <-> VS switching\n\n- Made comments in settings file only show if they start a line\n\n- Fixed auto-sizing of \"File changed outside of 10x\" panel and made it resizable\n\n- Made file renaming reopen file\n\n- Made file renaming save any unsaved files before rename\n\n- Fixed stall on startup due to bad font size setting\n\n- Made OpenFileInActivePanel setting override ColumnPresets settings\n\n- Fixed editing in the source preview panel not working for the find symbol panels\n\n- Made source preview panel check out read-only files before edit\n\n- Fixed pulled out windows sometimes disappearing after restart\n\n- Made \"Open Parser Cache Folder\" go to the parser cache folder for the current workspace\n\n- Fixed window border showing after exiting full screen focus mode\n\n- Fixed crash reloading workspace while symbol renaming in progress\n\n- Fixed FindFilePanel, FindInFilesPanel and ReplaceInFilesPanel not remembering docked position\n\n- Fixed Find and Find.Replace text panels jumping to next match on open before any key pressed\n\n- Fixed crash moving panel focus when no tab focused\n\n- Now focuses previous tab after closing last tab in panel/column\n\n- Fixed hang shutting down after SVN update\n\n- Fixed crash undoing a symbol rename in a file that was opened since the rename\n\n- Renamed \"Debug Command\" 10x workspace setting to \"Run Command\"\n\n- Renamed \"Debugger Exe\" 10x workspace setting to \"Debugger Command\"\n\n- Default \"Debug Command\" 10x workspace setting to \"$(Executable)\"\n\n- Default \"Working Directory\" 10x workspace setting to \"$(WorkspaceDirectory)\"\n\n- Renamed workspace substitution $(DebugComand) to $(RunCommand)\n\n- Renamed workspace substitution $(DebugCommandArgs) to $(RunCommandArgs)\n\n- Fixed occasional crash reloading syntax highlighting files\n\n- Fixed open files not in the workspace being added to the workpace parse set after a ReparseAll\n\n- Fixed auto-formattting for AutoAddCloseBrace setting\n\n- Fixed auto-formattting for AutoIndentBraces setting\n\n- Fixed fuzzy matches sometimes appearing above normal matches in autocomplete and FindSymbols\n\n- Fixed SpaceBrackets not adding space after first bracket\n\n- Fixed rare crash shutting down while Search is indexing folders\n\n- Fixed duplicate search results in Workspace Search\n\n- Stopped Workspace Search searching open file that don't match the search ext list\n\n- Fixed left/right keys in dropdown sub-menus\n\n- Fixed rare crash updating syntax highlgihting colours\n\n- Fixed flickering updated lines in margin\n\n- Fixed crash after d3d device reset\n\n- Fixed updated lines in margin sometimes not updating until a refresh\n\n- Fixed crash on GotoNextBuildError introduced in previous build\n\n- Fixed floating windows disappearing after restart\n\n- Fixed floating panels in default workspace changing position on restart\n\n- Fixed floating panels in default workspace sometimes being duplicated and flickering after restart\n\n- Made comments work in settings file values\n\n- Fixed various edit operations, such as paste or delete select not checking out read-only files\n\n- Fixed panels docked in columns not remembering their height\n\n- Made RenameFile handle and log file system errors\n\n- Workspace substitutions are now resolved recursively\n\n- Fixed renaming files with UNC paths\n\n- Fixed rare crash selecting rectangular regions with multi-cursor\n\n- Made TrackActiveFileInWorkspaceTree setting not open workspace tree panel\n\n- Fixed FindInFiles not searching new unsaved files\n\n- Fixed rare hang shutting down process\n\n- Fixed rare crash shutting down while Workspace Search setting up\n\n- Fixed default colour mappings\n\n- Made void use Language.Type colour instead of Language.Keyword\n\n- Fixed another hang shutting down\n\n- Fixed bug in syncing the active project to VS (would sometimes fail on some projects)\n\n- Fixed crash in collapse/expand\n\nParser Fixes\n\n- Reparse after edits fixes (stops parser losing info after certain types of edits)\n\n- Fixed symbol references not updating after updating symbol with a multiple dereference chain\n\n- Fixed symbol references sometimes not updating in statements with templats\n\n- Fixed symbol references not updating for typedefs and using aliases\n\n- Fixed auto not working with ternary statements\n\n- Fixed Set and Map parser symbols for UE5.7\n\n- Fixed parser type resolving for templated parent classes\n\n- Fixed parsing of Unreal cast templated functions\n\n- Fixes to delegate parsing in Unreal\n\n- Fixed Find References on statements with macros\n\n- Parser support for `__LINE__` macro\n\n- Fix for finding Unreal define files in non-development configs\n\n- Fixed symbol info hover boxes not showing for preprocessed lines (lines with macros etc)\n\n- Increased the parser thread stack size to avoid stack overflows on complex statements\n\n- Guard against infinite recursion in template arguments\n\n- Guard against excessive recursion resolving types\n\n- Fixed reparse bugs after modifying function definition\n\n- Fixed rare parser crash loading workspace on startup\n\n- Fixed renaming of identially named symbols in sub-scopes\n\n- Fixed parser bug that can cause crashes and a corrupt parser cache\n\nMisc\n\n- Updated vim.py\n\n- Updater now checks signature of downloaded file\n\n- Added EnableTelemetry setting\n\n- Made BuildBeforeStartDebugging and BuildBeforeRun default to false\n\n- 10xEditorLink update (1.8)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0.378.0","version":0,"site":"https://www.puredevsoftware.com/","source":"PureDev Software","license_or_tos":"Proprietary","resources":null,"verified":false}