{"appId":"w:PVsyst.PVsyst","appShortcutName":"PVsyst","appDisplayName":"PVsyst","authorId":"w:winget","releaseTagName":"winget-8.0.19","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.pvsyst.com/download/bin/PVsyst-8.0.19.47300-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A PC software package for the study, sizing and data analysis of complete PV systems.\n\nPVsyst is a PC software package for the study, sizing and data analysis of complete PV systems.\nIt deals with grid-connected, stand-alone, pumping and DC-grid (public transportation) PV systems, and includes extensive weather data and PV systems components databases, as well as general solar energy tools.\nThis software is geared to the needs of architects, engineers, researchers. It is also very helpful for educational training.\nPVsyst focuses on complete and precise PV system study with a complete set of tools.\n* Improvements\n\n- Databases update.\n\n* Corrections\n\n- 3D scene: import now groups table orientations based on project-defined tolerances and existing orientations\n- 3D scene: importing a DAE file with conversion error no longer causes crashes\n- 3D scene: the calculation of shading factor tables now completes correctly in cases where it was previously blocked\n- 3D scene: objects are stored with more precision in the variant file to avoid discrepancies when loading projects\n- Presizing tool: the irradiance calculation on the tilted plane is now correct.\n- Report: added option to disable display of the country name in the reports\n- Storage : improvements and corrections of the \"power shifting\" dialog","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.0.19","version":0,"site":"https://www.pvsyst.com/","source":"PVsyst SA","license_or_tos":"Proprietary","resources":null,"verified":false}