{"appId":"w:PVsyst.PVsyst","appShortcutName":"PVsyst","appDisplayName":"PVsyst","authorId":"w:winget","releaseTagName":"winget-8.0.15","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.pvsyst.com/download/bin/PVsyst-8.0.15.45387-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A PC software package for the study, sizing and data analysis of complete PV systems.\n\nPVsyst is a PC software package for the study, sizing and data analysis of complete PV systems.\nIt deals with grid-connected, stand-alone, pumping and DC-grid (public transportation) PV systems, and includes extensive weather data and PV systems components databases, as well as general solar energy tools.\nThis software is geared to the needs of architects, engineers, researchers. It is also very helpful for educational training.\nPVsyst focuses on complete and precise PV system study with a complete set of tools.\n* New Features\n\n- Optimizers, SolarEdge: it is now possible to define subarrays with heterogeneous strings (**).\n\n* Improvements\n\n- 3D scene: two redundant error messages concerning the azimuth and tilt spread in averaged orientations have been removed\n- 3D scene: import of scene now creates one single averaged orientation by default. An option allows re-enabling automatic detection of multiple orientations\n- Ageing tool: enabled tool tips to provide information on CSV output generation\n- Optimizers: Optimizer efficiency is now applied after module related losses (**)\n- Optimizers: power clipping is now better handled (**)\n- Weather data, Solargis: updated URL links in the TMY API integration UI to new Knowledge Base.\n\n* Corrections\n\n- 3D scene: small width changes in PV table dimensions (<3cm) now modify the total sensitive width/height (**)\n- 3D scene: changing scene view for the report no longer invalidates shadings table\n- 3D scene: improvement of the nomenclature for the dimensions of chimneys on sloping roofs\n- 3D scene: copying/pasting a PV object into the \"List and management of objects\" window no longer causes distortion of certain objects\n- 3D scene: PV module spacing and orientation from imported DAE files are now correctly saved within the variant\n- 3D scene: partition check box now works correctly for Polygonial field\n- Batch mode: shading table is now recomputed if backtracking parameters are changed in the batch simulation properties\n- Grid storage: revision of battery operation calculations (**)\n- System: number of modules in series now remains unchanged in systems combining subarrays with and without optimizers\n- Tools: voltage optimization plot now prints correctly\n- Trackers, diffuse shadings: \"central tracker\" and \"custom tracker\" modes now offer the choice of including shading objects in the calculation (**)\n- Weather data: the NSREL option is disabled when the data is not available for the selected site.\n\n> Check also dedicated page for PVsystCLI changes\n\n(**) More detailed information available on PVsyst FAQ (topic \"PVsyst 8.0.15: main changes\").","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"8.0.15","site":"https://www.pvsyst.com/","source":"PVsyst SA","license_or_tos":"Proprietary","resources":null,"verified":false}