{"appId":"w:PVsyst.PVsyst","appShortcutName":"PVsyst","appDisplayName":"PVsyst","authorId":"w:winget","releaseTagName":"winget-8.0.17","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.pvsyst.com/download/bin/PVsyst-8.0.17.46846-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A PC software package for the study, sizing and data analysis of complete PV systems.\n\nPVsyst is a PC software package for the study, sizing and data analysis of complete PV systems.\nIt deals with grid-connected, stand-alone, pumping and DC-grid (public transportation) PV systems, and includes extensive weather data and PV systems components databases, as well as general solar energy tools.\nThis software is geared to the needs of architects, engineers, researchers. It is also very helpful for educational training.\nPVsyst focuses on complete and precise PV system study with a complete set of tools.\n* New features\n\n- Grid storage: new strategy of power shifting, from the diurnal PV production to a period offering a better tariff (*).\n\n* Improvements\n\n- Databases update\n- Optimizer, AdvanSol: database update\n\n* Corrections\n\n- 3D scene: Improved stability for edge-case datasets for ground data import\n- Horizon: Fix for PVGIS import missing negative azimuth\n- License : unavailable license server no longer causes crashes\n- Preferences: unavailable preferences file no longer causes crashes\n- Project: Fix of sorting issue in the variant manager dialog\n- Report: printing the carbon balance no longer causes crashes\n- Report: texts in the legend of the single line diagram are not overlapping anymore\n- Simulation: fixed condition where variables unrelated to system type briefly appeared\n\n> Check also dedicated page for PVsystCLI changes.\n\n(*) More detailed information available on PVsyst FAQ (topic \"PVsyst 8.0.17: main changes\").","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.0.17","version":0,"site":"https://www.pvsyst.com/","source":"PVsyst SA","license_or_tos":"Proprietary","resources":null,"verified":false}