{"appId":"w:PVsyst.PVsyst","appShortcutName":"PVsyst","appDisplayName":"PVsyst","authorId":"w:winget","releaseTagName":"winget-8.0.16","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.pvsyst.com/download/bin/PVsyst-8.0.16.46135-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A PC software package for the study, sizing and data analysis of complete PV systems.\n\nPVsyst is a PC software package for the study, sizing and data analysis of complete PV systems.\nIt deals with grid-connected, stand-alone, pumping and DC-grid (public transportation) PV systems, and includes extensive weather data and PV systems components databases, as well as general solar energy tools.\nThis software is geared to the needs of architects, engineers, researchers. It is also very helpful for educational training.\nPVsyst focuses on complete and precise PV system study with a complete set of tools.\n* Improvements\n\n- Bifacial: corrected tab order in albedo settings\n- Databases update\n- Optimizers, database: new AndSolar optimizers\n- System: mixed orientation selection is now impossible if there is only one string defined in the subarray\n- Weather data: updated NSRDB Physical Solar Model used to download data North America from v3 to v4.\n\n* Corrections\n\n- Batch mode: changing variant and AC wiring loss at the same time in the batch run no longer leads to an infinite loop\n- Interactive map: searching for \"latitude, longitude\" in the interactive map is now working properly\n- Module layout: displaying I/V curves after aborting shading calculation no longer causes crashes\n- Optimizers: fixed issue with optimizer duty cycle applied twice during inverter power clipping\n- Power sharing: the situation where a single sub-array remains in a power sharing configuration is now handled properly\n- Report: \"electrical shadings effect\" is no longer printed when backtracking is activated with unlimited trackers, horizontal axis\n- Trackers, irradiance optimization: the range of search and estimate for the diffuse shadings in the irradiance optimization algorithm has been corrected\n- Weather data, Solargis: improved validation of country name when importing CSV files.\n\n> Check also dedicated page for PVsystCLI changes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.0.16","version":0,"site":"https://www.pvsyst.com/","source":"PVsyst SA","license_or_tos":"Proprietary","resources":null,"verified":false}