{"appId":"w:Qalculate.Qalculate","appShortcutName":"Qalculate!","appDisplayName":"Qalculate!","authorId":"w:winget","releaseTagName":"winget-5.9.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/Qalculate/libqalculate/releases/download/v5.9.0/qalculate-5.9.0-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A highly versatile desktop calculator, with support for units, physical constants, uncertainty propagation, symbolic calculations, etc.\n\nQalculate! is a multi-purpose cross-platform desktop calculator.\nIt is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation).\nFeatures include a large library of customizable functions, unit calculations and conversion, physical constants, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (GTK, Qt, and CLI).\nQalculate! is a multi-purpose cross-platform desktop calculator. It is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation). Features include a large library of customizable functions, unit calculations and conversion, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (Gtk, Qt, and CLI).\nChanges:\n- Improve speed of sort(), rank(), and mode() functions (and other dependent functions)\n- Parse ± before implicit multiplication when not preceded by number (e.g. \"7 km ± 5m\")\n- Always consider x^(a + b) equivalent to x^a × x^b (fixes \"x^(y + z) − x^y × x^z\")\n- Simplify (x = a || x ≥ a + 1) and (x ≤ a || x ≥ a + 1), and similar, when x and a are integers (fixes \"abs(x − 1) = abs(1 − x)\")\n- Do not remove duplicate whitespace characters from text strings (in quotation marks)\n- Add exact values for multiples of pi/12 (15°) in sin() and cos(), and tan(7/12pin)\n- Fix floating point conversion when comma is used as decimal separator\n- Fix (almost) endless loop with increasingly complex equations in some cases when x + x^(1/a) is transformed to x = (b − x)^a)\n- Fix and improve function() function\n- Fix loading of approximate variable with both approximate and exact values (e.g. in vector)\n- Fix missing parenthesis for exact number shown as approximate in vector\n- Fix conversion to non-unit expression beginning with zero (when not before decimal separator) or minus\n- Fix exchange rates updated after calculation of expression with only one currency\n- Fix segfault in some corner cases when converting approximate units before uncertainty calculation\n- Fix crash on Windows during output of extremely small or large (> 10^323228497) floating point number\n- Remove intltool build dependency\n- Fix compilation with readline < 7.0 and mpfr < 4.0\n- Do not show calculate-as-you-type result for incomplete object name (e.g. \"integ\" interpreted as \"int(e × g)\")\n- Ellipsize large matrices and vectors when a subset of output, e.g. in a failed function, in qalc\n- Completion for commands and options\n- Do not show result for variable assignment when --terse and --file are used\n- Minor bug fixes and feature enhancements\nDownload the source code here:\nlibqalculate-5.9.0.tar.gz\nDownload the source code for the graphical user interfaces (qalculate-gtk and qalculate-qt) here:\nqalculate-gtk-5.9.0.tar.gz\nqalculate-qt-5.9.0.tar.gz\nDownload Windows binaries here:\n64-bit installer\n64-bit zip (unpack and run without further installation; no application data are read or written outside of the unpacked directory)\nThe binaries requires Windows 10 (1809) or later. They can also be installed using the Windows Package Manager (winget) or Chocolatey.\nGNU/Linux binaries:\nflatpak packages (recommended) are available at https://flathub.org/apps/details/io.github.Qalculate.qalculate-qt (Qt GUI) and https://flathub.org/apps/details/io.github.Qalculate (GTK GUI).\nA snap package are available at https://snapcraft.io/qalculate (GTK GUI).\n64-bit (x86) self-contained binaries (GTK GUI) (extract and run from anywhere on most GNU/Linux distributions; no translations included)\nFor more information visit the website at http://qalculate.github.io/.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.9.0","version":0,"site":"https://qalculate.github.io/","source":"Hanna Knutsson","license_or_tos":"GPL-2.0","resources":null,"verified":false}