{"appId":"w:Qalculate.Qalculate","appShortcutName":"Qalculate!","appDisplayName":"Qalculate!","authorId":"w:winget","releaseTagName":"winget-5.8.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/Qalculate/libqalculate/releases/download/v5.8.0/qalculate-5.8.0-x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A highly versatile desktop calculator, with support for units, physical constants, uncertainty propagation, symbolic calculations, etc.\n\nQalculate! is a multi-purpose cross-platform desktop calculator.\nIt is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation).\nFeatures include a large library of customizable functions, unit calculations and conversion, physical constants, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (GTK, Qt, and CLI).\nQalculate! is a multi-purpose cross-platform desktop calculator. It is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation). Features include a large library of customizable functions, unit calculations and conversion, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (Gtk, Qt, and CLI).\nChanges:\n- Add output in scientific (sci), engineering (eng), ans simple notation as \"to\"-operator options\n- Improve support (and fix segfault) for exponential notation in hexadecimal numbers\n- Add TeX point, TeX scaled point, twip, and agate typography units, and change \"ATA Pica\" to \"Johnson Pica\" and \"ATA Point\" to \"American Point\"\n- Add darcy, kayser, lambert, foot-lambert, and cc units\n- Add compton wavelength constants for muon, neutron, proton, and tau\n- Update calculation of fraction of year (with day counting basis 0 and 1) to match method used in spreadsheets other than Gnumeric\n- Change default quantile algorithm from 8 to 7\n- Improve accuracy for intervals in solutions to equations when using interval arithmetic\n- Show warning about default assumptions the first time an equation is solved\n- Show warning symbol when calculate as you type expression results in a question\n- Show warning and ask for confirmation when deactivating interval arithmetic\n- Improve completion\n- Add \"save config\" option (if disabled qalc.cfg is never automatically updated) and relocate qalc.history to $XDG_STATE_HOME\n- Increase speed when calculating many expressions from file\n- Automatically recalculate expression with current time every second\n- Fix support for prompt string containing Unicode characters, control characters, and/or escape sequences\n- Fix poolvar(), ttest(), cor(), dollarde() and dollarfr() functions\n- Fix inequality with 1/f(x) on one side, e.g. \"1/(x-2) ≤ 2\"\n- Fix segfault with extremely small numbers and high number of bits in floating point conversion\n- Fix crashes and freezes in some corner cases\n- Fix value of Planck unit (was rounded to 7 decimals)\n- Fix negative time zone in date and time input\n- Many minor bug fixes and feature enhancements\nDownload the source code here:\nlibqalculate-5.8.0.tar.gz\nDownload the source code for the graphical user interfaces (qalculate-gtk and qalculate-qt) here:\nqalculate-gtk-5.8.0.tar.gz\nqalculate-qt-5.8.0.tar.gz\nDownload Windows binaries here:\n64-bit installer\n64-bit zip (unpack and run without further installation; no application data are read or written outside of the unpacked directory)\nThe binaries can also be installed using the Windows Package Manager (winget). The 64-bit binaries requires Windows 10 (1809) or later. 32-bit binaries (installer and zip), with support for Windows 7, are also available but do not include the Qt GUI.\nGNU/Linux binaries:\nflatpak packages (recommended) are available at https://flathub.org/apps/details/io.github.Qalculate.qalculate-qt (Qt GUI) and https://flathub.org/apps/details/io.github.Qalculate (GTK GUI).\nsnap packages are available at https://snapcraft.io/qalculate-qt (Qt GUI) and https://snapcraft.io/qalculate (GTK GUI).\n64-bit (x86) self-contained binaries (GTK GUI) (extract and run from anywhere on most GNU/Linux distributions; no translations included)\nFor more information visit the website at http://qalculate.github.io/.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.8.0","version":0,"site":"https://qalculate.github.io/","source":"Hanna Knutsson","license_or_tos":"GPL-2.0","resources":null,"verified":false}