{"appId":"w:Qalculate.Qalculate","appShortcutName":"Qalculate!","appDisplayName":"Qalculate!","authorId":"w:winget","releaseTagName":"winget-5.8.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/Qalculate/libqalculate/releases/download/v5.8.1/qalculate-5.8.1-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A highly versatile desktop calculator, with support for units, physical constants, uncertainty propagation, symbolic calculations, etc.\n\nQalculate! is a multi-purpose cross-platform desktop calculator.\nIt is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation).\nFeatures include a large library of customizable functions, unit calculations and conversion, physical constants, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (GTK, Qt, and CLI).\nQalculate! is a multi-purpose cross-platform desktop calculator. It is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation). Features include a large library of customizable functions, unit calculations and conversion, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (Gtk, Qt, and CLI).\nChanges:\n- Show error when function or variable disabled by \"--disable-insecure\" is used\n- New completion method with matches selectable from numbered list\n- Configurable completion\n- Improve interpretation of function expressions with x, y, or z in object names (e.g. \"x year\"), or within quotation marks\n- Fix compilation with -fsanitize=undefined\n- Fix make check with --disable-insecure\n- Fix infinite loop during factorization on Windows\n- Fix crash after factorization or in RPN mode, with calculate-as-you-type enabled\n- Fix unable to write preferences because of missing configuration directory\n- Fixes for character encodings other than UTF-8\n- Minor bug fixes and feature enhancements\nDownload the source code here:\nlibqalculate-5.8.1.tar.gz\nDownload the source code for the graphical user interfaces (qalculate-gtk and qalculate-qt) here:\nqalculate-gtk-5.8.1.tar.gz\nqalculate-qt-5.8.1.tar.gz\nDownload Windows binaries here:\n64-bit installer\n64-bit zip (unpack and run without further installation; no application data are read or written outside of the unpacked directory)\nThe binaries requires Windows 10 (1809) or later. They can also be installed using the Windows Package Manager (winget).\nGNU/Linux binaries:\nflatpak packages (recommended) are available at https://flathub.org/apps/details/io.github.Qalculate.qalculate-qt (Qt GUI) and https://flathub.org/apps/details/io.github.Qalculate (GTK GUI).\nA snap package are available at https://snapcraft.io/qalculate (GTK GUI).\n64-bit (x86) self-contained binaries (GTK GUI) (extract and run from anywhere on most GNU/Linux distributions; no translations included)\nFor more information visit the website at http://qalculate.github.io/.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.8.1","version":0,"site":"https://qalculate.github.io/","source":"Hanna Knutsson","license_or_tos":"GPL-2.0","resources":null,"verified":false}