{"appId":"w:Qalculate.Qalculate","appShortcutName":"Qalculate!","appDisplayName":"Qalculate!","authorId":"w:winget","releaseTagName":"winget-5.7.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/Qalculate/libqalculate/releases/download/v5.7.0/qalculate-5.7.0b-x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A highly versatile desktop calculator, with support for units, physical constants, uncertainty propagation, symbolic calculations, etc.\n\nQalculate! is a multi-purpose cross-platform desktop calculator.\nIt is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation).\nFeatures include a large library of customizable functions, unit calculations and conversion, physical constants, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (GTK, Qt, and CLI).\nQalculate! is a multi-purpose cross-platform desktop calculator. It is simple to use but provides power and versatility normally reserved for complicated math packages, as well as useful tools for everyday needs (such as currency conversion and percent calculation). Features include a large library of customizable functions, unit calculations and conversion, symbolic calculations (including integrals and equations), arbitrary precision, uncertainty propagation, interval arithmetic, plotting, and a user-friendly interface (Gtk, Qt, and CLI).\nChanges:\n- Support input of base in log() function before parenthesis, e.g. \"log20(400)\" (equivalent to \"log(400, 20)\")\n- Support input of exponent before argument of trigonometric function (e.g. \"sin²(x)\")\n- Support input of functions with more than one argument using RPN syntax\n- Add new binary prefixes (robi, quebi), and enable use of recently added SI prefixes in output by default\n- Micron unit\n- Data set translation fixes\n- Return exact integers in more case in log() function\n- Support \"to 1/n\" as alternative to \"to fraction\"\n- Ask for interpretation of comma (when comma is not the default decimal separator)\n- Customizable prompt\n- Uncolorized \"E\" in scientific E notation\n- Fix segfault with text argument containing potential text returning function, or variable containing text value\n- Fix segfault during calculation of (in)equality with root() function with insufficient number of arguments\n- Fix segfault during output of both approximate and exact logical OR value without (in)equality\n- Fix qError() function\n- Fix locale used for definitions when language option is set\n- Fix calculate as you type and indentation for show-mode-in-prompt with custom mode strings\n- Fix completion of text string ending with capital E\n- Minor bug fixes and feature enhancements\nDownload the source code here:\nlibqalculate-5.7.0.tar.gz\nDownload the source code for the graphical user interfaces (qalculate-gtk and qalculate-qt) here:\nqalculate-gtk-5.7.0.tar.gz\nqalculate-qt-5.7.0.tar.gz\nDownload Windows binaries here (updated 2025-08-06 with clear button fix):\n64-bit installer\n64-bit zip (unpack and run without further installation; no application data are read or written outside of the unpacked directory)\nThe binaries can also be installed using the Windows Package Manager (winget). The 64-bit binaries requires Windows 10 (1809) or later. 32-bit binaries (installer and zip), with support for Windows 7, are also available but do not include the Qt GUI.\nGNU/Linux binaries:\nflatpak packages (recommended) are available at https://flathub.org/apps/details/io.github.Qalculate.qalculate-qt (Qt GUI) and https://flathub.org/apps/details/io.github.Qalculate (GTK GUI).\nsnap packages are available at https://snapcraft.io/qalculate-qt (Qt GUI) and https://snapcraft.io/qalculate (GTK GUI).\n64-bit (x86) self-contained binaries (GTK GUI) (extract and run from anywhere on most GNU/Linux distributions; no translations included)\nFor more information visit the website at http://qalculate.github.io/.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.7.1","version":0,"site":"https://qalculate.github.io/","source":"Hanna Knutsson","license_or_tos":"GPL-2.0","resources":null,"verified":false}