{"appId":"w:ramdor.Thetis","appShortcutName":"Thetis","appDisplayName":"Thetis","authorId":"w:winget","releaseTagName":"winget-2.10.3.10","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/ramdor/Thetis/releases/download/v2.10.3.10/Thetis-v2.10.3.10.x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Client software for HPSDR with changes for the Apache Labs line of radios.\n\n\nThetis v2.10.3.10 - Final Release\nA couple of things cropped up in v2.10.3.9 which has warranted a quick update. Please check the change logs below.\nExplore the highlights of the changes in v2.10.3.9 over on YouTube : WATCH HERE\nIMPORTANT NOTE: It is worth making a backup of your DB before installing this version. It is also worth un-installing previous Thetis installs using Add/Remove Programs before installing this version.\n(Note: Uninstalling via Add/Remove Programs will leave your database intact. You don't need to take any specific action beyond backing it up if required. Thetis will handle the database appropriately.)\nTip: You can always access these release notes through the button in the About box. The full change log is also available there.\nIf you encounter any issues, please report them on GitHub here.\nJoin our Discord community for test builds and more: Click Here\nv2.10.3.10 - Change Log\n- [add] flash new TCI spots option in Setup->Serial/Network/MidiCat->Network. Spots that are <2 mins old will flash. Hovering over them will stop them flashing\n- [add] added ^o- symbols to anan meter needle, and signal text meter to represent reading source. (^-=sig o=sig avg, ^=max fft bin)\n- [fix] fix rare 'object in use' error with pretty tracker (scroll bars in UI)\n- [fix] fixed ChannelMaster.dll version issue. Increase version to v1.0.1.0 which should resolve install issues where ChannelMaster.dll was not being overwritten\n- [fix] fixed CW sidetone (MON) issue where it would turn off if mode was changed\nv2.10.3.9 - Change Log\n- [add] an [or decreased] option added to \"Force ATT on Tx to 31 when Drive or Tune power is increased and PS-A is on\"\n- [add] many tool tips added to fields and options in the linearity form\n- [add] many tool tips added to DSP setup form\n- [add] software sidetone option added. New options in Setup->DSP->CW. Audio via cmASIO + VAC. Note: this only works from cwx form and external rts/cts cw switching\n- [add] tx filter edge colour for the filter view item\n- [add] show/hide option for grid frequency numbers in Setup->Appearance->RX Display->Text\n- [add] options to show/hide major/minor grid lines in Setup->Appearance->RX Display\n- [add] option to show two tone measurements in the linearity form. Note: suitable spectrum scale etc required. Code attempts to find peaks at expected locations\n- [add] added fft size display to the rx display settings\n- [add] Red-Pitaya radio model. Specific modifications for that hardware\n- [add] PSForm tooltips now used in finder\n- [add] palette option added for TX waterfall\n- [add] custom waterfall palette added for RX and TX\n- [add] gradient added for TX panadaptor\n- [add] datafill colour/alpha, and dataline alpha added for TX panadaptor\n- [add] low colour added to tx waterfall\n- [add] custom meter bar for use with % variables, min/max/high/title/units\n- [add] ui popups during the wdsp wisdom00 file generation. Also notified if wisdom file is older than 3 months at startup\n- [add] FPS profiler in Setup->Tests. Use on a fresh database, with just region, model, and ip configured, so that you can connect + power up the radio through Thetis. Leave window position/size and do not change any settings\n- [add] options to cache WDSP filter impulse data in Setup-DSP. Can also store this data to a .dat file. Read the tool tips. Improves mode switch speed and Thetis start up time\n- [add] tci spot message now supports far more modes\n- [add] defaults and 'stealth' mode for two tone frequencies in setup->tests\n- [add] pause button in the info bar buttons to pause the display. The radio etc will continue when paused, noise floor calculations will not\n- [add] pulsed/pecker tune available in Setup->Transmit\n- [add] pulsed/pecker two tone available in Setup->Test\n- [add] options to prevent sleep/screen saver in Setup->Options->Options2\n- [add] top line of meter/gadget notes are used in the dropdown list to make identification easier\n- [add] signal meter based on peak bin in the passband to mirror Simon Brown's implementation in SDRconsole. %signal_max_bin% for text overlay. Note: notches are not considered\n  with this meter\n- [add] if an ALT key is held at startup 'auto launch at startup' will be bypassed. This will prevent apps from auto launching if configured to do so\n- [add] fpga and p2app version shown in titlebar and setup if using a G2 with p2app v39 or later\n- [add] a TCI spot message can provide additional info via json data. Cluster-TCI-Bridge by OE3IDE supports this currently. Details here here : 6174cac\n- [add] additional info is shown on a TCI spot popup if available\n- [add] CTRL+right click on a TCI will show the related HamQTH page. Right click will show QRZ, this is unchanged\n- [change] exporting a tx profile will now ask for destination location and filename. It will complain if filename already exists\n- [change] restored step attenuator RX1 if HERMES is used. Unsure why I disabled it a few years ago\n- [change] the bespoke TCI command Tx frequency has changed back to the following as per the TCI protocol, tx_frequency:3700000; .There is now a bespoke Thetis message also sent out at the same time, tx_frequency_thetis:3700000,b80m,false,false;\n- [change] refactor serial port pin change detection code for slight performance improvements\n- [change] display vsync defaulted to on for new databases. I would advise turning this on if not already\n- [change] all RX display offsets are now done in one place in the code\n- [change] TX-ATT label has been changed to [S-ATT]\n- [change] spectrum gradient change. Now -150 to +10 dBm. NOTE: all gradients will need to be adjusted\n- [change] cursor/peak readout colours moved to Appearance-General\n- [change] float precision maintained for display/meter calibration offsets\n- [change] limit setPan to filter item display spectrum to 1/8 of framerate (~266ms update interval when vfo is changing the spectrum pan)\n- [change] refactored midi wheel code to try and remove the lag when spinning a wheel very fast. Slider/knob will still have same issue. Behringer devices PL-1/Micro/etc do not use this new code\n- [change] rx filter can now be +-20kHz wide to mirror TX filter widths. Shift also needs to be set as that will (at the moment) imply a width limit\n- [change] WDSP has had some optimisations and caching added. For example if you change the filter size to something that has been calculated before it will be much faster the second time. Has improved start up time, mode switching etc etc.\n- [change] WDSP updated to version 1.26.\n- [change] meter/gadget containers changes so that each can be set to use rx1 or tx2 data (future proofing)\n- [change] setup-display-accurate frame timing has been set to off and removed from the ui. Now only used in testing/development\n- [fix] mic disable/enable button on front end will now disable the mic at startup if set as off. Note: its state is saved as part of the tx profile\n- [fix] fixed rare out of bounds issue in memory ScheduleUpdate\n- [fix] cat IF command fix where an error (O;) message would be returned if an unsupported TuneStep was in use. This bug has existed since 25/02/2007\n- [fix] mode buttons when in collapsed mode should now work again when Thetis is first launched\n- [fix] when running multiple instances of Thetis, closing down others may cause issues with PerformaceCounter/CpuLoad display, resulting in endless error logs. This has been resolved\n- [fix] fixed wave record crash if Windows [Controlled folder access] is turned on. You have to add Thetis.exe to the [Allow an app through Controlled folder access] list if you want to use the wave record when [Controlled folder access] is turned on\n- [fix] the sub-receiver now respects the main receiver’s mute state, fixing an issue where sub-receiver audio could still be heard even when the main receiver was muted\n- [fix] serial ports that are not of COMnn format now do not causes errors. If a serial port is for example name COMB13, then it will not be able to be used\n- [fix] notch popup window will be shifted so that it is visible when close to the edge of a screen\n- [fix] fix filter width crash under certain conditions in the filter config form\n- [fix] fix issues where adc overload has caused an rx attenuation to be applied and the band has been changed before the attenuation has been removed\n- [fix] serial keying cw will now only mox when in SEMI mode\n- [fix] rx2 on/off via midi/cat will now cause rx2 meter containers to hide/show\n- [fix] volt sens fix for G2, would cause an error log from time to time\n- [fix] fix for tcpip cat server where if a multiple cat message arrived, then only the first would be processed\n- [fix] simulated tci spot clicks using bespoke TCI message [spot_simulate_click] now also sends out [rx_clicked_on_spot] defaulted to rx1 and vfoa\n- [fix] when adcs were linked, unwinding of adc overload attenuation did not always return to original att\n- [fix] PS SetPk reset if user selects different radio model\n- [fix] rx2 sql thumb control now aligns with signal displayed below\n- [fix] VAC2 on/off state is recovered from the TX profile when rx2 is enabled\n- [fix] pulse on waterfall has been minimised when using NF compensation with the waterfall AGC\n- [fix] cwu above 10mhz will now be used by tciserver on restart if configured to do so\n- [fix] s-att/att state will behave as expected when the adcs are linked, and rx2 was previously saved with a different state to rx1. If the adc's are linked then RX2 will use setting from RX1\n- [fix] antenna button box now uses tx band to determine antenna. Now operates as expected when running a x-band transmit\n- [fix] issue where WWV was selected when in a ham band the associated selected rx antenna would not be shown correctly in the antenna button box when the switch to the WWV was made","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.10.3.10","version":0,"site":"https://github.com/ramdor","source":"Richie - MW0LGE","license_or_tos":"GPL-2.0","resources":null,"verified":false}