{"appId":"w:RARLab.WinRAR","appShortcutName":"WinRAR","appDisplayName":"WinRAR","authorId":"w:winget","releaseTagName":"winget-7.20.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.rarlab.com/rar/winrar-x64-720.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Compress, Encrypt, Package and Backup with only one utility\n\n- WinRAR is a powerful compression tool with many integrated additional functions to help you organize your compressed archives.\n- WinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disk space, transmission costs AND valuable working time as well.\n- WinRAR supports all popular compression formats (RAR, ZIP, CAB, ARJ, LZH, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip).\n- WinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries particularly well.\n- WinRAR allows you to split archives into separate volumes easily, making it possible to save them on several disks.\n- WinRAR is also ideal if you are sending data through the web. Its AES 256-bit encryption and its authenticated signature technology will give you the peace of mind you have been looking for.\n- WinRAR is a trial product, meaning you have the chance to thoroughly test it. The program can be used absolutely free of charge for 40 days!\n- WinRAR licenses are valid for all available language and platform versions. If you have purchased several licenses, you can even mix versions to meet your own personal needs.\n1. Original and packed file size column widths in \"l\" and \"v\" commands\n     are increased by 1 symbol, so 10 digit file sizes are also displayed\n     aligned by these commands.\n\n  2. If \"Reuse existing window\" option is enabled when opening an archive,\n     but another WinRAR copy is busy with archive processing, the archive\n     is opened by current copy. Previously neither of copies opened it.\n\n  3. Bugs fixed:\n\n     a) previous beta failed to open archives in ZIP format with extra fields\n        shorter than 4 bytes, such as some APK files;\n\n     b) \"Ask\" option in WinRAR \"Settings/Viewer/Viewer type\" didn't display\n        the viewer type prompt for PNG files and several other image formats;\n\n     c) -ag switch 'k' modifier used English week day names even\n        in localized versions.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.20.0","version":0,"site":"https://www.rarlab.com/","source":"win.rar GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}