{"appId":"w:RARLab.WinRAR","appShortcutName":"WinRAR","appDisplayName":"WinRAR","authorId":"w:winget","releaseTagName":"winget-7.20.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Compress, Encrypt, Package and Backup with only one utility\n\n- WinRAR is a powerful compression tool with many integrated additional functions to help you organize your compressed archives.\n- WinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disk space, transmission costs AND valuable working time as well.\n- WinRAR supports all popular compression formats (RAR, ZIP, CAB, ARJ, LZH, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip).\n- WinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries particularly well.\n- WinRAR allows you to split archives into separate volumes easily, making it possible to save them on several disks.\n- WinRAR is also ideal if you are sending data through the web. Its AES 256-bit encryption and its authenticated signature technology will give you the peace of mind you have been looking for.\n- WinRAR is a trial product, meaning you have the chance to thoroughly test it. The program can be used absolutely free of charge for 40 days!\n- WinRAR licenses are valid for all available language and platform versions. If you have purchased several licenses, you can even mix versions to meet your own personal needs.\n1. Performance improvements when deleting files in solid RAR archives:\n\n     a) if there are no non-zero files after deleted files, archive\n        recompressing isn't performed;\n\n     b) part of archive before deleted files is copied as is, without\n        repacking. Its contents is unpacked to memory if necessary,\n        but not recompressed;\n\n     c) semi-solid archive processing involves only solid blocks containing\n        deleted files. Unaffected solid blocks are copied as is.\n\n  2. \"Generate archive name by mask\" archiving option and -ag command line\n      switch:\n\n     a) new 'K' format character defines the current day of week\n        name as a text string;\n\n     b) new 'O' format character defines the current month name as a text\n        string regardless of format character number. Unlike \"MMM\" mask,\n        it allows to use shorter or longer than 3 character names,\n        such as -agOO;\n\n     c) excessive format characters exceeding the available field width\n        are now ignored instead of appending to archive name.\n        So it is possible to use full month or week day names by providing\n        format characters in the amount equal or exceeding the longest name,\n        such as -agKKKKKKKKKK for day of week names.\n\n  3. Command line -s switch:\n\n     a) switch -s accepts the optional parameter preceded by '=' character.\n\n        Switches -s, -se, -sv, -sv-, -s- are replaced by -s=f, -s=e,\n        -s=v, -s=d, -s=-. Previous versions of these switches are still\n        supported in the current version, but can be removed in the future.\n\n        It is allowed to combine multiple modifiers in the same switch,\n        such as -s=e100f.\n\n     b) new switch -s=r resets the solid statistics before adding new files\n        to existing archive.\n\n  4. Switch -tk now accepts the optional date parameter in YYYYMMDDHHMMSS\n     format. If used without parameter when modifying an archive,\n     it preserves the original archive time. If optional parameter\n     is present, it is assigned to archive modification time.\n\n     It is allowed to insert separators like '-' or ':' to the date string\n     and omit trailing fields. For example, switch -tk2025-06-01 is correct.\n\n  5. \"Specified time\" is added to \"Set archive time to\" options on \"Time\"\n     page of archiving dialog. It allows to assign the manually entered time\n     to newly created or modified archives.\n\n  6. UTF-8 output format and byte order mark options are added to\n     \"Generate report\" command.\n\n  7. \"Cloud files\" option is added to \"Where to check for SFX archives\"\n     group in \"Settings/Integration/Context menu items...\" dialog.\n\n     If this option is off, WinRAR shell extension will not attempt\n     to detect if archive is self-extracting, when right clicking\n     an executable cloud file not available locally. This detection\n     involves data read and can be slow for such files.\n\n     This option relies on file attributes returned by a cloud storage\n     provider and can be ignored if required attribute isn't supported\n     by specific cloud service.\n\n  8. \"Copy to clipboard\" button at the bottom of \"Search results\" dialog\n     places current results of \"Find files\" command to clipboard.\n\n  9. It takes less time to open a large archive with a lot of files\n     and folders in WinRAR file list. This is most noticeable for ZIP\n     archives containing millions of files.\n\n 10. Improved extraction speed of TAR and TAR based archives,\n     such as .tar.gz or tar.xz. It is most visible for hard disk drives\n     with slower seek time and large archives containing a lot of files.\n\n 11. SFX module sets sfxnamenoext environment variable, containing\n     SFX archive name without path and extension. It allows to append\n     the archive name to user defined destination path like:\n\n     Path=c:\\Util\\%sfxnamenoext%\"\n\n 12. \"minsize\" parameter, defining the minimum file reference size\n     in -oi[0-4][:] switch, now can include an optional trailing\n     unit size character. So -oi:1m is the equivalent of -oi:1048576.\n\n 13. Switch -x recognizes exclude paths with both Windows and Unix style\n     path separators, so -xfolder\\file and -xfolder/file do the same.\n     Previously only -xfolder\\file excluded the file.\n\n 14. Bugs fixed:\n\n     a) \"Files to exclude\" field of archiving dialog was ignored for all\n        but first ZIP archives if \"Put each file to separate archive\"\n        option was turned on;\n\n     b) when processing \"Convert archives\" command, \"Use for all archives\"\n        option in the password prompt was available only for encrypted\n        archives with file name encryption and couldn't be enabled\n        when converting archives without encrypted file names.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.20.0","version":0,"site":"https://www.rarlab.com/","source":"win.rar GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}