{"appId":"w:Readdle.Spark","appShortcutName":"Spark Desktop","appDisplayName":"Spark Desktop","authorId":"w:winget","releaseTagName":"winget-3.27.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.sparkmailapp.com/Spark3/win/dist/3.27.5.126936/Spark.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Smart. Focused. Email.\n\nFast, cross-platform email designed to filter out the noise - so you can focus on what's important.\nWe’ve redesigned the email layout and shipped several notable improvements across navigation, scheduling, and file sharing.\nNew additions:\n- Share meeting notes as emails via a dedicated button above each note.\n- Find shared availability faster by pasting a list of addresses into Meet With.\n- Fetch new messages on demand using the Check New Email button in the sidebar.\n- See previously viewed emails in a dedicated Recently Seen folder.\n- Control avatars and preview lines in Settings > Appearance.\nImprovements:\n- Emails and cards use a new layout for faster navigation.\n- Split View now shows clearer separation between the email list and viewer.\n- Mark as Done and Close buttons have more space between them to prevent misclicks.\n- Active account names are clearly visible when viewing a specific account.\n- Unread Cards now follow the account order from the sidebar.\n- Recent search queries can be cleared by hovering and clicking X.\n- Snooze, Send Later, and Reminders now support custom times.\nThis update brings changes many of you asked for. Let us know what you think — email support@sparkmailapp.com to share your feedback.\n\nP.S. If you encounter any issues with the automatic update, please use the following link to download the update manually: https://downloads.sparkmailapp.com/Spark3/win/dist/3.27.5.126936/Spark.exe","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.27.5","version":0,"site":"https://readdle.com/","source":"Spark Mail Limited","license_or_tos":"Proprietary","resources":null,"verified":false}