{"appId":"w:RedHat.Podman","appShortcutName":"Podman","appDisplayName":"Podman","authorId":"w:winget","releaseTagName":"winget-5.7.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/containers/podman/releases/download/v5.7.1/podman-5.7.1-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A daemonless container engine for developing, managing, and running OCI Containers\n\nPodman is a daemonless, open source, Linux native tool designed to make it easy to find, run, build, share and deploy applications using Open Containers Initiative (OCI) Containers and Container Images.\nPodman provides a command line interface (CLI) familiar to anyone who has used the Docker Container Engine.\nMost users can simply alias Docker to Podman (alias docker=podman) without any problems.\nSimilar to other common Container Engines (Docker, CRI-O, containerd), Podman relies on an OCI compliant Container Runtime (runc, crun, runv, etc) to interface with the operating system and create the running containers.\nThis makes the running containers created by Podman nearly indistinguishable from those created by any other common container engine.\nBugfixes\n- Fixed a bug where adding devices to emulated Linux containers on FreeBSD did not work.\n- Fixed a bug where the podman system migrate command could panic under certain circumstances when run rootless.\n- Fixed a bug where Podman would sometimes not correctly recreate the rootless user namespace when Conmon and the rootless pause process were unexpectedly killed.\n- Fixed a bug where the podman kube play command could leak file descriptors.\nMisc\n- Updated Buildah to v1.42.2\n- Updated containers/common to v0.66.1","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.7.1","version":0,"site":"https://podman.io/","source":"Red Hat","license_or_tos":"Apache-2.0","resources":null,"verified":false}