{"appId":"w:RedHat.Podman","appShortcutName":"Podman","appDisplayName":"Podman","authorId":"w:winget","releaseTagName":"winget-5.7.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/containers/podman/releases/download/v5.7.0/podman-5.7.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A daemonless container engine for developing, managing, and running OCI Containers\n\nPodman is a daemonless, open source, Linux native tool designed to make it easy to find, run, build, share and deploy applications using Open Containers Initiative (OCI) Containers and Container Images.\nPodman provides a command line interface (CLI) familiar to anyone who has used the Docker Container Engine.\nMost users can simply alias Docker to Podman (alias docker=podman) without any problems.\nSimilar to other common Container Engines (Docker, CRI-O, containerd), Podman relies on an OCI compliant Container Runtime (runc, crun, runv, etc) to interface with the operating system and create the running containers.\nThis makes the running containers created by Podman nearly indistinguishable from those created by any other common container engine.\nSecurity\n- This release addresses CVE-2025-52881, where arbitrary write gadgets and procfs write redirects allowed runc container escape and denial of service.\nFeatures\n- The remote Podman client and podman system service API server now support encrypting connections with TLS and mTLS, including client authentication by certificate (#24583).\n- The podman system connection add command can now create connections to TCP sockets with TLS and mTLS encryption.\n- The podman run and podman create commands now support two new options, --creds and --cert-dir, to manage logging into registries to pull images.\n- The podman kube play and podman kube down commands can now accept multiple files as input, creating or removing more than one pod or deployment with the same command (#26274).\n- The podman kube play command now supports a new option, --no-pod-prefix, to disable prefixing container names with pod names. Please note that this can cause pods to fail to create if the pod shares a name with a container (#26396).\n- The podman machine init command now supports a new option, --tls-verify, to control whether the machine image can be pulled from registries without a trusted TLS certificate, with the default being true (TLS verification on) (#26517).\n- When running the podman image load and podman build commands against a podman machine VM, if the path being loaded or built is shared into the VM, Podman will load it from the VM's filesystem instead of streaming the data through the REST API, improving performance (#26321).\n- A default location for container log files when using the k8s-file log driver can now be specified with the log_path option in containers.conf.\n- Default flags for the OCI runtime can now be set with the runtimes_flags option in containers.conf.\n- The podman artifact remove command can now accept multiple arguments, for example, podman artifact rm artifact1 artifact2.\n- The podman wait command now supports a new option, --return-on-first, which causes podman wait to return after any container matches the condition, as opposed to waiting for all containers to match (#26691).\n- The podman container restore command now supports a new option, --tcp-close, allowing containers with active TCP connections to be restored multiple times.\n- Quadlet now features support for a new file type, .artifact, allowing OCI artifacts to be managed with Quadlet (#25778).\n- Quadlet .container files now support a new key, HttpProxy, to disable the automatic forwarding of HTTP proxy options from the host into the container (#26925).\n- Quadlet .pod files now support a new key, StopTimeout, to configure the stop timeout for the pod (#27120).\n- Quadlet .build files now support two new keys, BuildArg and IgnoreFile, to specify build arguments and an ignore file (#27065 and #27268).\n- Quadlet .kube files now support multiple YAML files in a single .kube file.\n- Quadlet now supports templated dependencies for volumes and networks (#25136).\n- The podman quadlet install command now supports a new option, --replace, which will replace any existing Quadlet with a conflicting name (#26930).\n- The podman quadlet print command now has a new alias, podman quadlet cat (#27296).\n- The remote Podman client's podman artifact remove command now supports the --all option.\n- The podman artifact add command now supports a new option, --replace, which will replace any existing artifact with the given name (#27082).\n- The podman artifact rm command now supports a new option, --ignore, which will suppress errors when attempting to remove an artifact that does not exist (#27084).\n- The podman artifact list command now includes artifact creation time in its output (#27314).\n- The podman artifact list --format option now supports two new format keys, VirtualSize, returning the size of the artifact in integer bytes, and CreatedAt, returning the time the artifact was created as an RFC3339 timestamp (the existing Size and Created fields returned human-readable information) (#27085).\n- The podman artifact inspect command now supports a new option, --format, to return specific information about an artifact with user-specified formatting (#27112).\nChanges\n- In preparation for a planned removal of the BoltDB database in Podman 6.0, a warning has been added for installations still using BoltDB. These warnings were added in Podman 5.6, but were not visible by default; they now are. They can be suppressed with the SUPPRESS_BOLTDB_WARNING=true environment variable.\n- A new Windows installer has been introduced with a simpler single MSI architecture that supports both user-scope (no admin required) and machine-scope installations. Note: To use the new installer, users must uninstall existing Podman installations before using the new installer, but all containers, images, machines, and other data will be preserved. The old installer is still provided to ensure backwards compatibility, though it will be removed in a future release (#22994 and #25968).\n- Podman now requires Go 1.24.\n- When the -p/--publish and --network=ns:/path options are used together when creating a container, Podman will not warn that the -p option will be ignored as an existing namespace is in use (this has always been the case, but Podman now prints a warning about it) (#26663).\n- The podman stats command now provides additional information about container resource utilization when run on FreeBSD.\n- Shell autocompletion has been enabled for the --sysctl option to podman create and podman run, and the --interface-name option to podman network create.\n- Artifacts created by Podman now include a creation timestamp by default, stored in the org.opencontainers.image.created annotation (#27081).\n- The podman inspect command can now inspect artifacts.\n- The podman artifact add command can now override the org.opencontainers.image.title annotation in created artifacts.\n- Podman can now optionally be built with Sequoia-PGP support. When so built, the --sign-by-sq-fingerprint option allows signing images using Seqoia-PGP keys.\nBugfixes\n- Fixed a bug where the --filter ancestor= option to podman ps required complete matches, unlike Docker (which matched substrings) (#26623).\n- Fixed a bug where the --filter label= option to podman events did not support key-only matches (as podman os --filter label= does) (#26702).\n- Fixed a bug where Quadlet could panic when a Mount was given without a source being specified.\n- Fixed a bug where Quadlet would fail to generate for a .build file when a systemd specifier was used in the [Build] section (#26746).\n- Fixed a bug where the podman info command could panic when /proc/sys/fs/binfmt_misc was not mounted.\n- Fixed a bug where the remote Podman client could lose some initial bytes of output from attach sessions (podman run, podman exec, podman attach) due to a race condition (#26951).\n- Fixed a bug where the podman build command was ignoring SBOM related options (#23915).\n- Fixed a bug where the --userns=ns:/path option to podman create and podman run was broken with runc 1.1.11 and higher (#27148).\n- Fixed a bug where podman machine on Windows would always re-pull machine images when using the WSL provider, even if an the image had already been pulled and was present on disk.\nAPI\n- Added a new API endpoint to list quadlets (GET /libpod/quadlets/json).\n- The Compat Inspect endpoint for Images no longer includes the ContainerConfig field. To access image configuration, use the Config field instead. This matches changes made by Docker in the v1.45 API.\n- Fixed a bug where the Stats and Commit endpoints for Containers (compat & libpod), the Push, Commit, Push, and Pull endpoints for Images (compat & libpod), and the Push endpoint for Manifests (libpod) were not returning a Content-Type header.\nMisc\n- Error messages returned when an incomplete --device option (for example --device /dev/fuse::) is passed to podman create or podman run have been improved.\n- Updated Buildah to v1.42.0\n- Updated the containers/image library to v5.38.0\n- Updated the containers/storage library to v1.61.0\n- Updated the containers/common library to v0.66.0\n- The containers/image, containers/storage, and containers/common libraries are now sourced from the containers/container-libs monorepo.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.7.0","version":0,"site":"https://podman.io/","source":"Red Hat","license_or_tos":"Apache-2.0","resources":null,"verified":false}