{"appId":"w:RedHat.Podman","appShortcutName":"Podman","appDisplayName":"Podman","authorId":"w:winget","releaseTagName":"winget-5.8.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/containers/podman/releases/download/v5.8.0/podman-5.8.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A daemonless container engine for developing, managing, and running OCI Containers\n\nPodman is a daemonless, open source, Linux native tool designed to make it easy to find, run, build, share and deploy applications using Open Containers Initiative (OCI) Containers and Container Images.\nPodman provides a command line interface (CLI) familiar to anyone who has used the Docker Container Engine.\nMost users can simply alias Docker to Podman (alias docker=podman) without any problems.\nSimilar to other common Container Engines (Docker, CRI-O, containerd), Podman relies on an OCI compliant Container Runtime (runc, crun, runv, etc) to interface with the operating system and create the running containers.\nThis makes the running containers created by Podman nearly indistinguishable from those created by any other common container engine.\nFeatures\n- The podman quadlet install command can now install files which contain multiple separate Quadlet files. The files must be separated with a --- delimeter on a new line, and each section must begin with a # FileName=<name> line to name the new Quadlet (#27384).\n- Quadlet .container files now support a new key, AppArmor, for configuring the container's AppArmor profile (#27095).\n- When running the podman artifact add command against a podman machine VM, if the path being loaded or built is shared into the VM, Podman will load it from the VM's filesystem instead of streaming the data through the REST API, improving performance (#26321).\n- The podman update command now features a new option, --ulimit, to update container ulimits (#26381).\n- The podman exec command now features a new option, --no-session, which disables tracking of the exec session to improve performance and startup time (#26588).\nChanges\n- Podman will now automatically attempt to migrate legacy BoltDB databases to SQLite when the system reboots. This is necessary as support for BoltDB will be removed in Podman 6.0 in May. If automatic migration is not possible, a new option, podman system migrate --migrate-db, will manually force a migration.\n- The podman secret create - command no longer requires that the secret be provided through a pipe, and instead allows typing the secret through the terminal (#27879).\nBugfixes\n- Fixed a bug where containers created by podman play kube with a healthcheck using the initialDelaySeconds option would run healthchecks before the initial delay had expired (#27678).\n- Fixed a bug where healthchecks would sometimes fail to execute due to systemd rate limits.\n- Fixed a bug where the podman export command would emit a Mount event instead of an Export event.\n- Fixed a bug where the podman kube play command incorrectly handled precedence between environment variables set by both the envFrom and env fields (#27287).\n- Fixed a bug where the podman kube play command would panic when parsing Pod YAML missing the image field (#27784).\n- Fixed a bug where the podman volume mount command returned empty paths when volumes were handled by a plugin driver (#27858).\n- Fixed a bug where containers created with --rootfs instead of from an image would show that they had a healthcheck in the starting state even if no healthcheck was defined (#27651).\n- Fixed a bug where the podman build command's --pull=newer option did not function correctly (#22845).\n- Fixed a bug where the RequiresMountsFor field in Quadlet .container files incorrectly handled bind-mount paths which contained spaces.\n- Fixed a bug where the remote Podman client's podman run --detach-keys option did not accept an empty string (IE, no detach keys) (#27414).\n- Fixed a bug where the remove Podman client's podman build --secret ... env=VAR option would incorrectly try to read the environment variable on the server side, instead of from the client (#27494).\n- Fixed a bug where the podman artifact push and podman artifact pull commands ignored authentication credentials given by the --authfile option (#27421).\n- Fixed a bug where Windows paths were incorrectly handled under some circumstances when using the HyperV machine provider (#27571).\n- Fixed a bug where the podman run --pod-id-file option was not properly validated, allowing the creation of containers in pods with improper user namespace configuration (#26848).\nAPI\n- Added new APIs for interacting with Quadlets, including GET /libpod/quadlets/{name}/file (print contents of a Quadlet file), GET /libpod/quadlets/{name}/exists (check if the given Quadlet exists), POST /libpod/quadlets (install one or more Quadlets), DELETE /libpod/quadlets (remove one or more Quadlets), and DELETE /libpod/quadlets/{name} (remove a single Quadlet).\n- Fixed a bug where the Compat and Libpod Logs endpoints for Containers did not use nanosecond-level precision for reported timestamps (#27961).\n- Fixed a bug where the Compat Create endpoint for Containers incorrectly handled healthcheck commands with arguments containing spaces (#26519).\n- Fixed a bug where the Compat Remove endpoint for Secrets was misnamed as DELETE /secret/{name} instead of DELETE /secrets/{name} (#27548).\nMisc\n- Updated Buildah to v1.43.0\n- Updated the containers/storage library v1.62.0\n- Updated the containers/image library to v5.39.1\n- Updated the containers/common library to v0.67.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.8.0","version":0,"site":"https://podman.io/","source":"Red Hat","license_or_tos":"Apache-2.0","resources":null,"verified":false}