{"appId":"w:Resplendence.WhoCrashed","appShortcutName":"WhoCrashed","appDisplayName":"WhoCrashed","authorId":"w:winget","releaseTagName":"winget-7.10","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Comprehensible crash dump analysis, find out why your system crashed.\n\n### WhoCrashed reveals the drivers responsible for crashing your computer\n\nWhenever a computer running Windows suddenly reboots without displaying any\nnotice or blue or black screen of death, the first thing that is often thought\nabout is a hardware failure. In reality, crashes are often caused by\nmalfunctioning device drivers and kernel modules. In case of a kernel error,\ncomputers running Windows do not show a blue or black screen unless they are\nconfigured to do so. Instead these systems suddenly reboot without any notice.\n\nWhoCrashed shows the drivers that have been crashing your computer with a single\nclick. In most cases it can pinpoint the offending drivers that have been\ncausing misery on your computer system in the past. It does post-mortem\ncrashdump analysis and presents all gathered information in a comprehensible\nway. In case your system has been crashing because of a hardware failure,\nWhoCrashed will provide you with guidance to trace the root cause of the\nproblem.\n\nNormally, debugging skills and a set of debugging tools are required to do\npost-mortem crash dump analysis. Using WhoCrashed you do not need any debugging\nskills to be able to find out what drivers are causing trouble to your computer.\n### Certain dump files could not be analyzed due to a buffer overflow error\n\nCertain crash dump files could not be analyzed with WhoCrashed because of a\n\"buffer overflow error\". This would cause the program to terminate. This bug has\nbeen fixed.\n\n### Updated debug DLLs\n\nThe debug DLL versions used for analyzing crash dumps have been updated.\n\n### Wrong bugcheck analysis problem fixed\n\nWhoCrashed could draw the wrong conclusion analyzing certain crash dumps. The\nanalysis process has been improved to prevent this.\n\n### Clicking on \"cancel\" during dump analysis could produce unexpected behavior\n\nClicking the cancel button while a dump analysis process was in progress could\ngive unexpected results. This problem has been fixed.\n\n### After clicking on \"cancel\" when prompted to download symbols, analysis would\n  proceed\n\nWhen prompted to download symbol files, WhoCrashed would anyway proceed with the\nanalysis process after clicking the cancel button. This problem has been fixed.\n\n### Minor changes and improvements\n\nSeveral minor changes and improvements have been applied to WhoCrashed which are\nnot being specified.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.10","version":0,"site":"https://www.resplendence.com/main","source":"Resplendence Software Projects Sp.","license_or_tos":"Proprietary","resources":null,"verified":false}