{"appId":"w:RingCentral.RingCentralMeetingsRooms","appShortcutName":"RingCentralRooms","appDisplayName":"RingCentralRooms","authorId":"w:winget","releaseTagName":"winget-24.3.10.462","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Boost meeting efficiency for any conference space with Rooms - a wireless and scalable solution for your video conferencing needs.\n\nTransform your meeting spaces into dynamically enabled video conferencing destinations. Using existing off-the-shelf equipment, you can easily set up, hold, and manage video conferences with the highest quality “in-room” experience. Walk into any room and easily start and control a video meeting with one touch. Share presentations, documents, and other content wirelessly from your laptop. Seamlessly reserve rooms from Microsoft and Google calendar integrations.\nWhat's new\n- Join Microsoft Teams meetings: Set up third-party conferencing or use Microsoft Teams Cloud Video Interop (CVI) to join Microsoft Teams meetings from your Rooms controller.\n- Launch interactive polls: Set up the Poll feature in your meetings.\n- Use nonverbal feedback: Send and receive reactions during your meetings or webinars.\n- Set up Focus mode: Use Focus mode to restrict the view of participant videos and screen sharing to the meeting host. Hosts can also switch between multiple shared screens and allow participants to see others’ shared content.\n- Update join webinar messages: Customize your join webinar disclaimer content.\n- Enhanced content sharing: View content locally or share the content in a meeting when using an HDMI connection.\n- Set up Idle timeout mode: Use Idle timeout mode to save power in the Rooms display.\n- Display meeting chat: Turn the Chat feature on or off in your Rooms meetings.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"24.3.10.462","version":0,"site":"https://www.ringcentral.com/","source":"Zoom Video Communications, Inc. and RingCentral Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}