{"appId":"w:riok.Kreya","appShortcutName":"Kreya","appDisplayName":"Kreya","authorId":"w:winget","releaseTagName":"winget-1.18.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://stable-downloads.kreya.app/1.18.0/Kreya-win-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A GUI client for gRPC and REST APIs with innovative features for environments, authorizations and more.\n\nKreya is a GUI client for gRPC, REST and WebSocket APIs. It makes calling APIs easy! Supported features:\n- Kreya stores the files locally in JSON format for easy git-syncing (or any other syncing software)\n- Unary, client-streaming, server-streaming and duplex requests (gRPC)\n- Supports HTTP/2 and HTTP/3\n- Authentication configurations - declare once, use everywhere\n- Environment support combined with a powerful templating language\n- Directory settings (ex. define the endpoint or authentication once for all requests)\n- Scripting and tests\n- kreyac, the Kreya CLI\n- Server reflection (gRPC)\n- OpenAPI import (REST)\n- And more!\nFeatures\n- Core: add scripting preview api\n- Core: add snapshot testing\n- Core: add configurable proxy support\n- Core: add configuration to read product key from environment or file\n- Core: allow comments in environments\n- Core: allow to import multiples files at once, e.g. postman collections\n- Core: macos dmg installer\n- Core: show selected operation in invoker script screen\n- gRPC: add status code to tracing message\n- REST: support OpenAPI 3.1\n- Linux: upgrade to GTK4\n- Scripting: unify scripting entry point (kreya.rest instead of kreyaRest)\n- Scripting: add clear method to user variables\n- Scripting: add scripting snapshot assertion api\n- UI: inline gRPC method chooser\n- UI: add operations tags in trace tab\n- UI: add search in trace tab\n- UI: double click on operation collection entry opens operation\n- UI: show which tests belong to which operation in collections and scripts\n- Auth: add OAuth2/OIDC option to disable pushed authorization request\nBug Fixes\n- Auth: correctly apply the header prefix to static and OAuth2 authentications\n- Auth: use redirect URIs as is in authentications, do not modify them\n- CLI: improve error message when files at specified paths do not exist\n- CLI: improve summary output\n- CLI: use stderr for error messages\n- Core: correctly show Scripts and Collections as failed if operations or test fail\n- Core: correctly validate user variable contents when editing via UI\n- Core: delete the operation script file if it is empty\n- Core: fixed bug where users were logged out when opening multiple Kreya instances\n- Core: keep state when modifying collections\n- Core: overwrite existing files when saving responses\n- Core: show error message when saving an environment with duplicate JSON keys\n- gRPC: correctly send large numbers when not quoted as a string\n- gRPC: handle incorrect server reflection implementations that do not specify proto dependencies\n- REST: improve handling of formatted responses with invalid content\n- REST: improve resulting project structure from OpenAPI import\n- Scripting: ensure that the correct suggestions are displayed in the UI\n- Scripting: provide date.to_string docs\n- Scripting: show correct inlined parameter name in piped templated function calls\n- UI: add preview for advanced auth options\n- UI: behaviour of a newly created user variable is fixed\n- UI: display scripting and sandbox exceptions as snackbar\n- UI: fix theme switching, which failed sometimes before\n- UI: moving or renaming should not break quick actions\n- Linux: correctly build snap\n- Linux: native clipboard support","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.18.0","version":0,"site":"https://riok.ch/en/","source":"riok GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}