{"appId":"w:RockinChaos.Shiru","appShortcutName":"Shiru","appDisplayName":"Shiru","authorId":"w:winget","releaseTagName":"winget-6.4.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/RockinChaos/Shiru/releases/download/v6.4.5/win-Shiru-v6.4.5-installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Manage your personal media library, organize your collection, and stream your content in real time, no waiting required!\n\nA pure JS BitTorrent streaming environment, with a built-in list manager.\nImagine qBit + Taiga + MPV, all in a single package, but streamed real-time.\nCompletely ad free with no tracking/data collection.\nUnlike qBit's sequential approach, seeking into data that hasn't been downloaded yet will prioritise downloading that data, instead of simply closing MPV.\n- feat: launch external player from native\n  - Adds a button in the native player that launches an external player for video playback if you are on Android or if an external player path is defined on desktop.\n  - This button is usable with the \"Enable External Player\" setting disabled. This gives flexibility in using the native player when possible, but you can use the external player easily if an unsupported codec error occurs.\n- fix: linux and macOS system notifications\n  - Fixes notifications being blank on Linux and macOS as toastXml is not supported on those platforms. Big thanks to @xi-ve for providing the fix.\n  - Implements notification actions for linux and macOS\n- fix: disable keybinds outside player\n  - Player keybinds were able to be used outside of the player when the miniplayer was disabled or closed.\n- fix: video playing when minimized\n  - On desktop, there were some edge cases allowing the video to play when minimized.\n  - This was primarily an issue when using the play/pause key and when a video was still loading when minimized.\n- fix: discord rpc leaking between profiles\n  - Fixes discord rpc leaking the previous profile's activity. It was primarily an issue when swapping between a profile with rpc enabled and a profile with rpc disabled.\n- fix: undefined media edge case\n- chore: allow alt-click on episode list\n  - Adds right-clicking or tap and hold to force the torrent prompt for the episode, bypassing auto-file select without having to disable the setting directly.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.4.5","version":0,"site":"https://github.com/RockinChaos/Shiru","source":"RockinChaos","license_or_tos":"GPL-3.0","resources":null,"verified":false}