{"appId":"w:RockinChaos.Shiru","appShortcutName":"Winget Application","appDisplayName":"Shiru","authorId":"w:winget","releaseTagName":"winget-6.1.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/RockinChaos/Shiru/releases/download/v6.1.0/win-Shiru-v6.1.0-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"BitTorrent streaming software with no paws in the way—watch anime in real-time, no waiting for downloads!\n\nA pure JS BitTorrent streaming environment, with a built-in list manager.\nImagine qBit + Taiga + MPV, all in a single package, but streamed real-time.\nCompletely ad free with no tracking/data collection.\nThis app is meant to feel, look, work and perform like a streaming website/app, while providing all the advantages of torrenting, like file downloads, higher download speeds, better video quality and quicker releases.\nUnlike qBit's sequential approach, seeking into data that hasn't been downloaded yet will prioritise downloading that data, instead of simply closing MPV.\nDesigned to be a similar experience to using a streaming website with functionality akin to MALSync and AniSkip.\n- fix: AppImage Desktop file\n  - Fixes issues noted by @alanpoulain with the AppImage on Linux.\n  - Fixed incorrect app name, which was incorrectly showing productName instead of Shiru.\n- fix: scoring css\n- fix: sync with Anilist\n  - Fixes various bugs that prevented MyAnimeList authorized accounts from syncing their lists to AniList accounts.\n- fix: RSS caching\n  - RSS feeds were being unnecessarily cached every 30 seconds, eventually resulting in a performance drop.\n  - RSS feeds now properly cache ONLY when a change is detected.\n- fix: duplicate notifications\n  - General sub/dub release notifications were incorrectly triggered if an RSS notification had been sent beforehand.\n  - Now, if an RSS notification already exists, another will not be sent.\n- fix: movie not released toasts\n  - Improves the torrent toasts to state the difference between a movie and an episode.\n- fix: max playable episodes\n  - Max playable episode was incorrectly using the total episodes count without considering if the media has not been released.\n- fix: MacOS MenuBar\n  - Properly hides the custom menu bar when on macOS, as macOS has its own menu buttons.\n- fix: prefer dubs\n  - Full batch releases were being detected as \"single\" episode releases resulting in them being hidden from continue watching after the first episode, the latest Blue Box dub is a good example.\n- fix: remember my choice\n  - Fixes \"Remember my Choice\" not being saved when choosing the close option due to the cache debounce duration.\n- fix: restore window state\n  - When attempting to open a second instance of the app, the existing window should be restored and focused. However, when the app was minimized to the system tray, this was not properly functioning, resulting in nothing happening.\n- fix: single instance lock\n  - If a second instance was created, the app would close but leave behind an abandoned process that continued running in the background.\n- fix: mappings fallback\n  - Kitsu went down, resulting in the episode list being completely missing instead of properly ignoring Kitsu as a source.\n- fix: deselect text\n  - Once text was selected, it was impossible to deselect. You can now properly deselect text by intuitively clicking outside the text area.\n- chore: caching performance improvements\n  - Improves the performance of caching once the existing cache has a large amount of data.\n- chore: catch Linux EPIPE pop-up\n  - Under certain circumstances an EPIPE error may appear on Linux due to the webtorrent worker losing connection to the player process.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.1.0","site":"https://github.com/RockinChaos/Shiru","source":"RockinChaos","license_or_tos":"GPL-3.0","resources":null,"verified":false}