{"appId":"w:RockinChaos.Shiru","appShortcutName":"Shiru","appDisplayName":"Shiru","authorId":"w:winget","releaseTagName":"winget-6.5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/RockinChaos/Shiru/releases/download/v6.5.0/win-Shiru-v6.5.0-installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Manage your personal media library, organize your collection, and stream your content in real time, no waiting required!\n\nA pure JS BitTorrent streaming environment, with a built-in list manager.\nImagine qBit + Taiga + MPV, all in a single package, but streamed real-time.\nCompletely ad free with no tracking/data collection.\nUnlike qBit's sequential approach, seeking into data that hasn't been downloaded yet will prioritise downloading that data, instead of simply closing MPV.\n- feat: Android logs and debugging\n  - Adds the ability to export logs from the UI and persists debug logs through app restarts.\n- feat: android .torrent file association\n- feat: custom tracker list\n  - You can now remove default trackers or add additional trackers to the custom tracker list in the client settings.\n- feat: reannounce\n  - You can now manually attempt to reconnect to trackers using the reannounce button under the dropdown for each torrent.\n- feat: auto scrape toggle\n  - You can now disable auto-scraping of extension results for up-to-date peer data in the extension settings. Scraping can often be slow, and sometimes it isn't always needed.\n  - A manual scrape button has been added to the torrent menu to allow for manual scraping as needed.\n- fix: invalid relative url when adding extensions\n  - Fixes weird behavior where fetching an extensions source sometimes returns stub modules instead of the full implementation.\n- fix: storage permissions on older android devices\n  - Fixes storage permission issues with older Android devices when using an external download location.\n  - Users will now be prompted when selecting a download location to allow storage permissions.\n- fix: android stuck updater edge case\n  - Fixes a potential issue where the update prompt would remain locked when canceling the apk update.\n- fix: modal escape key with stacked modals\n  - Fixed escape key not closing open modals.\n  - Added a check to only close the topmost modal when stacked.\n  - Changed escape to first escape text inputs, second escape closes the modal.\n- fix: multi-part movie and special episodes\n  - The episode list now better handles series that split up movies or specials into multiple episodes for streaming release. E.g. Love is War.\n- fix: incorrectly listing zero episodes\n  - Fixes and edge case where AniList randomly lists a zero episode under their streaming episode list, despite having a separate dedicated entry.\n- fix: incorrect torrent results for zero episode series\n  - Zero episode series now properly returns the expected results for the episode that was queried.\n- fix: dub batch delays\n  - Dub batches that are delayed now properly show in the episode list with the proper dates.\n- fix: negative episode number results\n  - Fixes negative episode numbers by returning a positive result.\n  - Fixes negative episode numbers (failed result) falsely being marked as a successful result.\n- fix: android safe area padding on search and w2g pages\n- fix: android image search preview\n- fix: duplicate terms on torrent card\n- fix: completed and repeating card color in file manager and notifications.\n- fix: resolving series with hyphens\n- fix: dub aired count with zero episodes\n- fix: oversized episode list card\n- fix: prefer dub in schedule feed\n- chore: rework episodes by air date\n  - Fixes issues getting results from extensions during an AniList outage.\n  - Fixes getting existing torrents through extension results while offline or during an AniList outage.\n  - Implements fallbacks for episode air date for single episodes.\n- chore: improve update experience with progress indication\n  - Added a visual progress bar to the update button and informative toasts to keep users informed during the download and installation process.\n- chore: improve and simplify changelog\n  - Changelog is now properly sanitized rather than only handling certain cases. API calls to get the changelog have been deduplicated and simplified.\n- chore: properly sanitize synopsis\n  - Fixes issues with certain characters not being displayed, and now supports html tags.\n- chore: improve modal navigation and refactor\n  - Improves modal handling, making navigation less janky.\n  - Adds navigation history support for all previously missing modals.\n- chore: episode card scaling on small screens\n  - Episode cards will now shrink slightly, allowing them to be centered properly on small screens.\n- chore: add confirmations\n  - Changes dangerous buttons that permanently erase data to have a confirmation to ensure you want to perform that action.\n- chore: update minimize modal\n  - Updates the minimize prompt to use the new custom soft modal.\n- chore: improve example extension\n  - Redesigned the example extension as a functional reference implementation for developers.\n  - You can test this extension locally via direct path to the index.json or hosted via gh:RockinChaos/Shiru/extensions.\n- chore: hide watch prompt in image search\n- chore: debounce complex search inputs\n- chore: allow options for current torrent\n- chore: tweak mappings cache duration\n- chore: add raw term\n- chore: update deps\n- chore: refactor","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.5.0","version":0,"site":"https://github.com/RockinChaos/Shiru","source":"RockinChaos","license_or_tos":"GPL-3.0","resources":null,"verified":false}