{"appId":"w:RockinChaos.Shiru","appShortcutName":"Shiru","appDisplayName":"Shiru","authorId":"w:winget","releaseTagName":"winget-6.4.8","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/RockinChaos/Shiru/releases/download/v6.4.8/win-Shiru-v6.4.8-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Manage your personal media library, organize your collection, and stream your content in real time, no waiting required!\n\nA pure JS BitTorrent streaming environment, with a built-in list manager.\nImagine qBit + Taiga + MPV, all in a single package, but streamed real-time.\nCompletely ad free with no tracking/data collection.\nUnlike qBit's sequential approach, seeking into data that hasn't been downloaded yet will prioritise downloading that data, instead of simply closing MPV.\n- fix: recover from IndexedDB corruption\n  - Fixes an issue where the app won't start if the cache is corrupted.\n  - Separates database transactions to reduce the chances of data getting corrupted during writes.\n- fix: id filtering in user list search\n  - Ensures that id arrays are filtered for valid values before being used in search filters. Prevents empty or invalid ids from affecting search results and improves robustness of the anime filtering logic.\n- fix: stop infinite skeletons when no extensions\n  - Fixes an issue where skeleton cards would render indefinitely when no extensions were found, causing the query to appear stuck.\n- fix: correct myanimelist dates\n  - Adjusts start and completed dates to ensure the timeline is valid on MyAnimeList, preventing entries where the completed date would be earlier than the start date.\n- fix: missing banner images\n  - Fixes banner images vanishing after navigating to series that do not have banner images.\n- fix: scroll position jumping when marking notifications as read\n- fix: losing miniplayer when navigating\n- fix: logging stack traces in electron\n- fix: null/undefined checks\n- chore: update deps","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.4.8","version":0,"site":"https://github.com/RockinChaos/Shiru","source":"RockinChaos","license_or_tos":"GPL-3.0","resources":null,"verified":false}