{"appId":"w:RockinChaos.Shiru","appShortcutName":"Shiru","appDisplayName":"Shiru","authorId":"w:winget","releaseTagName":"winget-6.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/RockinChaos/Shiru/releases/download/v6.3.0/win-Shiru-v6.3.0-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Manage your personal media library, organize your collection, and stream your content in real time, no waiting required!\n\nA pure JS BitTorrent streaming environment, with a built-in list manager.\nImagine qBit + Taiga + MPV, all in a single package, but streamed real-time.\nCompletely ad free with no tracking/data collection.\nUnlike qBit's sequential approach, seeking into data that hasn't been downloaded yet will prioritise downloading that data, instead of simply closing MPV.\n- feat: adding local files for playback\n  - In the torrent manager, you can now use the upload button to add local media files as a private torrent for local playback. These are copied to the cache under the shiru-local folder.\n  - Selecting more than one file will create a batch.\n  - The file picker also supports .torrent files to stage them for download.\n  - Added a copy magnet link button in the torrent details.\n- feat: overhaul history navigation with sidebar support\n  - Complete rewrite of the navigation/history system to unify back/forward behavior.\n  - Adds full desktop support through clickable sidebar buttons.\n  - Parent page/view restoration now ensures consistent UX without unexpected closures.\n  - Fixes bad navigation behavior on Android with anime details view changes.\n- feat: macOS x64 codecs\n  - The universal build now supports codecs on x64 and arm64.\n- feat: show my anime\n  - Alt-clicking (right click or tap and hold) the hide my anime button in the search will now show only your anime.\n  - Useful for only showing your anime on the airing schedule page.\n- feat: new app icon\n  - Another big thanks to Ashtaka on Discord for designing the icon and logo.\n- fix: handle missing subtitle style blocks\n  - The subtitle parser occasionally received headers without any style blocks, causing the track to not appear at all.\n- fix: aggressive title matching\n  - Fixes certain series not being labeled Dual Audio.\n- fix: show multi-header release in episode list\n  - Multi-Header releases like \"May I Ask for One Final Thing?\" will now show properly in the Episode List.\n  - Dubs are also now considered for this, overriding any sub dates, as a dubbed episode wouldn't release before the sub.\n- fix: broken preview trailers\n  - Trailers that are auto-played in preview cards will no longer show errors; if they fail, it will fall back to the banner image.\n  - Fixes an edge case with trailers not functioning unless the cache is cleared.\n  - Trailers now load faster.\n  - Muting and unmuting the trailer from the preview card no longer restarts the trailer.\n  - Preview Card banner and trailer are now 16:9 ratio.\n- fix: zero episode air date\n  - Fixes \"Dusk Beyond the End of the World\" showing 1 episode ahead as already released due to the presence of the zero episode.\n  - Fixes detecting the description of zero episodes.\n- fix: zero episode behavior\n  - Torrent details now properly show zero episodes.\n  - The previous episode button is now visible in the player when playing episode 1.\n  - Clicking the watch button now plays the correct episode.\n- fix: showing duplicate or array resolution\n  - Torrent cards were showing duplicate resolutions or multiple, but didn't get their own badge.\n- fix: Android drag scroll\n  - Prevents interactable touch elements from triggering drag scroll.\n- fix: infinite scroll\n  - Search page scrolling is now more consistent.\n  - If you scroll to the bottom before the current batch query loads, it will automatically load the next batch after the current batch resolves.\n- fix: auto file select on rss feeds\n  - Fixed RSS feeds incorrectly prompting for torrent selection when Auto-File Select was disabled.\n- fix: subtitles missing cjk glyphs\n  - Noto Sans will now be used as the default font for subtitles whenever there are missing glyphs in the provided subtitle attachments.\n- fix: exclude trailers\n  - Fixes trailers incorrectly being in the playable files list.\n- fix: focus preview cards\n  - Improves the expected reactivity of preview cards, whether they should be shown or not, based on certain events..\n- fix: don't always verify OVA match\n  - Verification when resolving OVA media will now fail if the file name is missing OVA or if the file name has OVA and the media is not an OVA.\n- fix: missing NCED and NCOP\n  - Can't filter these out unless it's actually specified as an anime_type.\n- fix: start at the lowest unwatched id\n  - Lowest unwatched was previously determined based on the format of the series, which would result in weird issues like OVA being before the main series.\n  - We now get the lowest media id as ids are typically sequential.\n- fix: preserve episode and season when failing to resolve\n  - Ensure files that initially failed to resolve keep their known episode and season values instead of relying on torrent name parsing, preventing misdetections like \"1080p\" as an episode number.\n- fix: failing to detect playable episodes\n  - Series that are releasing but do not have an air date for the next episode would end up failing to detect how many episodes have already aired.\n- fix: check media status\n  - Check if the media is marked as finished before stating X episode hasn't released.\n- fix: show episodes for movies\n  - If a movie has multiple episodes, they will now be detailed rather than listing each as \"Movie\".\n- fix: replace timestamp-like chapter names\n  - Better to use a placeholder than a confusing timestamp.\n- fix: resolving My Gift Lvl 9999 Unlimited Gacha\n  - Resolves issues with release groups using the Mugen Gacha synonym.\n- fix: resolving Mr. Ginpachi's Zany Class\n  - Was primarily an issue with subbed release groups using an incorrect Romaji title.\n- fix: resolving Mobile Suit Zeta Gundam\n  - Some release groups used Z instead of Zeta for shorthand.\n- fix: Resolving Ranma 1/2 season 2\n- fix: resolving My Hero Academia FINAL SEASON\n- fix: Android dragging home sections\n- fix: ui reactivity\n- fix: miniplayer scaling\n- fix: fade in/out animations\n- fix: webpack warnings\n- fix: undefined media in file manager\n- fix: focusing hidden elements\n- fix: episode card title truncation\n- fix: don't prompt unresolved media\n- chore: move WebTorrent out of renderer\n  - Primarily impacts desktop, improving stability and performance, especially when seeding large torrents.\n  - Removed IPC override on Android, opting for a preload instead.\n  - Removed a large chunk of IPC calls, opting for cleaner inter-process messaging.\n  - Fixes issues with torrents hanging and WebTorrent crashing.\n  - Fixes extremely long buffering on Android.\n  - Fixes stuttering when loading a video.\n  - Changed torrent debug behavior, separated the torrent worker debug from WebTorrent debug.\n- chore: improve WebTorrent stability\n  - Introduces better cleanup and hash checking for existing torrents.\n- chore: better extension error handling\n  - Fixes local extension testing using the path.\n  - Now a lot harder for extensions to break.\n- chore: brighten amoled skeletons\n  - It was extremely hard to see when the screen brightness was low on mobile.\n- chore: make trailers load dynamically\n  - Trailers are now verified they can be played before showing a trailer button in the anime details.\n- chore: hide toasts when fullscreen\n  - Hides toasts while in fullscreen to avoid breaking immersion.\n- chore: bump to electron v39.1.2\n  - Fixes a lot of Linux issues, including the native title bar.\n  - Improves overall app stability.\n  - Removed release group exclusions from desktop.\n- chore: deprecate flags\n  - Unfortunately, Chromium has disabled Windows-like smooth scrolling, so we can no longer rely on these for scroll behavior.\n- chore: implement batch guesses\n  - If the detected hash for a series doesn't have an associated episode (unplayed batch), assume it is very likely accurate as the desired series.\n- chore: show buffering when unplayable\n  - Instead of viewing a black screen wondering why nothing is happening, it will now be evident by the buffering until playback is fully ready.\n- chore: improve torrent card terms\n  - Adds some missing terms and improves the cleaning of the displayed file name.\n- chore: rework progress sorting\n  - Sorting by 'Your Progress' will now sort by distance to completion rather than by how many episodes you watched.\n- chore: better credits regex\n- chore: silence extension update rate limit errors\n- chore: bump to node v22.20\n- chore: update deps","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.3.0","version":0,"site":"https://github.com/RockinChaos/Shiru","source":"RockinChaos","license_or_tos":"GPL-3.0","resources":null,"verified":false}