{"appId":"w:RomexSoftware.PrimoRamdisk","appShortcutName":"Primo Ramdisk","appDisplayName":"Primo Ramdisk","authorId":"w:winget","releaseTagName":"winget-6.6.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Powerful Disk Emulator to Create Ultra-Fast RAM-Disks\n\nRAM-Disks are created out of the system memory. All read and write requests to RAM-disks are processed in memory, resulting in a huge improvement in overall performance with ultra-fast speed and ultra-low latency.\n\nAn effective and efficient way to utilize system memory for RAM-disks, dynamically acquiring and releasing system memory based on real needs, instead of monopolizing disk-size memory in the system.\n\nCapable of rapidly imaging the RAM-disk contents to a persistent file and restoring contents when needed. In this way RAM-disks perform like persistent storage and retain contents across computer restarts, even though the system memory is volatile. Various imaging functions and options are offered.\n\nFAT, FAT32, exFAT and NTFS file systems are built-in, thus RAM-disks can be formatted and ready to use at very early stage during the computer boot, without the need of format scripts or imaging files.\n\nAble to recognize the system's invisible memory and use it for RAM-disks, overcoming the Windows memory limits, especially the 4GB issue in 32-bit Windows, while allowing all installed physical memory to be fully utilized.\n- Support Windows 11.\n- Support Windows Core Isolation.\n- Support detecting Invisible Memory beyond 64GB on 64-bit Windows.\n- [Ultimate/Server Edition] Be NUMA-Aware.\n- Other minor improvements.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.6.0","version":0,"site":"https://www.romexsoftware.com/","source":"Romex Software","license_or_tos":"Proprietary","resources":null,"verified":false}