{"appId":"w:RProject.R","appShortcutName":"Winget Application","appDisplayName":"R for Windows","authorId":"w:winget","releaseTagName":"winget-4.4.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cloud.r-project.org/bin/windows/base/old/4.4.3/R-4.4.3-win.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"R is a free software environment for statistical computing and graphics.\n\nR is a language and environment for statistical computing and graphics. It is a GNU project which is similar to the S language and environment which was developed at Bell Laboratories (formerly AT&T, now Lucent Technologies) by John Chambers and colleagues. R can be considered as a different implementation of S. There are some important differences, but much code written for S runs unaltered under R.\nR provides a wide variety of statistical (linear and nonlinear modelling, classical statistical tests, time-series analysis, classification, clustering, …) and graphical techniques, and is highly extensible. The S language is often the vehicle of choice for research in statistical methodology, and R provides an Open Source route to participation in that activity.\nOne of R’s strengths is the ease with which well-designed publication-quality plots can be produced, including mathematical symbols and formulae where needed. Great care has been taken over the defaults for the minor design choices in graphics, but the user retains full control.\nR is available as Free Software under the terms of the Free Software Foundation’s GNU General Public License in source code form. It compiles and runs on a wide variety of UNIX platforms and similar systems (including FreeBSD and Linux), Windows and MacOS.\nINSTALLATION\n- R can be installed using C23 (for example with -std=gnu23 or -std=gnu2x) with recent compilers including gcc 12–14, Apple clang 15–16, LLVM clang 17–20 and Intel icx 2024.2.\n  It can be installed with the upcoming (at the time of writing) gcc 15, which defaults to C23.\nC-LEVEL FACILITIES\n- The functions R_strtod and R_atof now allow hexadecimal constants without an exponent, for compatibility with their C99 versions (PR#18805).\nUTILITIES\n- R CMD build and R CMD check now allow reference output for demo scripts (‘demo/demo.Rout.save’ files) to be shipped with the package, as proposed by Torsten Hothorn in PR#18816.\nBUG FIXES\n- kappa(A, exact=TRUE) for singular A returns Inf more generally, fixing PR#18817 reported by Mikael Jagan.\n- Fixed URLs of the sun spots (sunspot.month etc) data sets and mention future changes due to recalibration.\n- The parser now accepts hexadecimal constants with a decimal point without an exponent (taken as p0) as documented in ?NumericConstants (PR#18819).\n- rbind() now works correctly when inputs include a raw vector and a logical, integer or double vector – previously the inclusion of the latter was garbled.\n- smooth.spline() checks validity of its arguments df.offset and penalty: it could segfault if they were NULL.\n- isGeneric(<primitive>, fdef=*, getName=TRUE) now also returns the name instead of just TRUE, fixing PR#18829 reported by Mikael Jagan.\n- isGeneric(fdef = print) now works, fixing PR#18369 thanks to Mikael Jagan.\n- sort(x, method = \"qsort\") made illegal accesses when x has length 0.\n- dir.create() is protected against being passed an empty string as its path argument.\n- Silent integer overflow could occur in the ‘exact’ computations for fisher.test() for unrealistic inputs: this is now an error.\n- Some invalid C-level memory accesses are avoided for loglin(, margin = NULL).\n  loglin(, param = TRUE) no longer gives an error in corner cases such as a one-dimensional input.\n- dev.capabilities() $ events now reports \"Idle\" if the device provides it, fixing PR#18836, thanks to Trevor Davis.\n- arima(.., seasonal = <wrong-vector>) correctly errors now, ditto for arima0(), thanks to Norbert Kuder's report on the R-devel list.\n- binomial(<link>)$linkinv(eta) and .. $mu.eta(eta) now also work for \"logit\" link when is.integer(eta).\n- as.roman(x) now should work platform independently, also for, e.g., x = \"IIIII\" (= V) and x = \"IIIIII\" (= VI).\n- R CMD Rd2pdf works again on an installed package directory containing LaTeX help (from option --latex), thanks to a report by Peter Ruckdeschel.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.4.3","site":"https://www.r-project.org","source":"R Core Team","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}