{"appId":"w:RPTools.MapTool","appShortcutName":"MapTool","appDisplayName":"MapTool","authorId":"w:winget","releaseTagName":"winget-1.17.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/RPTools/maptool/releases/download/1.17.1/MapTool-1.17.1.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Virtual Tabletop for playing roleplaying games with remote players or face to face.\n\n\nRead Me First\nBefore uninstalling any previous version, please copy them elsewhere beforehand if you have saved your campaign files, logs, or anything else you want to keep under the directory structure where MapTool is installed. It is also a good idea to always have backups.\nNote: Do not install over the top of an old version; either install it in a new directory or uninstall the old version first. If you have installed a beta version of 1.16.0, uninstall that first.\nPlatform Notes\nThe JAR file should only be used by advanced users who are comfortable installing Java releases. You need to install a working Java with JavaFX on your system to use it.\nWindows\nIf you want to install multiple version of MapTool on windows download the MapTool-1.xx.x-win.zip file and unzip it to the directory you want it in. If you use the .msi or .exe it will uninstall the older version.\nLinux\nIf using Ubuntu, you will need Ubuntu 24.04 or later, as the dependencies are not available for earlier versions\nmacOS:\nUse either .pkg or .dmg.\n- On macOS, to run the app the first time after installation, hold Ctrl while clicking the icon and continue to hold Ctrl while choosing Open, then choose to open the application (this is part of Apple's approach when dealing with an unidentified developer).\n- The macOS Gatekeeper may flag the DMG file as broken. For more details, see #2679.\nWhat's Changed\nBug Fixes 🩹\n- Force anchor position to the cell center for snap-to-grid movement by @kwvanderlinde in #5605\nFull Changelog: 1.17.0...1.17.1","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.17.1","site":"https://www.rptools.net/","source":"RPTools","license_or_tos":"AGPL-3.0","resources":null,"verified":false}