{"appId":"w:RPTools.MapTool","appShortcutName":"MapTool","appDisplayName":"MapTool","authorId":"w:winget","releaseTagName":"winget-1.18.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/RPTools/maptool/releases/download/1.18.6/MapTool-1.18.6.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Virtual Tabletop for playing roleplaying games with remote players or face to face.\n\n\nRead Me First\nIf you have saved anything you want to keep - campaign files, logs, etc. - under the directory where MapTool is installed, please copy these elsewhere before installing a new version otherwise they will be lost. It is also a good idea to always have backups.\nDo not install overtop of an old version. Either install it in a new directory or uninstall the old version first. If using the one of the installers, the previous version should be uninstalled automatically (check the Platform Notes for details).\nPlatform Notes\nThe JAR file should only be used by advanced users who are comfortable installing Java releases. You need to install a working Java with JavaFX on your system to use it.\nThe ZIP file for your platform is a self-contained version of MapTool that can be unzipped into any directory of your choosing. No need for an installer or working Java installation. Just heed the warnings above and don't store campaigns or other files in this directory, and don't try to unzip overtop of an existing version.\nWindows\nFor most users, use the .msi or .exe installer. This will seamlessly update MapTool in the standard location, installing the new version while automatically uninstalling the old versions. But note that versions older than 1.17.0 will not be automatically uninstalled, so you should uninstall such a version manually before updating to 1.17.0 or later.\nIf you want to install multiple versions of MapTool on Windows, download the MapTool-1.xx.x-win.zip file and unzip it to the folder you want it in.\nLinux\nIf using Ubuntu, you will need Ubuntu 24.04 or later, as the dependencies are not available for earlier versions\nIf you want to install multiple versions of MapTool on Linux, download the MapTool-1.xx.x-linux.zip file and unzip it to the directory you want it in.\nmacOS:\nUse either .pkg or .dmg.\n- On macOS, to run the app the first time after installation, hold Ctrl while clicking the icon and continue to hold Ctrl while choosing Open, then choose to open the application (this is part of Apple's approach when dealing with an unidentified developer).\n- The macOS Gatekeeper may flag the DMG file as broken. For more details, see #2679.\nIf you want to install multiple versions of MapTool on MacOS, download the MapTool-1.xx.x-mac.app.zip file and unzip it to the directory you want it in. You can then run the .app file.\nWhat's Changed\nBug Fixes 🩹\n- 1.18 - Fix token image tables by @kwvanderlinde in #5823\nFull Changelog: 1.18.5...1.18.6","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.18.6","version":0,"site":"https://www.rptools.net/","source":"RPTools","license_or_tos":"AGPL-3.0","resources":null,"verified":false}