{"appId":"w:SABnzbdTeam.SABnzbd","appShortcutName":"SABnzbd","appDisplayName":"SABnzbd","authorId":"w:winget","releaseTagName":"winget-4.5.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sabnzbd/sabnzbd/releases/download/4.5.5/SABnzbd-4.5.5-win-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"SABnzbd is an Open Source Binary Newsreader written in Python.\n\n\nRelease Notes - SABnzbd 4.5.5\nBug fixes and changes in 4.5.5\n- macOS: Failed to start on versions of macOS older than 11.\n  Python 3.14 dropped support for macOS 10.13 and 10.14.\n  Because of that macOS 10.15 is required to run 4.5.5.\nBug fixes and changes in 4.5.4\nNew Features\n- History details now includes option to mark job as Completed.\n- Quota notifications available for all notification services.\n  - Sends alerts at 75%, 90%, and 100% quota usage.\n- Multi-Operations now supports Move to Top/Bottom.\n- New outgoing_nntp_ip option to bind outgoing NNTP connections to specific IP address.\nImprovements\n- Setup wizard now requires successful Server Test before proceeding.\n- Anime episode notation S04 - 10 now supported for Sorting and Duplicate Detection.\n- Multi-Operations: Play/Resume button unselects on second click for better usability.\n- Unrar now handles renaming of invalid characters on Windows filesystem.\n- Switched from vendored sabnzbd.rarfile module to rarfile>=4.2.\n- Warning displayed when removing all Orphaned jobs (clears Temporary Download folder).\nBug Fixes\n- Active connections counter in Status window now updates correctly.\n- Job setting changes during URL-grabbing no longer ignored.\n- Incomplete .par2 file parsing no longer leaves files behind.\n- Local IPv4 address now detectable when using Socks5 proxy.\n- Server configuration changes no longer show Failure message during page reload.\nPlatform-Specific\n- Linux: Make Windows compatible automatically enabled when needed.\n- Windows: Executables are now signed using SignPath Foundation certificate.\n- Windows: Can now start SABnzbd directly from installer.\n- Windows and macOS: Binaries now use Python 3.14.\nBug fixes and changes in 4.5.3\n- Remember if Permanently delete was previously checked.\n- All available IP-addresses will be included when selecting the fastest.\n- Pre-queue script rejected NZBs were sometimes reported as URL Fetching failed.\n- RSS Next scan time was not adjusted after manual Read All Feeds Now.\n- Prevent renaming of .cbr files during verification.\n- If --disable-file-log was enabled, Show Logging would crash.\n- API: Added time_added, timestamp of when the job was added to the queue.\n- API: History output could contain duplicate items.\n- Snap: Updated packages and changed build process for reliability.\n- macOS: Repair would fail on macOS 10.13 High Sierra.\n- Windows: Unable to start on Windows 8.\n- Windows: Updated Unrar to 7.13, which resolves CVE-2025-8088.\nBug fixes and changes in 4.5.2\n- Added Tab and Shift+Tab navigation to move between rename fields in queue.\n- Invalid cookies of other services could result in errors.\n- Internet Bandwidth test could be stuck in infinite loop.\n- RSS readout did not ignore torrent alternatives.\n- Prowl and Pushover settings did not load correctly.\n- Renamed osx to macos internally.\n- API: Removed B post-fix from quota and left_quota fields in queue.\n- Windows: Support more languages in the installer.\n- Windows and macOS: Updated par2cmdline-turbo to 1.3.0 and Unrar to 7.12.\nBug fixes and changes in 4.5.1\n- Correct platform detection on Linux.\n- The From SxxEyy RSS filters did not always work.\n- Windows and macOS: Update Unrar to 7.11.\nNew features in 4.5.0\n- Improved failure detection by downloading additional par2 files right away.\n- Added more diagnostic information about the system.\n- Use XFF headers for login validation if verify_xff_header is enabled.\n- Added Turkish translation (by @cardpuncher).\n- Added unrar_parameters option to supply custom Unrar parameters.\n- Windows: Removed MultiPar support.\n- Windows and macOS: Updated Python to 3.13.2, 7zip to 24.09,\n  Unrar to 7.10 and par2cmdline-turbo to 1.2.0.\nBug fixes since 4.4.0\n- Handle filenames that exceed maximum filesystem lengths.\n- Directly decompress gzip responses when retrieving NZB's.\nUpgrade notices\n- Direct upgrade supported from version 3.0.0 and newer.\n- Older versions require performing a Queue repair after upgrading.\nKnown problems and solutions\n- Read ISSUES.txt or https://sabnzbd.org/wiki/introduction/known-issues\nCode Signing Policy\nWindows code signing is provided by SignPath.io using a SignPath Foundation certificate.\nAbout\nSABnzbd is an open-source cross-platform binary newsreader.\nIt simplifies the process of downloading from Usenet dramatically, thanks to its web-based\nuser interface and advanced built-in post-processing options that automatically verify, repair,\nextract and clean up posts downloaded from Usenet.\n(c) Copyright 2007-2025 by The SABnzbd-Team (sabnzbd.org)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.5.5","version":0,"site":"https://github.com/sabnzbd/sabnzbd","source":"The SABnzbd Team","license_or_tos":"GPL2/GPL3","resources":null,"verified":false}