{"appId":"w:Sandboxie.Classic","appShortcutName":"Sandboxie","appDisplayName":"Sandboxie","authorId":"w:winget","releaseTagName":"winget-5.71.8","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.16.8/Sandboxie-Classic-x64-v5.71.8.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\n\nSandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\nIt is developed by David Xanatos since it became open source, before that it was developed by Sophos (which acquired it from Invincea, which acquired it earlier from the original author Ronen Tzur).\nIt creates a sandbox-like isolated operating environment in which applications can be run or installed without permanently modifying the local or mapped drive.\nSuch an isolated virtual environment allows controlled testing of untrusted programs and web surfing.\n0 5 5\nRelease Notes\nThis update of Sandboxie-Plus enhances usability across the file panel and configuration interface. The file panel now supports an integrated search and filter function, which can be opened using Ctrl + F, allowing users to quickly locate items within large folder views. Additionally, a dedicated user interface option has been introduced for the ProtectAdminOnly=y/n setting, making this security configuration accessible without manual INI edits.\nThe release also addresses an issue in the 32-bit SbieDll.dll where SbieApi_QueryDrvInfo could trigger an incorrect certificate warning. This problem has been fully resolved to ensure accurate driver state reporting and eliminate unnecessary alerts.\nFor a full list of changes please review the change log.\nYou can support the project through donations, any help will be greatly appreciated.\nIf you have issues with an update installation, just uninstall the previous version keeping the sandboxie.ini and reinstall the new build.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.71.8","version":0,"site":"https://xanasoft.com/","source":"sandboxie-plus.com","license_or_tos":"GPL-3.0","resources":null,"verified":false}