{"appId":"w:Sandboxie.Classic","appShortcutName":"Winget Application","appDisplayName":"Sandboxie","authorId":"w:winget","releaseTagName":"winget-5.70.10","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.15.10/Sandboxie-Classic-x64-v5.70.10.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\n\nSandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\nIt is developed by David Xanatos since it became open source, before that it was developed by Sophos (which acquired it from Invincea, which acquired it earlier from the original author Ronen Tzur).\nIt creates a sandbox-like isolated operating environment in which applications can be run or installed without permanently modifying the local or mapped drive.\nSuch an isolated virtual environment allows controlled testing of untrusted programs and web surfing.\n0 5 5\nRelease Notes\nThis release primarily addresses critical compatibility issues with Firefox, ensuring that version 137.0 and later now runs correctly within Sandboxie Plus without generating SBIE2328 notifications. This fix restores proper functionality for Firefox users, resolving a major disruption introduced in the previous version.\nIn addition to the Firefox fix, this update introduces a new configuration option, BindAdapterIP, which allows users to bind sandboxed applications to a specific host IP address. This can be defined globally or per process via the INI file, offering greater control over network behavior within the sandbox. It’s important to note that the specified IP must be bound to a local network interface, or connections will fail.\nSeveral additional issues have been resolved, including problems affecting Thunderbird. Memory leaks related to process command line retrieval have been addressed, and missing components like SbieShellExt.dll have been restored.\nFor a full list of changes please review the change log.\nKnown Issue\nYou can support the project through donations, any help will be greatly appreciated.\nIf you have issues with an update installation, just uninstall the previous version keeping the sandboxie.ini and reinstall the new build.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.70.10","site":"https://xanasoft.com/","source":"sandboxie-plus.com","license_or_tos":"GPL-3.0","resources":null,"verified":false}