{"appId":"w:Sandboxie.Plus","appShortcutName":"Sandboxie-Plus","appDisplayName":"Sandboxie-Plus","authorId":"w:winget","releaseTagName":"winget-1.16.5","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.16.5/Sandboxie-Plus-ARM64-v1.16.5.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.16.5/Sandboxie-Plus-x64-v1.16.5.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\n\nSandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\nIt is developed by David Xanatos since it became open source, before that it was developed by Sophos (which acquired it from Invincea, which acquired it earlier from the original author Ronen Tzur).\nIt creates a sandbox-like isolated operating environment in which applications can be run or installed without permanently modifying the local or mapped drive.\nSuch an isolated virtual environment allows controlled testing of untrusted programs and web surfing.\n0 5 5\nRelease Notes\nSandboxie-Plus 1.16.5 introduces a range of refinements and fixes aimed at improving both usability and stability across the board. One of the most notable improvements is the enhanced INI Editor, which now offers a much more capable “Edit INI Section” dialog, making configuration editing more intuitive and efficient. Custom box colors are now preserved even when changing the Box Type Preset, ensuring that user-defined visual customization remains consistent. The sandbox border settings have also been expanded with support for alpha transparency, giving users finer control over the appearance of sandbox indicators.\nThe context menu icons have been refreshed for a cleaner, more modern look, and the default toolbar configuration has been refined for better usability. Under the hood, the Win32 system call handling has seen an experimental improvement: when UseWin32kFilterTable=y is enabled, the driver will now make use of the KeServiceDescriptorTableFilter instead of KeServiceDescriptorTableShadow where appropriate, providing more accurate and secure filtering behavior.\nThis release also resolves several technical issues. The reliability of the BindAdapter feature has been improved when a VPN or bound adapter becomes disconnected. A long-standing issue involving registry handling was fixed where a WOW6432Node subkey could incorrectly become HKLM\\SOFTWARE\\WOW6432Node\\WOW6432Node. Additionally, a security-related issue was addressed where programs started with their 8.3 filenames were not properly identified as forced or blocked programs.\nOverall, version 1.16.5 refines the user experience, enhances customization and system integration, and delivers improved robustness in key areas of the Sandboxie-Plus platform.\nFor a full list of changes please review the change log.\nYou can support the project through donations, any help will be greatly appreciated.\nIf you have issues with an update installation, just uninstall the previous version keeping the sandboxie.ini and reinstall the new build.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.16.5","version":0,"site":"https://xanasoft.com/","source":"http://xanasoft.com/","license_or_tos":"GPL-3.0","resources":null,"verified":false}