{"appId":"w:Sandboxie.Classic","appShortcutName":"Sandboxie","appDisplayName":"Sandboxie","authorId":"w:winget","releaseTagName":"winget-5.71.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.16.3/Sandboxie-Classic-x64-v5.71.3.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\n\nSandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\nIt is developed by David Xanatos since it became open source, before that it was developed by Sophos (which acquired it from Invincea, which acquired it earlier from the original author Ronen Tzur).\nIt creates a sandbox-like isolated operating environment in which applications can be run or installed without permanently modifying the local or mapped drive.\nSuch an isolated virtual environment allows controlled testing of untrusted programs and web surfing.\n0 5 5\nRelease Notes\nThis release focuses on improved compatibility and stability across modern and legacy Windows builds while polishing the user experience in dark mode and on high-DPI systems. We updated our GitHub build action to use Qt 6.9.2 and at the same time switched the product to Qt 6.8.3 with Windows 7 compatibility patches; driver imports were reworked so that binaries built with Visual Studio 2022 can still load correctly on Windows 7. We also validated compatibility with Windows build 27934 and refreshed DynData to reflect those changes.\nSeveral reported issues have been addressed to restore expected behavior for users. The missing tray menu introduced in 1.16.2 has been fixed, and the UAC prompt layout now displays correctly at higher DPI on the secure desktop; Arabic users will find the UAC prompt dialog respects RTL layout. The dark mode help popup that previously showed a light background in 1.16.1 has been corrected. Network options can now be persisted correctly during editing, the installer will remove obsolete files from older 1.16.x installations during cleanup, and the problem that prevented the “restart as admin” window from appearing has been resolved.\nFor a full list of changes please review the change log.\nYou can support the project through donations, any help will be greatly appreciated.\nIf you have issues with an update installation, just uninstall the previous version keeping the sandboxie.ini and reinstall the new build.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.71.3","site":"https://xanasoft.com/","source":"sandboxie-plus.com","license_or_tos":"GPL-3.0","resources":null,"verified":false}