{"appId":"w:Santesoft.SanteDicomViewerLite","appShortcutName":"Sante DICOM Viewer Lite","appDisplayName":"Sante DICOM Viewer Lite","authorId":"w:winget","releaseTagName":"winget-5.0.9","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sante DICOM Viewer Lite is a high quality, full-featured, completely free 2D/3D DICOM Viewer.\n\nSante DICOM Viewer Lite is a high quality, full-featured, completely free 2D/3D DICOM Viewer. \n\nThanks to its comprehensive feature set, intuitive interface, unparalleled stability, speed and easiness of use, it is one of the most popular DICOM viewers worldwide with hundreds of thousands of satisfied users (professionals or not), and the DICOM viewer of choice of many hospitals, universities and industries.\nIt provides all the necessary tools for reviewing images like distance and angle measurements, roi statistics, MPR and study/series comparison, and offers all the needed features in day to day practice.\nIt has all the features of Sante DICOM Viewer Pro except its advanced postprocessing functions like anonymizing (de-identification) and it is compatible with all modalities (CT, MR, NM, US, XA, MG, CR, PT etc.), all manufacturers and all DICOM 3.0 and NEMA 2 file types.\n\nFeatures and benefits\n- Easy to use 2D/3D DICOM viewer\n- PACS client that supports all the DICOM network services (C-FIND SCU/SCP, C-MOVE SCU/SCP, C-STORE SCU/SCP, C-GET SCU/SCP, C-ECHO SCU/SCP)\n- Built-in database (SQLite)\n- Migration tool for file transferring from other DICOM viewers\n- Support of all charsets (latin, chinese, japanese, korean, cyrillic, arabic, greek, turkish, etc.)\n- Compatible with all modalities (CT, MR, NM, US, XA, MG, CR etc.), all manufacturers and all DICOM 3.0 and NEMA 2 file types.\n- Supports also jpeg, jpeg2000, tiff, png, and bitmap image formats\n- Dual monitor support\n- Structured Report support\n- Creation of 3D model by the Isosurface technique\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.0.9","version":0,"site":"https://www.santesoft.com/","source":"Santesoft LTD","license_or_tos":"Freeware","resources":null,"verified":false}