{"appId":"w:Santesoft.SanteDicomViewerPro","appShortcutName":"Sante DICOM Viewer Pro","appDisplayName":"Sante DICOM Viewer Pro","authorId":"w:winget","releaseTagName":"winget-14.2.7","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sante DICOM Viewer Pro is a professional DICOM viewer, anonymizer, converter, PACS client, mini PACS server, patient CD/DVD burner (with free DICOM viewer) and much more.\n\nSante DICOM Viewer Pro is a professional DICOM viewer, anonymizer, converter, PACS client, mini PACS server, patient CD/DVD burner (with free DICOM viewer) and much more.\n\nSante DICOM Viewer Pro is not a \"yet another DICOM viewer\" constructed with freely available libraries such as dcmtk, itk and vtk, like hundreds of other DICOM viewers which differ from each other only in the appearance, menus, panels and dialog boxes. It is a unique program with unique capabilities, designed and developed in-house by us, from the ground up, with the most advanced programming tools and it is the result of research and development on DICOM imaging of the last two decades. Sante DICOM Viewer Pro has been developed since 1999 and it is one of the most popular professional DICOM viewers worldwide.\n\nFeatures and benefits\n- Powerful 2D/3D DICOM workstation and viewer\n- Perpetual license that never expires.\n- Free updates and free technical support for product's lifetime\n- PACS client that supports all the DICOM network services (C-FIND SCU/SCP, C-MOVE SCU/SCP, C-STORE SCU/SCP, C-GET SCU/SCP, C-ECHO SCU/SCP)\n- It can be used as a mini PACS server as well (the number of stored patients/studies depends on disk size only)\n- TLS support for DICOM network connections\n- OHIF viewer support (a study can be reviewed with OHIF viewer as well)\n- Migration tool for file transferring from other DICOM viewers\n- Command line switches for integration with PACS servers (learn more...)\n- Easy to use with native Windows \"look and feel\"\n- Support of all charsets (latin, chinese, japanese, korean, cyrillic, arabic, greek, turkish, etc.)\n- Creation of 3D model by the Isosurface technique\n- Creation of 3D model by the Transfer Function (Volume rendering) technique\n- Creation of 3D model by the Maximum Intensity Projection (MIP) technique\n\nFree demo version that works for 90 days\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"14.2.7","version":0,"site":"https://www.santesoft.com/","source":"Santesoft LTD","license_or_tos":"Proprietary","resources":null,"verified":false}