{"appId":"w:Santesoft.SanteDicomEditor","appShortcutName":"Sante DICOM Editor","appDisplayName":"Sante DICOM Editor","authorId":"w:winget","releaseTagName":"winget-10.2.7","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sante DICOM Editor is a professional DICOM editor, 2D/3D viewer, anonymizer, converter, dicomizer, PACS client, mini PACS server, patient CD/DVD burner (with free DICOM viewer) and much more.\n\nSante DICOM Editor is a professional DICOM editor, 2D/3D viewer, anonymizer, converter, dicomizer, PACS client, mini PACS server, patient CD/DVD burner (with free DICOM viewer) and much more.\n\nSante DICOM Editor is not a \"yet another DICOM viewer\" constructed with freely available libraries such as dcmtk, itk and vtk, like hundreds of other DICOM viewers which differ from each other only in the appearance, menus, panels and dialog boxes. It is a unique program with unique capabilities, designed and developed in-house by us, from the ground up, with the most advanced programming tools and it is the result of research and development on DICOM imaging of the last two decades.\n\nSante DICOM Editor is the industry-leading post processing application for DICOM file editing, conversion and handling, it is used by almost all the large corporations and medical equipment manufacturers, and it is the DICOM editor of choice of the greatest universities and hospitals of the world. Among others, it lets the user edit and modify DICOM files, to add and remove attributes, and even edit and modify sequence attributes.\n\nThe free demo version of the program works without any restriction for 90 days.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"10.2.7","version":0,"site":"https://www.santesoft.com/","source":"Santesoft LTD","license_or_tos":"Proprietary","resources":null,"verified":false}