{"appId":"w:sebescudie.GammaLauncher","appShortcutName":"Winget Application","appDisplayName":"GammaLauncher","authorId":"w:winget","releaseTagName":"winget-5.2.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sebescudie/GammaLauncher/releases/download/5.2.3/gammalauncher_5.2.3_installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GammaLauncher Setup\n\nA standalone launcher for vvvv gamma\nHohoho!\nQuite a while since the last release! And this one is a hotfix, but with a tiny bit of new stuff still. Big thanks to all vvvv user who reported the Launcher was confused by of the new vvvv win-arm64 builds, and even more thanks to @bj-rn and @antongit for providing commits and useful information on how to deal with it :-) Let's see what's on the menu for this one.\nFixed\n- Now deals correctly with win-x64 buillds. For now, the launcher only shows those, but should also let you download win-arm64 builds soon.. Thanks again @bj-rn and @antongit!\n- Should fix the annoying bug mentioned in #70 and #64 that when fetching new releases multiple times, new releases would be appended to the list rather than being added on top. Let's keep an eye on this one!\nChanges\n- Now uses the same color theme and style as ovvvvicial gamma extensions, for a more immersive experience\n- Uses ChildWindows so that you get cool scrollbar when the window is too small\n- Quick action buttons are now visible in all tabs\nOk, cool! Thanks again to everyone for using the Launcher, let's hope I find some time in the next months for more life-changing updates :-)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.2.3","site":"https://github.com/sebescudie/GammaLauncher","source":"sebescudie","license_or_tos":"GPL-3.0","resources":null,"verified":false}