{"appId":"w:Signiant.Kyno","appShortcutName":"Kyno","appDisplayName":"Kyno","authorId":"w:winget","releaseTagName":"winget-1.9.0.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn.lesspain.software/dist/1.9.0/Kyno-windows_x86_64-1.9.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Get Kyno – The All-In-One Media Management App. Preview, back up, ingest, log metadata, convert, trim, rename and organize material from all cameras (DSLRs, drones, GoPro, RED, Blackmagic Design, Panasonic P2, MXF).\n\nKyno is the centerpiece of professional video workflows for narrative, documentary, corporate and social media projects.\nIts easy to learn and simple to use interface works cross-platform on macOS & Windows and integrates with the tools you already use.\n\n- On-location: Backup, preview, annotate material, create shotlists and dailies\n- Post-Production: Play, organize and select material; transcode proxies and send to NLEs\n- Managing Shared Storage: Tag and find material in a team on NAS, SAN or external drives\n\nUse Kyno's powerful drilldown function to flatten and filter the content of a whole hard drive and define media aware filters such as framerate, resolution to find the files you're looking for.\nTag, rate, describe your media and use that information to find your content. Use Kyno's powerful media aware renaming engine to organize your files.\nOffload camera media to secondary storage securely using a simple process and industry-standard cryptographic checksum verification with Media Hash List support for later verification. Incremental backup copies only what's changed since the last backup.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.9.0.2","version":0,"site":"https://lesspain.software/","source":"Signiant Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}