{"appId":"w:Sinew.Enpass","appShortcutName":"Enpass","appDisplayName":"Enpass","authorId":"w:winget","releaseTagName":"winget-6.11.14.2067","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Enpass is a cross-platform password management app to securely store passwords and other credentials in a virtual vault locked with a master password. Unlike most other popular password managers, Enpass is an offline password manager.\n\n\nNew Features for Enpass Business Users:\nThe Enpass app now supports a wider range of your organization’s password policies and includes new features to strengthen your overall security. If your admin enables them, the app will guide you to follow these policies and ensures your passwords stay protected.\nHere’s what’s new:\n- Stronger Password Checks: Your company may now require passwords to meet certain rules like minimum length, complexity, or expiration. If a password doesn’t meet those rules, you’ll see it flagged as a “Rule Violating Password”.\n- Stronger PIN Requirements: Your admin may require a longer minimum PIN to improve the security of your Enpass unlock method.\n- Prompt to Change Master Password if Found Compromised: If your admin enables this, Enpass will check your master password against the database of compromised passwords from HaveIBeenPwned.com. If it is found as compromised, you’ll be asked to change it.\n- No Autofill on Unsecure (HTTP) Websites: Autofill is not allowed on unsecure websites that use HTTP instead of HTTPS. Your admin may allow exceptions where needed.\n- Passkey Sign-in Policy: Your company may allow or restrict the use of passkeys in Enpass. If restricted, you won’t be able to store or sign-in using passkeys.\n- Windows Hello Unlock Policy: Your admin may choose to enable or disable Enpass app unlock using Windows Hello.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.11.14.2067","site":"https://www.enpass.io/","source":"Enpass Technologies Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}