{"appId":"w:SmartBear.ReadyAPIVirtServer","appShortcutName":"ReadyAPI VirtServer","appDisplayName":"ReadyAPI VirtServer","authorId":"w:winget","releaseTagName":"winget-3.28.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://dl.eviware.com/virtserver/3.28.0/VirtServer-x64-3.28.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Run virtual services in your network\n\nYou use VirtServer to run virtual services in your network. It is an addition to ReadyAPI Virtualization that is used for creating, editing, and running virtualized services.\nVirtServer is tightly integrated with ReadyAPI Virtualization, allowing you to run and manage virtual services created with ReadyAPI Virtualization and hosted on VirtServer. VirtServer runs on Windows, Linux, macOS, and headless machines .\n- Support for ReadyAPI version 3.61.0: Updated VirtServer to support ReadyAPI version 3.61.0, including support for OpenAPI Specification (OAS) 3.1 and Jakarta-based JMS implementations. This includes compatibility with WebLogic 12 and 14.\n- Preservation of User Modifications: VirtServer Now preserves user-added modifications during upgrades, reducing post-upgrade effort. For more details, see the Custom JVM Options section and the Custom certificate configuration section.\n- Performance Optimizations: Applied performance optimizations to VirtServer’s default configuration to improve startup time and runtime efficiency.\n- Accessibility Improvements: Continued enhancements to VirtServer UI accessibility, improving compliance with accessibility standards and overall usability.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.28.0","site":"https://smartbear.com/","source":"SmartBear Software","license_or_tos":"Proprietary","resources":null,"verified":false}