{"appId":"w:SoftPerfect.NetWorx","appShortcutName":"NetWorx","appDisplayName":"NetWorx","authorId":"w:winget","releaseTagName":"winget-25.12","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softperfect.com/download/files/networx_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Bandwidth monitoring and data usage reports for Windows, macOS and Linux\n\nNetWorx is a simple yet versatile tool that helps you monitor your Internet connection. It can collect usage data, monitor connection quality and measure the speed of your Internet. It can also assist in identifying possible sources of network problems, ensuring that you do not exceed your ISP usage limits and tracking down suspicious network activity.\nNetWorx allows you to monitor a local network adapter or your router, or track the applications on your computer that access the Internet. Collected historical usage statistics are organised into daily, weekly and monthly reports. Real time connection usage is represented by an elegant and highly customisable graph, accompanied by a list of applications accessing the Internet.\nBuilt-in connection Speed Test can run on demand or on a schedule, so you can see if you are getting the promised speeds from your provider. In addition, there is a Connection Monitor that tracks downtime and monitors your ping time throughout the day. Both these features allow you to make sure you are getting a quality Internet connection.\nKey features\n- Historical usage reports by day, week and month.\n- Close supervision of uploads and downloads in real time.\n- Monitoring the applications accessing the Internet.\n- Support of local network adapters and remote SNMP and UPnP devices.\n- Configurable actions when the network activity exceeds a certain level.\n- Speed Meter for testing Internet connection speed.\n- Connection Monitor for regular connection status checks.\nWith NetWorx you can:\n- Find out and monitor how fast your Internet connection is and how much data you consume.\n- Verify whether your ISP charges your Internet usage fairly.\n- Detect a suspicious network activity on your computer.\n- Monitor connection quality by tracking downtime and ping.\n- Be notified about excessive Internet usage.\n- Added: Custom message text field for notifications.\n- Added: \"Both\" (AND) condition for traffic notifications.\n- Added: Y-axis labels and grid display in taskbar widget.\n- Fixed: Windows shutdown and hibernation commands in notification actions.\n- Fixed: Speed testing that stopped working.\n- Fixed: Notification threshold checking incorrect direction for upload-only rules.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"25.12","version":0,"site":"https://www.softperfect.com/","source":"SoftPerfect Pty Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}