{"appId":"w:SoftPerfect.SwitchPortMapper","appShortcutName":"SoftPerfect Switch Port Mapper","appDisplayName":"SoftPerfect Switch Port Mapper","authorId":"w:winget","releaseTagName":"winget-25.11","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softperfect.com/download/files/portmapper_setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Easy network switch port identification for Windows, macOS and Linux\n\nThe SoftPerfect Switch Port Mapper tool works with managed network switches and reports what is connected to switch ports, and which ports are not connected. For every connected port, the port mapper lists the MAC address, IP address and host names of the computers associated with that port.\nAdditionally, the software can display each client’s network card vendor, port speed, device type, VLAN assignments and statistics for every port. This can be of good assistance when troubleshooting network connectivity issues.\nKey features\n- Discovers managed switches by scanning your network.\n- Shows what is connected to every switch port in a simple table format.\n- Pulls ARP table from a router to display IP information of connected clients.\n- Scans the current subnet for MAC-to-IP address mappings if there is no router.\n- Comes in two editions: a GUI application and a console application for using in scripts.\n- Fully supports SNMPv1, SNMPv2c and SNMPv3, including bulk operations.\n- Added: SHA-256 support for SNMPv3 authentication.\n- Added: Multilingual installer and user interface.\n- Added: Filtering and search with match highlighting.\n- Added: Any Column option in filters for broader search.\n- Improved: MAC address vendor database now more compact and efficient.\n- Improved: User interface with larger, more legible and refined dialogs.\n- Improved: Grouped columns in the main view for easier identification.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"25.11","version":0,"site":"https://www.softperfect.com/","source":"SoftPerfect Pty Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}