{"appId":"w:SoftPerfect.BandwidthManager","appShortcutName":"SoftPerfect Bandwidth Manager","appDisplayName":"SoftPerfect Bandwidth Manager","authorId":"w:winget","releaseTagName":"winget-3.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softperfect.com/download/files/bandwidth_manager_setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Bandwidth limiter and traffic shaper for Windows\n\nAre your Internet usage or costs unexpectedly high? Does inappropriate use of the network or the Internet have an adverse effect on your business performance? Did the Internet access bandwidth become a major bottleneck in your network?\nIf your network has any of these problems, SoftPerfect Bandwidth Manager will provide a cost-effective solution. The software monitors your network traffic and limits bandwidth in whatever manner you specify. The result is an immediate increase in the efficiency of your network together and a reduction in your overall bandwidth requirements while allowing important Internet applications to run at full speed.\nSoftPerfect Bandwidth Manager is a full-featured traffic management tool for Windows that offers cost-effective bandwidth control and quality of service based on built-in prioritised rules. These rules can specify a bandwidth limit for each Internet user. The software of this kind is otherwise known as bandwidth limiter or traffic shaper. With its help, you can apply speed-throttling rules to specified IP and MAC addresses, ports and even network interfaces with no changes to your existing network infrastructure. The rich feature set of SoftPerfect Bandwidth Manager software is easily managed via the intuitive Windows GUI.\nKey features\n- Centralised configuration from a single network location.\n- Flexible, prioritised, bidirectional rules to specify maximum data rates and usage allowances.\n- Rules for IP and MAC addresses, protocols, ports (for TCP/IP) and network interfaces.\n- Transparency for end users with no client software installation required in most cases.\n- Quotas, scheduler, email notifications and comprehensive usage reports.\n- Added: Support for Windows on ARM64.\n- Added: Generating reports in TXT, XML, and JSON formats.\n- Added: Compatibility with Layer 3 TUN-like adapters for shaping in virtual networks.\n- Added: Windows bridging support, allowing bandwidth control using either adapter in the bridge.\n- Changed: Windows 10 is now the minimum required version.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.3.0","version":0,"site":"https://www.softperfect.com/","source":"SoftPerfect Pty Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}