{"appId":"w:SoftwareCompanions.ViewCompanionPremium","appShortcutName":"ViewCompanion Premium","appDisplayName":"ViewCompanion Premium","authorId":"w:winget","releaseTagName":"winget-16.20.0.1110","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softwarecompanions.no/vc16/vcpremium1620x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ViewCompanion Premium is the most powerful member of the ViewCompanion family. ViewCompanion Premium can view, print and convert Adobe PDF, PDF/A, Autodesk DWF, PLT, CGM, TIFF, CALS, EDMICS and several other file formats.\n\nViewCompanion Premium is the most powerful member of the ViewCompanion family. ViewCompanion Premium can view, print and convert Adobe PDF, PDF/A, Autodesk DWF, PLT, CGM, TIFF, CALS, EDMICS and several other file formats.\nWith ViewCompanion Premium you can convert your files to many different output formats, please check the complete list of supported output formats below.\n\nYour PLT, CGM, Gerber and DWF files can be converted into Autodesk DXF format, which can be read by all popular CAD applications, for example Autodesk AutoCAD™.\nWith the built-in PDF to CAD tools, you can convert your PDF files into editable DXF, Gerber, CGM or SVG files.\n\nYou can merge multiple files of different formats to a single multi-page PDF, DWF or TIFF file.\nViewCompanion can split a multipage PDF, TIFF or DWF file into multiple files. You may split a PDF file either based on a maximum number of pages per file or based on the maximum file size for each output file.\n\nWith ViewCompanion you can measure dimension lengths and areas. All measurements can be done using snap to drawing geometry to give the highest accuracy. Calibration of the measurement tools is available to make sure you get correct results even if your drawings are not scaled 1:1. The measurement results may be exported to either a Excel Workbook (XLSX) or to a CSV file which can be opened by any spreadsheet application.\n\nThe downloaded product will run in evaluation mode for a period of 30 days.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"16.20.0.1110","version":0,"site":"https://www.softwarecompanions.com/","source":"Software Companions","license_or_tos":"Proprietary","resources":null,"verified":false}