{"appId":"w:SoftwareCompanions.GerbView","appShortcutName":"GerbView","appDisplayName":"GerbView","authorId":"w:winget","releaseTagName":"winget-11.30.0.632","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.gerbview.com/11/gv1130x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GerbView™ can view, print and convert Gerber, Extended Gerber, ODB++, PDF, Excellon, PLT and several other file formats.\n\nGerbview is a powerful viewer and converter that will visualize your design, on the screen or in hardcopy. You no longer have to wait for a prototype circuit board to see your true design.\nGerbView supports both RS-274D and RS-274X Gerber formats, and you can use it to convert your older Gerber files to the new RS-274X extended format. The newer extended Gerber format contains embedded aperture information and minimizes the risk for errors during the manufacturing of the PCB.\n\nWith GerbView you can export individual layers, or the whole workspace, to any of the supported raster formats, which includes TIFF, JPEG, PNG and BMP. The resolution and number of colors used for the conversion can be set by the user.\n\nIn GerbView you work with a workspace that can contain one or more files (layers) of any of the supported file formats. The workspace can be saved for later use. The workspace will reference your design files, so only need to reload the workspace to see the whole design. You can set the size of this workspace to one of the preselected paper sizes, or to a custom size.\n\nFully working 30-day evaluation versions. You can turn the evaluation into a full product by entering a serial number.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.30.0.632","version":0,"site":"https://www.softwarecompanions.com/","source":"Software Companions","license_or_tos":"Proprietary","resources":null,"verified":false}