{"appId":"w:SoftPerfect.NetworkScanner","appShortcutName":"SoftPerfect Network Scanner","appDisplayName":"SoftPerfect Network Scanner","authorId":"w:winget","releaseTagName":"winget-26.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softperfect.com/download/files/netscan_setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Powerful multipurpose network administration tool for Windows, macOS and Linux\n\nThis fast, highly configurable IPv4/IPv6 scanner can streamline many of your network support procedures. Its well-designed interface, light weight and portability coupled with an extensive range of options and advanced features make SoftPerfect Network Scanner an invaluable tool, whether you are a professional system administrator, someone providing occasional network maintenance, or a general user interested in computer security.\nSoftPerfect Network Scanner can ping computers, scan ports, discover shared folders and retrieve practically any information about network devices via WMI, SNMP, HTTP, SSH and PowerShell. It also scans for remote services, registry, files and performance counters; offers flexible filtering and display options and exports NetScan results to a variety of formats from XML to JSON.\nKey features\n- Fully supports both IPv4 and IPv6 discovery.\n- Performs a ping sweep and displays live devices.\n- Detects hardware MAC-addresses, even across routers.\n- Discovers writable and hidden shared folders.\n- Detects internal and external IP addresses.\n- Retrieves any system information via WMI, remote registry, file system and service manager.\n- Scans for listening TCP ports, some UDP and SNMP services.\n- Retrieves currently logged-on users, configured user accounts, uptime, etc.\n- Supports remote SSH, PowerShell and VBScript command execution.\n- Launches external third party applications.\n- Supports Wake-On-LAN, remote shutdown and sending network messages.\n- Exports results to HTML, XML, JSON, CSV and TXT.\n- Integrates with Nmap for OS discovery, vulnerability tests, and much more.\n- Can be run from a USB flash drive without installation.\n- Added: New main IP input box that accepts multiple formats.\n- Added: Tree view row spacing option (Compact/Standard/Expanded).\n- Improved: MIB Browser performance with a new custom parser.\n- Improved: Live display controls moved from menu to a dedicated panel.\n- Improved: Background rescan now non-blocking with progress reporting.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"26.1","version":0,"site":"https://www.softperfect.com/","source":"SoftPerfect Pty Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}