{"appId":"w:SoftPerfect.ConnectionQualityMonitor","appShortcutName":"Connection Quality Monitor","appDisplayName":"Connection Quality Monitor","authorId":"w:winget","releaseTagName":"winget-1.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softperfect.com/download/files/connection_quality_monitor_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Internet connection status tracking\n\nConnection Quality Monitor is a software package that monitors the health of your Internet connection. It periodically checks whether the connection is online, and records ping time, jitter and downtime. Additionally, it periodically performs a speed test and records the measured upload and download speeds.\nThis information is presented in a chart, making it easy to spot any intermittent connection issues and verify if download/upload speeds are stable and up to your Internet service provider promises.\nConnection Quality Monitor can be used in multiple locations, for example in several offices connected via VPN, and all its instances can be managed from a single point, such as a network administrator workstation.\n- Added: Reset command for erasing all collected data.\n- Added: Data export options in CSV, TXT, and HTML formats.\n- Added: Star rating system for easy assessment of connection quality.\n- Added: Ping loss percentage for enhanced connection monitoring.\n- Added: Manual speed test option for on-demand performance checks.\n- Improved: Downtime is now displayed as a table with chart bars for duration.\n- Improved: Chart view with dynamic marker sizing and informative data point hints.\n- Improved: Split upload/download and ping/jitter into dedicated charts for better clarity.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1","version":0,"site":"https://www.softperfect.com/","source":"SoftPerfect Pty Ltd","license_or_tos":"Proprietary","resources":null,"verified":false}