{"appId":"w:SoftwareCompanions.ViewCompanionPro","appShortcutName":"ViewCompanion Pro","appDisplayName":"ViewCompanion Pro","authorId":"w:winget","releaseTagName":"winget-16.20.0.1110","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softwarecompanions.no/vc16/vcpro1620x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ViewCompanion Pro is a feature-rich and easy to use application for viewing, printing, annotating and converting many different file formats, including Adobe PDF, Autodesk DWF, PLT, CGM, TIFF, Calcomp, CALS, JPEG and PNG.\n\nViewCompanion Pro is a feature-rich and easy to use application for viewing, printing, annotating and converting many different file formats, including Adobe PDF, Autodesk DWF, PLT, CGM, TIFF, Calcomp, CALS, JPEG and PNG.\n\nConvert your files into a large list of output formats that includes PDF, PDF/A, DWF, DXF, CALS, TIFF, PNG and JPEG2000. Please see the complete list of supported output formats below.\nYou may use ViewCompanion to convert PLT, CGM and DWF files into Autodesk DXF format, which you can open in any major CAD application.\nViewCompanion can merge multiple files of different formats into a single multi-page PDF, TIFF or DWF file. ViewCompanion includes batch conversion of all supported formats.\n\nViewCompanion will let you view your files fast and accurate. You have full control of zoom and pan by using mouse and keyboard. You will also find advanced viewing functions such as magnifier, overview window, compare, rotate and mirror. You may toggle between monochrome, color and grayscale view modes.\n\nWith ViewCompanion Pro's markup feature you can annotate the viewed document, a process also commonly known as commenting. The range of supported annotation elements includes stamps, text, symbols, dimension lines, area measurements, rectangles, circles, lines, polygons, arrows and pictures. You may use one of the predefined stamps or create your own.\n\nThe downloaded product will run in evaluation mode for a period of 30 days.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"16.20.0.1110","version":0,"site":"https://www.softwarecompanions.com/","source":"Software Companions","license_or_tos":"Proprietary","resources":null,"verified":false}