{"appId":"w:SoftwareCompanions.ViewCompanionStandard","appShortcutName":"ViewCompanion Standard","appDisplayName":"ViewCompanion Standard","authorId":"w:winget","releaseTagName":"winget-16.20.0.1110","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.softwarecompanions.no/vc16/vc1620x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ViewCompanion Standard is an application for viewing, printing and converting plotter files generated by your CAD program or plotter driver.\n\nViewCompanion Standard is an application for viewing, printing and converting plotter files generated by your CAD program or plotter driver.\nViewCompanion can open PLT plotter files using HPGL, HP-GL/2, KIPGL, HP-RTL and Calcomp formats. In addition to plotter files it can view, print and convert Adobe PDF, CGM, Autodesk DWF and Gerber files.\n\nAdobe PDF, Autodesk Drawing Web Format (DWF) and Scalable Vector Graphics (SVG) are all very useful and popular formats for distributing drawings on the Internet.\nViewCompanion can convert your PLT, Gerber, CGM and DWF files to Autodesk DXF format which you can read in any major CAD application.\n\nKey Features\n- View, print, annotate and convert PLT, HPGL and HPGL/2 files.\n- View, print, annotate and convert Autodesk DWF, CGM, Calcomp and Gerber files.\n- View, print, annotate and convert Adobe PDF files.\n- Convert your files to PDF, TIFF, CALS, DWF, DXF, PNG and other formats.\n- Add markup using text, stamps, images, symbols, shapes, dimension lines, measurement areas and more.\n- Use the measurement and markup functionality to perform digital takeoffs.\n- Include footer and header containing date, scale, time and filename when printing.\n- Add watermark using either text or a raster image to the printed document.\n- Color or Black & White Printing.\n- Scaled print or fit to paper.\n- Poster mode for printing big format drawings on multiple paper sheets.\n- Print in n-up mode, also known as multiple pages per sheet printing.\n- Full screen print preview.\n- Print to all Windows supported plotter and printer devices.\n- Batch print and batch convert all supported format.\n- Compare two files and visualize the differences.\n\nThe downloaded product will run in evaluation mode for a period of 30 days.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"16.20.0.1110","version":0,"site":"https://www.softwarecompanions.com/","source":"Software Companions","license_or_tos":"Proprietary","resources":null,"verified":false}