{"appId":"w:sparrowwallet.sparrow","appShortcutName":"Winget Application","appDisplayName":"Sparrow Bitcoin Wallet","authorId":"w:winget","releaseTagName":"winget-2.1.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/sparrowwallet/sparrow/releases/download/2.1.3/Sparrow-2.1.3.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Desktop Bitcoin Wallet focused on security and privacy. Free and open source.\n\nSparrow is a modern desktop Bitcoin wallet application supporting most hardware wallets and built\non common standards such as PSBT, with an emphasis on transparency and usability.\n- OneKey Pro and Classic 1S hardware wallet support\n- Update BIP329 wallet labels export to include additional fields\n- Make BIP329 wallet labels import and export scannable\n- Add Copy Payment Code item to the transaction diagram outputs context menu for BIP47 outputs\n- Add Show Transaction as QR button to signed transaction tabs when offline (@ThauanAmorim)\n- Upgrade libusb to v1.0.27 on all platforms\n- Add specific handling for invalid Windows device drivers on Trezor devices\n- Handle scanning and pasting server URLs in the Electrum (x.x.x.x:n:t/s) format\n- Additionally check for Trezor model against internal name and improve exception handling on no match\n- Bug fix: Verify dropped release file instead of first platform specific release file found\n- Bug fix: Use default key origin information when importing a descriptor without key origin info\n- Bug fix: Fix various minor issues around multisig keystore labelling and keystore Export button visibility\n- Bug fix: Fix stripping leading zeros from the master fingerprint on importing some Trezor models\n- Bug fix: Protect against endless loop from negative value returned from writeBytes on Jade\n- Bug fix: Fix handling of high account numbers on Ledger devices\n- Bug fix: Fix account discovery on BitBox02\n- Bug fix: Fix access issue with macOS show/hide windowing commands","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.1.3","site":"https://github.com/sparrowwallet","source":"Sparrow Wallet","license_or_tos":"Apache-2.0","resources":null,"verified":false}