{"appId":"w:sparrowwallet.sparrow","appShortcutName":"Sparrow Bitcoin Wallet","appDisplayName":"Sparrow Bitcoin Wallet","authorId":"w:winget","releaseTagName":"winget-2.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/sparrowwallet/sparrow/releases/download/2.3.1/Sparrow-2.3.1.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Desktop Bitcoin Wallet focused on security and privacy. Free and open source.\n\nSparrow is a modern desktop Bitcoin wallet application supporting most hardware wallets and built\non common standards such as PSBT, with an emphasis on transparency and usability.\n- Support hiding amounts via the View menu (@kwsantiago)\n- Show the signing keystores in the transaction Blockchain form for spends from multisig wallets\n- Update MJPG camera pixel format support on Linux\n- Add YU12 camera pixel format support on Linux\n- Add Ctrl+Shift+Left/Right keyboard shortcuts for moving tabs left and right\n- Avoid using deprecated camera device type constants on recent macOS versions\n- Bug fix: Include BIP32 derivations in PSBTs for consolidation outputs (regression)\n- Bug fix: Update NSMenuFX to avoid occasional NPE on startup\n- Bug fix: Don't show confirmations in a tooltip when showing inputs and outputs on the transactions table\n- Bug fix: Use language-independent SID for Windows users group permission (@doblon8)\n- Bug fix: Support non-standard derivation paths on Ledger devices by requesting display of the path when retrieving xpubs\n- Bug fix: Fix occasional issue with cell reuse when avoiding updating cells during table size estimation","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.1","version":0,"site":"https://github.com/sparrowwallet","source":"Sparrow Wallet","license_or_tos":"Apache-2.0","resources":null,"verified":false}