{"appId":"w:Splunk.ACS","appShortcutName":"Winget Application","appDisplayName":"ACS","authorId":"w:winget","releaseTagName":"winget-2.17.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/splunk/acs-cli/releases/download/v2.17.0/acs_v2.17.0_windows_amd64_installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"ACS CLI is a tool for managing Splunk cloud stacks which can be used to perform common administrative tasks without assistance from Splunk support.\n\nAdmin Config Service CLI for managing Splunk cloud stacks. ACS is a cloud-native API that provides programmatic self-service administration capabilities for Splunk Cloud Platform. Splunk Cloud Platform administrators can use the ACS CLI to perform common administrative tasks without assistance from Splunk Support.\n- The new acs ip-allowlist-v6 describe subcommand adds support to list the ipv6 subnets for a specific allowlist feature.\n- The new acs ip-allowlist-v6 create subcommand adds support to create the ipv6 subnets for a specific allowlist feature.\n- The new acs ip-allowlist-v6 delete subcommand adds support to delete the ipv6 subnets for a specific allowlist feature.\n- The new acs outbound-port-v6 describe subcommand adds support to list the allowed ipv6 subnets for a given outbound port.\n- The new acs outbound-port-v6 list subcommand adds support to list all ipv6 subnets for all outbound ports.\n- The new acs outbound-port-v6 create subcommand adds support to create the ipv6 subnets for a given outbound port.\n- The new acs outbound-port-v6 delete subcommand adds support to delete the ipv6 subnets for a given outbound port.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.17.0","site":"https://www.splunk.com/","source":"Splunk","license_or_tos":"Splunk Software License Agreement","resources":null,"verified":false}