{"appId":"w:srjuddington.slade","appShortcutName":"SLADE","appDisplayName":"SLADE","authorId":"w:winget","releaseTagName":"winget-3.2.10","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"SLADE3 is a modern editor for Doom-engine based games and source ports. It has the ability to view, modify, and write many different game-specific formats, and even convert between some of them, or from/to other generic formats such as PNG.\n\n\nRelease Notes\nGeneral\n- [Windows] More fixes to handling of unicode file paths\n- Crash reports can now be sent directly from the crash dialog, without the need to post to GitHub (though the option is still there, and preferred)\n- [Linux] An official AppImage release is now available\n- [Linux] Fixed SLADE launching another copy when opening archives via a file manager if SLADE is already running\n- The clipboard is no longer cleared on exiting SLADE\nResource Editor\n- PNG format handling has been reworked to use libpng instead of wxWidgets. This should fix some issues related to PNGs saving with compressed palettes\n- Heretic+Hexen widescreen raw gfx are now correctly recognised and displayed\n- Fixed a freeze when using \"Check Duplicate Entry Content\" maintenance tool with lots of duplicates\nTexture Editor\n- Offsets are now kept when exporting a TEXTURES texture to an individual image\nMap Editor\n- Fixed a crash when saving a map to a location without write access (thanks @sulewicz)\nIssues Closed\n- [Linux] SLADE does not open wad files if an instance is already running #1896\n- [Blocking] Windows user folder path \"special\" characters prevent program startup #1917\n- Option to stop PNG optimization when working with paletted PNGs #1918\n- View Heretic+Hexen (KEX) widescreen TITLE files. #1924\nMerged Pull Requests\n- Replace all std::filesystem usage with wx equivalents by @sirjuddington in #1910\n- Simpler crash reporting + crash dialog updates by @sirjuddington in #1912\n- Fix a crash due to lack of write access permission by @sulewicz in #1913\n- Use libpng directly for png support instead of wx by @sirjuddington in #1916\n- Build Linux AppImage as part of CI by @sirjuddington in #1927\n- CI Workflow & AppImage tweaks by @sirjuddington in #1928\n- Split CI workflow into separate workflows per-OS by @sirjuddington in #1929\nNew Contributors\n- @sulewicz made their first contribution in #1913\nFull Changelog: 3.2.9...3.2.10","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2.10","version":0,"site":"https://github.com/sirjuddington/SLADE","source":"SirJuddington","license_or_tos":"GPL-2.0","resources":null,"verified":false}