{"appId":"w:SST.OpenCodeDesktop","appShortcutName":"OpenCode","appDisplayName":"OpenCode","authorId":"w:winget","releaseTagName":"winget-1.2.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/anomalyco/opencode/releases/download/v1.2.1/opencode-desktop-windows-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"OpenCode is an open source agent that helps you write and run code with any AI model. It''s available as a terminal-based interface, desktop app, or IDE extension.\n\nopencode is an AI coding agent. It features:\n- A responsive, native, themeable terminal UI.\n- Automatically loads the right LSPs, so the LLMs make fewer mistakes.\n- Have multiple agents working in parallel on the same project.\n- Create shareable links to any session for reference or to debug.\n- Log in with Anthropic to use your Claude Pro or Claude Max account.\n- Supports 75+ LLM providers through Models.dev, including local models.\nv1.2.0 and beyond includes a data migration that will execute on first run. It will migrate all flat files in data directory to a single sqlite database. Depending on how much data you have and speed of computer this can take some time.\nif anything goes wrong you can retrigger the migration by deleting ~/.local/share/opencode/opencode.db* files (%APPDATA% on windows)\nIf you have any issues with the migration the original data is not yet deleted and downgrading should work. But please open an issue so we can investigate and include sqlite in the issue title.\nSDK Users\nWe now have a PartDelta event which sends only incremental changes to parts. This avoids sending the full content of text parts over and over when it is updated\nCore\n- Show all project sessions from any working directory\n- Tweak websearch tool description date info to avoid cache busts","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.1","version":0,"site":"https://sst.dev/","source":"opencode","license_or_tos":"MIT","resources":null,"verified":false}