{"appId":"w:SST.OpenCodeDesktop","appShortcutName":"OpenCode","appDisplayName":"OpenCode","authorId":"w:winget","releaseTagName":"winget-1.1.28","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/anomalyco/opencode/releases/download/v1.1.28/opencode-desktop-windows-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"OpenCode is an open source agent that helps you write and run code with any AI model. It''s available as a terminal-based interface, desktop app, or IDE extension.\n\nopencode is an AI coding agent. It features:\n- A responsive, native, themeable terminal UI.\n- Automatically loads the right LSPs, so the LLMs make fewer mistakes.\n- Have multiple agents working in parallel on the same project.\n- Create shareable links to any session for reference or to debug.\n- Log in with Anthropic to use your Claude Pro or Claude Max account.\n- Supports 75+ LLM providers through Models.dev, including local models.\nCore\n- Preserve tool input from running state for MCP tool results (@rynfar)\n- Pass arguments to commands without explicit placeholders (@remorses)\n- Adjust Codex prompt to discourage unnecessary questions and encourage more autonomous decision-making\n- Register OAuth callback before opening browser in MCP (@msvechla)\n- Support ACP audience by mapping to ignore and synthetic (@noamzbr)\n- Terminal no longer hangs on exit or Ctrl+D and closes the pane properly (@ProdigyRahul)\nTUI\n- Prevent sidebar height from overflowing in terminal UI (@IdrisGit)\nDesktop\n- Refactor Select component to use settings variant for settings modal styling\n- Show \"View all sessions\" button for active project and close hovercard on click\n- Remove close delay on hover cards to prevent overlapping\n- Fix review empty state font size\n- Fix race condition when editing project names (@DNGriffin)\n- Resolve Select children type conflict with ButtonProps\n- Fix prompt agent button style\n- Fix type error\n- Update keyboard shortcuts panel to match general settings styling\n- Add color scheme preview on hover in appearance dropdown\n- Update settings panel padding and make content full width\n- Set 32px spacing between main title and group title\n- Add fade gradient to settings panel headers\n- Reset select trigger to default state after selection\n- Add extra large dialog size and use it for settings modal\n- Add triggerStyle prop to Select component and apply it to font selector\n- Render font options in their respective fonts\n- Wrap settings row groups with styled container\n- Remove border and background from settings panel headers\n- Remove subheader from General settings panel\n- Add keyboard icon and use it for Shortcuts settings tab\n- Add sliders icon and use it for General settings tab\n- Update settings tabs layout and spacing\n- Increase icon letter size to 32px in edit project dialog\n- Increase session messages popover open delay to 1000ms\n- Fix end-to-end tests in app package\n- Add Windows end-to-end tests for the app\n- Change terminal.new keybind to Ctrl+Alt+T (@ProdigyRahul)\n- Cleanup PTY exited event listener on component unmount (@ProdigyRahul)\n- Fix duplicate session loads in app\n- Add tooltips to sidebar new session and workspace buttons (@ProdigyRahul)\n- Better pending states for workspace operations\n- Fix session loading loop in app\n- Add restart and reload menu items on macOS (@BlankParticle)\n- Fix broken app functionality\n- Add settings page to app\nThank you to 13 community contributors:\n- @ProdigyRahul:\n  - fix(app): terminal no longer hangs on exit or ctrl + D and closes the pane (#9506)\n  - feat(app): add tooltips to sidebar new session/workspace buttons (#9652)\n  - fix(app): cleanup pty.exited event listener on unmount (#9671)\n  - fix(app): change terminal.new keybind to ctrl+alt+t (#9670)\n- @BlankParticle:\n  - feat: add restart and reload menu items on macOS (#9212)\n- @noamzbr:\n  - feat: Support ACP audience by mapping to ignore and synthetic (#9593)\n- @msvechla:\n  - fix(mcp): register OAuth callback before opening browser (#9646)\n- @remorses:\n  - fix: pass arguments to commands without explicit placeholders (#9606)\n- @zerone0x:\n  - fix(ui): show filename in Edit/Write permission titles (#9662)\n- @MBanucu:\n  - fix(opencode): Allow compatible Bun versions in packageManager field (#9597)\n- @DRunkPiano114:\n  - fix(ui): prevent Enter key action during IME composition (#9564)\n- @IdrisGit:\n  - fix(tui): prevent sidebar height from overflowing. (#9689)\n- @gigamonster256:\n  - fix(opencode): relax bun version requirement (#9682)\n- @DNGriffin:\n  - fix(app): Edit-project name race condition (#9551)\n- @rynfar:\n  - fix(opencode): preserve tool input from running state for MCP tool results (#9667)\n- @kdcokenny:\n  - docs(web): add KDCO plugins to ecosystem (#7694)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.28","version":0,"site":"https://sst.dev/","source":"opencode","license_or_tos":"MIT","resources":null,"verified":false}