{"appId":"w:StanleyBlack&Decker.DewaltDesignAssist","appShortcutName":"DEWALT DESIGN ASSIST","appDisplayName":"DEWALT DESIGN ASSIST","authorId":"w:winget","releaseTagName":"winget-1.7.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A world-class connection design software for concrete anchoring\n\nDEWALT DESIGN ASSIST™ (DDA) is a no cost/no fee state-of-the-art structural design software that streamlines, automates, and optimizes your concrete anchoring design process. With multiple design standards to choose from, a comprehensive library of anchors, numerous reporting options, and a wide range of design tools, simplify your design process with DEWALT Design Assist.\nThis update introduces a new, secure sign-in process using Azure. All users - new and existing - will need to create a new account. Registration is quick and intuitive, and you’ll only need to sign in once every 90 days.\nPlease note: Your previous credentials (license key, password, security questions) will no longer work after this update. No project data will be lost - only the sign-in method is changing. Make sure you are connected to the internet before updating.\nClick \"Download\" to download the latest version and begin the new registration process.\nFor help, contact dda@dewalt.com.\nBug Fixes and Enhancement Version: 1.7.7.0\n- Upgraded user authentication system\n  - All users (new and existing) will be required to create a new DDA account.\n  - This transition improves security, enables future integration into DEWALT ID or single sign-on, and sets the foundation for a more connected DEWALT experience.\n- Performance improvements","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.7.0.0","version":0,"site":"https://www.dewalt.com/","source":"Stanley Black and Decker","license_or_tos":"Freeware","resources":null,"verified":false}