{"appId":"w:StellarDataRecovery.StellarFileEraser","appShortcutName":"Stellar File Eraser","appDisplayName":"Stellar File Eraser","authorId":"w:winget","releaseTagName":"winget-5.0.0.8","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cloud.stellarinfo.com/StellarFileEraser.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Stellar File Eraser software is a powerful tool designed to erase files permanently, ensuring your sensitive data is securely wiped from your laptop or desktop PC.\n\nStellar File Eraser software is a powerful tool designed to erase files permanently, ensuring your sensitive data is securely wiped from your laptop or desktop PC. It also helps erase temporary files, protecting your personal information from unauthorized access and ensuring complete data privacy.\n- User-friendly software for individuals to securely erase files beyond recovery.\n- Securely erases traces, deleted data, temporary files and folders.\n- Works on all Windows compatible storage devices.\n- Permanently erase files from desktop, laptop, & more.\n- Wipes files from hard drive, USB drive, SD card & from Server.\n- Works with Acer®, ASUS®, Dell®, Lenovo®, & more.\n\nBesides your Internet search and browsing history, Stellar File Eraser can wipe clean the sensitive traces of daily Internet activities including cookies, temporary files, favorites and autocomplete data for forms and passwords. The file erasure software can permanently erase the traces of your Internet usage history across Chrome, Mozilla, Safari, IE, Microsoft Edge, Opera, & SeaMonkey.\n\nSystem traces are those temporary files that pile up on your computer with routine usage. These files are created by the operating system while running a process. Temporary files consume storage space and degrade system performance. Stellar File Eraser routinely deletes the system traces thus improving your PC’s speed, performance, and storage space utilization.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.0.0.8","version":0,"site":"https://www.stellarinfo.com/","source":"Stellar Information Technology Pvt Ltd.","license_or_tos":"Freeware","resources":null,"verified":false}