{"appId":"w:StellarDataRecovery.StellarRepairForExchange","appShortcutName":"Stellar Repair for Exchange","appDisplayName":"Stellar Repair for Exchange","authorId":"w:winget","releaseTagName":"winget-12.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cloud.stellarinfo.com/StellarRepairforExchange.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Restore dismounted and offline Exchange EDB files with high precision. This advanced Exchange Recovery Software is recommended by MVPs to repairs corrupt Exchange Database (EDB) file and restores mailbox content.\n\nRestore dismounted and offline Exchange EDB files with high precision. This advanced Exchange Recovery Software is recommended by MVPs to repairs corrupt Exchange Database (EDB) file and restores mailbox content like emails, attachments, contacts, calendars, notes, tasks & journals.\n- Recover Exchange Database files without any risk of data loss\n- Exports complete EDB file directly to Live Exchange Server and Office 365\n- Processes up to 8 mailboxes simultaneously with parallel processing technique\n- Exchange Server Support: Exchange Server Subscription Edition (SE), 2019, 2016, 2013, 2010, 2007, 2003, 2000 & 5.5\n\nThe Microsoft Exchange database repair tool efficiently recovers all accidentally or intentionally deleted emails and mailboxes. The Stellar Exchange Recovery software can easily locate and recover deleted Exchange emails and mailbox items. This ensures that you can access your mailbox without any problems.\n\nThe Exchange recovery tool also supports archive mailbox recovery. The software can repair corrupt or damaged archive mailboxes and save them to PST, MSG, EML, RTF, HTML, or PDF format. You can also export the archive mailboxes to Office 365 or live Exchange server directly.\n\nStellar Exchange server recovery software facilitates saving the scanned result for effortless recovery in the future. After completing the scan, the scan results can be stored as an image, in DAT file, at the desired location on the hard disk. When you wish to preview and save the files, this image can be loaded back into the software and the process can be continued.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"12.1.0.0","version":0,"site":"https://www.stellarinfo.com/","source":"Stellar Information Technology Pvt Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}