{"appId":"w:StellarDataRecovery.StellarRepairForExcel","appShortcutName":"Stellar Repair for Excel","appDisplayName":"Stellar Repair for Excel","authorId":"w:winget","releaseTagName":"winget-7.0.0.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cloud.stellarinfo.com/StellarRepairforExcel.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Complete Excel repair tool for .xls, .xlsx, .xltm, .xltx, and .xlsm files. It restores all Microsoft Excel's objects with 100% accuracy.\n\nStellar Repair for Excel - complete Excel repair tool for .xls, .xlsx, .xltm, .xltx, and .xlsm files. It restores all Microsoft Excel's objects with 100% accuracy. A handy solution for fixing all Excel corruption errors, such as unrecognizable format, 'Excel found unreadable content' in name.xls, and 'file name is not valid' and more.\n- Repairs Excel files and recovers tables, pivot tables, charts, formulas, etc.\n- Preview the repaired worksheet with original properties and cell formatting.\n- Repairs multiple Excel files in a single process.\n\nStellar Repair for Excel software previously known as Stellar Phoenix Excel Repair can repair & fix corrupt Excel files of any size. It removes corruption from individual objects, fixes the damage, and restores the Excel file back to its original state. The Excel repair tool can repair multiple Excel files in a batch.\n\nThis Excel file repair tool fixes all types of Excel corruption errors, such as unrecognizable format, Excel found unreadable content in name.xls, Excel cannot open the file filename.xlsx, file name is not valid, the Excel file is corrupt and cannot be opened, etc. It provides a comprehensive solution for fixing Excel file issues.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.0.0.4","version":0,"site":"https://www.stellarinfo.com/","source":"Stellar Information Technology Pvt Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}