{"appId":"w:StellarDataRecovery.StellarRepairForPDF","appShortcutName":"Stellar Repair for PDF","appDisplayName":"Stellar Repair for PDF","authorId":"w:winget","releaseTagName":"winget-3.0.0.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cloud.stellarinfo.com/StellarRepairforPDF.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Stellar PDF Repair is an effective Windows-based PDF repair software that repairs damaged PDF files. It restores forms, headers and footers, comments, word art, clip art, page format, shapes, charts, and tables in PDF documents.\n\nStellar PDF Repair is an effective Windows-based PDF repair software that repairs damaged PDF files. It restores forms, headers and footers, comments, word art, clip art, page format, shapes, charts, and tables in PDF documents.\n- Repairs corrupt PDF files and extracts all components\n- Restores text, hyperlinks, graphs, watermark, and digital signatures\n- Extracts videos and music from corrupt PDF files\n- Repairs PDF files located on external storage devices\n- Supports 1.2, 1.3, 1.4, 1.5, 1.6, and 1.7 versions of Adobe PDF files\n- Compatible with Windows 10, 8.1, 8, and 7\n\nStellar Repair for PDF is a professional software to repair PDF files which may get corrupt during upload, download, or regular use. The tool restores all elements of the PDF file such as headers, footers, forms, page format, word art, clip art, shapes, bookmarks, hyperlinks, etc. It also repairs text, labels, graphics, and images, page tree and cross-reference table of the PDF file.\n\nThis PDF file repair tool repairs corrupt PDF files stored on external hard drives, flash drives, CDs, and other storage media. Users do not need to transfer the PDF files to their system and can access and repair them directly on the external storage device.\n\nBatch conversion process allows you to repair multiple PDF files in a single process. The software saves the repaired PDFs at the same location, which helps users in easy file-tracking.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.0.0.2","version":0,"site":"https://www.stellarinfo.com/","source":"Stellar Information Technology Pvt Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}