{"appId":"w:StellarDataRecovery.StellarRepairForPhoto","appShortcutName":"Stellar Repair for Photo","appDisplayName":"Stellar Repair for Photo","authorId":"w:winget","releaseTagName":"winget-8.8.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cloud.stellarinfo.com/StellarRepairforPhoto.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Repair damaged, pixelated, distorted, disoriented, greyed-out, and corrupt JPEG and other RAW photo file formats.\n\nRepair damaged, pixelated, distorted, disoriented, greyed-out, and corrupt JPEG and other RAW photo file formats.\n- Repairs corrupt JPEG/JPG and other photo formats.\n- Support RAW file formats of popular cameras brands.\n- Repairs multiple corrupt files simultaneously.\n- Supports all camera memory cards: SDXC and more\n- Repairs photos shot from DSLR, camcorders, CCTV, etc.\n- Supports pictures taken from smartphones, iPads, and tablets\n\nThe picture repair utility can simultaneously repair unlimited number of photos of same or different formats. Stellar Repair for Photo offers a quick and easy way to repair hundreds of corrupt, broken, or damaged files stored in any drive or media.\n\nYour photos may be severely corrupt beyond repair. The advanced Stellar Photo Repair software extracts the embedded thumbnails in case of severely corrupt image files without compromising their visual fidelity.\n\nStellar Repair for Photo fixes your completely unreadable corrupted image image  files even under the situations of corrupt header, corrupt data, invalid image file structure, unknown or invalid marker, missing SOS marker etc. You can repair inaccessible, greyed-out, pixelated, fuzzy, stretched, tinted, faded, grainy, blurry images or those showing errors as well.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.8.0.0","version":0,"site":"https://www.stellarinfo.com/","source":"Stellar Information Technology Pvt Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}