{"appId":"w:STEMpedia.PictoBlox","appShortcutName":"PictoBlox","appDisplayName":"PictoBlox","authorId":"w:winget","releaseTagName":"winget-9.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.pictoblox.ai/win/PictoBlox-Setup-9.0.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Creator Tool for Coding, AI, AR-VR and Robotics\n\nPictoBlox is an educational programming software with block-based coding and Python Programming that makes coding fun and easy. With a user-friendly interface and drag-and-drop functionality, it is the ideal companion for setting the first step into the world of programming. One can learn to code, make interactive animations and games, interesting projects based on IoT, program actions for robots, create Artificial Intelligence or Machine Learning projects (like face expression detection, self driving car, object identifier, or speech recognition), and much more!\nNew Environments:\n\n- Video Editor Environment:\n  Introduced an environment for creating, editing, and managing videos directly inside PictoBlox to make project videos, tutorials, etc.\n- Paint Editor:\n  New Paint Editor with enhanced UI for smoother drawing and editing experiences.\n- Screen Recorder:\n  Improved Screen Recorder with better performance, higher FPS support, and multi-window/screen recording capability.\nNew Features:\nBlocks :\n- Improved Video Player Extension blocks.\n- Added Sound-Palette blocks for richer audio control.\n- Introduced Text Animation extension for creative text-based effects.\n- ChatGPT extension:\n  - Optimized API call requests (50 requests / 5 min).\n  - Block where the user sets own API key.\nJunior Blocks:\n- Added Text-to-Speech block.\n- Added 3 Wizbot example projects for learning and experimentation.\n3D and XR Studio:\n- Added Physics FPS option under General Settings for better simulation control.\n- Improved Image tracking support in XR.\n- Cube and marker tracking functionality improved for better accuracy.\n- Added Fullscreen recording capability added in the XR code window.\n- Introduced Mirror mode option for the XR webcam.\n- Added Annotation Text support in XR scenes.\n- Introduced Block for highlight, outline, and glow visual effects.\n- Added Tools for creating roads and arrows directly from sketches\n- Support for drawing lines from equations added in the Sketch module.\n- Implemented Project backup and history feature implemented – saving a project now creates a timestamped backup in the “Backup” folder.\n- Added Aspect Ratio Support in the coding canvas output window (e.g., 1:1, 16:9, 9:16).\nContent-Creation Extension:\n- Added new UI components: Slider, Status Bar, and Advanced Paragraph.\n- General bug fixes and performance improvements for a smoother creation experience.\nOnboarding and User Flows:\n- Simplified onboarding screens for easier user access.\n- New teacher sign-up flow.\n- Improved wait-time popup for better troubleshooting and clarity during loading states.\nBoards:\n- Introduced silent upload, erase, firmware, and upload-code with hidden toasts.\n- Added auto-upload for Arduino UNO, Mega, Nano, and ESP32 boards.\n- Updated naming and icons for Board Settings.\n- The Connect window now shows only the selected board type (Serial / Bluetooth).\nWizbot Maxx (New Hardware Integration):\n- Added full support for Wizbot Maxx in both Blocks Environment and Junior Blocks.\nOther Features:\n- Added auto-update functionality – users can now update the software without re-downloading the full installer.\n- Added High Memory Usage popup to alert users and maintain smooth performance.\n- Added compiler selection option while uploading code in the C++ editor.\nUpdates :\n3D and XR Studio:\n- Resolved physics lag issues affecting both parent and child objects.\n- Fixed car wheel scaling issues in physics simulations.\n- Orbit and Map controls now support cursor-based zoom with infinite scrolling.\n- Optimized performance for large, complex scenes with deep recursive handling.\n- Player Settings palette now includes additional customization features for better user control.\nBug Fixes:\n3D and XR Studio\n- Fixed issue where blocks in the scripting area would randomly disappear.\nJunior Blocks\n- Fixed Wizbot blocks bugs (also reflected in new examples).\nOthers:\n- Added support for multiple-sprite pen-inputs.\n- Text-to-speech now works in 3D & XR.\n- Python Editor:\n  - Fixed Arabic-language UI alignment and rendering issues.\n  - Improved navigation bar UI for better accessibility.\n- Bug fixes and improvements in C++ editor(upload mode)\n- Fixed Weather extension API Bug.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.0.0","version":0,"site":"https://thestempedia.com/","source":"STEMpedia","license_or_tos":"Proprietary","resources":null,"verified":false}