{"appId":"w:STEMpedia.PictoBlox","appShortcutName":"PictoBlox","appDisplayName":"PictoBlox","authorId":"w:winget","releaseTagName":"winget-9.0.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.pictoblox.ai/win/PictoBlox-Setup-9.0.1.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Creator Tool for Coding, AI, AR-VR and Robotics\n\nPictoBlox is an educational programming software with block-based coding and Python Programming that makes coding fun and easy. With a user-friendly interface and drag-and-drop functionality, it is the ideal companion for setting the first step into the world of programming. One can learn to code, make interactive animations and games, interesting projects based on IoT, program actions for robots, create Artificial Intelligence or Machine Learning projects (like face expression detection, self driving car, object identifier, or speech recognition), and much more!\nNew Features:\nBlocks\n- Added the Graph Extension for data visualization and table-based graphs in 3D and XR Studio.\nUpdates :\nQuarky & Sensors\n- Updated Advanced Line Following functionality.\n- Firmware updates released for Quarky Advanced Line Following and Advance Sensors(updated to 6.0)\n- Updated Quarky Advanced Sensors Extension for upload mode (added sensors – Color Sensors, Accelerometers, pH sensor, pulse rate sensor, SSD-OLED, 16x2LCD.)\n- Updated Quarky Advance Line Following and Advance Sensors example projects for better clarity and performance.\n- Added print block in upload mode for Quarky Board.\nBug Fixes:\nGeneral & UI\n- Fixed an issue where pop-ups behind PictoBlox caused freezing.\n- Improved overall pop-up handling to prevent UI blocking.\nBlocks and Python Coding Environment:\n- Fixed the ESP32 driver installation issue, ensuring reliable board connectivity and visibility.\nJunior Blocks\n- Improved hand pose detection performance and accuracy.\n- Fixed the issue where incorrect blocks were shown when selecting Quarky as a board.\n- Resolved the issue where Wizbot hand pose detection got stuck when Wizbot was not connected.\nVideo Editor\n- Fixed an issue where export video was disabled when an empty text box existed.\n- Resolved the issue where the timeline got locked after dragging an entire layer.\n- Added support for additional audio formats:\n  - AC3, E-AC3, DTS, FLAC, ALAC\n- Added support for additional video formats:\n  - FLV, OGV","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.0.1","version":0,"site":"https://thestempedia.com/","source":"STEMpedia","license_or_tos":"Proprietary","resources":null,"verified":false}