{"appId":"w:stevencohn.OneMore","appShortcutName":"OneMoreAddIn","appDisplayName":"OneMoreAddIn","authorId":"w:winget","releaseTagName":"winget-6.7.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/stevencohn/OneMore/releases/download/6.7.6/OneMore_6.7.6_Setupx64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/stevencohn/OneMore/releases/download/6.7.6/OneMore_6.7.6_Setuparm64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A OneNote add-in with simple, yet powerful and useful features\n\n\nWhat's Changed\n- Added ability to adjust and reszie an image from the Clipboard before pasting onto the current page, #1864\n- Added ability to build an ARM64 installer, #1769\n  - Changed the default ribbon configuration to set up a separate OneMore tab\n  - Updated the Diagnostic command to report ARM64 architecture\n  - Fixed an issue with OneMoreSetupActions where it did not recognized the ARM64 architecture\n  - NOTE, this seems to work for some users running on an ARM64 machine, but not everyone.\n- Added ability to pass a date parameter to OneMoreCalendar.exe to set initial view, #1843\n- Updated Schedule Hashtag Scanning dialog to force full scan of selected notebooks, #1846\n- Updated File Import dialog to remember file type options, append or create, #1840\n- Fixed an issue where the Context Menu settings sheet was not drawn correctly after scrolling, #1762\n- Fixed an issue where a batch import of Word docs did not continue to subsequent files after one failed, #1840\n- Fixed an issue where Enable/Disable Spell Check didn't apply to a single selected paragraph, #1848\nInternal Updates\n- Fixed an issue where Duplicate Page did not assign a new unique omPageID, #1866\nKnown Issues\n- 🐜 Search and Replace doesn't replace the currently highlighted or selected word/phrase; sometimes it doesn't replace other candidates either\n- 🐜_Select Similar Styles_ will find differences in colors Auto vs #000000 - make it more fuzzy?\n- 💡Paginate Hashtag search results\n- 💡Move Navigator to DB, paginate history panel, provide import/export\n- 💡Move Reminders to DB, option in dialog and on-page link to delete completed reminders\n- 💡Github PR action to pull ticket# prefix from branch name, e.g. 1234-do-something-cool","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"6.7.6","version":0,"site":"https://stevencohn.net/","source":"River","license_or_tos":"MPL-2.0","resources":null,"verified":false}