{"appId":"w:StirlingTools.StirlingPDF","appShortcutName":"Stirling-PDF","appDisplayName":"Stirling-PDF","authorId":"w:winget","releaseTagName":"winget-2.5.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/Stirling-Tools/Stirling-PDF/releases/download/v2.5.0/Stirling-PDF-windows-x86_64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A locally hosted one-stop shop for all your PDF needs\n\nStirling-PDF is a robust, locally hosted web-based PDF manipulation tool using Docker. It enables you to carry out various operations on PDF files, including splitting, merging, converting, reorganizing, adding images, rotating, compressing, and more. This locally hosted web application has evolved to encompass a comprehensive set of features, addressing all your PDF requirements.\nThis is a big update with lots of new functionality and changes like Form fill and redaction/annotation improvements! Also several changes around the login session expiry\nSpecial thanks to @balazs-szucs, who put a lot of work into this release!\nNew functionality:\n- Huge manual redaction changes with colour selection and improved UI\n- Add attachment support with sidebar button for viewing attachments etc (Seen in viewer mode)\n- FormFill tool with context and UI components for PDF form filling\n- Desktop now edits files that have been openned instead of creating new copies\n- Extra JWT settings to customise expiry times for desktop and browser\n- Add/remove link support\nExtra improvements:\n- Text selection improvements within the viewer with custom actions\n- Improved link handling and link location\n- EmbedPDF 2.6.0 upgrade for several bug fixes\n- Multiple fixes with the viewer, its functionality, and its export\n- PDF Text editor cache / JSON size issues\n- Enhanced JWT handling and refreshing for better session management without forced re-logins\n- Improved annotation UI\n- Files correctly open in the viewer automatically if only 1 file is opened\n- Improved tool disable menu to be able to disable all remaining tools and docs\nWhat's Changed\nEnhancements\n- feat(redaction): improve manual redaction with color selection and updated UI elements by @balazs-szucs in #5679\n- feat(text-selection): implement text selection enhancement for double and triple-click actions by @balazs-szucs in #5712\n- feat(linklayer): improve link handling with pdf-lib integration and add link toolbar, add delete link functionality by @balazs-szucs in #5715\n- feat(attachments): add attachment support with sidebar and API integration by @balazs-szucs in #5673\n- feat(form-fill): FormFill tool with context and UI components for PDF form filling by @balazs-szucs in #5711\n- feat(frontend): Upgrade embedPDF to v2.6.0 and migrate to pdf-lib fork, fix attachment/bookmark panel by @balazs-szucs in #5723\nMinor Enhancements\n- Update translation by @albanobattistella in #5670\n- various viewer pill fixes by @reecebrowne in #5714\n- Fix viewer export by @reecebrowne in #5713\n- fix tool disabling for docs and others by @Frooodle in #5722\n- Preserve local paths for desktop saves by @Frooodle in #5543\n- refactor(api): replace regex string literals with Pattern instances for improved performance and readability by @balazs-szucs in #5680\n- refactor: fix homepage file upload path by @Frooodle in #5738\n- PDF Text editor changes by @Frooodle in #5726\n- fix_env_files_for_tauri by @ConnorYoh in #5741\n- JWT enhancements for desktop by @Frooodle in #5742\n- Chore/v2/improve annotation UI by @reecebrowne in #5724\nFull Changelog: v2.4.6...v2.5.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.5.0","version":0,"site":"https://www.stirlingpdf.com/","source":"Stirling-Software","license_or_tos":"MIT","resources":null,"verified":false}