{"appId":"w:SUSE.RancherDesktop","appShortcutName":"Rancher Desktop","appDisplayName":"Rancher Desktop","authorId":"w:winget","releaseTagName":"winget-1.22.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/rancher-sandbox/rancher-desktop/releases/download/v1.22.0/Rancher.Desktop.Setup.1.22.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes and container management to the desktop.\n\nRancher Desktop is an open-source project to bring Kubernetes and container management to the desktop.\nWindows, macOS and Linux versions of Rancher Desktop are available for download, though do note that the Linux version is considered a tech preview.\nThis is the 1.22.0 release of Rancher Desktop, an open source desktop application to bring Kubernetes and container management to macOS, Windows, and Linux.\nInstallers\n- Windows\n- macOS x86_64\n- macOS aarch64\n- Linux install notes\nRelease Notes for 1.22.0\nWhat's New\nSelect moby storage driver\nVersion 1.21.0 switched to the containerd-snapshotter storage driver by default. On Windows, this happened unconditionally (even on upgrades), which made existing images inaccessible.\nUsers can now choose between the classic and containerd-snapshotter storage drivers via rdctl:\nrdctl set --experimental.container-engine.docker.storage-driver classic\nrdctl set --experimental.container-engine.docker.storage-driver containerd-snapshotter\nRancher Desktop automatically selects the driver based on where your existing images are stored. See Migrating Images for instructions on moving images between storage drivers. Windows users affected by the 1.21.0 issue can switch back to the classic driver to regain access to their images. (#9732)\nDocker 29 in the VM\nAlpine Linux has been updated to version 3.23, which includes Docker 29. This fixes issues with docker inspect returning incomplete image metadata. (#9671, #9739)\nKubernetes Dashboard improvements\nPod log streaming now works in the Dashboard. This was broken since version 1.6.0. (#3212)\nThe Dashboard button now waits until the Steve API server accepts connections before becoming active. Previously, clicking the button too quickly after Kubernetes started would show a spinner that never resolved. (#8217)\nThe non-functional \"Download KubeConfig\" and \"Kubectl Shell\" buttons have been removed from the cluster dashboard. (#2208, #8151, #8757)\nDocker Compose 5.0\nDocker Compose has been updated to version 5.0. Key changes include:\n- Compose can now be used as an SDK for third-party integrations\n- The internal builder has been removed; builds are delegated to Docker Bake\n- Hooks now run on restart\n- New --wait option for the start command\nHelm 4.0\nHelm has been updated to version 4.0. See the Helm 4.0 release notes for details on the changes.\nDiagnostics\nMoby image store check\nA new diagnostic reports when images exist in the inactive image store (classic vs. containerd-snapshotter), helping identify which images need migration. (#9733)\nWindows: wsl-vpnkit detection\nA new diagnostic warns when the wsl-vpnkit distribution is present, as it can cause networking issues with Rancher Desktop. (#9623)\nBug Fixes\nmacOS CA management with multiple keychains\nFixed a bug where certificates from multiple keychains were being written to the same file path, causing only the last keychain's certificates to be processed. (#9755)\nK3s version channel labels not updating\nFixed an issue where version channel labels (e.g, stable, latest, v1.xx) were not removed from old versions when they moved to newer versions, causing multiple patch versions to appear in the recommended list. (#9709)\nK3s image loading for older versions\nMade the --all-platforms flag optional when loading K3s images, so older K3s versions (before 1.31) load images correctly. (#9708, #9710)\nrdctl info works after upgrade\nFixed an issue where rdctl info failed with a BusyBox error for users who upgraded from version 1.19.3 or earlier, or restored an old snapshot. The 1.21.0 release notes mentioned a manual workaround; this is no longer needed. (#9546, #9554)\nContainers page error handling\nFixed an \"[object Object]\" error that appeared on the Containers page when the backend became temporarily unavailable. (#9545, #9661)\nConnectivity check uses HTTPS\nThe network connectivity diagnostic now uses an HTTPS HEAD request instead of HTTP GET, improving privacy by encrypting the request. (#9711)\nLinux packaging fixes\nFixed an issue where the Debian package did not set the suid bit on chrome-sandbox, causing the application to fail to start on Debian and Ubuntu systems.\nThe virtualization support check now works correctly on Linux arm64 systems.\nExtension fixes\nFixed several issues with Docker Desktop extensions:\n- Uninstall and upgrade buttons on the Installed tab now work correctly\n- Extension metadata and icons refresh properly after reinstalling an extension\n- Extensions without containers no longer cause errors during uninstall\n- The ddClient.extension object now includes the id and version fields as specified by the Docker Desktop Extension API\nUpdates to Bundled Utilities (from Rancher Desktop 1.21.0)\n- docker 29.0.2 → 29.1.4\n- docker-compose 2.40.3 → 5.0.1\n- docker-credential-helpers 0.9.4 → 0.9.5\n- helm 3.19.1 → 4.0.5\n- nerdctl 2.2.0 → 2.2.1\n- trivy 0.67.2 → 0.68.2\nUnchanged:\n- amazon-ecr-credential-helper 0.11.0\n- docker-buildx 0.30.1\n- kuberlr 0.6.1\n- spin 3.5.1\n- spin-shim 0.22.0\n- spin-operator 0.6.1\nConnect with the developers\n- The issue queue\n- Rancher Users Slack in the #rancher-desktop channel\nChangelog\nThe full version changelog, from v1.21.0, can be found using GitHub compare and the details of the release can be found in the v1.22.0 milestone.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.22.0","version":0,"site":"https://github.com/rancher-sandbox/rancher-desktop","source":"SUSE","license_or_tos":"Apache-2.0","resources":null,"verified":false}