{"appId":"w:SUSE.RancherDesktop","appShortcutName":"Winget Application","appDisplayName":"Rancher Desktop","authorId":"w:winget","releaseTagName":"winget-1.18.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/rancher-sandbox/rancher-desktop/releases/download/v1.18.2/Rancher.Desktop.Setup.1.18.2.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes and container management to the desktop.\n\nRancher Desktop is an open-source project to bring Kubernetes and container management to the desktop.\nWindows, macOS and Linux versions of Rancher Desktop are available for download, though do note that the Linux version is considered a tech preview.\nThis is the 1.18.2 release of Rancher Desktop, an open source desktop application to bring Kubernetes and container management to macOS, Windows, and Linux.\nInstallers\n- Windows\n- macOS x86_64\n- macOS aarch64\n- Linux install notes\nWhat has changed in 1.18.2\nWindows regression with docker-proxy has been fixed\nRancher Desktop 1.18.0 includes a fix for docker run commands on Windows that unfortunately introduced a race condition that sometimes breaks the communication between the docker.exe command and the docker daemon, resulting in http2 errors (#8276). Thanks to @bcxpro for providing a fix (#8311)!\nOpen WebUI extension has been updated to fix Ollama installation on Linux and macOS\nIf Ollama is not already installed on the system, then the extension will download and install Ollama just inside the extension directory. This had been broken by a change to the upstream Linux and macOS release formats. It does not affect users that already have Ollama installed because in that case the extension will just use the installed version.\nThe version of Open WebUI has been updated to 0.5.20.\nPlease note: there was no public release of 1.18.1\nAn issue with the Open WebUI extension was found after the 1.18.1 tag was already created, so this version had to be skipped.\nRelease Notes for 1.18.0\nCluster dashboard has been updated from 2.7.0 to 2.11.0\nThe cluster dashboard has been reimplemented as a Rancher extension and is mostly in sync with the upstream version.\nThe dashboard now works correctly even when the KUBECONFIG environment variable points to multiple config files.\nNetwork fixes\nThe gvisor-tap-vsock dependency has been updated again, which has solved several networking regressions from Rancher Desktop 1.17.x (on all platforms).\nRancher Desktop is working properly again when behind a VPN. On macOS the VZ emulation mode works again even without a network connection.\nImage scanning now scans local images with containerd\nThis already worked before for moby.\nImage scanning results are displayed much faster once the vulnerability databases have been downloaded (for images with many vulnerabilities).\nThe Open WebUI extension has been updated\nIf you already have the extension installed, then you must uninstall it from the \"Installed\" tab of the \"Extensions\" page (the \"Remove\" button on the \"Catalog\" tab does not work correctly in this release).\nAfter you have uninstalled the current version, you can install the new version as usual from the \"Catalog\" tab.\ndocker run issues on Windows have been fixed\ndocker run on Windows would hang indefinitely when reading from STDIN (#2094) or would produce no output when running without the -i option (#3239). Many thanks to @bcxpro for investigating and fixing this issue!\nnerdctl on Windows picks up compose.yaml automatically\nThe nerdctl command on Windows used to run from a separate directory before and therefore did not locate default filenames like compose.yaml correctly. This has been fixed.\nRancher Desktop is now available as a separate RPM for Fedora\nDeprecations\nMSI installer no longer installs WSL2 on Windows\nWSL2 must be installed on the local system before Rancher Desktop can be installed.\nmacOS 12 Monterey and earlier are no longer supported\nRancher Desktop no longer works on Apple ARM computers running macOS 12 Monterey. It still works on Apple Intel computers, but is unsupported.\nUpdates to Bundled Utilities\n- amazon-eco-credential-helper 0.9.0 → 0.9.1\n- docker 27.4.1 → 27.5.1\n- docker-buildx 0.19.3 → 0.20.1\n- docker-compose 2.32.1 → 2.33.0\n- docker-credential-helpers unchanged 0.8.2\n- helm 3.16.4 → 3.17.1\n- kuberlr unchanged 0.5.2\n- moby/buildkit 0.18.1 → 0.19.0\n- nerdctl 2.0.2 → 2.0.3\n- spin 3.1.1 → 3.1.2\n- spin-shim 0.17.0 → 0.18.0\n- spinkube unchanged 0.4.0\n- trivy 0.58.1 → 0.59.1\nConnect with the developers\n- The issue queue\n- Rancher Users Slack in the #rancher-desktop channel\nChangelog\nThe full version changelog, from v1.17.0, can be found using GitHub compare and the details of the release can be found in the v1.18.0 milestone.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.18.2","site":"https://github.com/rancher-sandbox/rancher-desktop","source":"SUSE","license_or_tos":"Apache-2.0","resources":null,"verified":false}