{"appId":"w:SUSE.RancherDesktop","appShortcutName":"Rancher Desktop","appDisplayName":"Rancher Desktop","authorId":"w:winget","releaseTagName":"winget-1.21.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/rancher-sandbox/rancher-desktop/releases/download/v1.21.0/Rancher.Desktop.Setup.1.21.0.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes and container management to the desktop.\n\nRancher Desktop is an open-source project to bring Kubernetes and container management to the desktop.\nWindows, macOS and Linux versions of Rancher Desktop are available for download, though do note that the Linux version is considered a tech preview.\nThis is the 1.21.0 release of Rancher Desktop, an open source desktop application to bring Kubernetes and container management to macOS, Windows, and Linux.\nInstallers\n- Windows\n- macOS x86_64\n- macOS aarch64\n- Linux install notes\nRelease Notes for 1.21.0\nWhat's New\nrdctl info command\nrdctl has a new info command that lists the Rancher Desktop version and the IP address of the VM:\n❯ rdctl info\nVersion:   v1.21.0\nIPAddress: 192.168.205.2\nYou can query individual fields for use in scripts:\n❯ rdctl info --field ip-address\n192.168.205.2\nIncreasing disk size (Linux and macOS)\nRancher Desktop by default reserves 100GB of disk space for the VM (it is a sparse file, so only the portion in use actually takes up disk space on the host).\nIt is now possible to increase the maximum size of the VM disk using rdctl:\n❯ rdctl set --experimental.virtual-machine.disk-size 120G\nStatus: reconfiguring Rancher Desktop to apply changes (this may take a while).\nThis will restart Rancher Desktop, at which time the volume will expand to the larger size. Please note that it is not possible to reduce the maximum size. Unused space in the VM disk will be returned for host usage every time Rancher Desktop is restarted (via fstrim).\nThere is no GUI mechanism to change the maximum disk size.\nUpdate checker only checks once a day\nRancher Desktop will only check for updates once per day now instead of every hour. This interval is not configurable but the update checks can be disabled completely via both rdctl and the GUI.\nOnline checker frequency is configurable\nBy default, Rancher Desktop checks every 5 seconds to update the \"online\" indicator. It does this by checking for the right redirect response from http://docs.rancherdesktop.io (to https). This also detects when the computer is caught inside a captive portal, like airport or hotel wifi.\nYou can now change the frequency of this check to a longer value (in milliseconds) or disable it completely by setting it to 0:\n❯ rdctl set --diagnostics.connectivity.interval 0\nStatus: settings updated; no restart required.\nElectron will still perform its own online checks (which will also update the Rancher Desktop indicators) but those checks are somewhat unreliable.\nThere is no mechanism in the GUI to change this setting.\nContainer Info page with logs\n@tylercritchlow has moved the container logs to a container info page. You get to the info page either by clicking the container name or through the menu at the end of the line.\nmoby now uses containerd snapshotter by default\nOn new installations, or after a factory reset, Rancher Desktop will now use the containerd snapshotter for storing container images by default. This snapshotter provides additional functionality, such as storing/pushing/pulling multi-platform images. It is also needed for using Wasm containers with docker. This means Rancher Desktop will no longer switch between snapshotters when turning Wasm support on or off, so local images will remain visible to both configuration options.\nUpdated extensions\nThe \"SUSE Application Collection\" extension can now display the collection without having to log in first.\nBug fixes\nUDP port forwarding fixed on Linux and macOS\nIt was already working on Windows. Thanks to @toshs for finding and fixing the issue.\nShadows on macOS 26 Tahoe\nWindow shadows had a performance issue on macOS 26. This has been fixed by upgrading the Electron version.\nUpdates to Bundled Utilities (from Rancher Desktop 1.20.1, as of 1.21.0)\n- amazon-ecr-credential-helper 0.10.1 → 0.11.0\n- docker 28.3.3 → 29.0.2\n- docker-buildx 0.26.1 → 0.30.1\n- docker-compose 2.39.2 → 2.40.3\n- docker-credential-helpers 0.9.3 → 0.9.4\n- helm 3.18.6 → 3.19.1\n- kuberlr unchanged 0.6.1\n- moby/buildkit 0.21.1 → 0.25.2\n- nerdctl 2.1.3 → 2.2.0\n- spin 3.3.1 → 3.5.1\n- spin-shim 0.20.0 → 0.22.0\n- spin-operator unchanged 0.6.1\n- trivy 0.65.0 → 0.67.2\nConnect with the developers\n- The issue queue\n- Rancher Users Slack in the #rancher-desktop channel\nChangelog\nThe full version changelog, from v1.20.1, can be found using GitHub compare and the details of the release can be found in the v1.20.0 milestone.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.21.0","version":0,"site":"https://github.com/rancher-sandbox/rancher-desktop","source":"SUSE","license_or_tos":"Apache-2.0","resources":null,"verified":false}