{"appId":"w:SweetScape.010Editor","appShortcutName":"010 Editor","appDisplayName":"010 Editor","authorId":"w:winget","releaseTagName":"winget-16.0.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.sweetscape.com/010EditorWin64Installer16.0.3.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Professional Text Editor + World's Best Hex Editor\n\n\n- Fixed some Input Method Editors (IMEs) were not being displayed in the correct place.\n- Fixed assigning an empty string to a variable could cause an incompatible type error.\n- Fixed a possible crash restarting Find in Files during a long operation.\n- Fixed the ++ operator could be evaluated twice if used to access an array element inside a nested structure statement.\n- Fixed a crash calling RunTemplate on some invalid templates.\n- Fixed the PasteFromClipboard function should always insert data, even when a hex editor is in overwrite mode.\n- Fixed a problem debugging a script when a watch contained an invalid array access statement.\n- Fixed mousing over a duplicate array could show the array size as off by one.\n- Fixed some update issues when replacing a large number of occurrences.\n- Fixed a potential crash deleting a bookmark.\n- Fixed on Linux when using certain IMEs, selected text could be deleted when switching to a different application.\n- Fixed a rendering refresh issue on some Linux window managers.\n- In the Licensing dialog, detect and ask to remove extra whitespace characters before or after the entered name.\n- On Linux, can now use the QT_NO_SHADOW environment variable to turn off the main window shadow.\n- Display more startup info when using -debug.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"16.0.3","version":0,"site":"https://www.sweetscape.com","source":"SweetScape Software","license_or_tos":"Proprietary","resources":null,"verified":false}