{"appId":"w:SyncROSoft.OxygenPDFChemistry","appShortcutName":"Oxygen PDF Chemistry","appDisplayName":"Oxygen PDF Chemistry","authorId":"w:winget","releaseTagName":"winget-27.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://archives.oxygenxml.com/Oxygen/Chemistry/InstData27.1/oxygen-pdf-chemistry.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Convert HTML and XML to PDF Using CSS\n\nPDF Chemistry allows you to obtain PDF output from HTML or XML documents simply by styling them with CSS. It is a CSS Paged Media processor based on the open-source Apache FOP XSL-FO engine. Its main purpose is to provide you with a simple tool that allows you to leverage your CSS knowledge to create printable deliverables. It is particularly useful for generating technical documentation.\nPDF Chemistry comes integrated with Oxygen XML Editor/Author but it is also available as a separate product for easy integration with automated processes. This means you can use an integration server to run the transformations to publish the PDF output or simply use a command-line interface to run the transformations. Note that the separate product requires its own license key.\nOxygen PDF Chemistry version 27.1 is a maintenance release for the CSS Paged Media processor used for obtaining PDF output from HTML or XML documents through CSS styling. This version adds the ability to control Chemistry console logging, implemented various bug fixes, and addressed issues that were reported by the community.\n\nCore\nControl Logging\nIt is now possible to control the Chemistry console logging by using a custom logback.xml configuration file along with the new -log-file parameter. This is helpful if you want to hide the INFO messages or write the logs into a separate file.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"27.1","version":0,"site":"https://www.oxygenxml.com/","source":"SyncRO Soft","license_or_tos":"Proprietary","resources":null,"verified":false}