{"appId":"w:SyncROSoft.OxygenPDFChemistry","appShortcutName":"Oxygen PDF Chemistry","appDisplayName":"Oxygen PDF Chemistry","authorId":"w:winget","releaseTagName":"winget-28.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://archives.oxygenxml.com/Oxygen/Chemistry/InstData28.0/oxygen-pdf-chemistry.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Convert HTML and XML to PDF Using CSS\n\nPDF Chemistry allows you to obtain PDF output from HTML or XML documents simply by styling them with CSS. It is a CSS Paged Media processor based on the open-source Apache FOP XSL-FO engine. Its main purpose is to provide you with a simple tool that allows you to leverage your CSS knowledge to create printable deliverables. It is particularly useful for generating technical documentation.\nPDF Chemistry comes integrated with Oxygen XML Editor/Author but it is also available as a separate product for easy integration with automated processes. This means you can use an integration server to run the transformations to publish the PDF output or simply use a command-line interface to run the transformations. Note that the separate product requires its own license key.\nOxygen PDF Chemistry 28 gives you more control over how PDFs are produced and delivered: you can compress output files for easier sharing, merge in additional PDFs before or after the generated content, and generate separate PDFs, for example for chapters or sections, directly from CSS.\nThere are changes in:\nCore\nComponent Updates\nCore\n\nCompress PDF Output\nThe new -compress-pdf parameter can be used to reduce the size of the PDF output file for easier storage and sharing.\nMerge Multiple PDFs\nIt is now possible to merge multiple PDFs together. Depending on where you want the additional PDFs to be inserted, you can use the new -insert-after or -insert-before parameters to provide a semicolon-separated list of PDF files to be merged with the currently generated PDF.\nGenerate Separate Files from Fragments of a PDF\nIt is now possible to generate individual fragments of a PDF as separate files using the new -oxy-pdf-extract-file CSS property, with the file name specified by the property value. This is particularly useful if you want separate PDF files for each chapter of a publication, alongside the whole book.\nComponent Updates\n\nUpdated Apache FOP to Version 2.11\nThe Apache FOP library was updated to version 2.11.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"28.0","version":0,"site":"https://www.oxygenxml.com/","source":"SyncRO Soft","license_or_tos":"Proprietary","resources":null,"verified":false}