{"appId":"w:Synology.DriveClient","appShortcutName":"Synology Drive Client","appDisplayName":"Synology Drive Client","authorId":"w:winget","releaseTagName":"winget-8.0.2.17889","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://global.synologydownload.com/download/Utility/SynologyDriveClient/4.0.2-17889/Windows/Installer/x86_64/Synology%20Drive%20Client-4.0.2-17889-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The desktop utility that provides file syncing and personal computer backup services on multiple client computers to a centralized server, Synology Drive Server.\n\n\nFixed Issues\nGeneral\n1. Fixed an issue where Synology Drive Client could unexpectedly close during file syncing if it encountered files with abnormal metadata.\n2. Fixed an issue where downloading a remote folder could fail if parent folders in the local target path did not exist. Starting with this update, the system automatically creates the required directory structure.\n3. Fixed an issue where removing folders from a backup task or deleting an entire backup task might fail.\nWindows\n1. Fixed an issue where the Synology Drive Client installer couldn't start properly on some computers.\n2. Fixed an issue where changing only the letter case of a filename could incorrectly trigger a conflict file.\n3. Fixed an issue where syncing or backing up an entire disk on Windows could fail with a folder sync error.\nmacOS\n1. Fixed an issue where syncing a large number of files in macOS On-demand Sync tasks could cause the computer to slow down or temporarily lose its internet connection.\n2. Fixed an issue where files could not be uploaded during on-demand sync tasks on macOS.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"8.0.2.17889","version":0,"site":"https://www.synology.com/","source":"Synology","license_or_tos":"Proprietary","resources":null,"verified":false}