{"appId":"w:Synology.BeeDrive","appShortcutName":"BeeDrive","appDisplayName":"BeeDrive","authorId":"w:winget","releaseTagName":"winget-1.4.2-13960","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://global.download.synology.com/download/Utility/BeeDrive/1.4.2-13960/Windows/x86_64/BeeDrive-1.4.2-13960-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A desktop utility that automatically backs up your computer to BeeDrive\n\nBeeDrive for desktop is a desktop utility that automatically backs up your computer to BeeDrive. It includes folder-level file sync with customizable options for sync direction, file size, and file type.\nWhat's new\nmacOS\n- Supports HFS+ file system.\nFixed issues\n- Fixed an issue where users in China might not be able to pair their mobile devices.\n- Fixed an issue that might prevent the BeeDrive desktop software from opening when BeeDrive wasn't safely ejected after setting up iCloud photo backup.\n- Fixed an issue where an iCloud photo backup created on Windows might duplicate backup files when connecting BeeDrive to a Mac.\nWindows\n- Fixed an issue where BeeDrive with the exFAT file system couldn't generate previews for HEIC files, even when the Microsoft HEIF Image Extension was installed on Windows.\nmacOS\n- Fixed an issue where photo backup from an SD card or external drive might not be successful after modifying macOS tags or comments of photos on the external storage.\n- Fixed an issue where the BeeDrive mobile app might not be able to preview photos if the BeeDrive name contained Chinese characters.\n- Fixed an issue where BeeDrive might not back up or sync previous folders after updating to macOS 15.\n- Fixed an issue where the BeeDrive mobile app might not be able to preview photos when BeeDrive was connected to a Mac running macOS 15.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.4.2-13960","site":"https://www.synology.com/","source":"Synology","license_or_tos":"Proprietary","resources":null,"verified":false}