{"appId":"w:Synology.SurveillanceStationClient","appShortcutName":"Synology Surveillance Station Client","appDisplayName":"Synology Surveillance Station Client","authorId":"w:winget","releaseTagName":"winget-2.2.2.2596","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://global.synologydownload.com/download/Utility/SurveillanceStationClient/2.2.2-2596/Windows/x86_64/Synology%20Surveillance%20Station%20Client-2.2.2-2596_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Protect your business or home with a reliable and intuitive surveillance solution with powerful and intelligent video monitoring, management, and analysis tools.\n\nSynology Surveillance Station Client is a desktop utility which provides quick, simple and powerful way to access Surveillance Station on your Synology products. With this utility, you can now enjoy smoother live-view experience, improved performance while launching different applications, and be free from browser limitations.\nImportant Note\n1. The Video Scaling option in Surveillance Station Client 2.2.2 has been removed. Video scaling is now automatically handled by GPU via Chromium for optimal quality.\nCompatibility & Installation\n1. Starting from this version, Surveillance Station Client is only compatible with macOS 11.0 or above.\n2. Starting from this version, Surveillance Station Client supports macOS ARM64 architecture.\nWhat's New\n1. Updated the window header to use a dark theme.\nFixed Issues\n1. Fixed an issue where H.265+ video from certain cameras might not play properly.\n2. Fixed an issue where video frames could appear purple when using CPU decoding with GPU rendering enabled.\n3. Fixed an issue where downloaded watermarked recordings in G.726 audio format might fail to play audio.\n4. Fixed an issue where logging in to NAS devices using the same IP but different ports might fail due to missing certificate re-validation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.2.2.2596","version":0,"site":"https://www.synology.com/","source":"Synology","license_or_tos":"Proprietary","resources":null,"verified":false}