{"appId":"w:Synology.SurveillanceStationClient","appShortcutName":"Synology Surveillance Station Client","appDisplayName":"Synology Surveillance Station Client","authorId":"w:winget","releaseTagName":"winget-2.2.1.2565","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://global.download.synology.com/download/Utility/SurveillanceStationClient/2.2.1-2565/Windows/x86_64/Synology%20Surveillance%20Station%20Client-2.2.1-2565_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Protect your business or home with a reliable and intuitive surveillance solution with powerful and intelligent video monitoring, management, and analysis tools.\n\nSynology Surveillance Station Client is a desktop utility which provides quick, simple and powerful way to access Surveillance Station on your Synology products. With this utility, you can now enjoy smoother live-view experience, improved performance while launching different applications, and be free from browser limitations.\nImportant Note\n1. The Live View Analytics app is no longer supported starting from this version.\n2. Adjusted the H.265 software decoding mechanism. For Windows 11 versions released before 2022 H1, please install the Windows HEVC Video Extensions app from the Microsoft Store to watch H.265 videos. This app is pre-installed in newer versions of Windows, so no additional installation is required. If your computer supports H.265 hardware decoding, installing this app is not necessary.\n3. The mechanisms of Fisheye Dewarping have been updated to improve system efficiency. For H.264 cameras, you can use the original mechanism by going to Application > Options > Advanced and enabling fisheye dewarping compatibility mode.\n4. The Smart Search app is no longer supported for H.265 cameras.\nCompatibility & Installation\n1. Starting from this version, Surveillance Station Client is only compatible with Windows 10 or above.\n2. Starting from this version, Surveillance Station Client is only compatible with macOS 10.15 or above.\n3. Starting from this version, Surveillance Station Client will no longer be supported for 32-bit (x86) Windows versions.\nFixed Issues\n1. Improved the error message and guidance displayed when login fails in Surveillance Station Client on macOS 15 or above due to insufficient permissions to access the local network.\n2. Fixed an issue where Surveillance Station Client installed silently could not be uninstalled.\n3. Fixed an issue where the camera display aspect ratio in Monitor Center might be incorrect.\n4. Fixed an issue where the camera live view might not play if the PC has been in sleep mode for an extended period.\n5. Fixed a memory leak issue that occurred when playing camera streams using the AAC audio codec on Windows 10 version 22H2, leading to software unavailability.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.2.1.2565","version":0,"site":"https://www.synology.com/","source":"Synology","license_or_tos":"Proprietary","resources":null,"verified":false}