{"appId":"w:SysNucleus.USBTrace","appShortcutName":"USBTrace","appDisplayName":"USBTrace","authorId":"w:winget","releaseTagName":"winget-3.0.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"USBTrace is an easy to use and powerful USB analyzer (USB traffic sniffer) software. USBTrace can analyze USB protocol at host controllers, hubs and devices.\n\nUSBTrace is an easy to use and powerful USB analyzer (USB traffic sniffer) software. USBTrace can analyze USB protocol at host controllers, hubs and devices.\nUSBTrace supports Windows 2000, XP, 2003/2008 Server, Vista, Windows 7 and Windows 8/8.1 operating systems and works with USB 1.x, 2.0 and 3.0 (low, full, high & super speed) host controllers, hubs and devices.\n\nUSBTrace is an invaluable tool for all those who develop/test firmware and drivers for devices which connect to the PC using the Universal Serial Bus.\n- USBTrace is an easy-to-use USB protocol analyzer. To analyze a USB device, just select the device and click the 'capture' button.\n- With USBTrace you can analyze USB protocol traffic at USB Host Controllers, USB Hubs and USB devices. The tool captures and displays USB Control, Bulk, Interrupt & Isochronous transfers.\n- USBTrace decodes and displays both standard and class specific USB descriptors (Device, Hub, Configuration, Interface, Endpoint, Class Specific, IAD, String) and Windows enumeration information.\n- Unlike other software based USB analyzers, USBTrace does not use any filter driver to capture the USB requests. So USBTrace will not disturb/slow down the PnP system due to its presence\n- USBTrace is capable of capturing all USB requests exchanged between the host controller/hub and the device during device enumeration.\n- USBTrace can decode class specific usb descriptors/requests and display detailed information regarding them. The classes currently supported are Hub, HID, Mass Storage, Bluetooth, Wireless USB HWA, Still Image Capture, Printer, Audio, Video, Smart Card, Vendor specific device class etc.\n\nPlease note that this is a 15 Days Evaluation Version of USBTrace. This Evaluation Version is limited to capture only up to 256KB of data during a single capture session.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.0.1","version":0,"site":"https://www.sysnucleus.com/","source":"SysNucleus","license_or_tos":"Proprietary","resources":null,"verified":false}