{"appId":"w:T_Troll.AlienFXTools","appShortcutName":"AlienFX Tools","appDisplayName":"AlienFX Tools","authorId":"w:winget","releaseTagName":"winget-9.3.4","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/T-Troll/alienfx-tools/releases/download/9.3.4/alienfx-tools.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Alienware systems lights, fans, and power control tools and apps\n\nAWCC alternative in 500kb. You can control your system lights (including hardware and software effects such as system parameters monitoring, ambient lights, sound haptic), fans, temperatures, power settings, and a lot more.\nImportant! If you are using tools for the first time, please read Beginner's guide and AlienFX-GUI readme to configure out its concept and operation principle.\nFan-SDK_V1.zip have binaries built against older fan control version, use it only in case you know what you're doing (or have Aurora R7), check readme file inside archive first to configure out how to make it working!\nChanges into this release:\nLight control SDK:\n- Handling of device detection/connection/disconnection improved.\nAlienFX-CLI:\n- status and probe commands now display disconnected devices as well as active.\nAlienFX-GUI:\n- Devices tab now show API version for disconnected (inactive) devices as well.\n- Area 51m R2 alternative profile added to device detection list.\n- Light update procedure improved - this can dramatically decrease light update rate for fast-pace effects like Grid and Haptics, but cost a bit more RAM (some kilobytes).\n- Bug fixed: Connected light device (like external keyboard) not updated if global effect active before disconnection (or stored into device).\n- Bug fixed: Connected light device not update to current profile lights in some cases.\n- Bug fixed: Quit active app doesn't switch profile to default if \"Do not switch for desktop\" active. Some other changes into profile switch also applied to better handle various situations.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.3.4","version":0,"site":"https://github.com/T-Troll","source":"T-Troll","license_or_tos":"MIT","resources":null,"verified":false}