{"appId":"w:T_Troll.AlienFXTools","appShortcutName":"AlienFX Tools","appDisplayName":"AlienFX Tools","authorId":"w:winget","releaseTagName":"winget-9.3.4.5","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/T-Troll/alienfx-tools/releases/download/9.3.4.5/alienfx-tools.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Alienware systems lights, fans, and power control tools and apps\n\nAWCC alternative in 500kb. You can control your system lights (including hardware and software effects such as system parameters monitoring, ambient lights, sound haptic), fans, temperatures, power settings, and a lot more.\nImportant! If you are using tools for the first time, please read Beginner's guide and AlienFX-GUI readme to configure out its concept and operation principle.\nFan-SDK_V1.zip have binaries built against older fan control version, use it only in case you know what you're doing (or have Aurora R7), check readme file inside archive first to configure out how to make it working!\nChanges into this release:\nAlienFX-SDK:\n- Minor changes and optimisation after review for Linux port.\nAlienFX-GUI:\n- \"Ambient\" effect rework:\n  - Screen cells not used for active zones does not calculate anymore. This provides great advantage to CPU utilisation - it can be up to 12 times less!\n  - This improvement doesn't apply to \"Grid ambient\" effect (from Grid effects) - it always calculates all zones by its nature.\n  - Ambient effect \"dimming\" slider now apply immediately as you move it.\n  - Ambient grid size limit changed from 20x12 to 22x10 to better reflect wider RGB keyboards.\n- Bug fixed: Pressing \"Save\" button do not update active effects in some cases (default color remains for lights).","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.3.4.5","version":0,"site":"https://github.com/T-Troll","source":"T-Troll","license_or_tos":"MIT","resources":null,"verified":false}