{"appId":"w:TablePlus.TablePlus","appShortcutName":"Winget Application","appDisplayName":"TablePlus","authorId":"w:winget","releaseTagName":"winget-6.4.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.tableplus.com/windows/6.4.5/TablePlusSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Modern, native, and friendly GUI tool for relational databases: MySQL, PostgreSQL, SQLite & more\n\nModern, native client with intuitive GUI tools to create, access, query & edit multiple relational databases: MySQL, PostgreSQL, SQLite, Microsoft SQL Server, Amazon Redshift, MariaDB, CockroachDB, Vertica, and Redis.\nBuild 306 - Bug fixes\nRelease date: 8 April 2025\n1. Added support for adding and removing rows directly in the SQL Editor response table.\n2. Double-clicking a history item now always opens in a new SQL Editor tab instead of appending to the current one.\n3. Enhanced “Select All” functionality in Table Data and improved editing performance for large rows in the right sidebar.\n4. Improved layout and padding consistency of left sidebar tab buttons; fixed text trimming on resize.\n5. Prevent DataGrid from triggering “select all” while loading data from the database.\n6. Fixed issue where values containing double quotes were not escaped properly.\n7. Fixed bug preventing editing of Item Overview from the right sidebar.\n8. Fixed bug where Table Data always selected all cells when pressing Key.A.\n9. Fixed issue where the last value entered in the right sidebar's text box was not retrieved.\n10. Fixed bug where setting PRETTY or EMPTY in Right Sidebar did not trigger a state change.\n11. Corrected label text from \"EMPT\" to \"EMPTY\".\n12. Fixed missing semicolon in CREATE INDEX statement during PostgreSQL table export or copy creation.\n13. Fixed issue where enum creation occurred in the wrong PostgreSQL schema.\n14. Fixed issue where connections opened via Connection URL could not be saved — now handled via the Edit Connection window.\nBuild 302 - New Features\nRelease date: 21 March 2025\n1. New Export Tables Window: Support exporting one or multiple tables simultaneously.\n2. PostgreSQL Connection Notice: Display connection notices for PostgreSQL databases.\n3. Support reopening the last closed workspace.\n4. Support editing data in the response of complex JOIN queries in SQL Editor.\n5. Updated context menu in SQL Editor for improved pane control.\n6. Updated result message text font style to match the Editor font style.\n7. Removed ordinal_position when creating a new table.\n8. Reflected SQLItem name changes in the item tree.\n9. Improved support for data types in ClickHouse database and fixed some connection issues.\n10. SQL Editor auto completion: Auto-update completion source after adding/removing items in the left sidebar, support autocomplete for functions and procedures.\n11. Fixed UI glitch in ProcessListWindow for PostgreSQL database.\n12. Fallback to current database when the user lacks permission to retrieve the database list.\n13. Fixed other issues and made performance improvements.\nOlder change logs.\nBug report.\nUp coming features.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.4.5","site":"https://tableplus.com/","source":"TablePlus, Inc","license_or_tos":"Proprietary","resources":null,"verified":false}