{"appId":"w:Taiko2k.TauonMusicBox","appShortcutName":"Winget Application","appDisplayName":"Tauon Music Box","authorId":"w:winget","releaseTagName":"winget-8.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Taiko2k/Tauon/releases/download/v8.0.0/tauonsetup-8.0.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The desktop music player from the future!\n\n\nWelcome to Tauon version 8.0.0!\nI'm excited to bring you this big update, which features a full port to SDL3 for better stability and enhanced features! I think this is the best version of Tauon yet, and I hope you do too!\nNew stop menu ⏹️\nThe new stop menu now gives more options for the behavior of auto-stop. You can now have these stop after the current album, and have this setting stay enabled.\nScreenshot From 2025-04-01 10-52-38-cropped\nImproved Discord RPC 💿\nIt now properly says Listening to Tauon instead of \"playing\", and shows album and artist on separate lines.\nScreenshot From 2025-03-27 19-09-00\nImportant\nOn Arch Linux install the optional AUR package python-lynxpresence for this to work.\nNew transparency support! ✨ [Linux Only]\nScreenshot From 2025-02-23 18-57-23\nThis update comes with a new setting under MENU > Settings > Theme > Transparent accent mode, which allows certain UI elements to be partially transparent. When combined with a desktop plugin you can achieve a blur/glass effect as shown above (Linux only).\nThis can be done with plugins such as Better Blur for KDE Plasma or Blur my Shell for GNOME.\nNote that the center tracklist is left opaque for readability. You can still use Ctrl + +/- to tweak the whole window transparency for a subtle effect. Blur my Shell has a global setting for this too.\nNew Shuffle Lockdown shortcut 🔀\nShuffle Lockdown is a special \"shuffle only\" mode, removing UI distractions and only allowing you to play your library on shuffle while in this mode.\nWhile this feature already existed, it was hard to find, but no more! Its now in the main MENU.\nScreenshot From 2025-02-22 21-42-36\nI think this is a pretty cool and unique feature, the intent here is to make it more accessible and well known.\nNow including Charmed theme 🍭\nPreviously a supporter download, after some tweaks the Charmed theme is now included in the base app. Rizumu the musical witch is now here to brighten everyone's day.\nrizumu1-scaled\nIf you're interested in creating your own theme with a mascot in the tracklist, you can use this theme as a reference.\nOther changes\nAlso included are some long awaited fixes:\n- Drop region highlighting now works when dragging in external files.\n- Mini mode always on top now works on Wayland.\n- Added a new lyric provider LRCLIB with new support in Tauon for fetching synced lyrics.\n- Radio search box now shows the \"Developer Picks\" section by default.\n- Fixed various bugs and introduced new ones for you to find.\nWarning\nUser data cannot be downgraded to an earlier version once upgraded.\n📦 Packagers note the temporary python-lynxpresence dependency.\nAs always, if you like Tauon please donate to support continued development! ❤️\n- @C0rn3j https://rys.rs/donate\n- @Taiko2k https://github.com/sponsors/Taiko2k","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"8.0.0","site":"https://github.com/Taiko2k","source":"Taiko2k","license_or_tos":"GPL-3.0","resources":null,"verified":false}