{"appId":"w:Tailscale.Tailscale","appShortcutName":"Tailscale","appDisplayName":"Tailscale","authorId":"w:winget","releaseTagName":"winget-1.92.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://pkgs.tailscale.com/stable/tailscale-setup-1.92.1-amd64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://pkgs.tailscale.com/stable/tailscale-setup-1.92.1-arm64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Tailscale is a WireGuard based mesh VPN, used to connect your computers and other devices together securely without proxies.\n\n\nNote: 1.92.0 was a release candidate intended for testing only.\nAll platforms\n- New: Tailscale Funnel and Tailscale Serve support the PROXY protocol, a header format that forwards information about the original client connection, such as the source IP and port, to the server before the actual traffic begins.\n- New: Tailscale Peer Relays can use static endpoints using the tailscale set command with the --relay-server-static-endpoints flag.\n- New: Tailscale Services can be configured to use a remote target as a service destination.\n- New: Nodes can authenticate using workload identity federation with the tailscale up command flags --client-id and --id-token.\n- New: Network flow logs automatically record node information about itself and peers it communicates with.\n- Changed: Tailnet Lock command tailscale lock log --json response returns Authority Update Messages (AUMs) in a more stable format.\n- Changed: Tailscale Peer Relay endpoint advertisements include more candidate IP:port pairs.\n- Fixed: Tailscale Peer Relays support multiple, forward bind packets per handshake generation, which improves path selection and chances of completing a handshake.\nmacOS\n- Fixed: Redundant label text for VoiceOver is removed from the exit node picker.\niOS\n- New: Taildrop supported nodes are shown in Device Details.\n- Fixed: Redundant label text for VoiceOver is removed from the exit node picker.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.92.1","version":0,"site":"https://tailscale.com/","source":"Tailscale Inc.","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}