{"appId":"w:Tailscale.Tailscale","appShortcutName":"Tailscale","appDisplayName":"Tailscale","authorId":"w:winget","releaseTagName":"winget-1.94.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://pkgs.tailscale.com/stable/tailscale-setup-1.94.1-arm64.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://pkgs.tailscale.com/stable/tailscale-setup-1.94.1-amd64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Tailscale is a WireGuard based mesh VPN, used to connect your computers and other devices together securely without proxies.\n\n\nNote: 1.94.0 was a release candidate intended for testing only.\nAll Platforms\n- New: tailscaled_home_derp_region_id client metrics are available.\n- New: tailscaled_peer_relay_forwarded_packets_total and tailscaled_peer_relay_forwarded_bytes_total client metrics are available for Tailscale Peer Relays.\n- New: Identity tokens are automatically generated for workload identities.\n- New: --audience flag added to tailscale up command to support auto generation of ID tokens for workload identity.\n- New: tsnet nodes can host Tailscale Services.\n- Changed: The tailscale lock status -json command returns tailnet key authority (TKA) data in a stable format.\n- Changed: Tailscale Peer Relays deliver improved throughput through monotonic time comparison optimizations and reduced lock contention.\nLinux\n- New: Custom DERP servers support Google Cloud Platform (GCP) Certificate Manager.\n- New: Tailscale SSH authentication, when successful, results in LOGIN audit messages being sent to the kernel audit subsystem.\n- Changed: Tailscale Peer Relay throughput is improved when the SO_REUSEPORT socket option is supported on multi-core systems.\n- Fixed: Tailscale Peer Relay server handshake transmission is guarded against routing loops over Tailscale.\n- Fixed: MagicDNS always resolves when using resolve.conf without a DNS manager.\nmacOS\n- New: AuthBrowser.macos system policy sets a preferred browser for opening automatic authentication URLs.\n- New: HideDockIcon system policy determines if the Tailscale Dock icon persists after all Tailscale windows close.\n- New: Install and automatically update to release candidate versions of the client in the About section, Release Channel drop-down.\n- Fixed: DNS related health warnings no longer display when Tailscale DNS is disabled.\n- Fixed: tssentinelId command injection vulnerability has been removed. This fix addresses a security vulnerability described in TS-2026-001.\n- Fixed: Ping view is Tailscale Peer Relay aware.\niOS\n- Fixed: Ping view is Tailscale Peer Relay aware.\ntvOS\n- New: Use Tailscale Subnets toggle is added in Subnet Routing Settings.\n- Fixed: Ping view is Tailscale Peer Relay aware.\nAndroid\n- Fixed: Ping view is Tailscale Peer Relay aware.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.94.1","version":0,"site":"https://tailscale.com/","source":"Tailscale Inc.","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}