{"appId":"w:TeamViewer.TeamViewer","appShortcutName":"TeamViewer","appDisplayName":"TeamViewer","authorId":"w:winget","releaseTagName":"winget-15.71.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.teamviewer.com/download/version_15x/TeamViewer_Setup_x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access and support\n\nTeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS.\nTeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.\nNew Features\n- The connect button in the device drawer has been improved for better visibility and clarity.\n- The TeamViewer Remote custom QuickSupport and Host modules now offer full feature parity with the classic Management Console.\n- Global search now includes knowledge base articles. Access to this feature is currently limited to select countries.\n- The Port Forwarding interface has been completely revamped with a fresh and modern look, providing an intuitive, streamlined, and smoother user experience.\n\nImprovements\n- Tensor license users can now customize the navigation menu. Menu items can be hidden and ordered for specific user groups.\n- Tensor administrators can now enable or enforce the new TeamViewer Remote UI from the settings page. Users will see a toggle to switch between the classic and remote interfaces.\n- A minor bugfix has been implemented to reduce load during client startup.\n- Users can now press the Enter key on a selected device in the device list page to initiate a connection, enabling faster and more efficient remote access.\n- Users can now connect to multiple devices sequentially directly from the device list page.\n- Device group selection in the basic view has been improved. Selected groups now automatically expand to show their items.\n- Clipboard content copied during a session is no longer saved to history, ensuring only the latest item remains and keeping clipboard data private and local.\n- The clipboard menu in the in-session toolbar has been improved. Menu entries have been rephrased for clarity and now reflect the clipboard synchronization status of both local and remote devices.\n- Device permissions are now categorized as Read-only, Read/Write, and Full control, enabling more effective device management.\n- Remote device CPU data in CoPilot is now more stable and consistently displays a value upon refresh.\n\nBugfixes\n- Fixed an issue where an outdated Security Key Redirection driver was installed via older MSI packages. Installing the latest TeamViewer version now ensures access to the updated driver.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"15.71.4","version":0,"site":"https://www.teamviewer.com/","source":"TeamViewer","license_or_tos":"Proprietary","resources":null,"verified":false}