{"appId":"w:TeamViewer.TeamViewer","appShortcutName":"Winget Application","appDisplayName":"TeamViewer","authorId":"w:winget","releaseTagName":"winget-15.64.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.teamviewer.com/download/version_15x/TeamViewer_Setup_x64_15.64.3.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access and support\n\nTeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS.\nTeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.\nNew Features\n- Tensor users with connection reporting enabled can now access additional system information through the connection reporting API, including OS version, CPU type, and other system data.\n- It is now possible to view and manage the TeamViewer policy for legacy groups and devices.\n- Legacy device groups now allow linking with custom QuickSupport module, via the group side-drawer, provided that you have the necessary rights to do so.\n- It is now possible to add a device with a personal password.\n- It is now possible to view, manage, and connect to contacts within legacy groups.\n- It is now possible to view and manage TeamViewer policies for legacy groups and devices.\n- It is now possible to add contacts within legacy groups.\n- A clearer alert is now displayed if an admin attempts to create a user with an email address that is already in use.\n- A new user group source type has been added to represent user groups created from SCIM. SCIM user groups cannot be modified or deleted using the UI and WebAPI endpoints, however, SCIM user groups can have roles assigned just like other groups.\n\nImprovements\n- You can now sort by Threat or Device in the Endpoint Protection detections view.\n- Added drag and reorder functionality for the dashboard widgets in the Endpoint Protection and Backup Overviews.\n- Endpoint Protection licenses have been added to the license usage overview: this includes EP and EDR usage distinguished by servers and workstations, and MDR and MTH add-on licenses.\n- We now distinguish server and workstations Endpoint Protection trial types in the license overview.\n- A new Add button is available in both the basic and advanced views, allowing users to add devices, groups, and contacts from a single location.\n- The advanced view for devices has been updated to enhance usability. The lists on the left-hand side can now be collapsed or expanded. Additionally, a new section has been introduced to contain all legacy devices and contacts.\n- A VPN connection is now available for legacy devices.\n- It is now possible to update the TeamViewer version directly from the start page.\n- User email addresses can now be copied to the clipboard using the copy button that appears on hover.\n\nBugfixes\n- Fixed a bug that prevented the session summary from being sealed at the end of the session.\n- Fixed a bug in the classic UI that caused the application to sign out automatically when the internet connection was lost while using single sign-on.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"15.64.3","site":"https://www.teamviewer.com/","source":"TeamViewer","license_or_tos":"Proprietary","resources":null,"verified":false}