{"appId":"w:TeamViewer.TeamViewer","appShortcutName":"TeamViewer","appDisplayName":"TeamViewer","authorId":"w:winget","releaseTagName":"winget-15.73.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.teamviewer.com/download/version_15x/TeamViewer_Setup_x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access and support\n\nTeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS.\nTeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.\nNew Features\n- Tensor company admins can now switch between the new TeamViewer Remote interface and the classic interface using a toggle when signing in.\n- Clipboard synchronization now only occurs when the session window has focus on the supporters side, thus protecting data copied during local work.\n- Devices can now easily be moved between groups in the Basic View using drag and drop.\n\nImprovements\n- Searching for a group from the side navigation panel now highlights the matching part of the groups name in the search results.\n- Double-clicking the Recent Connections group in Basic View now opens a page showing only recent connections.\n- Searching for a TeamViewer ID on the Devices page now highlights the matching part of the ID in the search results.\n- Its now possible to select up to 5 devices on the Devices page and connect to them simultaneously.\n- Recent connections can now be individually removed or completely cleared from the list on the Remote Support page.\n\nBugfixes\n- Fixed the display of the Version Update and System Update dialogs.\n- Removed support for connections to versions lower than TeamViewer 10.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"15.73.3","version":0,"site":"https://www.teamviewer.com/","source":"TeamViewer","license_or_tos":"Proprietary","resources":null,"verified":false}