{"appId":"w:TeamViewer.TeamViewer","appShortcutName":"TeamViewer","appDisplayName":"TeamViewer","authorId":"w:winget","releaseTagName":"winget-15.69.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.teamviewer.com/download/version_15x/TeamViewer_Setup_x64_15.69.5.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access and support\n\nTeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS.\nTeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.\nNew features\n- The Custom QuickSupport and Host modules are now also available for download in a 64-bit version.\n- TeamViewer deployment via MSI installer now supports direct device assignment using parameters—no post-install script required.\n- Notifications for incoming session events can now be enabled in Settings, providing better accessibility support for screen reader users.\n- Offline assignment of devices: A new \"--offline\" parameter for shell scripts and MSI installers ensures devices are assigned to a company once they come online, improving flexibility for staged or remote deployments.\n- The device details side panel now includes a DEX Essentials view, displaying aggregated compliance data and a 30-day history of automations executed on the device.\n- Users can now customize which DEX Essentials insights are enabled on their devices. Irrelevant insights can be disabled.\n\nImprovements\n- It is now possible to assign a contact and legacy group when configuring a new Host module, ensuring that any resulting service cases are automatically routed to the designated user and group.\n- It is now possible to enable Session Insights for specific outgoing connections by activating the setting in both the AI settings and the configuration of a custom Quick Support module.\n- Enhanced protection against symbolic link redirection vulnerability. (TV Security Bulletin: TV-2025-1003)\n\nBugfixes\n- Fixed a bug that could prevent Session Insights from being generated automatically after a QuickSupport session.\n- Fixed a bug in the in-session chat that could cause the selected text to be incorrectly copied via the context menu.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"15.69.5","site":"https://www.teamviewer.com/","source":"TeamViewer","license_or_tos":"Proprietary","resources":null,"verified":false}