{"appId":"w:TechSmith.Camtasia","appShortcutName":"Camtasia","appDisplayName":"Camtasia","authorId":"w:winget","releaseTagName":"winget-25.2.3.11943","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.techsmith.com/camtasiastudio/releases/2523/camtasia.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The best all-in-one screen recorder and video editor. Record your screen, add video effects, transitions and more.\n\nCamtasia is a video-based screen capture program that enables users to demonstrate and communicate ideas or share knowledge using video. From quick video demos to extensive video projects, Camtasia has a wide range of editing tools to create video content from a variety of sources. Users can record from webcam or screen, introduce a variety of effects, and easily share videos over multiple channels.\nFeature Updates\n- Removed the Save button from Camtasia Rev.\n- Added support for vertical alignment and spacing properties with Dynamic Captions.\nUpdates for IT Administrators\n- Improved messaging for enterprise customers to show that Screencast signin is unavailable.\nBug Fixes\n- Fixed issue which caused extra log files to be written.\n- Fixed a crash that could occur when sending a recording from Camtasia Rev to Camtasia Editor.\n- Fixed an issue where Dynamic Caption transcript words could get duplicated after an undo.\n- Fixed a bug to stop transcript keyframes from being added to Extend Frames of screen recordings and repeat in the transcript editor.\n- Fixed an issue that could cause audio playback to stutter when decoding some video files.\n- Fixed an issue that could cause the Cursor Scale effect to not be applied in Rev.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"25.2.3.11943","site":"https://www.techsmith.com/","source":"TechSmith Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}