{"appId":"w:TechSmith.Camtasia","appShortcutName":"Camtasia","appDisplayName":"Camtasia","authorId":"w:winget","releaseTagName":"winget-25.2.4.12581","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.techsmith.com/camtasiastudio/releases/2524/camtasia.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The best all-in-one screen recorder and video editor. Record your screen, add video effects, transitions and more.\n\nCamtasia is a video-based screen capture program that enables users to demonstrate and communicate ideas or share knowledge using video. From quick video demos to extensive video projects, Camtasia has a wide range of editing tools to create video content from a variety of sources. Users can record from webcam or screen, introduce a variety of effects, and easily share videos over multiple channels.\nFeature Updates\n- Use a horizontal layout for the Camtasia Rev window for consistency with Camtasia Online.\n- Added option in Camtasia Rev to choose between Rev Media and Unpacked Media after recording.\n- Added app icons and tooltips to selection menu for window capture.\n- Added import support for WebM: VP8 video with vorbis audio, and VP9 video with opus audio.\n- The Camtasia Rev Export options in the dropdown are now accessible with keyboard navigation.\n- User can change the asset downloads folder from the Preferences dialog.\nPerformance Improvements\n- Reduce the amount of closed caption objects that can get created while splitting and cutting along the timeline to help performance in projects with many captions.\nUpdates for IT Administrators\n- Added ability to restrict sign-in options via the Deployment tool.\n- Removed option for enterprise users to sign in to the application from the File menu.\nBug Fixes\n- Fixed bug where deleting an animation created by Smart Focus could unexpectedly adjust the media crop size.\n- Fixed Corner Rounding button being incorrectly unchecked on first launch.\n- Fixed bug that clicking Device Frame Effect doesn't show any properties.\n- Fixed a bug with SmartPlayer presets in the Batch Export window.\n- Fixed an issue where Camtasia might ignore certain events on startup if multiple events occurred at the same time.\n- Fixed an issue that could cause some decoded HEVC video frames to be delivered out-of-order.\n- Fixed an issue that could cause the export save location dialog to get lost behind the exporter dialog.\n- Fixed a crash that could occur when attempting to record a window that was missing certain metadata.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"25.2.4.12581","version":0,"site":"https://www.techsmith.com/","source":"TechSmith Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}