{"appId":"w:Tenable.NessusAgent","appShortcutName":"Nessus Agent","appDisplayName":"Nessus Agent","authorId":"w:winget","releaseTagName":"winget-11.1.0.20277","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.tenable.com/downloads/api/v2/pages/nessus-agents/files/NessusAgent-11.1.0-x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Nessus Agents give you visibility into additional IT assets - even endpoints, and other remote assets that intermittently connect to the internet.\n\n\nNew Features\n\nThe following are new features included in Tenable Agent 11.1.0:\n- Enabled CPU resource controls for Linux and Windows agents in Tenable Nessus Manager versions 10.10.0 and later and Tenable Vulnerability Management.\n  - This setting is now available for use in Tenable Nessus Manager versions 10.10.0 and later. For more information, see CPU Limit % in Manage Agent Profiles.\n  - Tenable is scheduled to release full support for this feature in Tenable Vulnerability Management near the end of January 2026.\n- Added support for plugin download concurrency settings in Tenable Vulnerability Management. Tenable is scheduled to release full support for this feature by the end of January 2026.\nChanged Functionality and Performance Enhancements\nThe following enhancements are included in Tenable Agent 11.1.0:\n- Added agent-side logic to support an upcoming feature for Red Hat Enterprise Linux (RHEL) and RHEL-derivative hosts. When fully released, this feature will allow agents to download only the plugin sets required for the specific Linux distribution. Tenable is scheduled to release full support for this feature by the end of January 2026.\nBug Fixes\n\nBug Fix Defect ID\nReduced agent disk usage, particularly during plugin updates. This included:\n- Removed the creation and use of the plugin-attributes database.\n- Introduced a process to ensure that the agent does not attempt plugin installs if it detects there is not enough disk space on the filesystem.\n- Changed to the plugin database update and maintenance processes so that it uses less temporary disk space.\n02345320, 02369076, 02336650, 02360792, 02392889, 02388348\nSupported Platforms\nThe following are supported platform updates made in Tenable Agent 11.1.0:\n- Added support for the following operating systems:\n  - Windows ARM64\n  - Debian 13\n  - Miracle Linux 9\n  - Rocky Linux 10\n- Removed support for the following operating systems:\n  - Windows 32-bit\n  - macOS 13\nUpgrade Notes\n- You can upgrade to the latest version of Tenable Agent from any previously supported version.\n- If your upgrade path skips versions of the Tenable Agent, Tenable recommends reviewing the release notes for all skipped versions to learn about new features and bug fixes.\n- If you are connecting to Tenable Vulnerability Management through Tenable Nessus scanners, Tenable Agents, Tenable Web App Scanning scanners, or Tenable Network Monitors (NNM) located in mainland China, you must connect through sensor.cloud.tenablecloud.cn instead of sensor.cloud.tenable.com.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.1.0.20277","version":0,"site":"https://www.tenable.com/","source":"Tenable, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}