{"appId":"w:Tenable.Nessus","appShortcutName":"Tenable Nessus","appDisplayName":"Tenable Nessus","authorId":"w:winget","releaseTagName":"winget-10.11.0.20161","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.tenable.com/downloads/api/v2/pages/nessus/files/Nessus-10.11.0-x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vulnerability scanner developed by Tenable\n\n\nNew Features\n\nThe following are the new features included in Tenable Nessus 10.11.0:\n- Introduced Nessus Essentials Plus, a new, yearly subscription tier that is free for verified students and educators and affordable for all other customers. It includes the following features:\n  - The ability to scan 20 targets.\n  - HTML and PDF reporting.\n  - Real-time plugin updates.\nChanged Functionality and Performance Enhancements\nThe following changes are included in Tenable Nessus 10.11.0:\n- Updated Tenable Nessus Essentials with new functional limits:\n  - Reduced scannable targets from 16 to 5.\n  - Disabled reporting and exporting.\n  - Updated the subscription to a monthly term.\n  - Delayed plugins updates by 30 days.\n  - Updated the product so that data is not saved at the end of the subscription term unless you upgrade to a premium version of Tenable Nessus.\nBug Fixes\n\nBug Fix Defect ID\nFixed an issue where localized HTML and PDF reports were incorrectly translated.\n02338762, 02340433\nFixed an issue where the Tenable Nessus backend was not updating the last checked available versions. 02257447, 02325697\nFixed an issue where Tenable Nessus could not ingest web app scanning plugins in offline mode. 02249841, 02335036\nFixed an issue where advanced agent scans launched from Tenable Security Center failed to include certain plugin results. 02358488, 02360054, 02352675, 02362129, 02362296, 02362890, 02354701, 02365102, 02352799, 02360666, 02364066, 02365597, 02357087, 02359851, 02365111, 02357867, 02365777, 02354325, 02362378, 02366634, 02353439, 02351699, 02363014, 02366463\nSupported Platforms\nThe following are supported platform updates made in Tenable Nessus 10.11.0:\n- Added support for Debian 13.\n- Added support for macOS 26.\n- Removed support for macOS 13.\n- Removed support for 32-bit Windows operating systems.\nUpgrade Notes\n- Tenable Vulnerability Management FedRAMP environments support Tenable Nessus scanners versions 10.4.0 and later.\n- If you are connecting to Tenable Vulnerability Management through Tenable Nessus scanners, Tenable Agents, Tenable Web App Scanning scanners, or Tenable Network Monitors (NNM) located in mainland China, you must connect through sensor.cloud.tenablecloud.cn instead of sensor.cloud.tenable.com.\n- You can upgrade to the latest version of Tenable Nessus from any previously supported version.\n- If your upgrade path skips versions of Tenable Nessus, Tenable recommends reviewing the release notes for all skipped versions to learn about new features and bug fixes.\n- If you want your scanners to update to the newest version before the GA date automatically, set your Tenable Nessus Update Plan to Opt in to Early Access releases.\n- If you want to update your scanners to the latest version before the GA date manually, disable automatic updates so the scanner does not automatically downgrade to the previous version.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"10.11.0.20161","version":0,"site":"https://www.tenable.com/","source":"Tenable, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}