{"appId":"w:Tenable.Nessus","appShortcutName":"Tenable Nessus","appDisplayName":"Tenable Nessus","authorId":"w:winget","releaseTagName":"winget-10.10.0.20152","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.tenable.com/downloads/api/v2/pages/nessus/files/Nessus-10.10.0-x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vulnerability scanner developed by Tenable\n\n\nNew Features\n\nThe following are the new features included in Tenable Nessus 10.10.0:\n- Added a global timeout setting to define the maximum duration for a host scan.\n- Added support for the upcoming software and plugin updates via scanner profiles for Tenable Vulnerability Management-linked scanners.\n- Added support for the upcoming Tenable Vulnerability Management plugin download concurrency feature.\n- Added support for the upcoming CPU resource limit setting for Tenable Agents, which will be configurable via agent profiles in Tenable Nessus Manager.\nChanged Functionality and Performance Enhancements\nThe following enhancements are included in Tenable Nessus 10.10.0:\n- In clustered environments, child nodes now report human-readable scan names instead of UUIDs for running scans to improve visibility.\n- The migration process from Tenable Nessus Manager to Tenable Vulnerability Management now includes triggered scans and their configured triggers.\n- When copying a triggered agent scan, Tenable Nessus Manager now includes the scan's history.\n- The main navigation menu is now resizable for an improved user experience.\n- Added a new API endpoint that allows you to export all Tenable Agent data in a single request.\n- For scanners on Linux systems, the command line output for nessuscli fetch --scanner-health-stats now includes heap memory statistics.\n- Improved the diagnostic packet capture feature to include support for ICMP and other IP-based protocols.\n- Added the ability to enforce TLS 1.3 for communications via the ssl_mode advanced setting.\n- Disabled the ability to export scan data and audit files in trial versions of Tenable Nessus.\n- Removed Terrascan from Tenable Nessus Essentials, Professional, Expert, and trials.\nBug Fixes\n\nBug Fix Defect ID\nFixed an issue where scan result emails showed incorrect vulnerability counts.\n02183925, 02290412\nFixed an issue that prevented users with appropriate permissions from generating certain scan reports.\n02194357\nFixed an issue where agent scan policies ignored the plugin family lock setting.\n02192072\nImproved the reliability of nessuscli fix commands by ensuring the database is fully initialized before the commands can run. 02191308\nFixed an issue that allowed duplicate linking keys in Tenable Nessus Manager, ensuring keys are unique to prevent agent linking conflicts.\n02257892\nFixed the Safe Mode agent list filter. 02286697\nImproved the functionality of nessusd.exe during the installation process to prevent installation failures on Windows. 02299766, 02301221, 02316698, 02304622\nSupported Platforms\nThe following are supported platform updates made in Tenable Nessus 10.10.0:\n- Added support for the following operating systems:\n  - macOS 26 (Tahoe)\n  - Red Hat Enterprise Linux 10\n  - CentOS 10 Stream\nUpgrade Notes\n- Tenable Vulnerability Management FedRAMP environments support Tenable Nessus scanners versions 10.4.0 and later.\n- If you are connecting to Tenable Vulnerability Management through Tenable Nessus scanners, Tenable Agents, Tenable Web App Scanning scanners, or Tenable Network Monitors (NNM) located in mainland China, you must connect through sensor.cloud.tenablecloud.cn instead of sensor.cloud.tenable.com.\n- You can upgrade to the latest version of Tenable Nessus from any previously supported version.\n- If your upgrade path skips versions of Tenable Nessus, Tenable recommends reviewing the release notes for all skipped versions to learn about new features and bug fixes.\n- If you want your scanners to update to the newest version before the GA date automatically, set your Tenable Nessus Update Plan to Opt in to Early Access releases.\n- If you want to update your scanners to the latest version before the GA date manually, disable automatic updates so the scanner does not automatically downgrade to the previous version.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"10.10.0.20152","version":0,"site":"https://www.tenable.com/","source":"Tenable, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}