{"appId":"w:Tenable.NessusAgent","appShortcutName":"Nessus Agent","appDisplayName":"Nessus Agent","authorId":"w:winget","releaseTagName":"winget-11.0.3.20014","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.tenable.com/downloads/api/v2/pages/nessus-agents/files/NessusAgent-11.0.3-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Nessus Agents give you visibility into additional IT assets - even endpoints, and other remote assets that intermittently connect to the internet.\n\n\nNew Features\nThe following are new features included in Tenable Agent 11.0.3:\n- Added support for plugin download concurrency settings in Tenable Vulnerability Management. Tenable is scheduled to release full support for this feature by the end of January 2026.\nSecurity Updates\nThe following are security updates included in Tenable Agent 11.0.3:\n- Fixed a vulnerability in the Tenable Agent Windows tray application that allowed a standard user to gain system privileges during installation or uninstallation.\n  For more information, see the Tenable Product Security Advisory.\nUpgrade Notes\n- You can upgrade to the latest version of Tenable Agent from any previously supported version.\n- If your upgrade path skips versions of the Tenable Agent, Tenable recommends reviewing the release notes for all skipped versions to learn about new features and bug fixes.\n- If you are connecting to Tenable Vulnerability Management through Tenable Nessus scanners, Tenable Agents, Tenable Web App Scanning scanners, or Tenable Network Monitors (NNM) located in mainland China, you must connect through sensor.cloud.tenablecloud.cn instead of sensor.cloud.tenable.com.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"11.0.3.20014","version":0,"site":"https://www.tenable.com/","source":"Tenable, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}