{"appId":"w:TheOSCARTeam.OSCAR","appShortcutName":"OSCAR","appDisplayName":"OSCAR","authorId":"w:winget","releaseTagName":"winget-1.7.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.sleepfiles.com/OSCAR/1.7.0/OSCAR-1.7.0-Win64-Qt5.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Open source software for reviewing and exploring data produced by CPAP and related machines used in the treatment of sleep apnea.\n\nOSCAR is an acronym that stands for, \"Open Source CPAP Analysis Reporter\". OSCAR provides for the viewing of the high-resolution sleep data that is generated by the CPAP and stored on the SD card. OSCAR converts this data to graph form allowing the user to view this data down to a breath by breath level. OSCAR is free to use and is compiled in formats that will operate on Mac, Linux, and Windows. OSCAR can be downloaded from https://www.sleepfiles.com/OSCAR/. It is this information that enables you to provide data for discussion with your doctor and/or to view and optimize your personal therapy.\n\nOSCAR is also used by many physicians and therapists who consult with patients, and by medical researchers comparing patient/machine responses across multiple platforms. OSCAR provides visual and statistical data details and enables comparisons across machine types and manufacturers, that are not available from proprietary manufacturer software and data products. Professionals who rely on OSCAR to provide research and to serve patient needs will lose this valuable resource if data becomes inaccessible, or only available through the manufacturer's data products.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.7.0","version":0,"site":null,"source":"The OSCAR Team","license_or_tos":"GPL-3.0","resources":null,"verified":false}