{"appId":"w:Throneproj.Throne","appShortcutName":"Throne","appDisplayName":"Throne","authorId":"w:winget","releaseTagName":"winget-1.0.9","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/throneproj/Throne/releases/download/1.0.9/Throne-1.0.9-windows64-installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Cross-platform GUI proxy utility (Empowered by sing-box)\n\n\nThis update should be considered experimental, and it is highly suggested to keep the older version as a backup\nIt is kindly requested from users that are willing to test and report issues to use this version so that we can refine it for the later versions\n- Refactor and Migrate the internal structures 1\n- Save window size/position\n- Add advanced connection options 2\n- Add experimental xhttp support 3\n- Return custom icon for Tray 4\n- Fixes and Improvements\n1:\nWe have refactored the internal structure we use for saving profiles. Some bugs are to be expected, so please submit issues with complete information regarding and bugs you see.\n2:\nYou can now configure ECH, Dial fields and other TLS security options from the UI. Note that some features are not yet supported in the sing-box version we use and are disabled for now.\n3:\nWe are planning to add a more comprehensive Xray outbound support to Throne in the upcoming releases, and the format and UI for such outbounds may change, so such options are not guaranteed to remain functional on the upcoming releases and may need to manual re-importing.\n4:\nYou can now choose a square-dimensioned PNG file as Icon for each state of the app in the Tray, you can also refer to the Iconsets repo to download or submit Iconsets for Throne.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0.9","version":0,"site":"https://github.com/throneproj","source":"Throneproj","license_or_tos":"GPL-3.0","resources":null,"verified":false}