{"appId":"w:TigerVNC.TigerVNC","appShortcutName":"TigerVNC","appDisplayName":"TigerVNC","authorId":"w:winget","releaseTagName":"winget-1.16.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High performance, multi-platform VNC client and server\n\nTigerVNC is a high-performance, platform-neutral implementation of VNC (Virtual Network Computing), a client/server application that allows users to launch and interact with graphical applications on remote machines. TigerVNC provides the levels of performance necessary to run 3D and video applications, and it attempts to maintain a common look and feel and re-use components, where possible, across the various platforms that it supports. TigerVNC also provides extensions for advanced authentication methods and TLS encryption.\nTigerVNC 1.16.0 is now available. Lots of changes have been made since the last release, but the highlights are:\n- The native viewer has a new keyboard shortcut system to control the viewer, replacing the F8 shortcut and allowing easier access to toggle full-screen mode and redirecting system keys\n- The native viewer now supports sending system keys even in windowed mode\n- Added a new server called w0vncserver for sharing Wayland desktops\n- The Java viewer has more fine-grained control of scaling the session\n- The native viewer uses a different method to intercept system keys on macOS, which will require explicit user approval\n- The native viewer has an improved server field, with searchable history\n- The native viewer now intercepts and forwards all¹ system keys on Windows\n- The native viewer is now more responsive when resizing the remote session\n- Red Hat Enterprise Linux 10 packages have been added, although without libvnc.so\n- Ubuntu 20.04 and Red Hat Enterprise Linux 7 packages have been removed\n¹ except for Ctrl+Alt+Delete, which can never be intercepted","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.16.0","version":0,"site":"https://tigervnc.org/","source":"TigerVNC project","license_or_tos":"GPL-2.0","resources":null,"verified":false}