{"appId":"w:TopazLabs.TopazPhotoAI","appShortcutName":"Topaz Photo AI","appDisplayName":"Topaz Photo AI","authorId":"w:winget","releaseTagName":"winget-4.0.4","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://downloads.topazlabs.com/deploy/TopazPhotoAI/4.0.4/TopazPhotoAI-4.0.4.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Image enhancement for on-location photographers\n\nPhoto AI is a robust desktop app that enhances photographs by removing noise (including from RAW files and low-light conditions), sharpening images, and correcting missed focus. It also offers many other enhancements to help you get the most out of your shots.\nHello! This patch brings small changes in preparation for our transition to the new applications that will be released soon.Photo AI will continue to receive occasional minor patch updates for compatibility. New AI models and major features will be introduced in the Studio versions of our desktop apps.\nAs you may have seen in recent emails and discussions, we are launching a new application built from Photo AI and updating the license structure for this new application. These changes are made with the longevity and growth of the company in mind so we can hopefully develop more exciting models and features for all users who we are lucky to be building for.\nWe understand that many of you have questions and concerns about the transition which we will do our best to answer. Please join the conversation and share your thoughts about the change here. Your feedback helps us build responsibly and thoughtfully, and we’re deeply grateful for your continued support.\nYou can find the installer links and the full changelog below for this version of Photo AI. For any issues, make sure to send us an email to support@topazlabs.com\n\nChangelog\n- Added support for Topaz Photo update","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.0.4","version":0,"site":"https://www.topazlabs.com/","source":"Topaz Labs LLC","license_or_tos":"Proprietary","resources":null,"verified":false}