{"appId":"w:TopoGrafix.ExpertGPS","appShortcutName":"ExpertGPS","appDisplayName":"ExpertGPS","authorId":"w:winget","releaseTagName":"winget-9.26.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.expertgps.com/download/SetupExpertGPS64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GPS Mapping Software for Garmin, Magellan, Lowrance, Eagle GPS\n\nExpertGPS is the ultimate GPS map software for planning outdoor adventures. View GPS waypoints and tracklogs from any handheld GPS receiver over aerial photos and US topographic maps. Plan your next outdoor adventure over scanned USGS topo maps and send a route directly to your GPS receiver to guide you in the field. View your GPS tracklog over an aerial photo to see exactly where you went.\nExpertGPS handles all your mapping and data-conversion jobs. You'll be able to convert any GPS, GIS, or CAD data to or from GPX, Google Earth KML or KMZ, Excel CSV or TXT, SHP shapefiles, or AutoCAD DXF drawings in two clicks. You can reproject data in any geographic format (lat-lon, UTM, US State Plane) and change datums instantly. With ExpertGPS, you'll be able to calculate acreage, measure distance, elevation and grade.\nFixed an error when the settings for old NMEA GPS models were still present in the registry.\nFixed an error when exporting extremely large SVG files.\nFixed namespace declarations in exported SVG.\nDeferred checking the printer settings until actually printing - this removes a delay at startup that some users were seeing with networked printers.\nFixed the Temperature display in the Edit Waypoint dialog when Celcius was selected.\nAdded Mass Storage Mode option for Garmin GPS 73.\nRemoved .zip option on Import. Unzip your files first, and then import.\nAdded additional fallback font options for Mac and Linux users.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"9.26.0.0","version":0,"site":"https://www.topografix.com/","source":"TopoGrafix","license_or_tos":"Proprietary","resources":null,"verified":false}