{"appId":"w:Tricerat.ScrewDriversClient","appShortcutName":"ScrewDrivers Client","appDisplayName":"ScrewDrivers Client","authorId":"w:winget","releaseTagName":"winget-7.9.4.21324","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.tricerat.com/hubfs/ScrewDriversClient_7.9.4.21324_x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Instant access to better printing and scanning for your organization with ScrewDrivers enterprise print management and monitoring tools.\n\n\nCurrent Release\nVersion 7.9.4 was released in November 2025 and is the current production release.\n\nImportant\nBefore installing this version, your Tricerat Licensing Server must be upgraded to v5.6.4.0 or later! The upgrade to v5.6.4.0 Tricerat Licensing Server needs to be completed before upgrading any server session agent to avoid license checkout issues! See this page for upgrade instructions: Upgrading Your License Server All license server releases are backwards compatible with all previous V6 and v7 releases.\nVersion 7 products are not compatible with version 6 license activation codes. You will need new activation codes for version 7 products. Please contact your Salesperson for more information.\n\nImportant\nBefore installing any version 7 component, you may need to install the .NET 4.8 Runtime. Failure to do so will prevent license activation of a nodelocked license and all UI’s will fail to run due to its dependency on this version of .NET. Note: Several Microsoft OS now include the .NET runtime so this step may not be required.\n\nImprovements and Fixes\n\n- ScrewDrivers Pro - fixed an APF bug for Konica printers.\n- Linux and IGEL enhancements for UI and deployment customizations.\n- ScrewDrivers Gateway supports device authentication mode for non-Windows platforms.\n- ScrewDrivers Endpoint client - now supports IPv4 messaging for AVD deployment environments.\n- Other minor updates, fixes and logging improvements.\nKnown Issues\n\n- This version is in-compatible with Server 2012 R2 OS. Server 2012 R2 OS is still supported by previous versions.\n- If the ScrewDrivers Administration active tab is Reporting, the report viewer will hide portions of the File->Options or Help->About windows due to a technical limitation. A workaround does exist, just change to another tab view before displaying the File->Options or Help->About window. We do not expect this to be fixed in a future version.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"7.9.4.21324","version":0,"site":"https://www.tricerat.com/","source":"Tricerat","license_or_tos":"Proprietary","resources":null,"verified":false}