{"appId":"w:Trimble.TrimbleConnect","appShortcutName":"Trimble Connect","appDisplayName":"Trimble Connect","authorId":"w:winget","releaseTagName":"winget-1.26.0.672","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.trimble.com/download_manager/getdownload/63500/7252/c077b9d9ac17fb7df04ac9bfafd6f760f57374f117f83355d2248780c1af262c/TrimbleConnectSetup-1.26.0.672-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Cloud-based collaboration platform with real time status-sharing\n\n\nTrimble Connect for Windows v1.26.0.672 Release Note - September 8, 2025\n\nThere is a new version of the Trimble Connect for Windows application released. Version identifier for this release is 1.26.0.672. The new version is available for download in the Connect apps store page or by clicking the \"New version available!\" button in the top right corner of the Connect for Windows application.\n\nImportant announcements\n- Windows 10 support ends on October 14th, 2025 (see Microsoft announcement here). All versions of the Trimble Connect for Windows application stop supporting Windows 10 operating system on the same date.\n- The limited availability point cloud uploader beta version will be discontinued. Trimble Connect for Windows application version 1.11.1 introduced an experimental beta version (with limited availability) for uploading point cloud data to the cloud in a format that enabled streaming the point cloud data in the Trimble Connect for Browser 3D Viewer. The beta version data has file format extension “.potree”. The beta feature for uploading “.potree” files will be discontinued and removed from the TC for Windows application at the end of 2025. Trimble Reality Capture Platform Service is the Trimble solution for uploading, viewing and collaborating on reality capture (point cloud) data in Trimble Connect.\n\nNew Features\n- This version introduces a new integrated Status Sharing panel. With the integrated Status Sharing panel there is no need to download and install the Status Sharing feature separately anymore. The Status Sharing feature is available in the online mode.\n\nImprovements\n- IFC (.IFC) file format importer updated to version 6.70\n- Navisworks (.NWD & .NWC) file formats importer updated to version 1.26\n- Sketchup (.SKP) file format importer updated to version 1.86\n- Stepiges (.STEP, .IGS, .IGES) file formats importer updated to version 3.26","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.26.0.672","site":"https://www.trimble.com/","source":"Trimble Inc. and affiliates","license_or_tos":"Proprietary","resources":null,"verified":false}