{"appId":"w:Tulip.TulipPlayer","appShortcutName":"Tulip Player","appDisplayName":"Tulip Player","authorId":"w:winget","releaseTagName":"winget-2.9.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.tulip.co/releases/prod/win/Tulip%20Player%20Setup.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Play Tulip apps on machines, tablets, computers, and phones. Enable powerful, consumer-grade user experiences for your workforce across devices\n\nPlay Tulip apps on machines, tablets, computers, and phones. Enable powerful, consumer-grade user experiences for your workforce across devices\nThe Tulip Player windows application, offers an extended set of features:\nA more immersive user experience:\n- The Tulip Player Windows App will persist its window size, position, and full screen state across restarts. This can be helpful if you always want your Tulip Player to appear in the same position, or to always be maximized.\n- The Tulip Player Windows App is a dedicated user experience. It can only be used to access Tulip Apps - not Facebook.\nBetter hardware access:\n- The Tulip Player Windows App supports Tulip Vision\n- It can open files from the local computer within your Tulip App.\n- In some situations, hardware barcode scanners will work better.\n- It supports a wide range of hardware devices which can be found here\nBetter authentication experience:\n- Administrators only have to authenticate the Tulip Player Windows App once per physical computer. In contrast, the Tulip Web Player has to be authenticated separately for each operator. In some situations, shareable station links can be used to work around this limitation.\n- For the the Tulip Player Windows App, credentials are securely persisted to the file system. This makes it harder for an operator to accidentally de-register their station, which would require an administrator to re-register them.\n- The Tulip Player Windows App can be registered with multiple Tulip instances, making it easier to switch between a staging and production instance, for example.\n- The Tulip Player Windows App and the Tulip App Editor can be used simultaneously. You must sign out of the App Editor in order to access the Tulip Web Player.\nDiagnostics:\n- The Tulip Player Windows App makes logs easier to access.\n- The Tulip Player Windows App can collect more detailed information about the computer it’s running on.\nVersion 2.9.1 of Desktop Player will be available for download by Saturday, January 24th 9:00PM ET! If you have auto updates enabled, the Desktop Player application will update in the background and changes will take effect the next time the application is restarted. Alternatively, you can manually initiate the update process from the file menu.\nFeature Enhancements\n- In the multi-tool torque driver and open protocol torque driver, a new \"alarm\" event has been added to torque tool Open Protocol driver(s). This event allows monitoring of conditions, such as low battery.\n- In the multi-tool torque driver, trace data (to be configured as a function and returned as an event with the specific tool ID) are now available.\n- In the multi-tool torque driver, rawJSON field is now available as part of the extendedTighteningData like torqueOP driver.\n- Allows a new protocol ('wsync://') in the open url trigger, which enables further connection with Zebra devices.\n- Added more extensions to prevent the {{Open File or Folder}} trigger from opening executable files and/or bundles. Added more extensions to prevent the {{Save Image}} trigger from saving executable files.\n- With Player 2.9.1, support for Vietnamese is now included.\n- For customers in China, they are now able to get faster player updates and downloads by updating an environment variable. For faster player updates: IT should update their environment variables to [Environment]::SetEnvironmentVariable(\"TULIP_PLAYER_SET_DOWNLOAD_REGION\", \"china\", [EnvironmentVariableTarget]::Machine)\n  - For Player downloads:\n    - Windows\n      - EXE: https://download.tulipco.cn.s3.cn-north-1.amazonaws.com.cn/releases/prod/win/Tulip%20Player%20Setup.exe\n      - MSI: https://download.tulipco.cn.s3.cn-north-1.amazonaws.com.cn/releases/prod/win/Tulip%20Player%20Setup.msi\n    - Mac\n      - DMG: https://download.tulipco.cn.s3.cn-north-1.amazonaws.com.cn/releases/prod/mac/Tulip%20Player.dmg\n    - Linux\n      - DEB: https://download.tulipco.cn.s3.cn-north-1.amazonaws.com.cn/releases/prod/linux/amd64/Tulip%20Player.deb\nBug Fixes\n- Fixes an issue where the timer of a custom widget that is not visible will run slower than it's visible counterpart.\n- Fixes an issue where plugged in cameras were not being reported as connected to a station, and camera configuration updates were failing intermittently.\n- Note for Intel-Based Macs running Player, they will remain to Player 2.9.0. Read more here\nFull List of Ticket ID included in Release\nIf you are tracking any of these tickets and would like more details, please contact Tulip Customer Support via support@tulip.co or live chat through your instance.\n- PLAT-47552\n- PLAT-47791\n- PLAT-47824\n- PLAT-47896\n- PLAT-47965\n- PLAT-48264\n- PLAT-49702\n- PLAT-48742","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.9.1","version":0,"site":"https://tulip.co/","source":"Tulip","license_or_tos":"Proprietary","resources":null,"verified":false}