{"appId":"w:TweakNow.AutoDark","appShortcutName":"TweakNow AutoDark","appDisplayName":"TweakNow AutoDark","authorId":"w:winget","releaseTagName":"winget-1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://tweaknow.com/Downloads/AutoDark100.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"TweakNow AutoDark is a lightweight, free tool that automatically switches between light and dark mode on Windows 11 based on your preferred schedule.\n\nTweakNow AutoDark is a lightweight, free tool that automatically switches between light and dark mode on Windows 11 based on your preferred schedule. Whether you like the bright look during the day or the sleek dark theme at night, AutoDark makes the transition seamless—so you don’t have to change it manually. It even delays theme switching while you’re running a full-screen app or game to avoid interruptions, and can change wallpapers to match your theme for a smooth, consistent desktop experience.\n\nThis simple app is designed to give you a taste of what’s possible with our powerful desktop customization suite. If you enjoy AutoDark, explore TweakNow WinSecret Plus for advanced Windows tweaks, deeper customization, and many more features that let you take full control of your PC.\n\nWhy Use TweakNow AutoDark?\n- Automatic Theme Switching: No need to dig into Windows settings every morning or night. TweakNow AutoDark does it for you.\n- Distraction-Free Gaming & Full-Screen Mode: The app intelligently delays switching while you’re running a full-screen app or game, so your experience isn’t interrupted.\n- Wallpaper Sync: AutoDark can also change your wallpaper to match your current theme, keeping your desktop consistent and stylish\n- Lightweight & Free: Unlike many bloated utilities, TweakNow AutoDark is small, fast, and completely free to use.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0.0","version":0,"site":"https://www.tweaknow.com/","source":"TweakNow.com","license_or_tos":"Freeware","resources":null,"verified":false}