{"appId":"w:ValentinSoftware.PVSOL.Premium.2026","appShortcutName":"PVSOL premium 2026","appDisplayName":"PVSOL premium 2026","authorId":"w:winget","releaseTagName":"winget-2026.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.valentin.de/pvsol/setup_pvsolpremium_2026_3.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The design and simulation software for photovoltaic systems – with 3D visualization and detailed shading analysis.\n\nWith PV*SOL premium, the industry standard for photovoltaic design software, you can design and simulate all types of modern PV systems. From small rooftop systems with to medium-sized systems on commercial roofs to solar parks - PV*SOL premium supports you with numerous tools for design and simulation.\nThe unique 3D visualization is the highlight of PV*SOL premium. You can visualize all common types of systems in 3D, whether roof-integrated or roof-mounted, whether on small angled roofs, large industrial halls or open spaces - with up to 7,500 mounted modules or up to 10,000 roof-parallel modules - and calculate the shading based on 3D objects. With the realistic shading from surrounding objects, you can achieve the highest reliability for your yield forecast.\nAll other design types from PV*SOL are of course also available in PV*SOL premium. Whether calculating self-consumption, designing battery storage or integrating electric vehicles - with PV*SOL premium you can implement all customer wishes in no time at all.\nOur extensive product database includes over 26,000 PV modules, 7,500 inverters, 5,500 battery systems and many other products such as electric vehicles and performance optimizers. It is updated regularly by the product manufacturers themselves, so you can always work with the latest data.\nYou can generate high-quality project reports for your customers that can be edited as required. Circuit diagrams with the necessary safety devices can also be created, e.g. for submission to the relevant authorities.\nThe current feed-in tariffs are available in our database for the calculation of economic efficiency. By adding the information to the system costs, you will receive a detailed economic analysis of the system over 20 years. This allows you to create an initial offer in just a few minutes.\nPV*SOL premium is available in German 🇩🇪, English 🇬🇧, Spanish 🇪🇸, French 🇫🇷, Italian 🇮🇹, Polish 🇵🇱, Czech 🇨🇿, Portuguese 🇵🇹 and Turkish 🇹🇷. And with project reports available in 23 languages, language barriers are a thing of the past.\nOur technical support team and our help pages offer you assistance with your questions. In our forum you can address more complex questions to our team and other PV*SOL premium users.\nThe following bugs have been fixed:\n- No new manual configurations could be made in the 3D planning.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2026.3","version":0,"site":"https://valentin-software.com/en/","source":"Valentin Software GmbH","license_or_tos":"Proprietary","resources":null,"verified":false}