{"appId":"w:VentoByte.Proxifier","appShortcutName":"Proxifier","appDisplayName":"Proxifier","authorId":"w:winget","releaseTagName":"winget-4.14","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.proxifier.com/download/ProxifierSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Proxifier allows network applications that do not support working through proxy servers to operate through a SOCKS or HTTPS proxy and chains.\n\nProxifier allows network applications that do not support working through proxy servers to operate through a SOCKS or HTTPS proxy or a chain of proxy servers.\nWith Proxifier, you can easily tunnel all a system’s TCP connections or only those you select.\n\nProxifier allows you to\n- run any network application through a proxy server. The software requires no special configuration, and the entire process is completely transparent\n- access the internet from a restricted network through a proxy server gateway\n- bypass firewall restrictions\n- \"tunnel\" the entire system (force all network connections, including system connections, to work through a proxy server)\n- resolve DNS names through a proxy server\n- use flexible Proxification Rules with hostname and application name wildcards\n- ensure privacy by hiding your IP address\n- work through a chain of proxy servers using diverse protocols\n- view real-time information on current network activities (connections, hosts, times, bandwidth usage, etc.)\n- maintain log files and traffic dumps\n- get detailed reports on network errors\n- and much more!\nSpecifications:\n- Proxy protocols: SOCKS4, SOCKS4A, SOCKS5, HTTPS, and HTTP (HTTP connections only)\n- Authentication: SOCKS5 username/password authentication (RFC 1929), HTTP Basic, NTLM (including transparent mode), Kerberos\n- Full IPv6 support\n- Full 64-bit application and system support\n- Profile password encryption up to AES 256 bit\n- Windows 7/8/10/11, Server 2008/2012/2016/2019/2022\n- Maintenance update\n- Profile Auto Update feature URL problem fixed\n- Minor performance issues fixed","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.14","version":0,"site":"https://ventobyte.com/","source":"VentoByte SL","license_or_tos":"Proprietary","resources":null,"verified":false}