{"appId":"w:Vijua.KotobeeAuthor","appShortcutName":"Kotobee Author","appDisplayName":"Kotobee Author","authorId":"w:winget","releaseTagName":"winget-1.9.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.kotobee.com/author/releases/kotobeeauthor-1.9.2-win64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Create and edit remarkable interactive ebooks with Kotobee's award-winning interactive ebook software and EPUB creator.\n\n\nSimplified Menu Layout and a New Preferences Window\nKotobee Author now features a redesigned menu layout for a cleaner and more user-friendly experience. In addition, a new Preferences window has been added to give you a centralized hub for adjusting interface settings and performance options to suit your workflow.\nMore Visualizer Animations\nKotobee Reader now supports four different visualizer animations that appear when playing audiobooks. Each animation style responds dynamically to audio playback, giving users a more engaging listening experience.\n\nAdd the Publisher’s URL in Book Info\nYou can now add a publisher's website to your book’s metadata. When readers view the book’s details, the website will appear as a clickable link.\n\nReview Management Enhancements\nDefault Visibility Settings for Reviews\nYou can now set whether new reviews are published by default or remain hidden until approved. When set to unpublished by default, the review notification email will include a direct “Publish” link, allowing you to approve the review with a single click, without needing to open Kotobee Author.\n\nUnpublish and Republish Reviews\nPreviously, removing a review meant deleting it permanently. Now you can unpublish reviews directly from Kotobee Author, with the option to republish them later if needed.\nNotification Emails for New Reviews\nWhen a new review is submitted, the library or cloud ebook owner now receives an email notification. These emails include the review content and the book rating.\nExport Reviews to XLS\nAll reviews can now be exported as an XLS file, allowing you to analyze or archive them externally.\nExport Assigned Books and Categories\nThe XLS export feature for library users has been updated to include two additional columns:\n- Assigned Books: Lists the IDs of books assigned to each user.\n- Assigned Categories: Lists the IDs of categories each user can access.\nThis enhancement makes it easier to manage access permissions and perform external audits or data analysis.\nBook Info Display Options\nA new library customization option enables you to display the book information (such as title, author, and publisher) to appear as inline wrapped text beneath its thumbnails rather than on separate lines. This helps maintain a compact and visually consistent layout.\nAudiobook Duration Display\nA new library customization option enables you to display the book information (such as title, author, and publisher) to appear as inline wrapped text beneath its thumbnails rather than on separate lines. This helps maintain a compact and visually consistent layout.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.9.2","site":"https://www.vijua.com/","source":"Vijua, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}