{"appId":"w:Vijua.KotobeeAuthor","appShortcutName":"Kotobee Author","appDisplayName":"Kotobee Author","authorId":"w:winget","releaseTagName":"winget-1.9.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.kotobee.com/author/releases/kotobeeauthor-1.9.4-win64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Create and edit remarkable interactive ebooks with Kotobee's award-winning interactive ebook software and EPUB creator.\n\n\nNew Admin Dashboard Access\nA redesigned dashboard is now available at www.kotobee.com/login that gives you a clearer view of your Kotobee account information. From one place, you can check your serial number, review your licenses and active subscriptions, and access all your account details.\nNew Question Type: Ordering\nThis question type presents users with a list of words or phrases that need to be arranged in a certain order. You can choose to display the items horizontally or vertically. A correct score is awarded only when the full sequence is arranged properly. This can be useful for activities such as placing historical events in order, arranging procedural steps, or sequencing story elements for children.\nNew Question Type: Fill in the Blanks\nThe Fill in the Blanks question type lets authors create sentences or short paragraphs with one or more missing words. Learners must type in the correct answers to complete the sentence. This format is perfect for language learning or any activity that requires users to recall specific terms.\nDrag-and-Drop in Matching Questions\nMatching questions now support drag-and-drop, allowing users to move items from one column to the other rather than clicking to form pairs.\nEPUB Validation Auto-Fix\nA new auto-fix option is now available when exporting your ebook to EPUB. It automatically corrects common validation issues, such as missing attributes or broken links, making the export process smoother and faster.\n\nCustom User Registration Fields\nAlongside the standard registration fields (Name, Date of Birth, Country, etc.) available in libraries and cloud ebooks, you can now create your own custom fields. Each field can be named as you wish, and you can choose whether it accepts open text or a set of predefined options from a dropdown menu.\nImproved Text-to-Speech\nReaders can now listen to the ebook’s text using Google’s Text-to-Speech engine, which delivers clearer, more natural narration with a wide range of languages supported. This feature works for hosted ebooks, cloud ebooks, and ebooks in your Kotobee Library, and it requires an internet connection. It’s especially useful for accessibility needs, language-learning ebooks, and early-reading educational materials.\nNew Page Flip Transition\nThe new Page Flip transition provides a realistic, book-like page-turn animation. When enabled, pages appear to curl and turn as they would in a physical book. This transition is particularly suitable for fixed-layout ebooks and children’s picture books, where visual continuity and page presentation are important.\n\nAnalytics Tab\nAll analytics-related settings have been reorganized into their own tab, making it much easier to configure tracking options without sorting through unrelated settings.\nUbuntu Version of Kotobee Author Returns\nLinux/Ubuntu users can now download Kotobee Author again, opening the door for educators and institutions using open-source environments.\nDragging to Scroll Horizontal Lists\nLibraries that display books in horizontal rows can now be scrolled by dragging left or right, making browsing smoother for both desktop and mobile users.\nTrim Long Book Titles\nYou can now choose to display book titles over two wrapped lines or trim them for a shorter appearance. This is especially helpful for libraries with long academic or multi-part titles.\nLibrary Storage Usage Display\nYour library dashboard now shows the total storage used by all ebooks. This helps you plan usage and avoid surprises if you manage a large catalog, especially when working with rich media or audiobooks.\nBook Ratings Under Thumbnails\nYou can now display a book’s average rating beneath its thumbnail, making it easy for readers to see how others have rated it at a glance.\nCategory-Specific Book Sorting\nSorting ebooks is no longer limited to a single global order. Authors can now set a different sorting order for each category an ebook belongs to. For example, a title can appear first within the Biology category, while appearing last in the Science category.\nInstant Category Filtering\nWhen you click a category that is assigned to an ebook library in Kotobee Author, the view now filters immediately to display all books in that category. This helps authors quickly navigate and organize collections, which can be especially useful when working with multiple categories or large catalogs.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.9.4","version":0,"site":"https://www.vijua.com/","source":"Vijua, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}