{"appId":"w:Vijua.KotobeeReader","appShortcutName":"Kotobee Reader","appDisplayName":"Kotobee Reader","authorId":"w:winget","releaseTagName":"winget-1.9.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Open interactive ebooks and audiobooks on any device with sleek design and rich multimedia features.\n\nOpen interactive ebooks and audiobooks on any device with sleek design and rich multimedia features.\n\nEPUB & KPUB Compatibility: Kotobee Reader is fully compatible with both the EPUB format, the industry standard for ebooks, and KPUB, Kotobee's own format for interactive content.\nInteractive Content Support: Kotobee Reader allows users to read interactive ebooks, providing access to multimedia elements including videos, audio, quizzes, and interactive images.\nMulti-Device Compatibility: Read on any device—whether it’s your tablet, smartphone, or desktop. Kotobee Reader ensures you can enjoy your favorite books on the go.\nFlexible Reading Modes: Whether you prefer single-page, double-page, or scroll view modes, Kotobee Reader offers flexible viewing options to suit your reading style and preferences.\nEnhanced Reading Controls: Take full control of your reading experience with font-size adjustments, zooming, and a variety of navigation tools designed to maximize your comfort and ease of use.\nGlobal Language Support: Kotobee Reader supports over 18 languages, making sure your ebooks are accessible to readers from all around the world.\nCustomizable for Your Brand: Personalize Kotobee Reader to reflect your brand. With white-labeling options, bundle the reader with your ebook into one single app, creating a professional, branded interface for your audience.\nEncrypted EPUB Support: Kotobee Reader supports encrypted EPUB files, created using Kotobee Author, ensuring your ebooks are secure and can only be opened with a user-specified password, providing an additional layer of security for your content.\nAudiobook Integration: Immerse yourself in audiobooks created with Kotobee Narrator. Kotobee Reader provides a smooth and easy listening experience for your favorite audiobooks.\nSupport for new question types: fill in the blanks, order the items. Improved page transition effect. Miscellaneous fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.9.4","version":0,"site":"https://www.vijua.com/","source":"Vijua, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}