{"appId":"w:VirtualGL.TurboVNC","appShortcutName":"TurboVNC","appDisplayName":"TurboVNC","authorId":"w:winget","releaseTagName":"winget-3.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/TurboVNC/turbovnc/releases/download/3.3/TurboVNC-3.3.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-speed, 3D-friendly, TightVNC-compatible remote desktop software\n\nTurboVNC is a high-performance, enterprise-quality version of VNC based on TightVNC, TigerVNC, and X.org.\nIt contains a variant of Tight encoding that is tuned for maximum performance and compression with 3D applications (VirtualGL), video, and other image-intensive workloads.\nTurboVNC, in combination with VirtualGL, provides a complete solution for remotely displaying 3D applications with interactive performance.\nTurboVNC's high-speed encoding methods have been adopted by TigerVNC and libvncserver, and TurboVNC is also compatible with any other TightVNC derivative.\nSignificant changes relative to 3.3 beta2:\n1. For compatibility with OpenSSH, the TurboVNC Viewer's built-in SSH client now disables multi-hop/multi-level SSH tunneling if a case-insensitive argument of none is specified for the ProxyJump OpenSSH config file keyword. This is useful in conjunction with wildcard Host entries.\n2. The TurboVNC Viewer's built-in SSH client now prints an SSH debugging message, rather than throwing a fatal error, if it cannot parse an entry in the SSH known hosts file. This mimics the behavior of OpenSSH.\n3. The TurboVNC Server now includes various security fixes (CVE-2025-26594, CVE-2025-26595, CVE-2025-26596, CVE-2025-26597, CVE-2025-26598, CVE-2025-26599, CVE-2025-26600, CVE-2025-26601, CVE-2025-49175, CVE-2025-49176, CVE-2025-49178, CVE-2025-49179, CVE-2025-49180, CVE-2025-62229, CVE-2025-62230, and CVE-2025-62231) from the xorg-server 21.1.x code base.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.3","version":0,"site":"https://turbovnc.org/","source":"The VirtualGL Project","license_or_tos":"GPL-2.0","resources":null,"verified":false}