{"appId":"w:VoiceAttack.VoiceAttack","appShortcutName":"VoiceAttack","appDisplayName":"VoiceAttack","authorId":"w:winget","releaseTagName":"winget-2.1.7","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://voiceattack.com/filesend.aspx?id=voiceattackinstaller_2.1.7.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"VoiceAttack is the premier voice control and macro creation system for your Windows games and applications.\n\nVoiceAttack is the premier voice control and macro creation system for your Windows games and applications. Take a look at just a few elements from VoiceAttack's substantial set of features:\n\nControl Your Games and simulators With Your Voice\nAdd your voice as an extra controller with voice commands that YOU create. Give specific instructions to your space freighter, your race pit crew, your 'mech or your druid and give life and immersion to your games like never before.\n\nAlso Control Your Apps\nLaunch and control applications with phrases you can actually remember. \"Launch Skype\" or \"Launch Spotify\" without even touching the keyboard or mouse. VoiceAttack even works great along side your favorite voice chat apps like TeamSpeak and Ventrilo.\n\nCreate Crazy-Powerful Macros\nFrom simple, single key presses from a keyboard to mouse clicks to full-blown virtual conversations using text-to-speech, many have found ways to make their PCs easier and way more fun to use in unprecedented ways.\n\nVirtual Reality: The Time Is Now\nMany are pairing VoiceAttack with devices such as the HTC Vive, Oculus Rift and Leap Motion. The extra depth and immersive experience of voice control take virtual reality to a new level [especially when you can't see your hands].\n\nPlay Sounds and/or Music\nReceive audible confirmation from your commands or fire up a random selection from your favorite tunes. You can pick random sounds from a defined list or even a directory full of .wav, .mp3, .aac, .ogg or .flac files.\n\nNot Just Voice Activation - Include Your Hardware\nInvoke your created commands with a click of one or more mouse buttons, the press of joystick buttons or a hotkey combo on your keyboard. Use VoiceAttack to augment or even replace some of that expensive macro-enabled hardware you have been wanting to give away.\n\nDynamic Text-to-Speech Responses\nGive your responses some personality by randomizing them or by using VoiceAttack tokens (inline functions) for some extra flair. Dynamic Response Sections allow you to create extensive and immersive expressions with minimal effort. How nerdy is that?\n\nComprehensive Macro Control\nLoops, control statements, variables, tokens and even a plugin interface. You can even write, compile and share your very own functions using C# or VB .net code within VoiceAttack. It's all there to help you design sophisticated commands to help make your life easier, or your opponents' lives more difficult.\n\nIt's All About the Community\nVoiceAttack has a diverse community of supporters that take VoiceAttack into the many facets of Windows computing. From games and applications, to robotics, to corporate data centers to home automation (and more), there's a good chance that you'll find the support you need to make your project as cool as you want it to be.\n\nTry the Demo\nGive VoiceAttack a try with the VoiceAttack Steam demo. It's all in there to help you get a taste of what will truly change the way you use your PC. Do.It.Now!\n- Improvements\n  -  Added, 'Change Speech Recognition Recording Device' action which will allow you to change your Windows speech recognition recording device from within a command.\n  -  Added link to Options screen that creates a desktop shortcut to the VoiceAttack executable.  This is handy if you are using the Steam version of VoiceAttack and want to bypass the Steam client.\n  -  Added ListeningModeChanged event to the proxy object which is raised if VoiceAttack's listening mode is enabled or disabled.\n  -  Added KeyboardShortcutsModeChanged event to the proxy object which is raised if VoiceAttack's keyboard shortcuts are enabled or disabled.\n  -  Added JoystickShortcutsModeChanged event to the proxy object which is raised if VoiceAttack's joystick shortcuts are enabled or disabled.\n  -  Added MouseShortcutsModeChanged event to the proxy object which is raised if VoiceAttack's mouse shortcuts are enabled or disabled.\n  -  Added various warnings to configuration screens to indicate when device shortcuts and listening are turned off.\n  -  Added visual indication on main screen recognition level bar when speech recognition is turned off.\n  -  Added System.Linq.Expressions.dll as a default assembly reference when creating new inline functions.\n\n- Bug Fixes\n  -  Exposed UI and token support for joysticks 5-8 (doh).\n  -  Fixed main screen audio popup not opening every time if 'x' was clicked.\n  -  Fixed an issue in the settings import where if specific information was missing from a version 1 settings file the import would fail.\n  -  Fixed an issue with the condition builder crashing introduced in the last update.\n  -  Fixed an issue with the Wait for Keypress screen not allowing input for the timeout and integer variable input boxes if key capture was turned on.\n  -  Fixed an issue with the Keypress screen key icons not appearing if 'Variable Keypress' checkbox was checked.\n  -  Fixed an issue where some instances of VR interaction would cause a crash if the 'Get user input' action screens were opened and then closed.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.1.7","version":0,"site":"https://voiceattack.com/","source":"VoiceAttack.com","license_or_tos":"Proprietary (ToS)","resources":null,"verified":false}