{"appId":"w:VovSoft.NetworkAlarmer","appShortcutName":"Vovsoft Network Alarmer","appDisplayName":"Vovsoft Network Alarmer","authorId":"w:winget","releaseTagName":"winget-5.0.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Network Alarmer is a lightweight software created to offer you the ability of verifying availability of various network devices by checking their IP addresses and warning you through automatic phone calls or email messages.\n\nVovsoft Network Alarmer is a lightweight software created to offer you the ability of verifying availability of various network devices by checking their IP addresses and warning you through automatic phone calls or email messages, when something goes off course.\n\nYou can add various IP addresses to the \"PING Hostname List\" and the utility will verify whether or not they are online, informing you of the result with a timestamped notice in the lower part of the window.\n\nIn addition to ping check, the program is also able to check the state of air conditioning machines through user-defined IP, supporting multiple devices at once. You can even set a maximum temperature level which the application should send you a phone call (requires 56K modem) or an instant message (requires alarm script URL).\n\nKey Features:\n- Ping multiple IP addresses or hostnames\n- Ability to fire off external URL or file\n- Ability to dial numbers using fax/modem device\n- Ability to play alert audio file\n- Air conditioner temperature check\n- Manual or regular check\n- Accessible through mobile app\n- Discover local devices\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"5.0.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}