{"appId":"w:VovSoft.SoundRecorder","appShortcutName":"Vovsoft Sound Recorder","appDisplayName":"Vovsoft Sound Recorder","authorId":"w:winget","releaseTagName":"winget-3.3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Sound Recorder helps you record your system sound and microphone with ease. It saves audio from your input device (microphone) or from your output device (loopback recording).\n\nVovsoft Sound Recorder helps you record your system sound and microphone with ease. It saves audio from your input device (microphone) or from your output device (loopback recording).\n\nThis program supports recording the following:\n- System sound (Speaker or microphone not required)\n- Microphone\n- Both (Combined)\n\nThis utility can come in handy when you are interested in quickly capturing your voice with microphone or the sounds played by your desktop or laptop computer even if you don't have any speakers connected.\n\nYou don't have to hold up a microphone to your computer's speakers to record its audio. Even if you don't have a \"Stereo Mix\" option on your PC, you can easily record the sound coming from your Windows PC as WAV or MP3 file.\n\nThis application takes advantage of WASAPI (Windows Audio Session API), which is a built-in Windows sound API that comes pre-installed with Windows. It enables high-quality, low-latency audio recording and playback. It provides direct access to audio devices.\n\nKey Features:\n* Save Full Recording: Stores the entire audio as captured, without any modifications\n* Save Silence-Trimmed Recording: Automatically detects and deletes silent sections before saving\n* Save Split Recordings: Automatically divides the audio into multiple files based on silence\n* Voice recorder\n* Computer sound recorder\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}