{"appId":"w:VovSoft.URLExtractor","appShortcutName":"Vovsoft URL Extractor","appDisplayName":"Vovsoft URL Extractor","authorId":"w:winget","releaseTagName":"winget-2.6.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft URL Extractor is one of the best link extractor programs that can recover http and https web page addresses, emails, ftp links. You can extract and harvest all URLs from files in seconds.\n\nVovsoft URL Extractor is one of the best link extractor programs that can recover http and https web page addresses, emails, ftp links. You can extract and harvest all URLs from files in seconds. Once installed, you can start the application and begin searching for links almost immediately. You only need to provide a directory, as the program can take care of the rest.\n\nThe software scans an entire folder for files that contain links and displays them all within its main window, allowing you to export the list to file. All the options are clear and simple and they all can be placed within the one-window interface. All you need to do is select the files you want the application to analyze and press the \"START\" button. File masks are supported to help you filter files.\n\nThere are a lot of online websites that can extract URLs from files. However they have upload limitations. Vovsoft URL Extractor can scan your directories and files through a user-friendly interface. The best part of the program is that the extraction is done completely offline. You are the only controller of your private data. No file is sent to internet in any case.\n\nThis program has the capability to read and extract URLs from a wide variety of file formats.\n- Plain-text Files: The program can read and process plain-text files. The most popular plain text file extension is TXT. However many extensions are actually plain text files such as CSV, JSON, LOG, XML.\n- PDF Files: The program has the ability to handle PDF (Portable Document Format) files.\n- DOC and DOCX Files: The program can read DOC (Microsoft Word Document) and DOCX (Microsoft Word Open XML Document) files.\n- XLS and XLSX Files: The program can read XLS (Microsoft Excel Spreadsheet) and XLSX (Microsoft Excel Open XML Spreadsheet) files. These formats are used for storing spreadsheet data.\n- EML Files: The program has the capability to decode EML (Internet Message Format) email files.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.6.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}