{"appId":"w:VovSoft.KeepSoftwareAlive","appShortcutName":"Vovsoft Keep Software Alive","appDisplayName":"Vovsoft Keep Software Alive","authorId":"w:winget","releaseTagName":"winget-3.4.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.vovsoft.com/keep-software-alive.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Keep Software Alive ensures uninterrupted application operation by automatically restarting them after crashes or closures.\n\nVovsoft Keep Software Alive ensures uninterrupted application operation by automatically restarting them after crashes or closures.\nSome processes and services are prone to crash, this utility can automatically restarts them. All you have to do is set \"check interval\" in seconds and select the applications you wish to restart. You can also include command line start parameters. The utility is built for system administrators and power users. Using this utility you can minimize application stoppages. It runs on Windows XP, Vista, 7, 8, 8.1, 10, 11 and Windows Server editions.\n\nUsers who rely heavily on certain vital applications will be able to use this simple program that maintains processes up and running and can even perform scheduled interval checks and restart the required processes following crashes or failures.\n\nThe sole purpose of this software is to restart processes or services that are not running or not responding. First, you need to add processes for the software to monitor. Once you tell the software to monitor a currently running process, it will watch it, but it won't react until the process hangs or exits. When a process the software is watching becomes unresponsive or exits for any reason, whether it was closed properly or not, the program will restart it. This software is able to watch multiple processes/services at once.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.4.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}