{"appId":"w:VovSoft.SilenceRemover","appShortcutName":"Vovsoft Silence Remover","appDisplayName":"Vovsoft Silence Remover","authorId":"w:winget","releaseTagName":"winget-1.2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Silence Remover is a Windows software designed to simplify audio editing by automatically removing unwanted pauses and silent segments from your recordings.\n\nVovsoft Silence Remover is a Windows software designed to simplify audio editing by automatically removing unwanted pauses and silent segments from your recordings. Whether you’re a podcaster striving for smooth narration or a vlogger aiming for seamless video voiceovers, Silence Remover helps you achieve professional-quality results effortlessly.\n\nLong silences and pauses in audio can disrupt the flow of your content, making it less engaging for listeners. Silence Remover automates the tedious process of identifying and removing these pauses, allowing you to focus on creating content that captivates your audience.\n- Batch Processing: Save time by processing multiple audio files in one go. Ideal for projects involving large volumes of recordings.\n- Wide Format Support: Compatible with popular audio file formats, including MP3 and WAV.\n- Offline Functionality: No internet connection required—Silence Remover works entirely offline, ensuring privacy and consistent performance.\n- Unlimited File Length: Process audio files of any duration without limitations, making it perfect for lengthy podcasts, interviews, or audiobooks.\n- Customizable Silence Detection: Adjust the threshold decibel (dB) value to fine-tune silence detection and set the minimum pause duration for removal. This level of customization ensures precise results tailored to your needs.\n- Fast and Efficient Workflow: Quickly process audio files while maintaining high-quality output, enhancing your productivity.\n\nWho Can Benefit from Silence Remover?\n- Podcasters: Create polished, engaging episodes by removing distracting pauses.\n- Vloggers: Maintain audience attention by cutting out unnecessary silences in voiceovers.\n- Audiobook Creators: Deliver seamless narration with no awkward gaps.\n- Anyone Working with Audio: From music producers to content creators, anyone who wants cleaner, more professional audio can benefit from Silence Remover.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}