{"appId":"w:VovSoft.AutoMouseClicker","appShortcutName":"Vovsoft Auto Mouse Clicker","appDisplayName":"Vovsoft Auto Mouse Clicker","authorId":"w:winget","releaseTagName":"winget-2.5.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Auto Mouse Clicker is a simple and straightforward desktop clicker software that automates mouse clicks.\n\nVovsoft Auto Mouse Clicker is a simple and straightforward desktop clicker software that automates mouse clicks. With this program, you can automate your workflow, increase productivity, and save time by eliminating the need to perform tedious tasks manually.\n\nThis program can simulate left, right and middle mouse button clicks on any window, and frees users from repetitive click work. The software maps the screen based on the coordinates to ensure that it clicks precisely where the user wants it.\n\nWhether you're a gamer, or a professional who needs to perform repetitive tasks on a regular basis, Vovsoft Auto Mouse Clicker can help you achieve your goals quickly and easily. This software can be used to automate a wide range of tasks, such as clicking on buttons, and navigating web pages.\n\nThere is nothing as boring as clicking thousands of times while playing your favorite games to complete certain tasks. Attacking enemies, building structures, and more tasks need a lot of clicks can waste your time and make you get bored, they can even cause wrist pain and harm your mouse. Some games can force you to click on the same point hundreds of times. What you need and what you have been looking for is a software that enables you to create automatic clicks as many times as you want.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.5.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}