{"appId":"w:VovSoft.CreateImageGallery","appShortcutName":"Vovsoft Create Image Gallery","appDisplayName":"Vovsoft Create Image Gallery","authorId":"w:winget","releaseTagName":"winget-2.0.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Quickly and easily create image galleries. You can either use the default settings or fine-tune the gallery to your needs using available options. Drag and drop the image files and create photo galleries.\n\nQuickly and easily create image galleries. You can either use the default settings or fine-tune the gallery to your needs using available options. Drag and drop the image files and create photo galleries.\n\nCreate custom image galleries with this specialized application that offers drag-and-drop functionality and custom size for the thumbnails.\n\nPresenting some graphical content can go beyond the classical slideshows, presentations or simply toggling between the actual images. An elegant solution might involve the use of thumbnails for constructing a so-called clickable gallery (zoom and navigate using left and right arrows). This is exactly what Vovsoft Create Image Gallery will do for you. Thanks to a dedicated thumbnail size customizer, it can help you \"whip-up\" a presentable HTML-based image gallery in just a few mouse clicks.\n\nMobile-Friendly HTML Generation: The software generates mobile-friendly HTML code, ensuring seamless functionality and an immersive experience across all devices, including desktop, smartphones and tablets.\n\nSingle File HTML Output: Simplify distribution and sharing with single file HTML output, in addition to your image files. Without the need for complex folder structures.\n\nImage Formats: All popular image formats are supported such as JPEG, PNG, WEBP, GIF, TIFF, BMP.\n\nThe Image Links setting lets you choose what happens when someone clicks on an image in your gallery. You can disable links completely with No Link, open the image directly in the Same Tab, or launch it in a New Tab for easier navigation. For a more interactive experience, you can also enable the Popup option, which displays the image in a stylish overlay without leaving the current page.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}