{"appId":"w:VovSoft.VoiceChanger","appShortcutName":"Vovsoft Voice Changer","appDisplayName":"Vovsoft Voice Changer","authorId":"w:winget","releaseTagName":"winget-1.4.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Voice Changer is a free audio enhancer and voice modifier tool that lets you add special sound effects to your recordings. There is a simple user interface where you can select the file and make any alterations you wish.\n\nVovsoft Voice Changer is a free audio enhancer and voice modifier tool that lets you add special sound effects to your recordings. There is a simple user interface where you can select the file and make any alterations you wish. It also has the ability to play the tracks and export in various formats.\n\nWhen you have selected the track, you will see a large selection of effects appear. While the name of the software implies you can only use voice recordings, it is worth noting that any audio files are compatible, even music. Before you can start using Vovsoft Voice Changer, you will need to select a track you want to enhance or alter. You can opt for a voice recording, or you can use a song. With the recording at hand, you can open the panel for special effects. When you have selected the one you want to use, you can play it back to test how it sounds in case you want to try something else.\n\nYou don't need to accept the built-in effects in Vovsoft Voice Changer if it doesn't completely meet your needs. When you open up the \"Custom\" setting, you can play with elements to change the output. If you do it right, you may be able to find a unique sound for your voice or track that no one else has created yet.\n\nFinally, you will need to save your file so you don't lose it. The export options are .WAV and .MP3. Vovsoft Voice Changer is ideal if you want to add some cool sound effects and filters to your voice and tracks, especially for streaming on Twitch or YouTube. While you can only use it after a recording is complete and not live, you have several editing options at your disposal.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.4.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}