{"appId":"w:VovSoft.PasswordGenerator","appShortcutName":"Vovsoft Password Generator","appDisplayName":"Vovsoft Password Generator","authorId":"w:winget","releaseTagName":"winget-2.2.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Password Generator is one of the programs you can rely on, a very simple utility that enables you to create passwords for your accounts with just a couple of clicks. It is an easy to use tool that can generate memorable passphrases.\n\nVovsoft Password Generator is one of the programs you can rely on, a very simple utility that enables you to create passwords for your accounts with just a couple of clicks. It is an easy to use tool that can generate memorable passphrases. Once you have installed the program, you can start creating passwords right away, as several character sets (integers, lowercase letters, uppercase letters) have already been entered for your convenience. If all you need to do is come up with a complex, unique password for one of your accounts, this application should be enough to get the job done. You can customize the key length, as well as remove any of the default character sets or add your own. This tool also showcases password quality through entropy, where, for instance, 128 bits can be considered secure.\n\nThe \"Copy\" button allows you to manually copy the generated password to the clipboard, while the \"Automatically Copy Generated Password\" setting saves you time by instantly copying each new password to the clipboard as soon as it’s created, eliminating the need for manual copying.\n\nIf you need to generate multiple passwords at once, you can try this software. Using the menu next to the \"Generate\" button, you can create thousands of secure password and save them as a text file on your computer.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}