{"appId":"w:VovSoft.FileSplitterAndJoiner","appShortcutName":"Vovsoft File Splitter And Joiner","appDisplayName":"Vovsoft File Splitter And Joiner","authorId":"w:winget","releaseTagName":"winget-2.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft File Splitter And Joiner is an easy to use tool to quickly split and combine files. You can split one large file into multiple smaller files. You can also merge the small chunks and create the original large file again.\n\nVovsoft File Splitter And Joiner is an easy to use tool to quickly split and combine files. You can split one large file into multiple smaller files. You can also merge the small chunks and create the original large file again.\n\nThe application can be used to split large files, such as a 10 GB file, into smaller files. This enables users to conveniently save the files on USB devices. You can specify the maximum file size, which can be handy for backing up to specific sizes such as CD, DVD, Blu-ray, FAT32, or floppy disk. The split files can then be joined to recreate the original file, the merging process is very quick and it does not stress CPU, neither does the splitting process. This program works pretty fast, as it can optimize disk-cache and memory usage, this makes it faster than many splitter-joiner and compression programs. In addition, this software supports very long path and file names (longer than 260 characters).\n\nThis utility provides both file splitter and file joiner functionality. You will be able to divide any file by using this tool. When you divide a file you can choose the file size of the parts. Output file extensions will be formatted as .001, .002, .003... You can glue them back together with ease. Select your files and the program will join the whole series with one click and you can use the full file as usual.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.1.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}