{"appId":"w:VovSoft.TextFilter","appShortcutName":"Vovsoft Text Filter","appDisplayName":"Vovsoft Text Filter","authorId":"w:winget","releaseTagName":"winget-1.1.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Text Filter is a simple yet powerful Windows software designed to help users filter lines within a text file based on multiple conditions.\n\nVovsoft Text Filter is a simple yet powerful Windows software designed to help users filter lines within a text file based on multiple conditions. Whether you're working with logs, code files, or large datasets, this tool allows you to quickly refine text by extracting specific lines based on custom rules.\n\nWith multiple filtering modes—Starts with, Ends with, Contains, Lacks, and RegEx—you have full control over how lines are included or excluded. Each filtering mode also includes an optional Case-Sensitive setting, ensuring precision when working with case-dependent text.\n\nKey Features:\n* Advanced Line Filter – Filter text lines using:\n  - Starts with – Keep only lines that begin with a specific word or phrase.\n  - Ends with – Extract lines that end with a certain term.\n  - Contains – Find lines that include a specific keyword.\n  - Lacks – Remove lines that contain unwanted text.\n  - Regular Expressions (RegEx) – Use powerful pattern matching for advanced text processing.\n* Case Sensitivity Option – Apply case-sensitive filtering to each rule individually.\n* Drag-and-Drop File Support – Easily open files by dragging them directly from Windows Explorer into the application.\n* Save Filtered Results – After applying filters, you can save the extracted content as a new file for further processing or analysis.\n* Automatic Encoding Detection – Supports multiple text encodings, including:\n  - ANSI\n  - UTF-8\n  - UTF-16\n  - Auto-detects encoding to ensure compatibility with different file types.\n\nThis program offers an efficient and user-friendly solution for analyzing log files, extracting key details, processing structured data, and cleaning up big text files.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}