{"appId":"w:VovSoft.DocumentManager","appShortcutName":"Vovsoft Document Manager","appDisplayName":"Vovsoft Document Manager","authorId":"w:winget","releaseTagName":"winget-2.0.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Document Manager can provide easy access to your documents on your desktop or laptop PC. You can manage Word, Excel, Powerpoint and PDF files in one screen. You can also customize the filetypes you wish to manage.\n\nVovsoft Document Manager can provide easy access to your documents on your desktop or laptop PC. You can manage Word, Excel, Powerpoint and PDF files in one screen. You can also customize the filetypes you wish to manage.\n\nNo matter if you are an expert or a beginner, you can still make the most of this application, since it requires no technical skills.\n\nBasically, you only need to select the directory where you store your documents, then leave all the work to Vovsoft Document Manager as it groups them according to their file types.\n\nYou can easily explore your Word, Excel, PowerPoint and PDF files. Additionally, you can create a custom category where you can define the formats you are most interested in.\n\nNot only can you get a list of all the files that match a certain sorting criterion, you can also right-click a file and gain access to some extra actions.\n\nYou can open the document in its default associated software, rename it, remove it from the list or you can erase it from your Windows PC without needing to access its folder. You can copy the files or the filenames to the clipboard so you can paste them later on. File lists can be exported to TXT or CSV so you can examine them more thoroughly at a later time.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}