{"appId":"w:VovSoft.WatermarkVideo","appShortcutName":"Vovsoft Watermark Video","appDisplayName":"Vovsoft Watermark Video","authorId":"w:winget","releaseTagName":"winget-2.2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Watermark Video is an easy to use Windows application designed to protect your video content with customizable watermarks.\n\nVovsoft Watermark Video is an easy to use Windows application designed to protect your video content with customizable watermarks. Whether you're a content creator, marketer, or simply want to personalize your videos, this software offers a user-friendly solution.\n\nSocial media lets you share videos; including YouTube, Instagram, Facebook, Twitter, etc. The freedom and flexibility the Internet provides you with come with a downside, namely the fact that your creations are constantly at risk. This is because, if measures are not taken, they can be claimed by people who actually have nothing to do with them. One simple way of staying out of harms way is to protect your work with a watermark, which makes your copyright more difficult to infringe.\n\nThis tool supports adding:\n- Text watermark\n- Image watermark\n- Both text watermark and image watermark\n\nThe software supports batch processing, which means you can add as many clips as you want. Selecting an output directory is the next thing you need to take care of, and last but not least, you are allowed to indicate the most suitable file format of your watermarked clip. One of the standout features of the software is its extensive video format support. It seamlessly handles popular video formats such as MP4, MKV, AVI, MPEG, MOV, WMV, FLV, and F4V, ensuring compatibility with a wide range of video files.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}