{"appId":"w:VovSoft.TreeNotes","appShortcutName":"Vovsoft Tree Notes","appDisplayName":"Vovsoft Tree Notes","authorId":"w:winget","releaseTagName":"winget-2.6.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Tree Notes is a hierarchical note-taking application designed to enhance your organizational efficiency and streamline your information management process.\n\nVovsoft Tree Notes is a hierarchical note-taking application designed to enhance your organizational efficiency and streamline your information management process. This powerful software provides users with a user-friendly platform to create, organize, and access their notes effortlessly.\n\n- Hierarchical Structure: Organize your thoughts, ideas, and information seamlessly using a hierarchical structure. Create a tree-like arrangement of notes, allowing you to categorize and subdivide your content for a clear and intuitive overview.\n- Search: Find information with Tree Notes' robust search functionality. Quickly locate specific notes within the hierarchical structure, saving valuable time.\n- Rich Text Editing: Enjoy a versatile note-taking experience with rich text editing capabilities. Format your notes with bold, italics, underline, bullet points, and more. Customize fonts and styles to create visually appealing and easily readable content.\n- Add Images: Enrich your notes visually by inserting images (JPG, PNG, BMP) directly into your documents. Whether you're attaching reference screenshots, diagrams, or photos, this feature helps bring more clarity and context to your notes\n- Single File Storage: Simplify data management by storing all your notes in a single file. This not only ensures easy backup and portability but also promotes a tidy and efficient workspace.\n- Import & Export: You have the flexibility to import your notes in either DOCX (Microsoft Word), RTF (rich text) or TXT (plain text) formats. Additionally, you can export your notes in DOCX, RTF and TXT formats as well.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.6.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}