{"appId":"w:VovSoft.DesktopDiary","appShortcutName":"Vovsoft Desktop Diary","appDisplayName":"Vovsoft Desktop Diary","authorId":"w:winget","releaseTagName":"winget-3.0.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Desktop Diary is a handy journal application that enables you to lock your personal account with a password, preventing others from accessing your private data.\n\nVovsoft Desktop Diary is a handy journal application that enables you to lock your personal account with a password, preventing others from accessing your private data. You can use it to write your memories, as well as save important appointments. It's a daily journal software for Windows that allows you to save your daily notes efficiently on your desktop or laptop computer.\n\nThis diary writing app for PC makes it simple to write and manage your memories or appointments.\n\nThe main window includes a calendar that can be used to navigate between dates / entries, and the built-in search function can make this task even easier. The program has a wide variety of themes and lets you choose between any of the fonts installed on your system, as well as change text style and background.\n\nThe text can be formatted as you wish, by adjusting the alignment, inserting a bulleted list, numbered list or modifying the font's size, type and color. You can also insert images, switch between bold, italic, underline and strikeout using either your mouse cursor, or using the well-known associated hotkey combinations.\n\nMultiple user accounts can be created, and it is not possible to access the stored information without first providing the right password. Additionally, the application allows you to create encrypted backups, so you can always restore your data if necessary.\nIf you plan to move to a different computer, you can export the data within seconds, and importing the records can be done just as easily. Vovsoft Desktop Diary is an offline digital diary software for Windows, you are the only controller of your private data. No diary information is sent to internet in any case.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.0.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}