{"appId":"w:VovSoft.MergeXMLFiles","appShortcutName":"Vovsoft Merge XML Files","appDisplayName":"Vovsoft Merge XML Files","authorId":"w:winget","releaseTagName":"winget-1.5.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.vovsoft.com/merge-xml-files.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Merge XML Files is a user-friendly software for combining multiple XML documents into one large one. You can combine XML files by using this compact and lightweight XML file combiner software.\n\nWorking with XML files can sometimes require merging operations; achieving such an outcome might require the use of a dedicated tool for combining them. This utility is designed to allow users to join XML files with ease, escaping the trouble of going through some potentially complex undertakings.\n\nMerge XML Files is a user-friendly software for combining multiple XML documents into one large one. You can combine XML files by using this compact and lightweight XML file combiner software.\n\nEasily concatenate your Extensible Markup Language (XML) files with the help of this compact merger app that offers minimalist functionality.\n\nUsers will be able to add their XML files for performing the merging operation using the application's navigation feature, which allows them to browse the containing directory.\n\nHaving loaded all their preferred XML files, users will be able to export the resulting file in just two mouse clicks, using either the dedicated button or the feature in the provided menu. Without carrying too much fuss and extra features, this software will allow you to merge your XML files in just a few seconds.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.5.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}