{"appId":"w:VovSoft.SpreadsheetCombiner","appShortcutName":"Vovsoft Spreadsheet Combiner","appDisplayName":"Vovsoft Spreadsheet Combiner","authorId":"w:winget","releaseTagName":"winget-1.3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Spreadsheet Combiner is an efficient software designed to streamline the process of merging multiple Excel files effortlessly.\n\nVovsoft Spreadsheet Combiner is an efficient software designed to streamline the process of merging multiple Excel files effortlessly. The software supports various file formats including CSV, XLS, and XLSX, ensuring compatibility with a wide range of spreadsheets commonly used across different platforms such as Microsoft Office and Google Sheets. With its intuitive interface, users can easily select multiple files to merge in bulk. The software swiftly combines data from these files, eliminating the need for manual copy and paste operations. The program ensures the integrity of your data during the joining process.\n\nThis utility offers two distinct functionalities:\n- Merge into Single Sheet: Consolidates data from multiple Excel files, into a single sheet within a new or existing file. This feature simplifies the process of aggregating information from various sources into a unified, organized format. For example, you can create a long list from multiple smaller list spreadsheets. Supported output formats are CSV, XLS, XLSX.\n- Merge into Multiple Sheets: Allows users to combine all sheets from different Excel files into a single file while preserving the original structure. This functionality is ideal for situations where maintaining the individual sheet organization is crucial, providing a unified file containing multiple sheets from diverse sources. Supported output formats are XLS, XLSX.\n\nWith this tool, users gain the ability to join Excel files according to their preferences, ensuring efficient data management and facilitating diverse analytical and reporting tasks.\n\nThe software also provides the choice to preserve original formatting (font, color, bold, italic, underline, etc.) or convert merged data into plain text, offering flexibility in data presentation.\n\nWhile there are many Excel join tools available online, some prefer a dedicated desktop tool instead. The best part of the program is that the conversion is done completely offline. You are the only controller of your private data. No spreadsheet file is sent to the internet in any case.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}