{"appId":"w:VovSoft.OCRReader","appShortcutName":"Vovsoft OCR Reader","appDisplayName":"Vovsoft OCR Reader","authorId":"w:winget","releaseTagName":"winget-4.2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft OCR Reader is an image to text converter program that allows you to extract text from PDF, PNG, JPEG, TIFF, WEBP, and BMP files using Optical Character Recognition. This software is basically a text reader from image.\n\nVovsoft OCR Reader is an image to text converter program that allows you to extract text from PDF, PNG, JPEG, TIFF, WEBP, and BMP files using Optical Character Recognition. This software is basically a text reader from image. It supports batch processing for PDF files with multiple pages.\n\nWhile there are many OCR tools available online, some prefer a dedicated desktop tool instead. The best part of the program is that the conversion is done completely offline. You are the only controller of your private data. No image file is sent to the internet in any case.\n\nThis small and lightweight OCR tool can easily digitize image files and scanned documents on your laptop or desktop computer. It can scan documents using TWAIN and WIA scanner protocols. This application utilizes Tesseract OCR engine, which supports more than 100 languages. In order to increase accuracy, it uses a neural network (LSTM) based OCR engine which provides line recognition, but also can recognize character patterns.\n\nYou can detect text in one selected language or use the \"Multilingual\" option to detect multiple languages at once.\n\nTrained Models Include: Arabic, Bengali, Bulgarian, Chinese (Simplified), Chinese (Traditional), Czech, Danish, Dutch, English, Faroese, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Italian, Japanese, Korean, Lao, Latvian, Norwegian, Persian, Polish, Portuguese, Punjabi, Romanian, Russian, Slovak, Slovenian, Spanish, Swedish, Tamil, Telugu, Thai, Turkish, Ukrainian, Urdu, Vietnamese\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}