{"appId":"w:VovSoft.ImagePixelator","appShortcutName":"Vovsoft Image Pixelator","appDisplayName":"Vovsoft Image Pixelator","authorId":"w:winget","releaseTagName":"winget-1.2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.vovsoft.com/image-pixelator.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Image Pixelator is a versatile Windows tool that transforms your images with retro pixel effects. Whether you're aiming for a classic 8-bit game style or experimenting with advanced quadtree pixelation, this program has the features you need.\n\nVovsoft Image Pixelator is a versatile Windows tool that transforms your images with retro pixel effects. Whether you're aiming for a classic 8-bit game style or experimenting with advanced quadtree pixelation, this program has the features you need.\nIt supports popular formats like JPG, PNG, and BMP, and allows you to load multiple files for efficient batch processing. Effortlessly craft stunning designs with this pixel art maker software.\n- Simple Pixel Effect: Create a retro, pixelated look with ease.\n- Quadtree Pixel Effect: Apply an advanced pixelation technique for more dynamic, artistic results.\n- Adjustable Scale Intensity: Fine-tune the level of pixelation to suit your needs.\n- Show Preview: Instantly preview your pixelation effects before saving, allowing for precise adjustments and experimentation.\n\nThere are many online websites that can pixelate images. However they have upload limitations. The best part of this program is that the conversion is fast and done completely offline. You are the only controller of your private data. No image file is sent to internet in any case.\n\nPerfect for digital artists, game designers, or anyone looking to add a retro twist to their images, this tool makes pixelation simple and fun!\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}