{"appId":"w:VovSoft.VCFtoTXTConverter","appShortcutName":"Vovsoft VCF to TXT Converter","appDisplayName":"Vovsoft VCF to TXT Converter","authorId":"w:winget","releaseTagName":"winget-3.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Designed with simplicity in mind, this VCF to text converter program can only perform one task, that of extracting the contacts from the input VCF container, then transfer it to a newly created text file anywhere on your computer.\n\nVCF files store information regarding your contacts, enclosing more vCards (short for Virtual Business Cards), each on a separate row. Such files are used to export and import contacts from and to Microsoft Outlook. In case you want to build a list of contacts in your Outlook address book, you can try to export the content of the VCF file. Desktop computers, laptops and mobile phones can recognize VCF file type.\n\nVovsoft VCF to TXT Converter, a dedicated software tool, can help you in this regard. Designed with simplicity in mind, this VCF to text converter program can only perform one task: that of extracting the contacts from the input VCF container, then transfer it to a newly created text file anywhere on your computer. In other words, you just have to select the input VCF file and choose to export it to TXT format, all with just a few clicks. In some cases, users may need to convert VCF to Notepad format for various reasons, such as ease of access, data backup, or data migration. All this conversion is done completely offline. You are the only controller of your private data. No contact information is sent to internet in any case.\n\nData included in converted contacts list: Person name, phone numbers, emails, address, organization, website, revision, notes\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.1.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}