{"appId":"w:VovSoft.EMLConverter","appShortcutName":"Vovsoft EML Converter","appDisplayName":"Vovsoft EML Converter","authorId":"w:winget","releaseTagName":"winget-1.2.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"EML Converter is a versatile tool designed for Windows users to manage EML files with ease. Whether you need to view, convert, search, or recover emails, this software provides comprehensive functionality to meet your needs.\n\nEML Converter is a versatile tool designed for Windows users to manage EML files with ease. Whether you need to view, convert, search, or recover emails, this software provides comprehensive functionality to meet your needs.\n\n- EML File Display: Easily view the content of EML files directly within the software interface, making it convenient to inspect HTML and Text parts.\n- Conversion: Convert EML to HTML and TXT formats, allowing for compatibility with different applications and systems.\n- Search Capability: Seamlessly search within EML files using keywords or phrases, enabling efficient information retrieval.\n- Attachment Handling: Support for displaying and saving email attachments ensures that all associated files are accessible and preserved.\n\nYou can use the software as an EML reader for reviewing emails, an EML browser for navigating through email content, or an EML searcher for quickly finding specific information within emails. In the event of email server issues, EML Converter proves to be a valuable disaster recovery tool for recovering critical emails and attachments. With its user-friendly interface and robust features, EML Converter is a reliable solution for managing EML files effectively on Windows platforms.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}