{"appId":"w:VovSoft.ProxyChecker","appShortcutName":"Vovsoft Proxy Checker","appDisplayName":"Vovsoft Proxy Checker","authorId":"w:winget","releaseTagName":"winget-1.3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Proxy Checker is a powerful tool designed to validate and manage your proxy server lists with ease.\n\nVovsoft Proxy Checker is a powerful tool designed to validate and manage your proxy server lists with ease. Supporting a wide range of proxy types, including SOCKS5, SOCKS4, and HTTP proxy servers, this software caters to all your proxy testing needs. Its intuitive interface allows you to effortlessly load and save your proxy lists, ensuring convenient management and quick access to your proxies.\n- Comprehensive Proxy Support: Validate and manage proxies with support for SOCKS5, SOCKS4, and HTTP proxy servers, covering a wide range of use cases.\n- Effortless Loading and Saving: Easily load your proxy lists from files and save them after testing, ensuring that your lists are always up to date and ready for use.\n- User-Friendly Interface: The intuitive and easy-to-navigate interface makes proxy management simple, even for users with limited technical expertise.\n- Batch Testing: Test multiple proxies simultaneously to save time and increase efficiency, ensuring that your proxy list is always functional.\n- Multi-Threading: Enhance your proxy testing process with this multithreaded proxy checker, allowing multiple proxies to be checked concurrently, significantly reducing testing time and boosting performance.\n\nWhether you're a professional requiring reliable proxies for your tasks, a developer testing your applications, or an individual looking to enhance your online privacy and security, this proxy tester tool provides the essentials needed to maintain a healthy and functional proxy list. Ensure your online activities remain seamless and secure with Proxy Checker for Windows.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}