{"appId":"w:VovSoft.BulkQRCodeGenerator","appShortcutName":"Vovsoft Bulk QR Code Generator","appDisplayName":"Vovsoft Bulk QR Code Generator","authorId":"w:winget","releaseTagName":"winget-2.3.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"With the help of a QR code creator software such as Vovsoft Bulk QR Code Generator, you can generate QR codes that contain different plain-texts at once by making a batch QR code.\n\nGenerating thousands of QR codes with different data individually can be time-consuming.\nWith the help of a QR code creator software such as Vovsoft Bulk QR Code Generator, you can generate QR codes that contain different plain-texts at once by making a batch QR code.\nIf you are mass-producing products every day, or have hundreds of employees in which you want to provide a digital business card using QR codes, you will no longer have to repeat the same process of generating QR codes.\nThis QR code maker utility will save your precious time.\n\nWhile there are various online generators for QR code, some users might prefer using a classic desktop app that does not require an Internet connection. The best part of this program is that the conversion is done completely offline. You are the only controller of your private data. No QR code information is sent to internet in any case. The major advantage of this software is that it can create more than one QR code in one go very easily and fast.\n\nThis software supports PNG, JPEG, GIF, BMP output image formats, allows you to change QR code color, encoding, margin, and specify image size (width and height).\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}