{"appId":"w:VovSoft.MachineLearningRequester","appShortcutName":"Vovsoft Machine Learning Requester","appDisplayName":"Vovsoft Machine Learning Requester","authorId":"w:winget","releaseTagName":"winget-1.7.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Machine Learning Requester is a user-friendly software for desktop and laptop computers.\n\nVovsoft Machine Learning Requester is a user-friendly software for desktop and laptop computers. It simplifies the interaction between user and AI (artificial intelligence) servers, making it effortless to execute machine learning models and generate results.\n\nMachine learning can now do some extraordinary things, but it's still hard to use. The good news is, you no longer need to rely on your own hardware and store gigabytes of trained data; you can utilize AI servers in the cloud! You can easily run open-source models that other people have published. Dive into the world of machine learning and AI without having to worry about the technical expertise!\n\nWith this software, you can simply leverage a wide variety of open-source generative AI models, which are trained, packaged, and published.\n- Chat (Meta-Llama, etc.)\n- Image (Stable Diffusion, SDXL, etc.)\n- Image Edit (flux-kontext-pro, flux-kontext-dev)\n- Audio (Multilingual text to speech, voice cloning with just a 6-second audio clip)\n- Video (Text to video, image to video)\n\nNote:  This program requires an API key from Replicate, which is a paid service. However, don't worry; Replicate's pricing is usage-based and very affordable.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.7.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}