{"appId":"w:VovSoft.MergeMultipleFolders","appShortcutName":"Vovsoft Merge Multiple Folders","appDisplayName":"Vovsoft Merge Multiple Folders","authorId":"w:winget","releaseTagName":"winget-2.3.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Merge Multiple Folders is a tool to combine the contents of different folders into a single folder. You can concatenate multiple directories using this easy to use folder merger software.\n\nVovsoft Merge Multiple Folders is a tool to combine the contents of different folders into a single folder. You can concatenate multiple directories using this easy to use folder merger software.\n\nDesktop or laptop computer users might keep their music, downloads, documents, videos, and pictures organized in separate folders on their hard drive. However, there may be times when it is necessary to combine or merge files located in different directories into a single folder. This can be time-consuming, especially if you have a lot of subfolders or folders to merge.\n\nIf you organize files, you probably have a lot of folders and subfolders holding all your data. If you ever find that you've over-organized a bit, you might want to merge folders into one.\n\nCombining multiple folders into one can make it easier to find a specific document or picture on your PC. While you can always copy and paste files from one folder to another, this method is impractical if your files are scattered among dozens or even hundreds of separate folders. To simplify the process, use this software, and then consolidate them all at once.\n\nThis program offers two merging methods:\n- Merge all files into the root of the target folder\n- Preserve folder structure\n\nAdditionally, this program provides options for handling existing files:\n- Create numbered copy\n- Preserve original file\n- Overwrite\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}