{"appId":"w:VovSoft.XLStoCSVConverter","appShortcutName":"Vovsoft XLS to CSV Converter","appDisplayName":"Vovsoft XLS to CSV Converter","authorId":"w:winget","releaseTagName":"winget-2.3.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft XLS to CSV Converter is a minimalist and user-friendly software that can help you convert multiple Excel spreadsheets to CSV files with only a few mouse clicks.\n\nVovsoft XLS to CSV Converter is a minimalist and user-friendly software that can help you convert multiple Excel spreadsheets to CSV files with only a few mouse clicks. This utility can batch convert chunks of Excel workbooks and worksheets in bulk.\n\nBesides the graphical user interface, the software also offers automatic conversion upon application launch. You can enable it through the Settings menu:\n- Automatically Add Excel Files: The application automatically scans the executable directory and adds all found Excel files to the list.\n- Automatically Convert to CSV: The application automatically converts the added Excel files to CSV files.\n- Automatically Close Application: The application automatically closes itself after the conversion.\n\nConfigure your settings to optimize the functionality of the software. Below are the key options available:\n- Include Subfolders: Include files from all subfolders in the selected directory.\n- Preserve Multiple Line Cells: Ensure that cells containing multiple lines of text are maintained without alterations.\n- Preserve Sheet Names in Filenames: Include worksheet names in the filenames when saving files.\n- Start Minimized: Launch the software in a minimized state.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}