{"appId":"w:VovSoft.DownloadMailboxEmails","appShortcutName":"Vovsoft Download Mailbox Emails","appDisplayName":"Vovsoft Download Mailbox Emails","authorId":"w:winget","releaseTagName":"winget-2.1.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Download Mailbox Emails will provide users with an efficient and simple way of connecting to their email accounts, selecting the preferred content, and downloading it. This software is an easy to use mailbox download tool.\n\nEnsuring your mailbox safety can sometimes require saving emails in an offline means of storage. However, managing to easily download the required email messages from your account, can be a lengthy and somewhat challenging undertaking.\n\nFor such uses, Vovsoft Download Mailbox Emails will provide users with an efficient and simple way of connecting to their email accounts, selecting the preferred content, and downloading it. This software is an easy to use mailbox download tool. You can download all your emails with attachments from your mailbox.\n\nDownload all email messages inside your mailbox. You can get emails from your email account. Enter your login credentials and click \"Connect\" button. Then select the mailbox you need to download and click \"Start Download\" button. The application will export all emails as EML files into the directory you selected. You can store and look through all your emails by having them offline in your computer. Your e-mails will remain on the email server, the application does not perform any deletion.\n\nAfter downloading your mailbox contents, you will have lots of EML files. These files contain the email contents in MIME format; including the email header, body, and attachments. EML files can be used and opened by the following email clients:\n- Mozilla Thunderbird\n- Microsoft Outlook\n- Windows Mail\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.1.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}