{"appId":"w:VovSoft.BatchImageConverter","appShortcutName":"Vovsoft Batch Image Converter","appDisplayName":"Vovsoft Batch Image Converter","authorId":"w:winget","releaseTagName":"winget-2.3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.vovsoft.com/batch-image-converter.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Batch Image Converter is a simple tool for converting between graphic formats in batches. With its help, you can easily obtain images in the desired format out of a folder containing pictures of diverse types.\n\nVovsoft Batch Image Converter is a simple tool for converting between graphic formats in batches. With its help, you can easily obtain images in the desired format out of a folder containing pictures of diverse types.\n\nEasily convert images, photos and pictures with this lightweight mass image converter software. Simple and powerful, it converts image formats, one by one or in batch mode. Images can be converted in bulk.\n\nYou can convert one or more images with ease with the help of this handy and reliable application, which can process entire folders. You can use this highly intuitive and user-friendly application to quickly change the formats of multiple graphic files. You simply need to add image files either via drag & drop, or by manually browsing to the location of each file.\n\nSelect your output image format, convert the original images by simply doing a batch convertion in one go. The software supports PNG, WEBP, JPEG, JFIF, TIFF, BMP, GIF, ICO, WMP, AVIF, SVG, JP2, JXL, TGA, PSD, PDF, HEIC filetypes, preserves transparency of transparent images with alpha channel, has the \"Convert to Grayscale\" option.\n\nDepending on the number of input images, it can take more or less time to convert the files. The application is fast and, when the conversion process is completed, a notification message is displayed.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}