{"appId":"w:VovSoft.VovMusicPlayer","appShortcutName":"Vov Music Player","appDisplayName":"Vov Music Player","authorId":"w:winget","releaseTagName":"winget-12.3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vov Music Player is a lightweight, intuitive audio player designed for simplicity and functionality.\n\nVov Music Player is a lightweight, intuitive audio player designed for simplicity and functionality. It supports a wide range of audio formats, including FLAC, MP3, MP2, MP1, OGG, OPUS, WMA, M4A, M4B, AAC, WAV, WV (WavPack), MPC (Musepack), MIDI, MOD, S3M, MP4, WEBM, and AIFF. With the ability to play high-resolution audio at 24 bits and sampling rates up to 192 kHz, it delivers an exceptional listening experience.\n\nEnjoy music without complicated setups—just select your source directory and start playing. The player minimizes to the system tray for quick access, allowing you to control playback directly from the right-click context menu.\n\nEnhanced Playback Options:\n- Minimalistic Interface: A clean, distraction-free design with multiple themes and an equalizer.\n- DSP Effects: Immerse yourself with 3D rotation, echo, flanger.\n- Customizable Playback: Adjust pitch, tempo, and frequency or choose sequential or random play modes.\n- Fade In & Fade Out: Smooth transitions between songs with automatic fade in and fade out effects.\n\nExtra Features:\n- Auto-Skip Loud Songs: Automatically skip songs exceeding a user-defined loudness threshold.\n- Auto-Skip Old Files: Play only recent additions by setting a cutoff date for older tracks.\n- Automatic Lyrics Support: Automatically download and display synchronized lyrics (LRC and JSON format) in real-time, perfect for karaoke or following along with your favorite songs.\n- Peak Level Normalization: Automatically adjust volume levels for consistent sound clarity, even for silent or low-volume tracks.\n- TTS DJ Announcements: Announce song filenames before playback using the built-in Microsoft SAPI Text-to-Speech engine. Customize the DJ voice or disable it for uninterrupted listening.\n\nVov Music Player is designed to run smoothly without taxing your system resources. Whether you're working, browsing, or relaxing, it transforms your computer into the ultimate music companion.\n\nRediscover your music collection with Vov Music Player—a feature-rich audio player that keeps things simple while delivering a premium listening experience.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"12.3.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}