{"appId":"w:VovSoft.3DBoxMaker","appShortcutName":"Vovsoft 3D Box Maker","appDisplayName":"Vovsoft 3D Box Maker","authorId":"w:winget","releaseTagName":"winget-1.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft 3D Box Maker is a lightweight and easy-to-use tool for creating 3D covers and boxshots for software, eBooks, games, and other digital products.\n\nVovsoft 3D Box Maker is a lightweight and easy-to-use tool for creating 3D covers and boxshots for software, eBooks, games, and other digital products. A well-designed product cover can make a small but meaningful difference in how your product is perceived, and this program aims to make that process simple and approachable.\n\nWith this program, you don’t need advanced design skills to create 3D visuals. The software works as a practical 3D boxshot creator and product mockup generator, letting you import your Main Image and Side Image (PNG, JPG, GIF, or BMP), adjust the camera distance, rotation, and angle, and see a real-time preview of your 3D box.\n\nWhen your design is ready, you can export it as a transparent PNG file, which is ideal for use on websites, online stores, promotional banners, and social media. Whether you are a software developer, author, marketer, or hobbyist, this tool provides a simple way to create 3D boxshots and digital product covers without needing complex graphic design software.\n\nThis program focuses on ease and practicality. It is a humble yet reliable software box design tool and 3D mockup generator for anyone who wants to visualize products in a clear and appealing way. Its goal is not to replace professional design tools, but to give users a fast, straightforward way to generate simple, 3D product visuals with minimal effort.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}