{"appId":"w:VovSoft.MarkdownConverter","appShortcutName":"Vovsoft Markdown Converter","appDisplayName":"Vovsoft Markdown Converter","authorId":"w:winget","releaseTagName":"winget-1.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Markdown Converter is a user-friendly tool designed to effortlessly transform your markdown documents into HTML format.\n\nVovsoft Markdown Converter is a user-friendly tool designed to effortlessly transform your markdown documents into HTML format. It has an intuitive interface that simplifies the conversion process. You don't need to be a tech guru to use our software; it's designed for everyone, from beginners to advanced users. It runs smoothly on your Windows-based devices, providing a hassle-free user experience.\n\nThis software supports CommonMark, TxtMark, and DaringFireball markdown dialects. This means you can convert markdown content written in different variations, ensuring compatibility with various platforms and styles.\n\nSome of the popular platforms and applications that support markdown include:\n- WordPress: Markdown plugins or features enable writing in markdown format for blog posts.\n- Reddit: Many subreddits allow markdown formatting for posts and comments.\n- Stack Overflow: Markdown is used to format questions, answers, and comments on this programming Q&A platform.\n- GitHub: Markdown is used for formatting README files, issues, and comments on GitHub.\n- Slack: Markdown can be used for formatting messages in Slack.\n- Discord: Some Discord channels allow markdown for text formatting.\n- Jupyter Notebooks: Markdown cells are used to add formatted text and documentation in Jupyter notebooks.\n- Trello: Markdown can be used in card descriptions and comments in Trello.\n- Notion: Markdown is supported for text formatting in Notion pages.\n- Ghost: Markdown can be used for writing blog posts in the Ghost platform.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.1.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}