{"appId":"w:VovSoft.SEOChecker","appShortcutName":"Vovsoft SEO Checker","appDisplayName":"Vovsoft SEO Checker","authorId":"w:winget","releaseTagName":"winget-10.4.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft SEO Checker is an easy to use website crawler that can efficiently crawl both small and large websites. With this SEO checker tool, you can identify broken links, analyze on-page SEO data, distinguish between internal and external links.\n\nVovsoft SEO Checker is an easy to use website crawler that can efficiently crawl both small and large websites. With this SEO checker tool, you can identify broken links, analyze on-page SEO data, distinguish between internal and external links, and classify links as dofollow or nofollow. Additionally, the tool provides analysis of internal linking, titles, description meta tags, and other tags in real-time.\n\nOn-page SEO (also known as \"on-site SEO\") is the practice of optimizing web page content for search engines and users. Common on-page SEO practices include optimizing title tags, content, internal links and URLs. This software provides full lists of sitemaps, links, internal backlinks, anchors, H1, H2, H3, H4 headings and helps you on your on-page SEO check efforts.\n\nBy using this SEO checker software, you can freely test your website or competitor websites in your niche, and rapidly get a technical SEO analysis report (including SEO errors) and valuable data. It can help you rank higher on Google, Bing, Yahoo, Baidu, Yandex, DuckDuckGo.\n\nKey Features:\n* On-page SEO audit (checkup)\n* Internal URL list\n* Link and backlink lists\n* Page title list\n* META description list\n* HTTP & HTTPS response codes\n* Page speed\n* Domain or subdomain based crawl\n* H1, H2, H3, H4 heading lists\n* Anchor list (prevent keyword cannibalization)\n* Generate sitemap\n* Export to CSV, XML, TXT\n* Word count\n* Embedded SQLite database (in-memory or file)\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"10.4.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}