{"appId":"w:VovSoft.CryptocurrencyTracker","appShortcutName":"Vovsoft Cryptocurrency Tracker","appDisplayName":"Vovsoft Cryptocurrency Tracker","authorId":"w:winget","releaseTagName":"winget-2.4.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"This software is a desktop app to visualize cryptocurrency market data. You can view cryptocoin prices and charts, including Bitcoin, Ethereum, XRP, LTC, BNB and thousands of more crypto currencies.\n\nThis software is a desktop app to visualize cryptocurrency market data. You can view cryptocoin prices and charts, including Bitcoin, Ethereum, XRP, LTC, BNB and thousands of more crypto currencies. Supports exporting raw data as CSV file and chart image as JPEG file. You can make the application stay-on-top and use it as a desktop widget.\n\nThe program is a straightforward solution that helps you get a bird's eye view over the evolution of several cryptocurrency so you can make better investments. The main window is very user-friendly and intuitive, and you only need to choose the type of cryptocurrency you are interested in to get an overview of its current trend, be it ascending or descending. You can set the graph to be automatically refreshed, without any extra action on your part. You can manually enter the number of days and the type of price you prefer, or you can switch to a 3D chart if you are not satisfied with the current look. Market capitalization can also be seen below the price chart. Prices can be displayed in USD, EUR, GBP, CAD and BTC.\n\nVovsoft Cryptocurrency Tracker is a nice way to monitor the evolution of numerous types of cryptocurrencies within the same window, without needing to open many browser tabs.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.4.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}