{"appId":"w:VovSoft.BatchAudioConverter","appShortcutName":"Vovsoft Batch Audio Converter","appDisplayName":"Vovsoft Batch Audio Converter","authorId":"w:winget","releaseTagName":"winget-1.6.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Batch Audio Converter is your go-to solution for converting audio files quickly and efficiently.\n\nVovsoft Batch Audio Converter is your go-to solution for converting audio files quickly and efficiently. This powerful Windows software allows you to handle bulk audio conversions with ease. Simply drag and drop your files, select your desired output format, and let the software do the rest.\n\nWhether you’re managing a music library, preparing audio files for a project, or ensuring compatibility across platforms, this program delivers high-quality results with minimal effort.\n\n- Bulk Conversion: Convert multiple files at once to save time.\n- Drag-and-Drop Simplicity: Add files directly from Windows Explorer.\n- Wide Format Support: Handles all popular audio file types, ensuring compatibility with your devices and applications.\n- Preserve Metadata: Retain audio file details, such as ID3 tags, during conversion when supported by the file format.\n- Customizable Output Settings: Adjust bitrate, sampling rate, and audio channels (mono, stereo, 5.1, 7.1) for tailored results.\n- Flexible Destination Management: Set your preferred output directory for better organization.\n\nInput and output: MP3 (MPEG Audio Layer 3), WMA (Windows Media Audio), WAV (Waveform Audio), M4A (MPEG-4 Audio), AIFF (Audio Interchange File Format), AAC (Advanced Audio Coding), OGG (Ogg Vorbis), OPUS (Opus Codec), AC3 (Dolby Digital), EAC3 (Enhanced AC-3), MP2 (MPEG Audio Layer 2), WV (WavPack), WEBM (WebM Audio), FLAC (Free Lossless Audio Codec)\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.6.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}