{"appId":"w:VovSoft.BatchImageUpscaler","appShortcutName":"Vovsoft Batch Image Upscaler","appDisplayName":"Vovsoft Batch Image Upscaler","authorId":"w:winget","releaseTagName":"winget-1.2.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files.vovsoft.com/batch-image-upscaler.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Batch Image Upscaler is an AI-powered software designed to enhance and upscale your images with exceptional quality.\n\nVovsoft Batch Image Upscaler is an AI-powered software designed to enhance and upscale your images with exceptional quality. It supports popular file formats, including JPG, PNG, and WEBP, and allows you to process multiple images in bulk, saving you time and effort.\n\nThis program leverages artificial intelligence to transform low-resolution images into high-quality, detailed images. By utilizing advanced AI models trained on synthetic data, it ensures precise upscaling tailored to your specific needs. Whether you're working with digital artwork or real-life photographs, this AI image upscaler delivers super-resolution results, making it an indispensable tool for professionals and enthusiasts alike.\n\n- AI-Powered Super-Resolution: Enlarges images up to 4x their original size while preserving and enhancing details.\n- Image Type Selection: Choose between Artwork and Photo modes to optimize results based on your image type.\n- Pure Synthetic Data Models: Utilizes advanced AI models pre-trained on high-quality synthetic data for superior upscaling accuracy.\n- GPU-Accelerated Performance: Leverages Vulkan driver for seamless compatibility with Intel, AMD, and Nvidia GPUs. No additional dependencies like CUDA or Python are required.\n- Fully Offline Operation: Runs entirely on your local device, ensuring your files remain private and secure. No data is sent to the internet.\n- All-in-One Package: Includes all necessary binaries and pre-trained models, making installation and portable usage hassle-free.\n- Image Restoration: Excellent for restoring old, low-resolution images, bringing them back to life with stunning clarity.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}