{"appId":"w:VovSoft.FolderSplitter","appShortcutName":"Vovsoft Folder Splitter","appDisplayName":"Vovsoft Folder Splitter","authorId":"w:winget","releaseTagName":"winget-1.2.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Folder Splitter was made with one purpose in mind, and that is to help you split one large folder into many smaller folders.\n\nVovsoft Folder Splitter was made with one purpose in mind, and that is to help you split one large folder into many smaller folders. This tool lets you organize files in a directory using various criteria, such as number of files, folder size, date, or file extension.\n\nDesktop or laptop computer users may sometimes have added too many files to a folder they use frequently. Such folders can cause problems in online environments such as cloud drives and FTP servers. Manually splitting such directories into smaller chunks can take a lot of time. Using this program you can solve this problem with just a few clicks.\n\nThis application is a simple-to-use folder axe software that lets you cut folders into multiple pieces. You can choose whether to copy or move the files to their new destination.\n\nYou may split the folders in various ways:\n- \"By Size\", in which you specify a size limit for each of the resulting folders. You can specify the maximum size for the destination folders, which can be handy for backing up folders to specific sizes such as CD, DVD, Blu-ray, FAT32, or floppy disk.\n- \"By Amount\", where you specify a limit for the number of files that can be in each resulting folder.\n- \"By Date\", where you can specify a datetime format and choose between created, modified or accessed.\n- \"By Extension\" allows you to split folders based on file extensions, grouping files with the same extension into separate destination folders.\nThe \"Include Subfolders\" option enables users to include all subfolders and their contents during the folder splitting process, ensuring a comprehensive organization based on the selected criteria.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}