{"appId":"w:VovSoft.CSVtoVCFConverter","appShortcutName":"Vovsoft CSV to VCF Converter","appDisplayName":"Vovsoft CSV to VCF Converter","authorId":"w:winget","releaseTagName":"winget-3.6.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft CSV to VCF Converter is an easy to use VCF generator software that can convert CSV files (created by Microsoft Excel or other compatible office software) to VCF vCard files.\n\nVovsoft CSV to VCF Converter is an easy to use VCF generator software that can convert CSV files (created by Microsoft Excel or other compatible office software) to VCF vCard files.\n\nCSV files are plain text files that can be edited using any text editor. VCF files store information regarding your contacts, enclosing vCards (Virtual Business Cards). Such files are used to export and import contacts from and to mobile phones (Android or iPhone), Microsoft Outlook, iCloud, Gmail, etc.\n\nDesigned with simplicity in mind, Vovsoft CSV to VCF Converter can only perform one task: that of extracting the contacts from the input CSV container, then transfer it to a newly created VCF file. In other words, you just have to select the input Excel file and choose to export it to VCF format, all with just a few clicks. You can use this VCF maker tool to convert CSV into vCard file, which can be used and shared in mobile devices.\n\nSupported fields include First Name, Middle Name, Last Name, Phone (Cell), Phone (Home), Phone (Work), Email, Email (Work), Address (Home), Address (Work), Organization, Title, URL, Birthday, Notes.\n\nIn addition to CSV files, this program can also load and convert Microsoft Excel (XLS and XLSX) files. If you are looking for a program to convert CSV/XLS/XLSX to VCF format, you can rely on this software.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.6.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}