{"appId":"w:VovSoft.PreventComputerSleep","appShortcutName":"Vovsoft Prevent Computer Sleep","appDisplayName":"Vovsoft Prevent Computer Sleep","authorId":"w:winget","releaseTagName":"winget-1.2.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Prevent Computer Sleep is a simple yet powerful tool designed to keep your PC awake by simulating keypresses at regular intervals.\n\nVovsoft Prevent Computer Sleep is a simple yet powerful tool designed to keep your PC awake by simulating keypresses at regular intervals. Whether you're running important tasks, watching videos, or giving a presentation, this software ensures that your computer doesn't go into sleep mode or lock the screen due to inactivity.\n\nBy default, the program simulates an F15 keypress every 59 seconds, tricking your system into thinking you're still actively working. However, you have full control over these settings. You can easily customize both the key and the time interval to match your preferences. Adjust the time between keypresses (e.g., more frequent or less frequent than 59 seconds) and choose any function key to be simulated.\n\nKey Features:\n* Prevents sleep mode and screen lock: Keeps your computer awake by simulating keypresses.\n* Customizable intervals: Adjust the time between keypresses (default is 59 seconds).\n* Flexible key selection: Simulate any F-key press, default F15 key.\n* User-friendly interface: One-click start and stop functionality for hassle-free operation.\n\nPerfect for scenarios where you need your computer to stay active — such as presentations, long-running processes, or periods of low interaction — this utility ensures that your PC remains awake without the need for constant manual input.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.2.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}