{"appId":"w:VovSoft.ResourceExtractor","appShortcutName":"Vovsoft Resource Extractor","appDisplayName":"Vovsoft Resource Extractor","authorId":"w:winget","releaseTagName":"winget-1.0.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Resource Extractor is a simple utility designed to help users scan files, and extract embedded resources from files like Windows executable (.exe) and dynamic-link library (.dll) files.\n\nVovsoft Resource Extractor is a simple utility designed to help users scan files, and extract embedded resources from files like Windows executable (.exe) and dynamic-link library (.dll) files.\n\nWhether you're a developer, a reverse engineer, or a power user, this tool simplifies the process of accessing graphics, icons, cursors, sounds, strings, and other data packaged within these files.\n- Targeted Scanning: Easily specify a directory to scan, including the option to \"Include Subfolders\" for comprehensive searching.\n- Flexible Filtering: Use wildcards like *.exe and *.dll to focus the search on specific file types. A \"Case-Sensitive\" option is also available for precision.\n- Detailed File Listing: The results table provides essential metadata for the identified files, including the Filename (full path), Bits (x86 or x64 architecture), Extension, Date Modified, and Size (bytes).\n- Visual Aid: The \"Show Icons\" option displays the embedded icon alongside the file path, offering a quick visual reference.\n- File Size Calculation: The \"Calculate Filesize\" feature ensures you have accurate size information for the listed resources.\n- Batch Extraction: Define a \"Destination Folder\" and use the \"Extract All\" button to quickly and efficiently save all found resources to a single location.\n- User-Friendly Interface: The clear, intuitive design (as shown in the screenshot) ensures a simple and smooth extraction workflow.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.0.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Freeware","resources":null,"verified":false}