{"appId":"w:VovSoft.VovStopStart","appShortcutName":"Vov Stop Start","appDisplayName":"Vov Stop Start","authorId":"w:winget","releaseTagName":"winget-2.0.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vov Stop Start is a Windows application that can stop any process and then start it again at a frequency specified by the user.\n\nDue to the nature of their design, some applications stop responding after some time. For example, if you keep running a web server, it becomes slower and consumes more RAM. But once its process is terminated and restarted, it starts working fine again. You can manually restart these applications, or you can use a dedicated tool such as Vov Stop Start to do it for you. Vov Stop Start is a Windows application that can stop any process and then start it again at a frequency specified by the user.\n\nVov Stop Start has a simple interface. The first thing that you have to specify is the \"Stop Process\" and latter is the \"Start File\".\n- Stop Process: Click on the Select button and pick one of the running processes or services from the list.\n- Start File: Click on the Select button and choose any EXE or BAT file.\n\nVov Stop Start is a specialized application and only meant for the users who are having trouble with some applications that keep freezing or crashing all the time. You can minimize application stoppages by using Vov Stop Start. All you have to do is to set stop-start period in seconds and select the applications you wish to stop-start. The utility is built for system administrators and power users. It runs on Windows XP, Vista, 7, 8, 8.1, 10, 11 and Windows Server editions.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.0.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}