{"appId":"w:VovSoft.WebsiteWatcher","appShortcutName":"Vovsoft Website Watcher","appDisplayName":"Vovsoft Website Watcher","authorId":"w:winget","releaseTagName":"winget-2.1.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Vovsoft Website Watcher is a user-friendly and powerful website-monitoring tool suitable for both beginners and advanced users. The software allows users to monitor various types of web pages, including RSS/Atom feeds.\n\nVovsoft Website Watcher is a user-friendly and powerful website-monitoring tool suitable for both beginners and advanced users. The software allows users to monitor various types of web pages, including RSS/Atom feeds. It provides notifications for changes in competitors' websites, price adjustments, product availability, updates to favorite websites, modifications to the user's homepage, and more. The tool runs as a client on the user's computer, ensuring full control over data.\n\nMonitor websites periodically in a simplistic manner for any changes. You can effortlessly monitor websites at scheduled intervals, ensuring you stay updated on any modifications. Our tool simplifies the process, making it easy to track new content and changes on your favorite sites without hassle.\n\nThe purpose behind this tool is to routinely monitor specific webpages, such as university exam result announcements, ensuring prompt notifications upon updates. Its functionality extends to tracking shipment details via postal services or similar tasks. Operating on a simple principle, the program accesses a webpage, saves its HTML code into embedded database, and subsequently compares it to detect any alterations during subsequent visits. Any disparities trigger actions.\n\nKey Features:\n- Detect content change: Alerts you when any content changes are detected, ensuring you never miss important updates.\n- Detect connection error: Displays when a website is down or experiencing problems, keeping you informed in real time.\n\nAdvanced Filtering Options:\n- Strip HTML: Removes all HTML tags and retains only the plain text content of the webpage.\n- Line Range: Lets you specify exact line numbers (e.g., lines 15-30) in the webpage.\n- Keyword: Monitors only parts of the page that contain specific word or phrase you define.\n- XPath: Uses XPath queries to target specific HTML/XML elements (e.g., <div id=\"price\">).\n- RegEx (Regular Expressions): Applies pattern-matching rules to identify changes in text (e.g., dates, prices, IDs)\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.1.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}