{"appId":"w:VovSoft.TextToMP3Converter","appShortcutName":"Vovsoft Text to MP3 Converter","appDisplayName":"Vovsoft Text to MP3 Converter","authorId":"w:winget","releaseTagName":"winget-4.4.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Easily convert any text to speech. Perfect for e-learning, presentations, YouTube videos and increasing the accessibility. You can convert from text to speech and save it as audio file in a few clicks. The text can be exported as MP3 and WAV file.\n\nEasily convert any text to speech. Perfect for e-learning, presentations, YouTube videos and increasing the accessibility. You can convert from text to speech and save it as audio file in a few clicks. The text can be exported as MP3 and WAV file.\nThis program uses the preinstalled Microsoft SAPI Text-to-Speech (TTS) engine for generating voice. It can convert text of up to 500,000 characters into an audio file, that’s approximately 8 hours long.\n\nIf you need to convert some text to audio or you're just looking for a way to preview some content without having to actually spend time reading it, Vovsoft Text to MP3 Converter can do both, offering you choices for the used speech engine, as well as the output audio format. The two main options offer users the choice of increased quality (WAV) or a more compact recording (MP3). \"Speech Speed\" option allows from 10x slow to 10x fast playing and recording. If you seek a basic application that can help you perform text to audio conversions, without having to resort to complex steps and configuration processes, try out this simple yet quite capable software.\n\nIn addition to TXT files, this software also supports loading PDF files and Microsoft Word documents. This MP3 maker software can be used for Word to MP3 conversion by loading DOC and DOCX files on your desktop or laptop computer. You can even use \"Batch Conversion\" to convert multiple files at once.\n\nIf you create videos, you can use this software to generate voiceovers for them. As a content creator, you can add voice narration to your video, without the need to speak on the recording yourself or hire a speaker to do it for you. This can be particularly useful when uploading videos to YouTube.\n\nSupported APIs:\n- Besides the robotic voices offered by Microsoft Windows, this program also allows you to use natural voices (Alloy, Echo, Fable, Onyx, Nova, Shimmer) provided through the OpenAI API.\n- Additionally, the program supports the Replicate API, which offers sample voices and voice cloning.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.4.0.0","version":0,"site":"https://vovsoft.com/","source":"VOVSOFT","license_or_tos":"Proprietary","resources":null,"verified":false}