{"appId":"w:VRCX.VRCX","appShortcutName":"VRCX","appDisplayName":"VRCX","authorId":"w:winget","releaseTagName":"winget-2026.02.11","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/vrcx-team/VRCX/releases/download/v2026.02.11/VRCX_2026.02.11_Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Friendship management tool for VRChat\n\n\nWhat's New\n- Custom Search Limit: We separated the search limit from the load limit. You can now search many results while keeping the load count low to save memory.\n- Mutual Graph: A complete rewrite for better speed and readability. You can now adjust the graph layout parameters to fit your needs.\n- Flexible Navigation: We split the Instance Activity Chart and Mutual Graph. You can now place them separately anywhere in the navigation menu.\n- Tools Reorganized: \"Auto Change Status\" is now in the \"Tools\" tab. Please look there for all our miscellaneous tools.\n- Discord Connection: See Discord badges on profiles when users connect their accounts. Simply click the badge to open their Discord profile, to enable this feature you will need to click \"Show Discord Connections\" on your profile.\nAdditions\n- Mutual graph has been rewritten with performance fixes and new settings.\n- Added separate table search limit in Setting -> Appearance -> Table Max Size\n- Added loading indicator when clicking on an avatar in the feed tab.\n- Added world/avatar last updated date per platform tooltip.\n- Added Discord badge to user dialog, clicking on it will open Discord on their profile.\n- Add fetch models for OpenAI #1625\n- Add attribution header for OpenAI #1623\nChanges\n- Move \"Auto Change Status\" setting to Tools tab.\n- Improved performance and reduced memory usage.\n- Let of styling related touch ups.\n- Retain dialog data when reopening the same dialog.\n- Added grey title bar for dark theme.\n- Sidebar friend item hover effect.\nFixes\n- Fix feed tab breaking with duplicate entries.\n- Fix dialog jumping around on image load.\n- Fix tables jumping to first page on new entry.\n- Fix feed table expand collapsing on new entry.\n- Fix tables not remembering their last page.\n- Fix notification dot indicator position.\n- Fix dialog closing on error.\n- Fix mutuals chart filtering out invalid user IDs.\n- Fix button spacing in some dialogs #1617\n- Fix avatar thumbnail image stretching #1619\n- Fix wrist overlay grey leaking over into HMD notifications overlay.\nLinux/macOS (Electron)\n- Fix macOS title bar.\n- Disable non-functioning updater on macOS.\nTranslation Updates\nCayahuanca\nflower-elf\nxxKawa\nAnteness","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2026.02.11","version":0,"site":"https://github.com/vrcx-team","source":"VRCX","license_or_tos":"MIT","resources":null,"verified":false}