{"appId":"w:VRCX.VRCX","appShortcutName":"VRCX","appDisplayName":"VRCX","authorId":"w:winget","releaseTagName":"winget-2025.09.10","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/vrcx-team/VRCX/releases/download/v2025.09.10/VRCX_20250910_Setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Friendship management tool for VRChat\n\n\nAdditions\n- New \"tools\" tab.\n  - Add Group Calendar timeline, proper calendar in next release.\n  - We're going to start slowly moving stuff from settings into the new \"tools\" tab, this should help clean things up and increase discoverability of these features.\n  - We'll keep the old buttons around to redirect to the tools tab to help with not getting lost in the menus.\n- Add Discord RPC options.\n  - Toggle displaying current platform, it now works with Mobile platforms.\n  - Toggle world integration.\n  - Toggle \"Display world name as Discord status\", defaulted to disabled.\n- Open instance in-game instead of self invite while VRChat is running. If it fails it will automatically fallback to self invite, if you still prefer self invite, a setting was added to disable this feature.\n- User dialog button to open group moderation tools.\n- Group dialog, add last visited and previous instances (#1351).\n- Add moderation icons to playerList, for when you've previously moderated a user (block, mute, etc).\n- VRCX autorun option to only open single instance of app, defaulted to enabled.\nChanges\n- Change navigation bar icons.\n- When using Invite to group only show groups with invite permission.\n- Sort playerList by icons.\n- Click dialog titles to copy displayName to clipboard.\nFixes\n- Fix running VRCX as Admin (although ideally you shouldn't).\n- Fix clear and copy favorites.\n- Fix avatar/world updated at date.\n- Fix searching through group members.\n- Fix removing local avatar favorites while holding the shift key.\nLinux/macOS (Electron)\n- Expect the updater to be broken while updating to this release, it's fixed in future releases.\n- Add support for arm64 on Linux and macOS, Linux arm64 builds are currently in nightly and will be in stable next release.\n- Include dotnet runtime with macOS builds.\n- Launch commands now work on Linux while VRCX is already running, e.g. vrcx:\\\\world\\wrld_id (#1352).\n- Fix crash when OpenVR isn't installed, include openvr library in expected path.\n- Add option to disable registry restore popup.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2025.09.10","site":"https://github.com/vrcx-team","source":"VRCX","license_or_tos":"MIT","resources":null,"verified":false}