{"appId":"winget_app_IrfanSkiljan.IrfanView","appShortcutName":"Winget Application","appDisplayName":"IrfanView","authorId":"winget","releaseTagName":"winget-4.70","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://files02.tchspt.com/down/iview470_x64_setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Fast and compact image viewer and converter\n\nIrfanView is a fast, compact and innovative FREEWARE (for non-commercial use) graphic viewer for Windows XP, Vista, 7, 8, 10 and 11.\nIt is designed to be simple for beginners and powerful for professionals.\nIrfanView seeks to create unique, new and interesting features, unlike some other graphic viewers, whose whole \"creativity\" is based on feature cloning, stealing of ideas and whole dialogs from ACDSee and/or IrfanView! (for example: XnView has been stealing/cloning features and whole dialogs from IrfanView, for 10+ years).\nIrfanView was the first Windows graphic viewer worldwide with Multiple (animated) GIF support. One of the first graphic viewers worldwide with Multipage TIF support. The first graphic viewer worldwide with Multiple ICO support.\n- New option: Keep existing alpha/transparency color (Properties->Viewing)\n  Show checkerboard image; Alpha/Color also used for saving\n- New option in Increase Color Depth dialog: 32 BPP (with alpha layer)\n- New option in Replace Color dialog: Set transparent color (if 32 BPP image)\n- New Image menu: Edit or Set alpha/transparency color>\n- New option: Show Browse buttons in main window (Properties->Browsing)\n- Fine Rotation option can work on selections\n- New in OCR PlugIn: read QR or Barcode (thanks to ZXing guys)\n- New slideshow hotkey: SHIFT + \",\" (comma): Toggle random and automatic time\n- New Print dialog option: Reverse pages (for multipage images, page ranges)\n- Support for EXIF data in WEBP files (EXIF dialog)\n- Command line: \"/effect\" can be combined with \"/slideshow\", like:\n  i_view64.exe /slideshow=c:\\mypics.txt /effect=(30,0,0)\n- Loading issues in several PlugIns fixed (thanks to Trend Micro)\n  (CADImage, Formats, CamRAW, DjVu, JPM, ECW, WSQ)\n- SVG PlugIn loading bugs fixed (thanks to nerty_nerty)\n- EXR PlugIn loading bugs fixed (thanks to leeho and Who4mI)\n- Several PlugIns are changed/updated, please install the newest versions:\n  https://www.irfanview.com/plugins.htm","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.70","site":"https://www.irfanview.com/","source":"Irfan Skiljan","license_or_tos":"Proprietary","resources":null,"verified":false}