{"appId":"winget_app_Logtalk.Logtalk","appShortcutName":"Winget Application","appDisplayName":"Logtalk","authorId":"winget","releaseTagName":"winget-3.88.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nDocumentation\n- IMPROVED: Handbook documentation of the mode/2 predicate directive.\n- IMPROVED: Handbook glossary definition of \"prototype\".\n- IMPROVED: Documentation of the packs tool.\n- UPDATED: Notes on the developer tools third-party dependency requirements.\n- UPDATED: The lgtunit tool documentation on generating Allure reports.\n- FIXED: The manual install instructions missing a PATH setting for the packs tool lgtenv.sh script.\n- FIXED: Handbook PDF version missing the sections on ports and contributions.\nLibrary\n- FIXED: The types library natural::check/1 object predicate to throw error/2 exceptions.\nTools\n- UPDATED: The lgtunit to use only two decimal places when printing code coverage stats.\n- FIXED: The packs tool to use the gsha256sum command when available instead of the sha256sum command on POSIX systems. This is required to workaround Apple adding the incompatible BSD version of the sha256sum command on macOS 15.\nExamples\n- CHANGED: Consolidate the examples NOTES.md and SCRIPT.txt files into a single NOTES.md file.\n- CHANGED: The contents of the examples NOTES.md files to allow open them as Jupyter notebooks. Experimental. See the examples/NOTES.md file for the setup details.\n- FIXED: The haunted_wasteland, scratchcards, and trebuchet examples sample queries to allow running from any directory.\n- FIXED: Missing queries in the defaulty example documentation.\n- FIXED: The dcgs examples to allow opening its documentation as a notebook without loading warnings.\nIDEs, text editors, and syntax highlighters support\n- IMPROVED: The Prolog embedding scripts to avoid an error with a large number of application files.\n- FIXED: Workaround JIProlog format/2-3 predicate issues in the VSCode support.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.88.0","site":"https://logtalk.org/","source":"Logtalk.org","license_or_tos":"Apache-2.0","resources":null,"verified":false}