{"appId":"winget_app_Google.IAPDesktop","appShortcutName":"Winget Application","appDisplayName":"IAP Desktop","authorId":"winget","releaseTagName":"winget-2.44.1694","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/GoogleCloudPlatform/iap-desktop/releases/download/2.44.1694/IapDesktop.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"IAP Desktop is a Windows application that allows you to manage multiple Remote Desktop connections to Windows VM instances that run on Google Cloud. This is not an officially supported Google product.\n\n\nRelease 2.44 introduces a number of SSH improvements:\n- New terminal: The SSH terminal is now based on the same component that powers the Windows Terminal. As a result of this change, the terminal now supports a range of additional xterm features, including mouse input and support for 256 colors.\n- Browse and transfer files: When you're connected to a Linux VM, you can now browse the VM's file system and transfer files by selecting Session > Transfer files. You can transfer files by using copy and paste or drag and drop in the same way you're used to from Windows File Explorer.\n- Group policies for SFTP: You can now use a group policy to control whether users in your organization are allowed to transfer files by using SFTP.\nThe release also includes these new features:\n- Connect to PostgreSQL: You can now let IAP Desktop connect to PostgreSQL and launch the psql command line client for you.\nIn addition, the release includes several stability improvements and fixes, including:\n- Automatic Logons are now automatically disabled if your local computer is subject to the Do not allow passwords to be saved group policy.\n- Metadata-based SSH keys that included excess whitespace could cause authentication to fail.\n- Under certain circumstances, the installer didn't detect the Windows version correctly and refused to execute. #1580.\nA note to vim users: Because the SSH terminal now supports mouse input, coping text from vim might no longer work as before. To copy text from vim, use the set mouse=r option, or hold the Shift key while coping text.\nUpdate 01/07/2025: Updated packages to fix an issue with the Automated logons setting that caused IAP Desktop to ignore existing saved passwords.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.44.1694","site":"https://github.com/GoogleCloudPlatform/iap-desktop","source":"Google Inc","license_or_tos":"Apache-2.0","resources":null,"verified":false}