{"appId":"winget_app_YACReader.YACReader","appShortcutName":"Winget Application","appDisplayName":"YACReader","authorId":"winget","releaseTagName":"winget-9.15.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/YACReader/yacreader/releases/download/9.15.0/YACReader-v9.15.0.2501014-winx64-7z-qt6.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Read, browse and manage your comics collection.\n\n\nYACReader\n- Save magnifying glass size and zoom level.\n- Add shortcut to reset the magnifying glass to its defaults (size and zoom), it is slash by default but it can be reasigned.\n- Bump PDF render size.\n- Fix trackpad scrolling, it makes using trackpads more reponsive and natural.\n- Added more info to Help -> System info.\nYACReaderLibrary\n- Fix headers in the table view getting stuck in a non moveable state.\n- Add option to set the type of a library. It will convert all the content to desired type (comic, manga, etc) and it will set that type as the default one for that library. Available in the library context menu.\n- Added more info to Help -> System info.\n- New setting to open comics in third party reader apps, it works by entering a command that will launch the app, e.g. \"/path/to/the/app {comic_file_path}\". You can use {comic_file_path} as a placeholder where YACReaderLibrary will place thet path to the comic file.\n- Purge covers and metadata not being used after a full library update.\n- Fix crash when updating the current folder content after a library update.\n- Fix crash when current folders is empty after an update.\n- Enable dropping content on the FolderContentView.\n- Fix open containing folder... shortcut for comics.\n- Add a dialog to show information about a library, it includes the number of folders and comics and the number of read comics.\n- Fix occasional crashes when using automatic library updates.\n- Add setting to hide the \"Continue Reading...\" banner from the home view.\n- Improve Grid and Flow Info comics view scroll performance.\nYACReaderLibraryServer\n- New command --system-info to print information about the execution environment and available resources (including what image formats are supported and what libraries are used by the app).\n- Fix automatic libraries updates not being triggered.\nAll apps\n- Sorting heuristic to try to find spreads in the content of a comic is now only used for files with less than 1000 pages to avoid false positives.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"9.15.0","site":"https://www.yacreader.com/","source":"YACReader","license_or_tos":"GPL-3.0","resources":null,"verified":false}