{"appId":"winget_app_GnuCash.GnuCash","appShortcutName":"Winget Application","appDisplayName":"GnuCash","authorId":"winget","releaseTagName":"winget-5.10","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Personal and small-business financial-accounting software\n\nGnuCash is personal and small-business financial-accounting software, freely licensed under the GNU GPL and available for GNU/Linux, BSD, Solaris, Mac OS X and Microsoft Windows.\nDesigned to be easy to use, yet powerful and flexible, GnuCash allows you to track bank accounts, stocks, income and expenses. As quick and intuitive to use as a checkbook register, it is based on professional accounting principles to ensure balanced books and accurate reports.\nThe GnuCash development team announces GnuCash 5.10, the tenth release in the stable 5.x series.\nBetween 5.9 and 5.10, the following bugfixes were accomplished:\n- Bug 798789 - Trading Accounts\n- Bug 799283 - Segfault/Crash if payment dialog change from customer to vendor\n- Bug 799420 - gnucash 5.8 crashes on windows 10 while importing qif\n- Bug 799423 - Crash when creating ETF transaction\n- Bug 799429 - Crash when changing accounting period end date\n- Bug 799430 - Type-Ahead feature lost account setting functionality\n- Bug 799433 - Right-click issue in import window\n  Make the context menu apply to the row under the pointer instead of the selected row.\n- Bug 799435 - Right-click issue in reconcile window\n  Right click should open the context menu, not extend the selection.\n- Bug 799437 - Crash deleting and recreating an SX with the scheduled transaction editor open\n- Bug 799439 - Duplicate information in description when importing CAMT.053.001.02 via aqbanking\n- Bug 799443 - Edit find account jump then open, open the last highlighted account not the jumped to account\n- Bug 799444 - Silent crash on CSV import\n- Bug 799451 - Cannot translate different meanings of string \"_Balance\" to Chinese.\n  Add context to the msgids.\n- Bug 799452 - Transaction Report: Cannot subtotal based on Number field\n  enable grouping and subtotals for Num field\n- Bug 799454 - Numeric value in exported CSV transactions\n- Bug 799456 - Tabbing through fields autoselects all but Num field\n  By which the reporter means that the value in every cell except Num is selected on cell entry.\n- Bug 799458 - Crash attempting to edit a scheduled transaction\n- Bug 799470 - Crash when clicking on Schedule Transaction Editor\nThe following fixes and improvements were not associated with bug reports:\n- Tabs now close when you middle-click on them.\n- The SX editor's saved duration and height are stored differently in preferences so values previously saved will be lost when switching between versions 5.9 and 5.10 (and later). We regret the inconvenience but the new scheme better matches GnuCash's use of the preferences.\n- Allow 0 cash amount when using the Stock Assistant to create a sell transaction. This might happen if the commission and fees exactly balance the proceeds of the sale.\n- Enforce searching for our gsettings schema files first where they were installed. This was not done when the installation prefix was /usr or /usr/local which could potentially cause gnucash to find other schema files first.\n- Set tooltip text on the outer tab container again so that it can be updated by main_window_update_page_long_name.\n- Tooltips on chart reports now appear any time the pointer hovers in the chart area and reflect the nearest point. Previously the pointer had to be very close to a point.\n- Updated the quote source lists in the Security Editor dialog to reflect the current Finance::Quote version.\n- Display a warning dialog when a transaction is unbalanceable because the user has set a minimum fraction on an account smaller than the security's fraction in a book using trading accounts.\n- Deleting a commodity will fail if there are accounts denominated in the commodity. When reporting the error to the user list those accounts.\n- Correct in Tips of the Day the IRC network where GnuCash's channel can be found.\n- Ensure Python bindings Session constructor loads the session's data.\n- Fix compile failures with Boost 1.87. This requires the minimum Boost version to be 1.67, removing the option for distributions to patch older versions.\n- Prevent deleting an account with an open register from logging spurious errors\n- Check that GUI refreshes are not suspended before calling gnc_gui_refresh_all.\n- Unify wording for alphavazntage tooltips.\n- New script to update translator-credits.\n  See POD for usage instructions.\n- Document cmake 3.14 requirement set a year ago.\nNew and Updated Translations: Chinese (Simplified Han script), Chinese (Traditional Han script), Croatian, Dutch, English (Australia), English (New Zealand), English (United Kingdom), French, German, Hebrew, Hungarian, Japanese, Portuguese, Portuguese (Brazil), Russian, Spanish, Swedish, Ukrainian\nHelp translate GnuCash on Weblate\nGerman AQBanking Users:\nThe AQBanking author is still working to get his updated PIN/TAN code finalized so the Flatpak, macOS, and Windows bundles of this release contain the last stable version, 6.5.4. The GnuCash nightly builds have beta releases with the new implementation, so consider using one of those if the stable AQBanking doesn't work for you.\nKnown Problems\nComplete list of all open bugs.\nDocumentation\nThe following fixes and improvements were not associated with bug reports:\n- Update the Security Editor section in manual to match the dialog.\n- add entity for menuchoice 'Export Reports'\n- Remove Finance::Quote appendix. The content has been moved to Wiki.\nNew and Updated Translations: Chinese, German","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.10","site":"https://www.gnucash.org/","source":"GnuCash Development Team","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}