{"appId":"winget_app_WonderIdea.MangoAnimationMaker","appShortcutName":"Winget Application","appDisplayName":"Mango AM","authorId":"winget","releaseTagName":"winget-3.0.800","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://online.mangoanimate.com/software/Mango%20Animate%20Animation%20Maker%203.0.800%20windows%20x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Animation Video Maker\n\n\nTool: Optimize the formula window interface to improve user experience.\nText: Optimize the text material classification and display to improve user experience.\nOperation: Optimize the canvas operation experience, distinguish canvas and assets operations on the left and right sides of the top.\nFavorites:Optimize the favorites panel feature to support adding local materials.\nAnimation: Optimize the advanced settings of gesture animation, and support setting the pen point position at any time.Animation: Optimize the anchor point edit feature, and advanced settings of some animation effects.\nSubtitles: Support one-click deletion of subtitles in all scenes.\nOperation: Support splitting folders.\nProperty: Paper cut effect supports edting thickness.\nMaterials: Add basic settings for special effect and foreground like adjusting opacity and position.\nMy scene: Add manager group feature to support custom classification, renaming scenes and other related operations.\nSTT: Optimize the recognition process, add speech recognition confirmation, and support viewing and application of previous speech recognition records.\nInterface: Fixed the issue where some buttons exceeding the container and displaying wrong names.\nOthers: Known bugs fixed.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.0.800","site":"https://www.wonderidea.com/","source":"Mango Animate Animation Maker Solution","license_or_tos":"Proprietary","resources":null,"verified":false}