{"appId":"winget_app_FlorianHeidenreich.Mp3tag","appShortcutName":"Winget Application","appDisplayName":"Mp3tag","authorId":"winget","releaseTagName":"winget-3.28","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.mp3tag.de/mp3tagv328-x64-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The universal tag editor and more...\n\nMp3tag is a powerful and easy-to-use tool to edit metadata of audio files.\nIt supports batch tag-editing of ID3v1, ID3v2.3, ID3v2.4, iTunes MP4, WMA, Vorbis Comments and APE Tags for multiple files at once covering a variety of audio formats.\nFurthermore, it supports online database lookups from, e.g., Discogs, MusicBrainz or freedb, allowing you to automatically gather proper tags and download cover art for your music library.\nYou can rename files based on the tag information, replace characters or words in tags and filenames, import/export tag information, create playlists and more.\nNEW: added support for replacing displayed cover via Tag Panel and Extended Tags. (#42361, #44338, #47635, #51792, #53337, #54769)\nNEW: added scripting function `uuid` to create a 128-bit universally unique identifier (UUID).\nNEW: added support for scaling toolbar icons up to 200% (see 'Options > Appearance'). (#13986)\nFIX: runtime error when removing last item from Tag Panel when docked horizontally.\nCHG: increased the maximum number of possible search fields for Tag Sources to 5.\nFIX: debug output of web sources framework used incorrect script-line numbers in some cases. (#66132)\nFIX: option to reference contents of output buffers via `%output%` in string parameters of web sources framework functions also replaced `output`. (#66196)\nCHG: find results sort column and sort order is remembered for the current search session.\nFIX: find results sort indicator was not updated correctly for subsequent searches. (#65741)\nFIX: action type 'Generate Playlists' used format string for playlist filenames to partition files.\nFIX: last command in Tag Sources script was omitted if followed by comment. (#65645)\nFIX: File List sort indicator changed to previous column after customizing File List columns (since v3.15). (#65691)\nLNG: updated Catalan, Danish, Italian, Simplified Chinese, Slovak, and Spanish translation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.28","site":"https://www.mp3tag.de/en","source":"Florian Heidenreich","license_or_tos":"Freeware","resources":null,"verified":false}