{"appId":"winget_app_BinaryMark.BatchFileSplitJoin","appShortcutName":"Winget Application","appDisplayName":"Batch File Split & Join Free Edition","authorId":"winget","releaseTagName":"winget-5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0240500t.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Split and merge multiple text or binary files in either character, line, or byte modes. When splitting files, you can split on certain text or binary separator; target given number of parts; or target specific part size. Join files on lines/bytes.\n\nSplit and merge multiple text or binary files in either character, line, or byte modes. When splitting files, you can split on certain text or binary separator; target given number of parts; or target specific part size. In all cases you can select operational unit to be either line or character for text files and byte for data/binary files. Files can be joined in specific order on a line-to-line, char-to-char, or byte-to-byte level. Process 1000s of files using multiple CPU cores in manual, automatic/continuous, triggered/scheduled, or console modes, or directly from Windows Explorer right-click menu. Save files to output directory specified using either absolute or relative path, with original or new name defined by a mask. Select files for processing based on their name, dates, size, and contents using advanced file search supporting RegEx and advanced wildcards. Detailed processing logs are available in both user interface and log files. Run multiple program instances simultaneously.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}