{"appId":"winget_app_Eassos.DiskGenius","appShortcutName":"Winget Application","appDisplayName":"DiskGenius","authorId":"winget","releaseTagName":"winget-5.6.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download2.eassos.com/DGEngSetup5611580.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"All-in-one solution for IT professionals\n\nDiskGenius provides an all-in-one solution for data recovery, disk partition management and backup & restore for Windows PCs, Servers and workstations.\n- Enhanced\n  1. When using the Delete Files Permanently feature, if the partition cannot be locked after selecting the \"Delete Directory Entry\" option, the software will restart into WinPE and then perform the operation.\n  2. To ensure the smooth completion of operations such as formatting partitions, cloning partitions, and cloning disks, the BitLocker encryption status of the target partition will be removed if it is a BitLocker encrypted partition.\n  3. For features that require restarting and entering WinPE to execute, if a BitLocker encrypted partition is involved, the software will temporarily turn off the encryption status and restore it after the operation is completed.\n  4. Optimize the file recovery effect for exFAT partitions.\n  5. The resizing of partitions within dynamic volumes is not allowed.\n- Fixed\n  1. Fixed the issue that the software did not refresh after inserting a USB disk.\n  2. Fixed the issue that the exFAT and FAT32 partitions were displayed as damaged in some cases.\n  3. Fixed the issue that the capacity of USB drives containing an ISO partition was displayed incorrectly.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.6.1","site":"https://www.eassos.com/","source":"Eassos Co., Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}