{"appId":"winget_app_TonyPottier.ImageView","appShortcutName":"Winget Application","appDisplayName":"ImageView","authorId":"winget","releaseTagName":"winget-2.4.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The free and open-source image viewer for Microsoft Windows\n\nImageView is a free and open-source image viewer for Microsoft Windows.\nIt focuses primarily on ease of use and aims to remain lightweight.\n- First of all, the drawing logic has been displaced in a custom PictureBox control that handles everything.\n  ImageView is basically the PictureBox control \"with some UI stuff around it\".\n- The code logic has been separated from the UI as much as possibly by pushing it aside in a \"State\" class.\n  This is a much better and cleaner solution than what was there before (a hot mess of code in the windows form class file)\nNew features\n- HEIC support (Apple's new default image format in IOS).\n  This was already baked in ImageMagick but not officially supported in ImageView. (#19)\nBug Fixes\n- Images with alpha channels not displaying properly (#18)\n- Changing language resets the status bar (#16)\nOther changes\n- All dlls are now under a /lib subfolder (#22)\nKnown issues\n- Pixel Coordinates are wrong above 32767 (#1)\nTodo\n- Support for multi page ICOs\n- Support for animated GIFs\n- Browse palette of images when available\n- Add a check for updates functionality\n- Manage file associations directly from settings\n- File Deletion: Add a switch based on the configuration to move to recycle bin by default instead of deleting.\n- File Deletion: In case of AunauthorizedAccessException prompt user to restart the app in admin mode\n- If a picture was moved while browsing a folder, recover gracefully by attempting to load the previous or next image\n- Custom toolbar (pick what tools should be seen and in which order)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.4.6","site":"https://github.com/tonyp7/ImageView","source":"Tony Pottier","license_or_tos":"MIT License","resources":null,"verified":false}