{"appId":"winget_app_Wondershare.DemoCreator","appShortcutName":"Winget Application","appDisplayName":"Wondershare DemoCreator","authorId":"winget","releaseTagName":"winget-8.5.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.wondershare.com/cbs_down/democreator_8.5.2_full7743.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An easy-to-use screen recorder for lessons and tutorials.\n\nWondershare DemoCreator is a professional presentation video creation tool that integrates recording and editing to help you create videos more efficiently. Using DemoCreator, you can not only experience high-definition screen recording, webcam capture, microphone voice-over recording, screen drawing tool, spotlight, and other practical recording functions. You can also use the built-in video templates, transition effects, green screen chroma key, Pan&Zoom, stickers, and other hundreds of editing tools and presentation video templates to help you create videos with ease.\nDemoCreator has made special optimizations for video creation such as presentations, online training, and game recording. It supports the audio and video sub-track editing of the recorded files according to the input source. It uses cursor effects, audio fade-in and fade-out, and other post-production tools to accurately modify the video material so that you can make better use of the video material. During game recording, unique adaptations and optimizations have been made for various popular games to stabilize the image capture and enhance the game recording experience.\nUpgrade and Enhance Video Presentation Mode\n1. \nPPT to Video: Supports importing PPT files. No need for a timeline; simply arrange the layout and record to complete your video creation effortlessly.\n2. \nPresentation Templates to Video: Offers over 30 presentation templates covering various subjects, professions, and topics. This significantly enhances your productivity and makes your videos more engaging and impressive.\n3. \nLive Presentation: Supports real-time online teaching and meeting presentations.\nWith zero learning curve, you can install and start using it immediately. Upgrade now for an enhanced experience!","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"8.5.2","site":"https://www.wondershare.com/","source":"Wondershare Software","license_or_tos":"Proprietary","resources":null,"verified":false}