{"appId":"winget_app_RProject.R","appShortcutName":"Winget Application","appDisplayName":"R for Windows","authorId":"winget","releaseTagName":"winget-4.4.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cloud.r-project.org/bin/windows/base/old/4.4.2/R-4.4.2-win.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"R is a free software environment for statistical computing and graphics.\n\nR is a language and environment for statistical computing and graphics. It is a GNU project which is similar to the S language and environment which was developed at Bell Laboratories (formerly AT&T, now Lucent Technologies) by John Chambers and colleagues. R can be considered as a different implementation of S. There are some important differences, but much code written for S runs unaltered under R.\nR provides a wide variety of statistical (linear and nonlinear modelling, classical statistical tests, time-series analysis, classification, clustering, …) and graphical techniques, and is highly extensible. The S language is often the vehicle of choice for research in statistical methodology, and R provides an Open Source route to participation in that activity.\nOne of R’s strengths is the ease with which well-designed publication-quality plots can be produced, including mathematical symbols and formulae where needed. Great care has been taken over the defaults for the minor design choices in graphics, but the user retains full control.\nR is available as Free Software under the terms of the Free Software Foundation’s GNU General Public License in source code form. It compiles and runs on a wide variety of UNIX platforms and similar systems (including FreeBSD and Linux), Windows and MacOS.\nC-LEVEL FACILITIES\n- The S-compatibility macros F77_COM and F77_COMDECL defined in header ‘R_ext/RS.h’ are deprecated and will be removed shortly. We could find no record of their use.\nBUG FIXES\n- Mathlib function lgammacor(x) no longer warns about underflow to zero for large x.\n- Text widths and heights were incorrectly reported by the Quartz device if the drawing context didn't exist yet (typically when drawing off-screen to a window that is yet to appear, see PR#18591).\n- The Quartz device could segfault in cases where paths with spaces are used in the new glyph drawing API. Thanks to Tomek Gieorgijewski (PR#18758).\n- On macOS in R CRAN builds, it is again possible to read little-endian UTF-16 text with a BOM from a connection using encoding=\"UTF-16\". Users building R from source should avoid using the system libiconv in macOS 14.1 and later.\n- methods' internal .requirePackage() now re-enables primitive method dispatch when needed; thanks to Ivan Krylov for demystifying CRAN package check failures on the R-devel mailing list.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.4.2","site":"https://www.r-project.org","source":"R Core Team","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}