{"appId":"winget_app_BinaryMark.BatchFileEncrypt","appShortcutName":"Winget Application","appDisplayName":"Batch File Encrypt Free Edition","authorId":"winget","releaseTagName":"winget-5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0310500t.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Encrypt and decrypt whole files or their parts using AES, 3-DES, RC2, and DES symmetric algorithms. You can encrypt files with a single password or specify cryptographic keys (vectors) instead. You can change key bit length for better protection.\n\nEncrypt and decrypt whole files or their parts using AES, Triple-DES (3DES), RC2, and DES symmetric algorithms.\nYou can encrypt files with a single password or specify cryptographic keys (vectors) instead.\nYou can change key bit length for better protection.\nYou can select specifically which bytes in a file should be encrypted/decrypted, though by default the whole file is processed.\nProcess 1000s of files using multiple CPU cores in manual, automatic/continuous, triggered/scheduled, or console modes, or directly from Windows Explorer right-click menu.\nSave files to output directory specified using either absolute or relative path, with original or new name defined by a mask.\nSelect files for processing based on their name, dates, size, and contents using advanced file search supporting RegEx and advanced wildcards.\nOptionally merge together, split all, or zip processed files.\nPerform different operations on different files with conditional processing and process branching.\nDetailed processing logs are available in both user interface and log files.\nRun multiple program instances simultaneously.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}