{"appId":"winget_app_sbt.sbt","appShortcutName":"Winget Application","appDisplayName":"sbt","authorId":"winget","releaseTagName":"winget-1.10.7","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A build tool for Scala, Java, and more\n\n\n🚀 features and other updates\nEnable runner script's build detection by default to require --allow-empty by @eed3si9n in #7966\nSupport glob expressions in scripted to aid sbt 2.0.0-M3 cross building by @eed3si9n in #7933 / #7968\n- perf: Precompile a regex in hot code by @retronym in sbt/zinc#1508\nBuild directory detection\nStarting 1.10.7, the sbt runner script enables build directory detection by default. This means that the sbt will exit with error when launched in a directory without build.sbt or project/, with exceptions of sbt new, sbt --script-version etc.\n\nTo override this behavior temporarily, you can use --allow-empty flag. To permanently opt out of the build directory detection, create $XDG_CONFIG_HOME/sbt/sbtopts with --allow-empty in it.\n\ncsrMavenDependencyOverride setting\nsbt 1.10.7 updates Coursier to 2.1.11. sbt 1.10.7 also adds a new setting csrMavenDependencyOverride (default: false), which controls the resolution, which respects Maven dependency override mechanism, also known as bill-of-materials (BOM) POM. Since there is a performance regression in the new resolver, we are setting the default to false.\n\n🐛 bug fixes\n- fix: Add csrMavenDependencyOverride to opt into bill-of-material (BOM) respecting Coursier resolution by @eed3si9n in #7970\n- fix: Update the template resolver to use Giter8 0.17.0, which fixes the SLF4J warning by @eed3si9n in #7947\n- fix: Update JLine 2 fork to 9a88bc4 and Jansi to 2.4.1, which fixes crash on Windows on ARM by @Friendseeker in #7952\n🎬 behind the scene\n- ci: New Scala CLA URL by @eed3si9n in #7929\n- ci: Use new Scala CLA GitHub Action by @Friendseeker in #7953\n- ci: Prepare for sbt 1.10.7 by @Friendseeker in #7957\n- ci: Restore disabled Multirepo integration test by @Friendseeker in #7962\nFull Changelog: v1.10.6...v1.10.7","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.10.7","site":"https://www.lightbend.com/","source":"Lightbend, Inc.","license_or_tos":"Apache-2.0","resources":null,"verified":false}