{"appId":"winget_app_Xanashi.Icaros","appShortcutName":"Winget Application","appDisplayName":"Icaros","authorId":"winget","releaseTagName":"winget-3.3.3.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Xanashi/Icaros/releases/download/v3.3.3/Icaros_v3.3.3.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A collection of lightweight, high quality, Windows Shell Extensions\n\nIcaros is a collection of lightweight, high quality, Windows Shell Extensions.\nIcaros can provide Windows Explorer thumbnails, for essentially any video media format supported by FFmpeg, this includes popular filetypes such as: Mkv, Flv, Avi, Mp4, Mov, Rmvb, M2ts, Ogm etc.\nBesides the FFmpeg supported filetypes, Icaros also contains custom parsers, which can produce Cover Art thumbnails for Mkv, Flac, Ape, Mpc and several other filetypes.\nIcaros also provides Windows Explorer properties for the following popular filetypes: Mkv, Mk3d, Mp4, Mov, Webm, Ogm, Ogg, Flv, Avi, Rm, Rmvb, Flac, Opus, Spx, Ape, Mp3, Mpc, Mka, Tak, Tta, Ofr, Wav and more.\nProperties refer to the info shown for each file in Explorer, such as length, width, height, title, channels and so on.\nGood Afternoon Everyone,\nIt's finally time for another stable release. I've only made a few changes since the last Beta, here they are:\n- Added thumbnailing support for AVIF and HEIC covers in several audio filetypes\n- Fixed aspect ratio for some MP4, MOV (and more) files in the MS Photos app\n- A few performance improvements\nThank you all so much for the donations, troubleshooting and help with the translations! ❤️ I hope you all enjoy the new release!\n\nIcaros v.3.3.3 Final\n- Added support for VVC decoding\n- Added support for thumbnailing 'tiled' HEIC files\n- Added thumbnailing support of INDD files with an embedded preview\n- Added thumbnailing support of EPS files with an embedded preview\n- Added thumbnailing support for WEBP, AVIF and HEIC covers in several audio filetypes\n- Added AVIF, AI, INDD, EPS, PX, EXR and PDXPRJ to the 'Common' and 'Most Known' presets\n- Improved HEIF/AVIF thumbnailing support\n- Improved thumbnailing of AI files\n- Fixed thumbnailing of several HEVC files\n- Fixed colors in EXR thumbnails (changed to sRGB color space)\n- Fixed thumbnailing of PXZ files\n- Fixed aspect ratio for some MP4, MOV (and more) files in the MS Photos app\n- Fixed MP4 'creation date' property being off by 1 hour\n- Fixed some unicode characters showing up wrong in properties\n- Fixed rare MKV crash (Thank you Brett! __)\n- Fixed issue where Icaros failed to return properties of large files (4GB+) (Thank you dgonyier! __)\n- Fixed several UNC Icaros Cache locations issues\n- The 'View Size' column on the Locations tab will now only show up in Windows 7 and below, as it is not relevant on newer versions of Windows\n- PDF, AI, EPS, INDD, HEIC, HEIF, AVIF, EXR and PSXPRJ are now registered as image formats\n- A couple of minor improvements\n- Updated GCC\n- Updated FFmpeg","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.3.3.0","site":"https://github.com/Xanashi","source":"Tabibito Technology","license_or_tos":"Freeware","resources":null,"verified":false}