{"appId":"winget_app_buchen.portfolio","appShortcutName":"Winget Application","appDisplayName":"Portfolio Performance","authorId":"winget","releaseTagName":"winget-0.73.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/portfolio-performance/portfolio/releases/download/0.73.0/PortfolioPerformance-0.73.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Track and evaluate the performance of your investment portfolio across stocks, cryptocurrencies, and other assets.\n\n\n- New: Updated to Eclipse 2024-12\n- New: Additional derived data series in the assets chart (e.g., invested capital for any classifications, not just the total portfolio).\n- New: New column: Indicator for the price range.\n- New: Purchase value/price now displayed both with and without taxes/fees in the assets overview.\n- New: Reference account balance in the list of securities accounts.\n- New: Sorting options for classifications when editing a security.\n- New: Ctrl-D to duplicate a transaction in tables.\n- New: PDF importer for Ginmon VL Sparen.\n- Improvement: Windows version now supports ARM-based devices.\n- Improvement: Default currency is suggested based on the locale (for new files).\n- Fix: Australian trading calendar now correctly shifts \"Australia Day\" to the next weekday when it falls on a weekend.\n- Fix: Corrected chart legend labels in some languages.\n- Fix: Resolved issue with GBX/GBP rates from Yahoo Finance.\n- Fix: No more white screen flashes in Dark Theme (macOS tables).\n- Improvements to the PDF importers for DKB, Targo Bank, Hypothekarbank, PostFinance, Swissquote, Baader Bank, Commerzbank, Scalable Capital, ING, Sunrise, Consorsbank, and DADAT.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.73.0","site":"http://abuchen.name","source":"Andreas Buchen","license_or_tos":"EPL-1.0","resources":null,"verified":false}