{"appId":"winget_app_Hydrogen_Music.Hydrogen","appShortcutName":"Winget Application","appDisplayName":"Hydrogen (Advanced drum machine for GNU/Linux)","authorId":"winget","releaseTagName":"winget-1.2.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/hydrogen-music/hydrogen/releases/download/1.2.4/Hydrogen-1.2.4-win64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Drum Machine and Sequencer\n\n\nThis patch release fixes a number of bugs and inconsistencies found since version 1.2.3 and is generally recommended for all users.Added\n- Forward compatibility for .h2song, .h2pattern, .h2playlist, and drumkit changes introduced in version 2.0.\n- MIDI and OSC commands\n- CLEAR_SELECTED_INSTRUMENT - to remove all notes of the selected pattern associated with the currently selected instrument.\n- CLEAR_PATTERN - to remove all notes of the selected pattern.\n- INSTRUMENT_PITCH - to adjust the pitch of an instrument.\n- OSC commands\n- NOTE_ON and NOTE_OFF which are handled like incoming MIDI events without triggering their associated actions.\n- CLEAR_INSTRUMENT - to remove all notes of the selected pattern associated with the provided instrument number.\n- CLI option:\n    - -O/--osc-port to use a custom OSC port in both hydrogen and h2cli.\n    - -L/--log-file to provide a path to an alternative log file.\n    - -T/--log-timestamps to add timestamps to all log messages.\n    - --config to use a different user-level config file.\n    - --compression-level for h2cli to set the trade-off between max. quality (.mp3 and .ogg)/max. speed (.flac) (0.0) and max. compression (1.0) for exported audio files.\n    - Adding support for importing and exporting audio files of format .mp3, .opus, .au, .caf, .voc, .w64. Drumkits containing those  formats can be loaded with older versions of Hydrogen too. libsndfile >= 1.1.0 is required on your system for MP3 support. (#2023)\n    - X-NSM-Exec entry added to org.hydrogenmusic.Hydrogen.desktop by @grammoboy2 (#2042).\n    - Delete key does now remove selected notes and notes under cursor in NotePropertiesRuler.\nChanged\n- Brazilian translation updated.\n- Grid lines in the Song Editor are now rendered dotted to emphasize that this is the space the patterns in rather than objects in their own right.\n- Virtual keyboard strokes are now mapped exactly as incoming MIDI NOTE_ON events (respecting both \"Use output note as input note\" and hihat pressure groups). But do not trigger associated actions (#1770).\n- CLI option -d understand driver names regardless of capitalization.\n- h2cli option -V is now able to handle whitespaces between flag and argument.\n- h2cli long option for -k is renamed --drumkit -> kit in order to align the naming with the one used in hydrogen CLI options.\n- Smaller keyboard cursor size with resolution set to off.\n- Rename \"J.Master\" button into \"Timebase\".\nFixed\n- Fix potential segfault on ill-formated notes in .h2song files.\n- Fix buzzing sound during startup when using Port Audio (#1932).\n- Fix build failure without precompiled headers (e.g. on Gentoo) (#1944).\n- Fix persistent of hihat pressure group settings while changing/restarting MIDI drivers.\n- Fix mapping of NOTE_OFF MIDI messages in hihat pressure groups.\n- Fix segfault when using MIDI sense button in table of Preferences > MIDI after removing rows above it from the table.\n- Fix synchronization problems while using JACK Timebase support (#1953).\n- Fix compilation error on macOS with case-sensitive filesystem (#1938).\n- Fix usability with large QT_SCALE_FACTOR (#1933).\n- Fix MIDI, WAV, and LilyPond export as well as drumkit import and export with with non-ASCII filenames (#1957).\n- Paths to songs and scripts are now properly saved relative to a .h2playlist file (in case the corresponding option was set).\n- Fix grid line rendering with resolution set to off (#2015).\n- Fix handling of adjacent tags with same content in Director by @aldimond (#2036).\n- Fix copy/cut/paste in PianoRollEditor.\nRemoved\n- Windows 32bit support dropped (due to upstream limitations).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.2.4","site":"http://hydrogen-music.org/","source":"Hydrogen Developers","license_or_tos":"GPL-2.0","resources":null,"verified":false}