{"appId":"winget_app_BinaryMark.AdvancedFileFinder","appShortcutName":"Winget Application","appDisplayName":"Advanced File Finder Free Edition","authorId":"winget","releaseTagName":"winget-5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0230500t.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Generate file list of all files with specific name pattern, extension, properties and attributes, as well as text and binary content by recursively scanning specified directories and searching for matching files.Copy and rename found files.\n\nGenerate file list of all files with specific name pattern, extension, properties and attributes, as well as text and binary content by recursively scanning specified directories and searching for matching files.\nAll files can then be saved to file list; copied to a new location specified using either absolute or relative folder paths; or renamed.\nProgram can use advanced wildcards, RegEx, and case sensitivity options when checking file names.\nYou can specify file name patterns to exclude from search, as well as directory scanning depth.\nWhen looking for files, program can inspect file contents by looking for specific text or byte pattern.\nFile search can be further limited by specifing file size, dates, and attribute parameters.\nProcess 1000s of files using multiple CPU cores in manual, automatic/continuous, triggered/scheduled, or console modes, or directly from Windows Explorer right-click menu.\nSave files to output directory specified using either absolute or relative path, with original or new name defined by a mask.\nPerform different operations on different files with conditional processing and process branching.\nDetailed processing logs are available in both user interface and log files.\nRun multiple program instances simultaneously.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}