{"appId":"winget_app_BlueStack.BlueStacks","appShortcutName":"Winget Application","appDisplayName":"BlueStacks","authorId":"winget","releaseTagName":"winget-5.21.600.1019","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://ak-build.bluestacks.com/public/app-player/windows/nxt/5.21.600.1019/f6945d044544789909820ed9a02fcb0e/FullInstaller/x64/BlueStacksFullInstaller_5.21.600.1019_amd64_native.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Play Android games on PC or try instantly from our cloud\n\n\n1. Unleash your inner legend in Mobile Legends: Bang Bang (com.mobile.legends) and dominate the battlefield with precision. Say goodbye to aiming inaccuracies and unwanted black screens on BlueStacks 5 Android Pie & Android 11.\n2. Gear up to outsmart your rivals in Arknights (com.YoStarEN.Arknights) without a hitch on BlueStacks 5 Android Pie & Android 11!\n3. Prepare for glory in 서머너즈 워: 크로니클 (com.com2us.chronicles.android.google.kr.normal, com.com2us.chronicles.android.google.us.normal) as the game will no longer freeze or show a black screen on BlueStacks 5 Android Pie & Android 11. Victory is just a battle away!\n4. Outmaneuver your enemies in Wing Fighter (com.minigame.wszj.android.gp) without any error message on BlueStacks 5 Android Pie & Android 11. Remember, Sky’s the limit!\n5. Say goodbye to audio glitches in 小妖問道 (com.global.xddq) on BlueStacks 5 Android 11. Get ready to summon mystical powers and battle legendary foes in your quest for immortality!\n6. You can now play Dancing Line (com.cmplay.dancingline) without sound interruptions on BlueStacks 5 Android 11. Follow the beat and let the music lead your way!\n7. Upload and watch videos or video call your friends on WhatsApp Messenger (com.whatsapp) smoothly and without any issues on BlueStacks 5 Android Pie.\n8. Princess Connect! Re: Dive (com.ini3.PrincessConnect) will no longer crash on BlueStacks 5 Android Pie & Android 11. Adventure awaits in Astroom!\n9. Jump into 메이플스토리M (com.nexon.nsc.maplem) and create new characters effortlessly on BlueStacks 5 Android Pie & Android 11. Start your epic journey with smooth gameplay, with no obstacles in sight!\n10. Switch between Portrait and Landscape mode in AFK Journey (com.farlightgames.igame.gp) using the “Rotate” icon on the Side toolbar without any hassles on BlueStacks 5 Android Pie.\n11. Step into the shadows and uncover the mysteries in 에오스 블랙 (com.BluePotionCompany.EosBlack) without the game crashing on BlueStacks 5 Android Pie & Android 11.\n12. Madden NFL 25 Mobile Football (com.ea.gp.maddennfl21mobile) will no longer freeze while starting on BlueStacks 5 Android Pie & Android 11.\n13. Reinstall 鸣潮 (com.kurogame.mingchao) on BlueStacks 5 Android Pie and play your heart out as unwanted error messages will no longer stop you from unleashing your inner adventurer and navigating the wild seas!\n14. Crashes will no longer stop you from demonstrating your prowess in these apps:\n- 波拉西亞戰記 (com.gamania.twp) on BlueStacks 5 Android Pie & Android 11.\n- Star Wars: Hunters™ (com.zynga.starwars.hunters) on BlueStacks 5 Android Pie.\n- HIT2 (com.nexon.hit2tw) on BlueStacks 5 Android 11.\n-《英雄聯盟：激鬥峽谷》(com.riotgames.league.wildrifttw) on BlueStacks 5 Android Pie.\n- 캐시노트 - 사장님 필수앱 (cashnote.com.albatross) on BlueStacks 5 Nougat 32-bit, Android Pie, and Android 11.\n- 黎明死線 M - Envoy (com.netease.ma100tw) on BlueStacks 5 Android Pie & Android 11.\n- KartRider: Drift (com.nexon.kartdrift) on BlueStacks 5 Android Pie.\n- StarPlayer (com.axissoft.starplayer) on BlueStacks 5 Nougat 32-bit, Android Pie, and Android 11.\n- うたのプリンスさまっ LIVE EMOTION (jp.co.broccoli.utapri.liveemotion) on BlueStacks 5 Android Pie & Android 11.\n15. Say goodbye to the sound issues in Duolingo: Language Lessons (com.duolingo) on BlueStacks 5 Android 11 and prepare to join the language party!\n16. Unearth hidden treasures in 레이븐2 (com.netmarble.raven2) seamlessly, free from pesky error messages or game crashes on BlueStacks 5 Android Pie & Android 11.\n17. Forge your destiny in 黑色契約 MOBILE (com.estgames.cm.tw) without any graphical glitches on BlueStacks 5 Android Pie and Android 11. Only the bold will survive – will you rise to the challenge?\n18. Record and share videos flawlessly on Facebook (com.facebook.katana) and Instagram (com.instagram.android) on BlueStacks 5 Android 11.\n19. Venture into the shadows and confront your fears in Dead by Daylight Mobile (com.netease.dbdena) without the game crashing or freezing on BlueStacks 5 Android Pie and Android 11.\n20. Step into the realm of the fearless in NIGHT CROWS (com.wemade.nightcrowsglobal) and experience the thrill without any graphical glitches on BlueStacks 5 Android Pie!\n21. Say goodbye to crashes during video calls with Telegram (org.telegram.messenger) on BlueStacks 5 Android Pie—connect seamlessly and keep the conversation going!\n22. Effortlessly translate your text with Google Translate (com.google.android.apps.translate) on BlueStacks 5 Nougat 32-bit, Android Pie, and Android 11—no hassles, just smooth sailing!","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.21.600.1019","site":"https://www.bluestacks.com/","source":"now.gg, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}