{"appId":"winget_app_Lenovo.AIMeetingManager","appShortcutName":"Winget Application","appDisplayName":"联想智能会议助手","authorId":"winget","releaseTagName":"winget-3.1.16.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://filedownload.lenovo.com/dtsw/AIMeeting/Packages/AIMeetingManager_3.1.16.1.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Integrating communication and collaboration\n\nLenovo AI Meeting Manager is an intelligent office voice assistant for Windows PC, featuring various AI functions such as real-time voice translation, audio/video real-time subtitle translation, voice input, etc.\n- Intelligent Subtitle: In the scenarios where the audio/video voice content needs to be translated, such as meetings and multi-language communication, it can assist in translating the corresponding language to other countries and displaying it through text.\n- Meeting Editing: Organize and edit the audio files and text files from real-time translation or one-key transcription, as well as save the texts. The files generated by real-time translation can be exported to Word, Excel and TXT formats in the form of original/translation/original & translation. The record files generated by one-key transcription can only be exported as the original text.\n- Audio to Text: Extract and export the contents of audio/video files as Word or TXT documents as needed.\n- Voice Recording: Through voice input, when you are writing emails or trying to use text input across software, it can automatically transcribe/translate the user's voice into the required text information.\n- Please use this program under the network service provided by ISP (China Mobile, China Unicom, China Telecom, etc.) in mainland China.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.1.16.1","site":"https://lva.lenovo.com.cn/","source":"Lenovo Group Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}