{"appId":"winget_app_Cairo.Cairo","appShortcutName":"Winget Application","appDisplayName":"Cairo Desktop Environment","authorId":"winget","releaseTagName":"winget-0.4.370","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/cairoshell/cairoshell/releases/download/v0.4.370/CairoSetup_ARM64.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/cairoshell/cairoshell/releases/download/v0.4.370/CairoSetup_64bit.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A customizable, intuitive desktop environment for Windows.\n\nCairo is a desktop environment for Windows.\nOur goal is to develop a desktop experience that increases productivity and advances current technology standards.\nWith a focus on stability, performance, and productivity, Cairo aims to deliver an interface that exceeds expectations and delivers superior ease of use.\nChanges since 0.4.317\n- Cairo no longer requires .\n  NET Framework 4.7.1, and includes all necessary .\n  NET files. As a result, the download size has increased.\n- Added \"add to programs menu\" and \"add to quick launch\" commands to desktop/stacks icon context menus (#834)\n- Added option to automatically show removable drives as stacks in the menu bar (#836)\n- Added options to hide the programs or places menus (#821, thanks @TheXorog!)\n- Added updates support for the ARM64 build (#812)\n- Added a commands framework which can be used by extensions (#144)\n- Extensions can invoke commands offered by Cairo components and other extensions\n- Extensions can register their own commands, which can appear in desktop/stacks icon context menus\n- Fixed apps disappearing from the programs menu when the shortcut that the app was added from is deleted, but the app is still installed (#834)\n- Fixed being unable to drag desktop icons to the programs menu (#834)\n- Fixed error adding .exe files to the programs menu when the file has no description (#834)\n- Fixed extensions that are misbehaving preventing Cairo startup (#814)\n- Fixed mouse back/forward buttons navigating the desktop when the dynamic desktop is disabled (#827)\n- Fixed programs menu closing itself when the menu bar is on the bottom edge (#824)\n- Fixed \"open on desktop\" sometimes not appearing when right-clicking stacks (#829)\n- Fixed task list menu sometimes appearing in the wrong place (#811)\n- Fixed taskbar items sometimes disappearing after removing a monitor (#817)\n- Improved translations:\n- German (#808, thanks @uDEV2019!)\n- Simplified Chinese (#832, thanks @Cria-Cysta!)\n- Spanish (#818, thanks @ponjadito23!)\n- Misc under-the-hood improvements","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.4.370","site":"https://cairodesktop.com","source":"Cairo Development Team","license_or_tos":"Apache-2.0","resources":null,"verified":false}