{"appId":"winget_app_4tNiagaraSoftware.4tTrayMinimizer","appShortcutName":"Winget Application","appDisplayName":"4t Tray Minimizer Free","authorId":"winget","releaseTagName":"winget-6.07","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"4t Tray Minimizer is a lightweight but powerful window manager\n\n\nADDED\n  Windows 10 support\n  Windows 8 support\n  Support for console windows\n  Ability to redefine action for the mouse click on the title bar\n  Inactive favorite windows can be automatically minimized to tray after certain idle time is reached\n  Localization support\n  French language added. Thanks Jean-Pierre Lord for translation\n  Chinese language added. Thanks Merci chao for translation\n  Simplified Chinese translation added. Thanks Zeojc Uts for translation\n  Portuguese (Brazil) language added. Thanks Eduardo Lampugnani for translation\n  Russian language added. Thanks Ringil Endimion for translation\n  Spanish language added. Thanks Claudio Salvio for translation\n  Italian language added. Thanks Massimo Marcacci for translation\n  German language added. Thanks Thomas Creutz and Maximilian Balter for translation\n  Auto check updates\nCHANGED / IMPROVED\n  Technical support wizard was redisigned and improved\n  User interface improved\nFIXED\n  Error when changing item in Options>Titlebar>Standard titlebar and Options>Interface>Tray icon lists. Thanks Jonathan Griffon for the report.\n  Favorite's options>Automatically>Minimize to tray when it's executed but wait for N seconds did not wait for console windows. Thanks CDC for the report.\n  Windows 8: windows menu of Windows Explorer did not close after choosing 4t Tray Minimizer commands. Thanks Jordi for the report.\n  Wrong site link in Tech Support application\n  Additional window menu does not respond for Opera browser. Thanks Charles W. Billow for the report.\n  Windows Explorer crashes randomly. Many thanks Cameron Clarke, Danny Stumpf and Heidi-Ann Kennedy for the reports and patience\n  Additional title bar buttons were not always shown for 64-bit programs in Windows 8.1\n  Additional title bar buttons were not shown for Office 2013 after launching\n  Chinese language did not display correctly in main menu and toolbar\n  Hide tray feature: empty icon may show while restoring tray area. Thanks Toni Ostarcevic for the report\n  minor errors","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.07","site":"http://www.4t-niagara.com/","source":"4t Niagara Software","license_or_tos":"Proprietary","resources":null,"verified":false}