{"appId":"winget_app_HighMotionSoftware.VidBatch","appShortcutName":"Winget Application","appDisplayName":"VidBatch","authorId":"winget","releaseTagName":"winget-1.1.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.highmotionsoftware.com/download/vidbatch/setup-vidbatch-latest.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"VidBatch - is batch video processing tool for Windows.\n\nVidBatch is a free batch video processing tool. First, add the desired video files to the processing list, then add tasks, adjust the parameters and process a bunch of your video files at once.\nYou can combine several tasks in the list and process them in one go! For example, you can resize and set the watermark to your video files in batch mode.\nTo speed up the processing, VidBatch works in multithreaded mode, taking the full power of your modern CPU.\n- Added Trim task.\n- Added Export Images task.\n- Resize task: added the ability to select the resizing - by specified values or aspect ratio.\n- Resize task: added ability to save entered values to the Combobox list.\n- Save As task: Added option to remove subtitles.\n- Save As task: Changed the default values for some parameters.\n- Save As task: Fixed saving video with streams of other types besides video and audio.\n- Save As task: Fixed problem with processing video streams with unsupported codecs.\n- Save As task: fixed bitrate sizes for video and audio (from bytes to Kbps).\n- Watermark Image task: many minor fixes.\n- Watermark Image task: Fixed a memory leak.\n- Lots of minor fixes for the interface and tasks.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.1.0","site":"https://www.highmotionsoftware.com/","source":"High Motion Software","license_or_tos":"Freeware","resources":null,"verified":false}