{"appId":"winget_app_MoonlightGameStreamingProject.Moonlight","appShortcutName":"Winget Application","appDisplayName":"Moonlight Game Streaming Client","authorId":"winget","releaseTagName":"winget-6.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/moonlight-stream/moonlight-qt/releases/download/v6.1.0/MoonlightSetup-6.1.0.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/moonlight-stream/moonlight-qt/releases/download/v6.1.0/MoonlightSetup-6.1.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Play games remotely from your NVIDIA GameStream-enabled PC\n\n\nDownload links:\n- Windows Installer (Universal)\n- Windows Portable x64 or ARM64 (for work/public PCs without the ability to install new programs)\n- macOS (Universal)\n- Snap (for Ubuntu-based Linux distros)\n- Flatpak (for other Linux distros)\n- AppImage (Linux, no installation required)\n- Raspberry Pi 4 and 5\n- Generic ARM 32-bit and 64-bit Debian packages (not for Raspberry Pi)\n- Experimental RISC-V Debian packages\n- NVIDIA Jetson and Nintendo Switch (Ubuntu L4T)\n- Steam Link device\nThe Windows installer package may require an Internet connection to download the latest Microsoft Visual C++ Runtime if your PC does not already have it installed. If you do not have Internet access during installation, you can pre-install the runtime from Microsoft's website or use the portable version.To update an existing installation, simply run the latest installer (for Windows) or replace the old app in your Applications folder (for Mac). For the portable Windows version, extract the latest version on top of your old folder.To install on Steam Link hardware, extract the ZIP file to the root of a FAT32 flash drive, insert it into your Steam Link, then restart the Steam Link. Moonlight can run alongside official Steam Link streaming and other Steam Link apps.OS Support Changes:\n- Windows 10 (1809), Windows Server 2019, or later is now required\n- 32-bit versions of Windows are no longer supported\n- macOS Big Sur or later is now required\n- macOS Sequoia is now supported\nNew Features:\n- Experimental YUV 4:4:4 support for improved text clarity during remote desktop usage\n    - Host must be running latest Sunshine pre-release build or v0.24.0 (when released)\n    - Sunshine only currently supports YUV 4:4:4 encoding on Windows hosts\n- HDR streaming is now supported with software decoding (requires GPU with Vulkan or Metal support)\n- Bitrate limit can now be increased to 500 Mbps\n    - These bitrates are not officially supported but can improve image quality if client and host can handle it (Ethernet strongly recommended).\n- Audio decoding now uses 32-bit floating point format\nBugfixes:\n- Fixed inability to connect to hosts on macOS Sequoia\n- Fixed incorrect color range when streaming with AV1 from a host with an AMD GPU\n- Fixed unexpected Left Control key input when pressing the AltGr key on Windows clients\n- Fixed unexpected tearing artifacts when streaming with Intel Ivy Bridge GPUs\n- Fixed Windows installer failures due to failed firewall exception registration\n- Fixed GUI breakage on Raspberry Pi OS Buster or Ubuntu Bionic\n- Fixed Vulkan video decoding crash with recent Nvidia drivers using the AppImage build\n- Silenced log message spam when streaming HDR using Vulkan Video decoding on Linux\n- Fixed inability to see video output on SpacemiT K1 due to incorrect overlay plane selection\n- Fixed suboptimal pixel format selection with non-hwaccel FFmpeg hardware decoders\n- Fixed incorrect hardware decoding warning on embedded systems that use custom OpenMAX hardware decoding patches\n- Fixed build failure of libplacebo renderer on 32-bit platforms\n- Updated community-contributed translations from Weblate\nDependency Updates:\n- Updated Qt in Windows and macOS builds to 6.7.2\n- Updated OpenSSL to 3.3.2\n- Updated libplacebo to 7.349.0\n- Updated libva in AppImage build to 2.22.0\n- Updated WiX to 5.0.1\nKnown Issues:\n- Location Services on macOS may cause periodic lag and stuttering on Wi-Fi due to background network scans. To avoid the issue, disable Location Services on your Mac by going to \"System Preferences -> Security & Privacy -> Location Services\"","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.1.0.0","site":"https://github.com/moonlight-stream/moonlight-qt","source":"Moonlight Game Streaming Project","license_or_tos":"GPL-3.0","resources":null,"verified":false}