{"appId":"winget_app_MoritzBunkus.MKVToolNix","appShortcutName":"Winget Application","appDisplayName":"MKVToolNix","authorId":"winget","releaseTagName":"winget-89.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://mkvtoolnix.download/windows/releases/89.0/mkvtoolnix-64-bit-89.0-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"MKVToolNix is a set of tools to create, alter and inspect Matroska files under Linux, other Unices and Windows.\n\n\nNew features and enhancements\n- mkvmerge: AC-3 writer: mkvmerge will now use the codec ID A_AC3 even for streams with bitstream IDs 9 or 10 instead of the deprecated codec IDs A_AC3/BSID9 & A_AC3/BSID10. Fixes #2387.\n- MKVToolNix GUI: multiplexer: the mechanism for setting track languages to specific values upon adding a file has gotten a new option to always set the language, no matter whether or not the source container provided a track language or what it was set to.\n- all command-line tools: implemented an escape mechanism for when you want to use the @ sign as the first character in an argument to an option such as --title. To escape it the @ sign has to be doubled as in --title @@midnight. Implements #3768.\n\nBug fixes\n- mkvmerge, mkvpropedit, MKVToolNix GUI's multiplexer & header editor: the MIME type for TrueType & OpenType fonts will be set properly to either the current MIME types font/ttf & font/otf or to the legacy MIME types application/x-truetype-font & application/vnd.ms-opentype depending on whether the \"use legacy font MIME types\" option is disabled or enabled, even if the MIME database used by Qt returns the wrong one or even other MIME types such as application/x-font-ttf & application/x-font-otf. This was the case on Windows due to Qt 6.7.3 switching to a different embedded MIME database. Partially fixes #3751.\n- MKVToolNix GUI's multiplexer & header editor: ensured that both the legacy & the current font MIME types are always present in the MIME type combo boxes of attachments, no matter what Qt's MIME type database contains. Partially fixes #3751.\n- MKVToolNix GUI: the \"disable tooltips\" option in the preference will now disable the tooltip for the status bar, too.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"89.0.0","site":"https://www.bunkus.org/","source":"Moritz Bunkus","license_or_tos":"GPL-2.0","resources":null,"verified":false}