{"appId":"winget_app_calibre.calibre","appShortcutName":"Winget Application","appDisplayName":"calibre","authorId":"winget","releaseTagName":"winget-7.24.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/7.24.0/calibre-64bit-7.24.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- Allow creating rules to transform series names in the Bulk metadata editor and Preferences->Metadata download\n  Closes tickets: 2091268\n- Conversion: Automatically set the page progression direction for books that do not have it set and have their primary language either Arabic or Hebrew\n- Content server: Book details view: Make calibre://show-book and calibre://view-book URLs in the comments work\n- Edit book: Spell check: Add a button to export the currently displayed list of words as a CSV file\n  Closes tickets: 2092496\n- Add from ISBN: Add a checkbox to automatically convert obsolete ISBN 10 to ISBN 13\n  Closes tickets: 2092483\n- Save single format to disk: Allow choosing the book cover as the format to save\n  Closes tickets: 2092395\n- Option to show a button to access all available actions from the status bar in Preferences->Look & feel->Main interface\nBug fixes\n- Read aloud: Fix no audio produced when text contains <3 and using the Windows legacy speech engine\n  Closes tickets: 2092948\n- Fix Tabbing while editing cells in the book list not always working\n  Closes tickets: 2092643\n- Windows build: Also sign the portable launcher exes\n- Fix viewing books via the Cover browser not working when in device view\n  Closes tickets: 2092630\nImproved news sources\n- LWN Weekly\n- Outlook India\n- Livemint","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.24.0","site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}