{"appId":"winget_app_MehediHassan.Tweeten","appShortcutName":"Winget Application","appDisplayName":"Tweeten","authorId":"winget","releaseTagName":"winget-5.5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/MehediH/Tweeten/releases/download/v5.5.0/TweetenSetup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A powerful TweetDeck client for those who get real work done.\n\n\n- Introducing Tweeten Notifications:\n- Get real-time updates for your columns, built on top of the existing TweetDeck notification system.\n- Tweeten Notifications allow you to interact with tweets directly, including being able to like a tweet.\n- Complete control over how and where notifications appear via Tweeten Settings > Notifications.\n- You can view images and GIFs within notifications.\n- You can view quoted tweets in notifications, as well as more general details for each tweet/notification.\n- Tweeten Notifications respect Do Not Disturb settings in macOS (only on Intel Mac devices) and Focus Assist settings in Windows 10/11.\n- Built-in mute feature allows you to temporarily disable notifications easily.\n- Added the ability to set custom notification sounds (#233).\n  This is independent of Tweeten Notifications, so you will be able to use custom notification sounds even if you disable Tweeten Notifications.\n- Added the ability to disable the spell checker (#211).\n- Added ability to choose the language for spell checker on Windows.\n  On macOS, Tweeten follows native OS settings (System Preferences > Keyboard > Spelling).\n- The new Tweeten logo has been slightly adjusted to be larger on both Windows and macOS.\n- Fixed an issue where the app would not close properly in macOS (#238), resulting in changed behaviour:\n- When you now close the Tweeten window with the red X button, it will simply hide the window, and clicking on the Tweeten icon on the taskbar will show the window again.\n  This will ensure that notifications still show up and that you are able to perform tweet actions (like/RT/reply) from the notifications.\n- To completely close the app, including the notifications, you will have to hit CMD+Q, or \"Quit App\" from the context menu of the app in the dock.\n- This is in line with the behaviour of other apps such as Discord, Spotify, etc.\n- Fixed an issue where the app would not focus the existing instance when attempting to launch a second instance with \"multiple instances\" option disabled.\n- Fixed an issue where the compact RT modal did not work when the Tweeten window is narrow (#248).\n- Fixed an issue where the compact RT modal broke modals such as \"Add or remove from lists...\" and \"Add to Collection...\" (#249).\n- Changed compact RT modal behaviour to only close when the tweet moves.\n  Previously, the modal would close if there was any scroll event in the app.\n- Fixed an issue where native Twitter videos would not play (#230).\n- Fixed an issue where the GIF zoom preview would take up the entire window for larger GIFs (#243).\n- Fixed an issue where the app wouldn't persist previous window state before installing a new update.\n- Fixed an issue where the \"clear column\" quick action did not appear for Search columns (#227).\n- Fixed an issue where Tweeten did not persist the zoom level across sessions (#192).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.5.0","site":"https://builtbymeh.com","source":"Mehedi Hassan","license_or_tos":"Freeware","resources":null,"verified":false}