{"appId":"winget_app_Sandboxie.Plus","appShortcutName":"Winget Application","appDisplayName":"Sandboxie-Plus","authorId":"winget","releaseTagName":"winget-1.15.6","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.15.6/Sandboxie-Plus-ARM64-v1.15.6.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.15.6/Sandboxie-Plus-x64-v1.15.6.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\n\nSandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\nIt is developed by David Xanatos since it became open source, before that it was developed by Sophos (which acquired it from Invincea, which acquired it earlier from the original author Ronen Tzur).\nIt creates a sandbox-like isolated operating environment in which applications can be run or installed without permanently modifying the local or mapped drive.\nSuch an isolated virtual environment allows controlled testing of untrusted programs and web surfing.\n0 5 5\nRelease Notes\nThis update introduces improvements to stability, compatibility, and debugging tools, addressing several reported issues affecting various applications and sandbox configurations.\nThis release also includes a rework of CreateDesktop handling, which addresses various issues encountered with browsers and browser-based applications when running within Sandboxie. These changes should result in improved stability and functionality for affected software. Furthermore, a missing hook for NtQueryInformationByName has been implemented to enhance overall system compatibility.\nSeveral bugs have been resolved in this update. An issue where the Sandboxie Plus data folder was not functioning correctly after updating to version 1.15.5 has been fixed. Additionally, crashes affecting Adobe Acrobat Reader when used within an Application Compartment box have been resolved.\nCompatibility issues with Viber have also been fixed, ensuring that the software no longer crashes upon launch within Sandboxie. Users of qutebrowser will benefit from a fix that now allows the browser to run properly in a sandboxed environment. A problem preventing applications from launching when ApiTrace was enabled in version 1.15.5 has also been resolved. Lastly, a critical fix has been implemented to prevent blue screen errors (BSoD) when using OpenWndStation=y on Windows 10 with applications that call CreateDesktopW/A.\nThis release provides key stability and usability improvements for Sandboxie Plus, ensuring better compatibility across a range of applications.\nFor a full list of changes please review the change log.\nAnouncement\nAdditionally, I am pleased to announce that TaskExplorer, a powerful system exploration tool first launched in 2019, has been revitalized and is now production-ready thanks to its fully signed driver. With a host of new features and enhancements, including advanced security options, expanded data columns, and improved usability, TaskExplorer is an ideal choice for both casual users and IT professionals. For more details and to download the latest release, visit: TaskExplorer on GitHub.\nYou can support the project through donations, any help will be greatly appreciated.\nIf you have issues with an update installation, just uninstall the previous version keeping the sandboxie.ini and reinstall the new build.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.15.6","site":"https://xanasoft.com/","source":"http://xanasoft.com/","license_or_tos":"GPL-3.0","resources":null,"verified":false}