{"appId":"winget_app_Readdle.Spark","appShortcutName":"Winget Application","appDisplayName":"Spark Desktop","authorId":"winget","releaseTagName":"winget-3.19.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://downloads.sparkmailapp.com/Spark3/win/dist/3.19.2.94903/Spark.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Smart. Focused. Email.\n\nFast, cross-platform email designed to filter out the noise - so you can focus on what's important.\nHello,\nThis update is for those who needed more personalization options to turn off specific parts of the new +AI Meeting Notes feature. We apologize for any frustrations caused by unclear or limited settings, and we focused on addressing these issues first to prevent other users from experiencing them.\n- We’ve updated the wording to clarify the settings for disabling the Agenda option (on Windows), in case you don’t use it. We’ve also moved this option to Settings -> General for better discoverability.\n- Additionally, we've fixed an issue with the onboarding pop-up for the +AI Meeting Notes feature—new users will now only see it once.\n- We’ve added a setting to disable the automatic meeting call detection pop-ups (Meeting Notes -> Meeting Notification Pop-Up -> Automatically Detect Meetings toggle), as well as a setting to turn off automatic calendar event creation for ad-hoc meeting transcription in Spark +AI -> Transcription and Summarizing Settings.\n- We've also made some other UI improvements and fixes.\nRest assured, we’re continuing to improve the core email functionality—stay tuned for a major update related to the improved email experience, coming soon!\nFor any questions or suggestions, please contact us at support@sparkmailapp.com.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.19.2","site":"https://readdle.com/","source":"Spark Mail Limited","license_or_tos":"Proprietary","resources":null,"verified":false}