{"appId":"winget_app_Mozilla.Thunderbird","appShortcutName":"Winget Application","appDisplayName":"Mozilla Thunderbird (en-US)","authorId":"winget","releaseTagName":"winget-128.6.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/thunderbird/releases/128.6.0esr/win64/en-US/Thunderbird%20Setup%20128.6.0esr.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Thunderbird is a free email application that is easy to set up and customize - and it's loaded with great features!\n\nThunderbird is a free and open source email, newsfeed, chat, and calendaring client, that’s easy to set up and customize. One of the core principles of Thunderbird is the use and promotion of open standards - this focus is a rejection of our world of closed platforms and services that can’t communicate with each other. We want our users to have freedom and choice in how they communicate.\nWhat’s Fixed\n\nfixed\nNew mail notification was not hidden after reading the new message\n\nfixed\nNew mail notification could show for the wrong folder, causing repeated alerts\n\nfixed\nmacOS shortcut CMD+1 did not restore the main window when it was minimized\n\nfixed\nClicking the context menu \"Reply\" button resulted in \"Reply-All\"\n\nfixed\nSwitching from \"All\", \"Unread\", and \"Threads with unread\" did not work\n\nfixed\nDownloading message headers from a newsgroup could cause a hang\n\nfixed\nMessage list performance slow when many updates happened at once\n\nfixed\n\"mailto:\" links did not apply the compose format of the current identity\n\nfixed\nAuthentication failure of AUTH PLAIN or AUTH LOGIN did not fall back to USERPASS\n\nfixed\nSecurity fixes","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"128.6.0","site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}