{"appId":"winget_app_HermannSchinagl.LinkShellExtension","appShortcutName":"Winget Application","appDisplayName":"Link Shell Extension","authorId":"winget","releaseTagName":"winget-3.9.3.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://schinagl.priv.at/nt/hardlinkshellext/save/3935/HardLinkShellExt_X64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Explorer extension for easy creation of Hardlinks, Junctions, Volume Mountpoints and Symbolic Links\n\nLink Shell Extension (LSE) provides for the creation of Hardlinks, Junctions, Volume Mountpoints, and Symbolic Links, (herein referred to collectively as Links) a folder cloning process that utilises Hardlinks or Symbolic Links and a copy process taking care of Junctions, Symbolic Links, and Hardlinks. LSE, as its name implies is implemented as a Shell extension and is accessed from Windows Explorer, or similar file/folder managers. The extension allows the user to select one or many files or folders, then using the mouse, complete the creation of the required Links - Hardlinks, Junctions or Symbolic Links or in the case of folders to create Clones consisting of Hard or Symbolic Links. LSE is supported on all Windows versions that support NTFS, Windows 7/8/10. Hardlinks, Junctions and Symbolic Links are NOT supported on FAT file systems, and nor is the Cloning and Smart Copy process supported on FAT file systems.\n- With SE_CREATE_SYMBOLICLINK assigned to a user, UAC dialog was raised anytime after second attempt.\n- German Translation of Documentation.\n- Pressing F1 in LSEConfig crashed it. Fixed.\n- During Hardlink/Symbolic Link Clone pressing Cancel didn't have an impact.\n- Progress bar prediction has been improved.\n- Fixed crash when username was > 20 chars as non-admin during symbolic link drop.\n- Link ShellExtension now maintains its chocolatey package.\n- Link ShellExtension is public on gitlab.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.9.3.5","site":"https://schinagl.priv.at/","source":"Hermann Schinagl","license_or_tos":"Freeware","resources":null,"verified":false}