{"appId":"winget_app_Logtalk.Logtalk","appShortcutName":"Winget Application","appDisplayName":"Logtalk","authorId":"winget","releaseTagName":"winget-3.87.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nLogtalk compiler and runtime\n- ADDED: New includes/2, object/3, protocol/3, and category/3 properties to the logtalk::loaded_file_property/2 predicate.\nDocumentation\n- UPDATED: Notes on the developer tools third-party dependency requirements.\n- UPDATED: Notes on the Prolog integration scripts.\n- FIXED: Grammar and spelling typos in scripts and tests documentation.\nTools\n- REMOVED: Deprecated lgtdoc tool .js scripts and ie50.xsl file.\n- IMPROVED: Computation of the Halstead complexity metrics by considering recursive predicate calls.\n- FIXED: The packs tool lgtenv.ps1 script when using the -p option.\nInstallers and installation scripts\n- UPDATED: Synced the MacPorts portfile with the version used upstream.\nTests\n- ADDED: Additional tests for the bagof/3, setof/3, and findall/3-4 Prolog standard and de facto standard predicates.\nIDEs, text editors, and syntax highlighters support\n- ADDED: VSCode support for finding dynamic predicate references in clauses that assert or retract clauses for them.\n- ADDED: VSCode support for re-running a single test using CodeLens.\n- FIXED: VSCode support for finding predicate implementations when the definition is found in an included file.\n- FIXED: VSCode support for finding predicate references when the call is found in an included file.\n- FIXED: VSCode support for finding predicate declarations when the reference is found in an included file.\n- FIXED: VSCode support for navigating call hierarchies where an exception would be thrown in some cases.\nInstallers and installation scripts\n- REMOVED: Deprecated logtalk_user_setup.js script.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.87.0","site":"https://logtalk.org/","source":"Logtalk.org","license_or_tos":"Apache-2.0","resources":null,"verified":false}