{"appId":"winget_app_Mozilla.Firefox.DeveloperEdition.fur","appShortcutName":"Winget Application","appDisplayName":"Firefox Developer Edition (fur)","authorId":"winget","releaseTagName":"winget-136.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/devedition/releases/136.0b9/win64/fur/Firefox%20Setup%20136.0b9.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/devedition/releases/136.0b9/win64-aarch64/fur/Firefox%20Setup%20136.0b9.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Firefox Browser Developer Edition\n\nGet the latest features, fast performance, and the development tools you need to build for the open web using Firefox Browser Developer Edition.\nNew\n- On macOS, some background tasks will be moved to lower power cores resulting in less energy use.\n- Hardware-accelerated playback of HEVC video content is now supported on macOS.\n- Hardware video decoding is now enabled for AMD GPUs on Linux.\n- Firefox will upgrade page loads to HTTPS and gracefully fall back to HTTP if that does not succeed. This behavior is known as HTTPS-First.\n- Having any issues with a website on Firefox for Android, yet the site seems to be working as expected on another browser? You can now let us know via the Web Compatibility Reporting Tool. To access it:\n  - Open the Menu via the three-dot button while on a browser tab\n  - Tap on “Report broken site”\n  Provide the form with as much information as possible, and you’ll directly help us detect, target, and fix the most impacted sites to make your browsing experience on Firefox smoother.\n- Smartblock Embeds allows users to selectively unblock certain social media embeds that are blocked in ETP Strict and Private Browsing modes. Currently, a limited number of embeds are supported with support for more embed types coming in the near future.\nFixed\n- Firefox will now prefer PNG when copying images out of Firefox, allowing the preservation of transparency.\nChanged\n- Cookie Banner Handling by default in Private Browsing is now disabled. This was previously enabled only in Nightly and Beta. The feature can be enabled via the cookiebanners.service.mode and cookiebanners.service.mode.privateBrowsing prefs in about:config.\n- macOS DMG packages now use LZMA for compression, reducing download size and installation time.\nDeveloper\n- The Developer Tools debugger editor now uses Codemirror 6 which improves performance.\nWeb Platform\n- Added support for the Intl.DurationFormat object, this enables language-sensitive duration formatting.\n- Added support for the CSS :open pseudo-class for styling elements that can be toggled “open” to display more content.\n- Added support for the :has-slotted pseudo-class, allowing authors to style the contents of a <slot> element when it is not empty or not using the default value.\n- The value plaintext-only can now be specified for the contenteditable attribute, making the raw text of an element editable but without supporting rich text formatting.\n- Added support for the CookieStore API, an asynchronous cookie API for scripts running in HTML documents and service workers.\n- Firefox now sends a referrer from meta refreshes and Refresh headers.\n- Firefox now supports sending multiple simultaneous versions of the same source over WebRTC, so called simulcast, with the H264 video codec. H264 is the second video codec after VP8 to be supported for sending simulcast.\n- Firefox now supports sending and receiving the AV1 video codec over WebRTC. Both singlecast and simulcast are supported for sending.\n- Added support for ARIA elements reflection.\n- Firefox now supports by default the text replacement feature in an input field on macOS. Web content can enable/disable this using the HTML autocorrect attribute.\n  Also, Firefox for Android hints if the software keyboard supports autocorrect. If supported, the software keyboard suggests autocorrection.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"136.0","site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}