{"appId":"winget_app_BinaryMark.BatchEncodingConverter","appShortcutName":"Winget Application","appDisplayName":"Batch Encoding Converter Free Edition","authorId":"winget","releaseTagName":"winget-5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0180500t.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Convert multiple files between more than 100 text encodings and binary formats: Unicode, ANSI, Latin, Cyrillic, ASCII, UTF8, ISO, OEM, Mac, Base-64, Bin-Hex, Quoted-Printable. Features automatic encoding detection, Big Endian support, and more!\n\nConvert 1000s of files between more than 100 text encodings and binary formats: Unicode, ANSI, Latin, Cyrillic, ASCII, UTF8, ISO, OEM, Mac, Base-64, Bin-Hex, Quoted-Printable.\nSave raw bytes from files as hex, dec, or bin ASCII byte code representations, and convert them back to bytes.\nIncludes automatic encoding detection, Big Endian, and Unicode support.\nProcess 1000s of files using multiple CPU cores in manual, automatic, scheduled, console modes, or directly from Windows Explorer right-click menu.\nSave files to output directory specified using either absolute or relative path, with original or new name defined by a mask.\nSelect files for processing based on their name, dates, size, and contents using advanced file search supporting RegEx and advanced wildcards.\nPerform different operations on different files with conditional processing and process branching.\nDetailed processing logs are available in both user interface and log files.\nRun multiple program instances simultaneously.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}