{"appId":"winget_app_SVZsoft.GEDKeeper","appShortcutName":"Winget Application","appDisplayName":"GEDKeeper2","authorId":"winget","releaseTagName":"winget-3.7.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GEDKeeper - program for work with personal genealogical database\n\nGEDKeeper is an open-source and cross-platform genealogy management program.\nThe lightweight, fast and reliable program to offer user friendly but powerful user interface for hobbyist, family historian and serious genealogy researcher.\nIt fully supports the GEDCOM standard, has no restrictions on the number of persons and generations, allows to store, edit, and research genealogical data and offers numerous views like family tree, charts, tables (individuals, families, etc), reports, timeline and more.\nIt supports multimedia and allows privacy control; allows you to interactively browse family trees and charts; and make changes, such as adding new people and adding or deleting images or notes and stories.\nIt provides fast navigation, filtering, searching and adding multimedia materials.\nSupports output of geographic data on maps.\nCartography, statistics, dynamic graphical trees and reports can be viewed on screen, send to a printer, or saved as image-files.\nExtensible base of program provides easy implementation of new features (both plugins and powerful scripts) and localize to new user’s languages.\n- Localizations updated: Dutch [Annelotte], German [ChakaDragon, Christian Bettinger], Chinese Simplified [Jeff Li], Kazakh [karatal], Hungarian [Kékesi Lajos], Japanese [mtsx68k].\n- Added the feature to enter user's references in family, media, source and repository records.\n- Added the option to include page numbers of sources in pedigrees.\n- Added place analyzer/constructor to locations management tool.\n- Added a section for links to subordinate locations in the location information panel.\n- Added function for duplicating location records.\n- The feature of selecting and exporting a separate list of records (notes, multimedia, locations) to a GEDCOM file has been added to the database splitting tool.\n- Added saving of column width settings for all lists.\n- Completed Spanish localization [Miguel Á. Pérez Valdenebro].\n- Added remembering and the feature to select from a list of causes and agencies of events.\n- Added an option to select list filtering methods (differences in speed).\n- Added an option to display the full name in one line in trees, for countries with a short form of the full name (hieroglyphs).\n- Added custom event types, the feature to turn off events and add custom ones.\n- Added localizable names for tree borders.\n- Fixed an issue where blood group fact values would get stuck after use and when a different fact type was subsequently selected.\n- Added data checking option: search for notes and sources without links.\n- Added a call to detailed information about sources and persons in the lists of citations to sources, children, parents and spouses (pop-up menu).\n- Added display of multimedia and notes on the info-panel for events.\n- Fixed multiple lines in the Author column of source citation lists (GKv3).\n- Improved output of portraits from photos with DPI > 100 (GKv3).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.7.0","site":"http://gedkeeper.net/","source":"Sergey V. Zhdanovskih","license_or_tos":"GPL-3.0","resources":null,"verified":false}