{"appId":"winget_app_TeamViewer.TeamViewer","appShortcutName":"Winget Application","appDisplayName":"TeamViewer","authorId":"winget","releaseTagName":"winget-15.62.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.teamviewer.com/download/version_15x/TeamViewer_Setup_x64_15.62.4.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access and support\n\nTeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS.\nTeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.\nNew Features\n- It is now possible for any TeamViewer license holder to add embedded devices via the device list.\n- It is now possible to add an unknown device as bookmarked via the recent connections list.\n- It is now possible to add a description when creating a custom Host module.\n\nImprovements\n- Security measures have been enhanced to better neutralize argument delimiters (Security Bulletin TV-2025-1001).\n- The sign-in process has been improved. The Keep me signed in option is now checked by default to speed up signing in on the new interface.\n- The global search accuracy has been adjusted to produce more focused results.\n- The in-session menu has been reorganized to ensure greater transparency regarding when functionality is available during a session and when it is not.\n- The edit option is now more prominently displayed for devices and device groups.\n- The connect option on the devices toolbar has been updated. Users can now connect to the selected device with a single click.\n- Upon creating a device group, the creator is automatically granted device permissions by default if the inherit device group permissions to devices setting is enabled.\n- In the devices basic view, the state of expanded groups is retained when users navigate away from and return to the basic view.\n- The behavior of columns in device lists has been improved. The TeamViewer ID is now positioned second, immediately following the device name. It is also possible to reduce the column widths to a minimum length for a more compact view.\n- The TeamViewer ID input field on the remote support page will now retain the ID of the last connected device.\n- Device groups managed by company are available during rollout setup configuration creation for company administrators.\n\nBugfixes\n- Fixed a crash which could occur when signing into a TeamViewer account with a slow internet connection.\n- Fixed a bug in the in-session chat that caused issues on high-DPI monitors when no messages had been sent or received.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"15.62.4","site":"https://www.teamviewer.com/","source":"TeamViewer","license_or_tos":"Proprietary","resources":null,"verified":false}