{"appId":"winget_app_darktable.darktable","appShortcutName":"Winget Application","appDisplayName":"darktable","authorId":"winget","releaseTagName":"winget-5.0.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/darktable-org/darktable/releases/download/release-5.0.1/darktable-5.0.1-win64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"darktable is an open source photography workflow application and raw developer\n\ndarktable is an open source photography workflow application and raw developer. A virtual lighttable and darkroom for photographers. It manages your digital negatives in a database, lets you view them through a zoomable lighttable and enables you to develop raw images and enhance them.\nWe're proud to announce the new bug-fix release of darktable, 5.0.1!\nThe github release is here: https://github.com/darktable-org/darktable/releases/tag/release-5.0.1.\nTo build from source, do not use the autogenerated tarball provided by GitHub on the release page, download our tar.xz file instead. If you're just building for yourself without creating a package for some distribution, then using source code cloning in git is an even more convenient way.\nThe checksums are:\n$ sha256sum darktable-5.0.1.tar.xz\n4a918d094ebba983ef67a10cc715c3d7e8ca738009920a9ff65d33417b6dd984  darktable-5.0.1.tar.xz\n$ sha256sum darktable-5.0.1-x86_64.dmg\nce05f2a9efa4cde090a939e42813ee98cf98f5b5e6a14304c9d8c3d71a589a01  darktable-5.0.1-x86_64.dmg\n$ sha256sum darktable-5.0.1-arm64.dmg\n66296ab8d26e4ac14061a5407eafe0f31ddb7ac1de9995bd2e05043e9c0b0c60  darktable-5.0.1-arm64.dmg\n$ sha256sum darktable-5.0.1-arm64-13.5.dmg\n19878fca36ab52d6b629ae6b372345665809df3941fd9e168b470237ed6cb4b9  darktable-5.0.1-arm64-13.5.dmg\n$ sha256sum darktable-5.0.1-win64.exe\n2ea64535f1d42793f2ef53aec971eca43818748aba036b5e778624297ea0fb34  darktable-5.0.1-win64.exe\n$ sha256sum darktable-5.0.1-x86_64.AppImage\n881e4cfb79c473404f871d48bd60ed2d6234f90f71e33c1bdc033dafd6901f06  Darktable-5.0.1-x86_64.AppImage\nWhen updating from the stable 4.8 series, please bear in mind that your edits will be preserved during this process, but the new library and configuration will no longer be usable with 4.8.\nYou are strongly advised to take a backup first.\nImportant note: to make sure that Darktable can keep on supporting the raw file format for your camera, please read this post on how/what raw samples you can contribute to ensure that we have the full raw sample set for your camera under CC0 license!\nSince Darktable 5.0.0:\n- 105 commits to Darktable+rawspeed\n- 57 pull requests handled\n- 15 issues closed\nPlease note that the Darktable documentation is not currently complete for release 5.0\nand contributions are greatly appreciated. Please see the\nproject documentation\nfor more information on how to contribute.\nThe Big Ones\nThe following is a summary of the main features added to Darktable\n5.0.1. Please see the user manual for more details of the individual\nchanges (where available).\n- N/A\nUI/UX Improvements\n- N/A\nPerformance Improvements\n- Improved performance of discarding history of selected images.\nOther Changes\n- Harmonized style selection in print settings with the update made in\n  the export module for release 5.0.\n- Darktable now includes the Lensfun database into the AppImage.\n- Center collapsible module section labels.\nBug Fixes\n- Fixed a scrolling bug in the collections module where the collection\n  tree was not scrolled to the previous position when returning from\n  darkroom.\n- Fix crash when attempting to move up the top or only shape in a\n  group in the mask manager.\n- Fix collection module when using the \"module\" filter which was\n  listing none of the processing modules.\n- Fix iop-order user presets use. It was not possible to get a user's\n  iop-order preset to be applied as the Darktable internal presets\n  where always picked up first.\n- Fixed a crash in variable expansion for $(SEQUENCE[n,m]).\n- Fixed handling on click from filmstrip when in map and print\n  view. On map we now properly center the image on the map. On the\n  print view, we use the selected image as content of the main print\n  area.\n- Fixed a regression introduced in 5.0.0 where we lost the ability to\n  read 2-channel TIFF files and files with more than 4 channels. This\n  fix allows them to be read by the TIFF loader, whereas previously\n  the TIFF loader rejected such files and they were loaded by a\n  fallback loader (GraphicsMagick or ImageMagick).\n- Fixed not being able to pan with a mouse in the zoomable layout.\n- Fixed possibly collapsing the module header when restoring defaults.\n- Fixed a case of XMP being written without actual image modification.\n- Fixed a crash of Darktable when reimporting XMP having overlay\n  images referenced.\n- Fixed the support for single lib module opened at a time when in\n  darkroom.\n- Fixed xmp sidecar writing while working as a gimp plugin.\n- Fixed issues when applying a style in darkroom using the Styles\n  module.\n- Fixed a possible crash when using Ctrl+z reproduced on\n  macOS.\n- Fixed Darktable crashing in enlarge-canvas module.\n- Fixed Darktable crashing using details mask due to bad tiling.\n- Fixed a hash calculation bug leading to pixelpipe instabilities.\n- Fixed issue to handle auto-presets when the focal length is greater\n  then 1000.\n- Fixed crash on macOS when closing the darkroom's second window.\n- Fixed possible jump in filmstrip when entering darkroom from full\n  preview.\n- Fixed a performance regression in haze removal module.\n- Fixed reading palette-based PNG with transparency.\n- Fixed possible crash in lens correction module when changing camera\n  and/or lens model.\n- Fixed crash after deleting style or preset that was selected in\n  shortcuts dialog.\n- Fixed a crash when the currently active module instance is being\n  deleted.\n- We now support the correct orientation for JPEG XL if it was\n  specified in the format's metadata but not in Exif (or Exif is\n  missing). We also avoid over-transformation if it is specified in\n  both the basic data and Exif.\nLua\nAPI Version\n- API version is now 9.4.0\nNew Features\n- N/A\nBug Fixes\n- N/A\nAdd action support for Lua\nOther Lua changes\n- N/A\nNotes\n- The AppImage package is compatible with distribution releases that\n  have glibc version 2.35 or higher. For example, if we consider some\n  popular distributions, Ubuntu 22.04, Debian 12, Fedora 36 and newer\n  releases are compatible.\n- The macOS *-x86_64.dmg and *-arm64-13.5.dmg packages require at\n  least macOS 13.5 (Ventura), the *-arm64.dmg package requires at\n  least macOS 14.0 (Sonoma).\n- When exporting to AVIF, EXR, JPEG XL, or XCF, selecting specific\n  metadata (e.g. geo-tag or creator) is not currently possible. For\n  AVIF, EXR, JPEG XL, and XCF formats, Darktable will not include any\n  metadata fields unless the user selects all of the checkboxes in the\n  export module's preference options.\nChanged Dependencies\nMandatory\n- Bump SQLite requirement to 3.26\nOptional\n- N/A\nRawSpeed changes\n- Fujifilm GFX cameras now use the vendor supplied crop\nCamera support, compared to 5.0.0\nBase Support\n- Leica SL3-S (DNG)\n- Minolta DiMAGE 5\n- Panasonic DC-S5D (3:2)\nWhite Balance Presets\n- N/A\nNoise Profiles\n- Fujifilm GFX100 II\n- Fujifilm X-S20\n- Fujifilm X100VI\nMissing Compression Mode Support\n- Apple ProRAW DNGs\n- CinemaDNG lossless (Blackmagic, some DJI, etc.) and lossy (Blackmagic)\n- DNG 1.7 using JPEG XL (Adobe enhanced, Samsung Expert RAW)\n- Fujifilm lossy RAFs\n- Nikon high efficiency NEFs\n- OM System 14-bit high resolution ORFs\n- Sony downsized lossless ARWs (\"M\" for full-frame, \"S\" for full-frame & APS-C)\nSuspended Support\nSupport for the following cameras is suspended because no samples are available on https://raw.pixls.us:\n- Creo/Leaf Aptus 22(LF3779)/Hasselblad H1\n- Fujifilm IS-1\n- Kodak EasyShare Z980\n- Leaf Aptus-II 5(LI300059)/Mamiya 645 AFD\n- Leaf Credo 60\n- Leaf Credo 80\n- Olympus SP320\n- Phase One IQ250\n- Sinar Hy6/ Sinarback eXact\n- ST Micro STV680\nTranslations\n- Albanian\n- Brazilian Portuguese\n- Chinese (Simplified)\n- Chinese (Traditional)\n- Czech\n- Dutch\n- European Spanish\n- Finnish\n- French\n- German\n- Hungarian\n- Japanese\n- Polish\n- Slovenian\n- Swedish\n- Ukrainian","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0.1","site":"https://www.darktable.org/","source":"The Darktable Project","license_or_tos":"GPL-3.0","resources":null,"verified":false}