{"appId":"winget_app_KDE.digiKam","appShortcutName":"Winget Application","appDisplayName":"digiKam","authorId":"winget","releaseTagName":"winget-8.5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.kde.org/stable/digikam/8.5.0/digiKam-8.5.0-Qt6-Win64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Professional Photo Management with the Power of Open Source\n\ndigiKam is an advanced open-source digital photo management application that runs on Linux, Windows, and macOS. The application provides a comprehensive set of tools for importing, managing, editing, and sharing photos and raw files.\nDear digiKam fans and users,\nAfter five months of active maintenance and many weeks triaging bugs, the digiKam team is proud to present version 8.5.0 of its open source digital photo manager.\nGeneralities\nMore than 160 bugs have been fixed and we spent a lot of time contacting users to validate changes in pre-release versions to confirm fixes before deploying the program to production.\nApplication internationalization has also been updated. digiKam and Showfoto are released with 61 different languages for the graphical interface. Go to the Settings/Configure Languages dialog and change the localization as you want. digiKam needs to be restarted to apply the changes. If you want to contribute to the internationalization of digiKam, please contact the translator teams, following the translation how-to. The statistics about translation states are available here.\n\nThanks to the translators who have worked on the online documentation internationalisations which is now available in 16 languages as French, German, Spanish, Italian, Japanese, Chinese, and more. You can read and search over the documentation here. You are welcome to contribute to application handbook translations following the coordination team instructions.\n\nInternal Components Update\nThis version arrives with the internal RAW decoder Libraw updated to the rolling-release snapshot 2024-09-10, including bugfixes.\n\nFor metadata management, the industry-standard open-source component ExifTool has been updated in all bundles to the latest 12.99 release. Additionally, the well-known shared library Exiv2 has been upgraded to version 0.28.3.\n\nNative Apple Silicon Package\nA native macOS package for the Apple Silicon arm64 architecture is now available for the first time. This package leverages Qt6 framework version 6.7.2, KDE framework 6.7.0, and FFmpeg 6.1 to facilitate video media playback. Importantly, it no longer necessitates the use of the Apple Rosetta 2 emulator.\nThe journey to develop an Apple Silicon package was lengthy and involved. It required acquiring new Apple devices and setting up the environment to configure, compile, and test all necessary packages. This milestone marks the completion of the full port to the Qt version 6 framework across all Windows, macOS, and Linux bundles.\nPlease note that the previous macOS package based on the Qt5 framework will still be supported for legacy Intel Apple computers.\n\nNotable Bug Fixes\n- Fix wrong ExifTool packaging in the bundles 490341 488222\n- Usability improvements of the progress manager 375519\n- Better OpenCL support while intensive calculations with the OpenCV framework 495014\n- Better ICC profiles support 495646\n- Better large TIFF file format support with a new solid identification in the database 488662 490859\n- Better date and time formats support 490552 491804 493388\n- New Apple extensions supported with HEIF file format 494304\n- New option to not blur pixels at high zoom level in preview mode 431788 491580\n\nNew Features\nFace Management Updates and Improvements\nA new contributor named Michael Miller joined the team a few months ago. As a long time digiKam user with an excellent developer skills, he decided first to help us on the native macOS Silicon port, and more recently to improve Face Management with a long list of closed reports.\nThe current release boasts several enhancements and improvements to the Face Management feature. New deep-learning models have been integrated into the face pipeline, making face detection and recognition faster and more accurate.\n\nYuNet is now the default model for face detection, outperforming the previous MobileNetSSD and YOLO v3 models in both speed and accuracy. It offers more configuration options to enhance overall accuracy and allows users to fine-tune face detection for specific scenarios, such as large group photos and portrait photography.\n\nSignificant improvements have also been made to face recognition. SFace is now the default deep-learning model for face recognition. Additionally, the face classifier (matching algorithm) has been updated to be both faster and more accurate. Now, only one face needs to be confirmed for a person before digiKam can start recognizing other detected faces.\n\nColor Label Usability\nOne of the key features offered by digiKam is the ability to identify important items using color labels. In both the thumb-bar and album icon view, the color labels mark thumbnails with a solid color frame. You have ten different colors at your disposal to catalog your photos.\nIn the previous release, the color label feature drew a bright border frame around the thumbnail, which was deemed a bit intrusive in the user interface, especially when multiple labels were used in an album.\nTo enhance this behavior, we’ve now implemented a narrow linear gradient color bar below the thumbnail.\n\nFuture Plans\nNext maintenance version is targeted in February 2025 with more bug fixes and improvements.\nIn the coming weeks, a crucial task planned with Michael is to continue the revamp of face management. The multithreaded face pipeline will be completely rewritten to boost performance, enhance maintainability, and reduce false positives in the recognition clustering algorithm. These improvements will also be integrated into a new auto-tagging engine, bringing the same enhancements to auto-tagging as those made to face management.\n\nFinal Words\nThanks to all users for your support and donations, and to all contributors, students, testers who allowed us to improve this release.\ndigiKam 8.5.0 can be downloaded from this repository as:\n- Source code tarball.\n- Linux 64 bits AppImage bundles compatible with systems based on glibc >= 2.31.\n- Windows 10 (or later) 64 bits installers or bundle archives.\n- macOS Silicon and Intel packages.\nRendez-vous next year for the digiKam 8.6.0 release.\nHave fun with digiKam…","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"8.5.0","site":"https://kde.org/","source":"The digiKam team","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}