{"appId":"winget_app_BinaryMark.BatchFileReplace","appShortcutName":"Winget Application","appDisplayName":"Batch File Replace Free Edition","authorId":"winget","releaseTagName":"winget-5.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0190500t.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Search and replace text and raw bytes in multiple files. Features include: multi-line text entry; full support for RegEx with syntax highlighting and match substitutions; built-in hex editor to replace bytes; wildcards and case-sensitivity; Unicode.\n\nSearch and replace text and raw bytes in multiple files. Includes multi-line text search & replace with wildcards, case-sensitivity, and match selection options. Full support for Regular Expressions with syntax highlighting and match substitutions. Built-in hex editor allows for easy entry of binary data to search & replace bytes. Perform multiple replacements easily by entering plain-text or RegEx-based search-replace pairs into grid or import them from a file. Process 1000s of files using multiple CPU cores in manual, automatic/continuous, triggered/scheduled, or console modes, or directly from Windows Explorer right-click menu. Save files to output directory specified using either absolute or relative path, with original or new name defined by a mask. Select files for processing based on their name, dates, size, and contents using advanced file search supporting RegEx and advanced wildcards. Optionally merge together, split all, or zip processed files. Perform different operations on different files with conditional processing and process branching. Complete support for Regular Expressions (RegEx) and Unicode throughout the program. Detailed processing logs are available in both user interface and log files. Run multiple program instances simultaneously.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}