{"appId":"winget_app_Texmaker.Texmaker","appShortcutName":"Winget Application","appDisplayName":"Texmaker","authorId":"winget","releaseTagName":"winget-6.0.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.xm1math.net/texmaker/assets/files/Texmaker_6.0.0_Win_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free cross-platform LaTeX editor since 2003.\n\nTexmaker is a free, modern and cross-platform LaTeX editor for Linux, macOS and Windows systems that integrates many tools needed to develop documents with LaTeX, in just one application.\nTexmaker includes unicode support, spell checking, auto-completion, code folding and a built-in PDF viewer with SyncTeX support and continuous view mode.\nTexmaker is easy to use and to configure.\nTexmaker is released under the GPL license.\n- Texmaker 6.x versions are designed for Qt6 (Qt5 support is deprecated and will no more be tested)\n- reorganization of the source files\n- switch to cmake for build system (a qmake .pro file is still available in the qmake_deprecated subdirectory but should no more work in the future)\n- macosx packages are now built for arm64 architecture (Mx chipsets)\n- a critical bug that happens on windows with large files has been fixed (limitation of calling a recursive function with msvc)\n- a bug related to the bad detection of % !TEX root = has been fixed\n- the obsolete \"svn helper\" has been replaced by \"git helper\"\n- texmaker now tries to use the devicePixelRatio of the screen corresponding to the window of the pdf document instead of qApp->devicePixelRatio() (in case of use of a second screen for the pdf viewer)\n- on gtk based desktop, texmaker now tries first to detect the gtk4 theme and see if the corresponding theme is available for Qt\n- key pressed detection in presentation wiew for the pdf has been completed","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.0.0.0","site":"https://www.xm1math.net/","source":"Texmaker","license_or_tos":"GPL-2.0","resources":null,"verified":false}