{"appId":"winget_app_QuadSpinner.Gaea","appShortcutName":"Winget Application","appDisplayName":"QuadSpinner Gaea 2.0","authorId":"winget","releaseTagName":"winget-2.0.4.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://get.gaea.app/Release/Gaea-2.0.4.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"QuadSpinner Gaea is a procedural, graph-based, non-destructive terrain generator and simulator used in major AAA VFX, Games, and Virtual Production projects.\n\n\nThis is an important release that delivers major improvements and stability fixes. It is recommended that all users update to this version, although we recommend testing it first.\nSee https://blog.quadspinner.com/ for more details on this update.\n- Major stability updates throughout Gaea.\n- Mixer gets a significant update.\n  - Supports up to 15 layers.\n  - Improved interface.\n  - Toggle individual layers.\n  - Simplify individual layers.\n  - Masks generated by Mixer are now saved as outputs.\n  - Drag layers to re-order.\n  - Multiply height and slope with custom mask.\n- Modifier Stack updated for better visibility.\n- Modifiers can now be reordered by dragging.\n- Node Tree improved.\n- New Node Tree filters added.\n- Nodes in Graph View are highlighted when filtered.\n- Aperture Node (Preview Version).\n- Lazy Menu (F1) editor in Options dialog.\n- Gaea2Unreal Plugin updated with World Partition support.\n- Drag-drop .terrain files into Gaea to open.\n- Shortcut List added to Help Menu for easy reference.\n- Gaea Update notifications improved.\n- Added option to omit adding Port suffix _Out to filenames.\n- Added non-Uniform scaling to Transform node.\n- Allow Q/E key flipping in Navigation options.\n- Zoom shortcuts changed to industry standard.\n- FIX: Older Gaea files that used SqRt Blend Mode would not open in newer builds.\n- FIX: Prevent multiple overlapping windows from stealing focus.\n- FIX: Insert mode in Transpose was behaving incorrectly.\n- FIX: Note font size balanced.\n- FIX: Occlusion output was inverted. Old files will not be modified but new ones will have it corrected.\n- FIX: Collapsed notes would not show contents as tooltips.\n- FIX: Mask ports would not preserve connections, especially in new files.\n- FIX: Variables would not clear when changing files.\n- FIX: Unreal node would emit incorrect filename prefixes.\n- FIX: Unreal node would incorrectly have tiled filename suffixes.\n- FIX: Failed node would not show error message in node tooltip.\n- FIX: Prevent clearing viewport when preview is locked.\n- FIX: Bitmap nodes could break visualization when connected to Export nodes.\n- FIX: Major issue with Underlay node being downstream and unbuilt.\n- FIX: Overlapping Pixel setting was not being honored.\n- FIX: Humanized gRPC errors.\n- FIX: Emergency recovery file would be overwritten in new session.\n- FIX: Portal would draw off-center.\n- FIX: Open Folder and Copy Terrain settings would not load in Build Settings window.\n- FIX: Deleting a node while processing could cause a crash.\n- FIX: Graph could not zoom out far enough.\n- FIX: Intermittent crashes could occur in rare circumstances in some nodes.\n- FIX: Baked data would not be accessible after changing resolutions.\n- FIX: Changing resolutions could destabilize cached data.\n- FIX: Autosave would create copies of baked cache.\n- FIX: Autosave files that relied on baked data could not be opened normally.\n- FIX: Added missing Terrain port warning to Mixer node.\n- FIX: Viewport compass was broken.\n- FIX: Graph would slow down when working with large networks.\n- FIX: Bookmark shortcuts removed to avoid conflicts.\nAs usual, there are lots of other smaller, unlisted tweaks and improvements throughout the engine that will result in smoother, faster, and more stable experience going forward.\nThanks to everyone for their continued support and sharing diagnostics logs.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.0.4.0","site":"https://quadspinner.com/","source":"QuadSpinner","license_or_tos":"Proprietary","resources":null,"verified":false}