{"appId":"winget_app_TeamViewer.TeamViewer","appShortcutName":"Winget Application","appDisplayName":"TeamViewer","authorId":"winget","releaseTagName":"winget-15.63.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.teamviewer.com/download/version_15x/TeamViewer_Setup_x64_15.63.4.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access and support\n\nTeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS.\nTeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.\nNew Features\n- You can now view the contacts with whom a legacy group is shared, along with their permissions. You can edit these permissions as well as add or remove contacts from the share.\n- Information about shared status is now included in legacy groups. The side panel of legacy groups has been updated to display this information in the header.\n- It is now possible to edit the names of legacy groups, provided that the necessary user permissions are granted.\n- It is now possible to edit the name and description of bookmarked devices, provided that the necessary user permissions are granted.\n- It is now possible to group offline devices. This can be enabled via the Advanced settings.\n- We are introducing 1E agent integration with TeamViewer. The current integration scope includes enabling the installation of the 1E offline agent via TeamViewer policy settings and activating advanced monitoring in RM Device Monitoring.\nKey Capabilities:\n- Provides users with historical and real-time insights into CPU, memory, and disk usage, as well as detailed event logs.\n- Achieved by integrating the 1E agent into the Monitoring product, thereby enhancing the device view and Remote Task Manager.\n\nImprovements\n- The session audit event logs now include the authentication method used.\n- It is now possible to apply bulk actions to devices / device groups by right clicking on them and using the contextual menu.\n- The sign-in process has been improved. The email address is now pre-filled from a last sign-in to speed up the process on the new interface.\n- The device or group side-drawer panel now remains open after the user edits and saves changes.\n- The process for moving devices to groups has been updated. Users can now move devices without requiring policy updates or policy administration permissions.\n\nBugfixes\n- Fixed a bug where the managed devices in the basic view were not sorted alphabetically.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"15.63.4","site":"https://www.teamviewer.com/","source":"TeamViewer","license_or_tos":"Proprietary","resources":null,"verified":false}