{"appId":"winget_app_WonderIdea.Animiz","appShortcutName":"Winget Application","appDisplayName":"Animiz Animation Maker","authorId":"winget","releaseTagName":"winget-2.5.8","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://static.animiz.com/download/amsoft/animiz_v2.5.8_x64_setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Create Professional Animated Video Presentations & Gifs\n\n\nNew Features\n1. Upgrade the user interface interaction for a smoother experience.\n2. Homepage: Optimize the template style filtering and make multi-filtering easier.\n3. Material: Optimize material categorization and add some new materials.\n4. Feature: Add intercept marker, export current frame, chart animation, rasterize type, and layer selection features.\n5. File: Optimize the backup feature and add a “clean cache” feature.\n6. Operation: Rename the camera, paste the subtitle across scenes, and edit the audio by dragging and dropping.\n7. Animation: Add numerous cool animation effects and more animation effects can be customized.\n8. Interface: Optimize the design of some pop-ups, tools, and swatches.\nFixed & Improvement\n1. Operation: Some actions were unable to be undone.\n2. Material: Software crashes caused by using Flash materials in the old version.\n3. Timeline: Issues with element selection and dragging on the timeline.\n4. Roles: The abnormal thumbnail display of roles.\n5. Animation: The abnormal display of some animation effects.\n6. Interface: Inconsistencies in some feature names, icon misalignment and blank pop-up occurrences.\n7. Interface: The known translation errors and text display issues.\n8. Fix known bugs we know and enhance system stability and performance.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.5.8","site":"https://www.wonderidea.com/","source":"Animiz Animation Maker Solution","license_or_tos":"Proprietary","resources":null,"verified":false}