{"appId":"winget_app_Inkscape.Inkscape","appShortcutName":"Winget Application","appDisplayName":"Inkscape","authorId":"winget","releaseTagName":"winget-1.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://media.inkscape.org/dl/resources/file/inkscape-1.4_2024-10-11_86a8ad7-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A professional vector graphics software which runs on Linux, macOS and Windows desktop computers.\n\nInkscape is a Free and open source vector graphics editor for GNU/Linux, Windows and macOS. It offers a rich set of features and is widely used for both artistic and technical illustrations such as cartoons, clip art, logos, typography, diagramming and flowcharting. It uses vector graphics to allow for sharp printouts and renderings at unlimited resolution and is not bound to a fixed number of pixels like raster graphics. Inkscape uses the standardized SVG file format as its main format, which is supported by many other applications including web browsers.\nIt can import and export various file formats, including SVG, AI, EPS, PDF, PS and PNG. It has a comprehensive feature set, a simple interface, multi-lingual support and is designed to be extensible; users can customize Inkscape's functionality with add-ons.\nThe Inkscape project has a growing international user community, and many learning materials exist to help get you started with your creations. Help and support is provided by the community, and there are lots of ways for you to get involved if you want to help improve the Inkscape project.\nInkscape is a member of the Software Freedom Conservancy, a US 501(c)(3) non-profit organization. Contributions to Inkscape are tax deductible in the United States.\nInkscape 1.4 is the latest major Inkscape release that brings you fresh new features and bug fixes.\nRelease highlights\n- Filter Gallery: It has never been so easy to find the best filter for your needs! This new dialog features previews, categories and search.\n- Modular grids & improved axonometric grids: Set the grid angle by ratio for isometric designs and use modular grids to plan layouts and make icons!\n- Swatches dialog and palette file handling improved: Access dialog layout controls quickly, search for colors, and open different palette file formats!\n- Unified font browser preview: Activate it in the preferences to quickly browse through your font collection. Try it out and give your feedback!\n- Customizable handles: Power users with CSS knowledge can now customize the styling and basic shape of all the handles!\n- Fast image clipping with the Shape Builder: Clip your raster graphics into multiple sections using the Shape Builder!\n- Affinity Designer File Import: Handle files from your colleagues, and don't lose your own contents when you can't access the program they were made with anymore!\n- Support for internal links in exported PDF files: Help people navigate the files you created!\n- A whole new icon set: Enjoy more than 500 new icons in the Dash theme!\n- There's even more: faster extensions, new templates for folding booklets, additional options in Ruler and Taper Stroke LPE, new keyboard shortcuts, changed node deletion behavior, preview in Spray tool, many new command line options, more supported color palette formats (e.g. CIELAB, Adobe Color Book and Adobe Swatch Exchange), updated translations, many bug fixes …\n… and more!","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.4","site":"https://inkscape.org/","source":"Inkscape","license_or_tos":"GPL-2.0","resources":null,"verified":false}