{"appId":"winget_app_Axosoft.GitKraken","appShortcutName":"Winget Application","appDisplayName":"GitKraken","authorId":"winget","releaseTagName":"winget-10.7.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://release.axocdn.com/windows/GitKrakenSetup-10.7.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The legendary Git client with an ultra-intuitive GUI, a powerful terminal, and offers a seamless experience for Windows, Mac and Linux.\n\n\nNew ✨\n- Find your repos and branches faster! You can now search directly in the repository and branch dropdowns from the breadcrumb in the toolbar.\n  - Repository search: Searching in the repository dropdown will search through all repositories in the Repository Management tab. Selecting a new repo will open it in the current tab or switch to that tab if it’s already opened.\n  - Branch search: Searching in branch dropdown will search through all local branches in the repo, and selecting a branch will checkout that branch. If your repository has worktrees, they’ll appear at the top of the branches list for easy access.\n\nImprovements 🙌\n- Custom Launchpad views are now only visible when the corresponding Team or Personal mode they were created in is selected.\n- Experimental Feature – Git Executable:\n  - Added support for ‘Discard all changes’ and connected Undo/Redo actions.\n  - Added partial support for ‘Discard changes’ of unstaged files.\n  - Interactive rebase now replays all rebased commits instead of fast-forwarding over the unchanged ones.\n\nBug Fixes 🐛\n- Fixed an issue where cloning a repo can create an undefined folder with hooks files inside.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"10.7.0","site":"https://www.axosoft.com/","source":"GitKraken","license_or_tos":"Proprietary","resources":null,"verified":false}