{"appId":"winget_app_GPSoftware.DirectoryOpus","appShortcutName":"Winget Application","appDisplayName":"Directory Opus","authorId":"winget","releaseTagName":"winget-13.12","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://cdn2.gpsoft.com.au/files/Opus13/DOpusInstall-13.12.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A complete replacement for Explorer, with far more power and functionality than any other file manager available today.\n\n\nPreferences\n- Added Assume UTF8 filenames option to Zip & Other Archives / Zip Files, to help with Zip files which store filenames using UTF8 despite not setting the flag in the archive to say they're doing so.\n- Added Launching Opus / Startup / Always perform startup action option. When turned on the configured startup action (e.g. open the last closed Listers) will always happen even if Opus is launched to show a specific folder (e.g. by double-clicking on a desktop icon).\n- Added File Displays / Folder Expansion / Extra expand button width option. Lets you add additional padding around the expansion buttons for expandable folders in the file display. Also added File display - expand button extra width setting to UI spacing schemes.\n- Added File Displays / Options / Info Tips / Only with key held down option.\n- Added Toolbars / Options / Alt key activates toolbar keyboard mode option. Split the floating toolbar related controls from Preferences / Toolbars / Options to a new page.\n- Added File Operations / Logging / Script/FTP Preferences page. Provides greater control over the script log header. Date, time and the script name can now be turned on or off independently. Added options for seconds and milliseconds.\n- Added Toolbars / Options / Only with key held down option. With this enabled, toolbar tooltips will only be shown if the specified modifier key is held down.\n- Added Miscellaneous / Advanced / description_quick_flush option. When storing descriptions in the external descript.ion format, this option makes description changes get flushed to disk immediately rather than being batched up and written \"lazily\" on a timer.\n\nCommands\n- Prefs LAYOUT=!lastclosed can now be used to (re)open the special Lister set that is saved automatically when Opus shuts down (or at regular intervals if the backup option is turned on).\n- When setting a Lister background image with the Set BACKGROUNDIMAGE command, the BACKGROUNDIMAGEOPTS=local argument can now be used to make the image local to a single Lister rather than global. Use BACKGROUNDIMAGEOPTS=local,reset to reset a Lister back to the global settings.\n- The Properties SETLABEL command now accepts the !lastused keyword. This will apply the label that was most recently applied to a file. A button with this command automatically shows the name of the most recently used label, and updates whenever a different label is applied.\n- Added Set PAIREDFOLDERS command. Lets you temporarily disable paired folder diversion for a Lister.\n\nScripting\n- JScript scripts can now opt-in to Microsoft's later JScript engine (we think this was added in Windows 11 22H2) by adding // !JSCRIPTVER=3 to the top of the script file. This seems to enable more modern JavaScript features like String.trim().\n- The script editor now remembers bookmarks set in the internal text editor (via Ctrl-F2) from one invocation to the next.\n- Script columns can now provide column text with simple html markup which will be used in places markup is supported (e.g. in a tooltip). The markup text should be returned in the ScriptColumnData.markup value.\n- Script dialogs now support Date/Time Picker controls.\n- Added OnScheduledTimer event and DOpus.SetScheduledTimer method. Very similar to OnPeriodicTimer/DOpus.SetTimer except you can provide a specific date/time for the timer to be triggered. Note that scheduled timers only trigger once, and if the specified time has already passed they won't trigger at all.\n- Added Control.type script property; returns a string indicating the type of the control.\n- Added Control.userdata script property. Allows controls in script dialogs to store an item of user defined data.\n- Scripts can now receive a full list of file changes performed by functions run via the Command object. To use this, set the Command.logchanges property to true before running the command. Any file changes made will be listed in the object you can retrieve via Command.results after the command returns.\n- The script dialog markup text control now supports center and right-justified text.\n- The Dialog.Open() script method (and the {dlgopen} command sequence) now let you use the file open dialog to select folders, by setting the type argument to \"folder\".\n- The EverythingInterface.Start() method now takes an optional parameter to specify how long to wait for Everything to start up. The default is 2500 ms.\n\nMiscellaneous\n- Added an option under Customize / Toolbars to disable mouseover button highlighting on a per-toolbar basis.\n- Context menu commands added via File Types can now have custom descriptions which are shown as tooltips.\n- Added GPSTimestamp field to metadata editor for exif files.\n- If the option to show sizes/dates in thumbnails mode is enabled, they're now shown for folders as well as files.\n\nFixes\n- Fixed erratic detection of clicks in single-click mode.\n- Fixed CreateFolder command's \"auto read\" mode getting confused when given a path containing extra slashes (e.g. CreateFolder D:\\\\1234 READAUTO).\n- Fields like filecount and dircount now work from evaluation label filters.\n- Fixed file/folder counts not being preserved properly in the back/forward folder history list.\n- Global everything search now works from empty tabs (both via the search field and the FAYT).\n- Searching with \"ignore diacritics\" enabled now treats Ł (Polish L with stroke) as a normal latin L character.\n- Creating a shortcut to a server share now works.\n- Popup menus now temporarily disable any IME that's active, allowing accelerator keys to be pressed on Chinese/Japanese systems.\n- Fixed several issues relating to the script editor when editing an include file both directly and via another script that includes it.\n- Fixed NOAUTORUN losing the collection name with Find DUPES command.\n- Fixed Select FILTERDEF namestem match swapping the source/destination windows when run from a script\n- Fix for scripts using multiple include files not working in Windows 11 24H2.\n- Fixes for several reported crashes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"13.12","site":"https://www.gpsoft.com.au/","source":"GPSoftware","license_or_tos":"Proprietary","resources":null,"verified":false}