{"appId":"winget_app_PioneerDevelopers.Pioneer","appShortcutName":"Winget Application","appDisplayName":"Pioneer","authorId":"winget","releaseTagName":"winget-20250203","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Pioneer is a space adventure game set in our galaxy at the turn of the 33rd century.\n\n\nA year of development brings with it many changes and improvements. Headlining this release is a new ship model, a complete rebalance of all ships in the game, the ability to install multiple weapons per ship, many improvements to user interface, and more.\nNatrix Reworked\nThe overhaul of our ship models has now come to the OPLI-Barnard Inc. manufactured Natrix line, with a beautiful new model and vastly improved capability for this not-so-little ship. While not intended for a combat role in the same way as the Coronatrix, the Natrix still has plenty of defensive firepower to ensure your deliveries go where they are needed in a timely fashion.\nUser Interface\nWe have focused on improving a number of things about the user interface. First and most noticeable, we have implemented a new, much more consistent UI color theme. (This also brings better support for user mods that recolor the UI).\nimage\nimage\nThe Save/Load dialog has received a complete overhaul and now displays significantly more information about each save, including character and ship name, location, and (new this release!) when the game was last saved and total time played in the save.\nimage\n(Yes, it's quite obvious this screenshot is from a developer...)\nOther notable changes include:\n- The radar interface in the flight view has been greatly improved with control over radar zoom and full keybinding support.\n- Mission progress in the Scout mission gadget has been remade to better communicate mission state to the player.\n- The commodity market now shows separate buy and sell prices.\n- The economy display in the System View have been confusing to many, which is why we have added tooltip for clarity.\nOther Visual Improvements\nWhile playing around with some of the headlining features, you may find yourself witnessing improved planetary ring textures, and noticing that ships docked in orbital stations are now lit by the station!\nShip Equipment System Rewrite\nProbably the most major feature this release contains is a complete redesign of how ships are equipped and how equipment is handled by the game.\nEquipment now has fully independent mass and volume values, and ships are now equipped based on the amount of free equipment volume rather than a \"capacity\" metric shared between cargo and equipment. Cargo is now fully separate from installed equipment; you won't have to choose between carrying cargo or equipping that beam laser any longer.\nWe've decided to make ship equipment slots first-class citizens rather than just a simplistic numeric limit, which has allowed us to finally add support for multiple weapons per ship rather than the hard-coded singular forward and rear weapon mount (if you happened to be rich enough to even afford a ship with a rear weapon mount!)\nThis has also enabled us to implement a much-needed improvement to the game's hyperdrives, converting them to sip fuel from an internal reservoir rather than chugging an entire cargo container of fuel from the cargo hold. Hyperspace jumps in small ships should take quite a bit less cargo space to carry out now. For those curious, the hyperdrive design document outlines the thought that went into the new design.\nA number of these changes had to be merged in very late in the development cycle, so we consider this release the \"first iteration\" of the new equipment system, focused only on converting existing equipment and game content to function under the new code architecture. Many aspects of the game have yet to receive a full balance pass, and we have a number of new systems and gameplay features planned to take advantage of this new architecture.\nWe are sure you, the players, will be quite happy to report back the full details on the effects this has had on the game's balance, and we intend to continue iterating on adding equipment and content as we enter the 2025 development cycle.\nComplete Ship Rebalance\nAs part of the equipment redesign, we had to convert every ship in the game to use the new system. We took the chance to go through all of the ships in the game and set more realistic values for cargo, fuel, and equipment space based on the physical volume of the ship's hull, as well as giving each ship its own weapon layout.\nWe're certainly not finished with balance changes, and intend to update ships as they are redesigned and reworked with new models and new gameplay considerations in mind.\nMajor changes and new features\n- Total overhaul of Ship Equipment - EquipSet v2 (#5734)\n- Fully support installing multiple weapons per ship (#5991)\n- Add Buy and Sell prices to the Commodity Market (#5945)\n- Implement a consistent (and purple!) UI theme (#5865)\n- Redesign Save/Load window, add UI Notification system (#5898)\n- Station Police shows: crime records, rules & regulations, banned goods (#5863)\n- Clarify system-level economy display (#5900)\n- Add interior lighting to stations (#5823)\n- Natrix overhaul (#5963)\n- Natrix patterns (#5975)\n- Improvement: Radar auto-zoom on cargo canisters (#5948)\n- Added keybinding for target radial menu (#5962)\n- Added manual zoom mode to scanner (#5958)\n- Capture mouse wheel for zooming radar (#5978)\n- Radar improvements (e.g. intermediate zoom step, etc.) (#5984)\n- Reset view on hyperspace exit (#5922)\n- Rework scout mission display and completion (#5932)\n- Degrade scooped cargo requiring cargo life support (#5949)\n- Add \"jettison all\" buttons to cargo sidebar menu (#5867)\n- Added/remade 3 new factions (#5892)\n- NameGen - Spice up the station names (#5906)\n- Add Hawaiian names (#5910)\n- Polaris is also found by name \"North Star\" (#5908)\n- Add ability to reroll random systems to System Editor (#5901)\n- Added Perf-Info button to Dump a system to systemeditor compatible JSON (#5888)\n- Expose galaxy parameters - allow changing explored space radius (#5941)\n- Add Easter egg. Story about time traveller (#5864)\nBugfixes / Tweaks\n- Optimize CityOnPlanet CPU-side rendering cost (#5943)\n- Fix $HOME/.pioneer randomly created on Linux (#5944)\n- Ubuntu 24.04 & openSuSE Tumbleweed - Illegal instruction, core dumped (#5877)\n- Preview information for modules in particular for hyperdrives and guns (#2820)\n- New game may give you zero equipment (#4803)\n- Weapon on sale not installed (#5567)\n- Missiles buttons not showing up (#5887)\n- Buying and selling ship equipment does not require confirmation (#5020)\n- assertion failed in equipment-market.lua:91 (#5883)\n- fix crash bugs in Passengers introduced by equip-v2 (#5957)\n- Fix the ability to start from all start positions (#5971)\n- Fix incorrect dV calculations in ship market (#5970)\n- Fixing icons.svg after the radar updates (#5982)\n- Fix(flightlog): fix crash when removing a flight log entry (#5988)\n- Updating Vatakara to use the shield mesh of the Malabar (#5990)\n- Fix hyperspace route update bug across save/load cycle (#5924)\n- Fix creating save game directory on startup & implementation improvement (#5927)\n- Icelandic culture name generator fix-up (#5913)\n- Fix savefiles directory not being created (#5919)\n- Update advice on hyper drive mechanics (#5923)\n- Fix crash in mission list in hyper space when combat mission (#5872)\n- Invert illegal commodities icons in the Economy & Trade view (#5884)\n- Police patrol improvement, don't confuse player with pirate (#5809)\n- Fix intro screen ship spinner parade's lack of randomness for some (#5896)\n- Repopulate BBS with adverts if empty (#5894)\n- Better explanation of the combat mission due date (#5891)\n- Create BBS if empty (#5912)\n- Fix terrain texture disappearance / GeoPatch/GeoSphere refactoring (#5979)\n- Fix the Vatakara not having a shield model (#6034)\n- Fix Game crashes when disabling rotation while exiting a station (#6034)\n- Lua function GetEquipFree(\"cargo\") is not behaving as expected (#3450)\n- Fix error when tradeship attempts to redock to nearby starport (#6035)\n- Fix crash in Assassination mission (#6035)\n- Fix thrusters offered in SecondHand advert (#6035)\nInternal Changes\n- Fix builds which use \"-DDEBUG\" (#5946)\n- Build Cleanup (#5956)\n- Removing normal map from default cockpit materials (#5964)\n- Fully expose InputBindings to Lua (#5965)\n- Small fixes and improvements (#5968)\n- Linux de-profile and msvc compilation fix (#5967)\n- More default colours and cleanup copy-n-paste in GeoPatch (#5973)\n- Cleanup Sound interfaces to allow plugging in alternative backend (#5959)\n- Cleanup and unify Feat/view event and names (#5974)\n- Allocate light data UBO from per-frame allocator, misc. fixes and cleanup (#5970)\n- Improve narrow-phase collision physics performance (#5789)\n- CppCheck 2.15 performance cleanup (#5931)\n- Misc. code improvements (#5937)\n- refactor: run SaveGameStats in a job (#5934)\n- Simplified random station selection for delivery missions (#5915)\n- Separating shield.models (#5853)\n- Separate shield meshes from ship models (#5840)\n- Don't build against lzcnt by default and enable USE_SSE42 only on Intel (#5871)\n- Improve PerfInfo debug window (#5899)\n- Move local, and bright stars systems definitions from lua to json (#5911)\n- Fix debug commodities tab (#5861)\n- News Event: debug can also remove adverts (#5862)\n- Improve Lua type checking for string enums (#5869\n- Fix compilation on Clang v19+ (#6034)\n- CMake: Rename PROJECT_VERSION -> PIONEER_VERSION (#6036)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"20250203","site":"http://pioneerspacesim.net/","source":"Pioneer Developers","license_or_tos":"MIT License","resources":null,"verified":false}