{"appId":"winget_app_WonderIdea.MangoPresentationMaker","appShortcutName":"Winget Application","appDisplayName":"Mango PM","authorId":"winget","releaseTagName":"winget-4.8.541","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://online.mangoanimate.com/software/Mango%20PM_4.8.541_x64_setup-global.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Animated Presentation Maker\n\n\n【NEW】 Quick Layout module launched! Users can edit the content rapidly.\n【NEW】 3D Background Generator feature is now available! Easily create 3D backgrounds to enhance visual effects.\n【NEW】Interactive roles officially launched, supporting EXE output and 90-day access. You can create conversations effortlessly.\nInteractive components: Add Fan slideshow, allowing image and video rotation control by adjusting the fan's opening.\nOperation: Add a \"Frame BG settings\" button. Frame background settings are now supported.\nAuto-save: The auto-save time can be set to 0 seconds, disabling auto-save.\nChart: The chart settings panel has been optimized.\nAnimation: Add five new animation effects: Random Motion, Flash in, Flip, Lying flat, and Side Slip.\nShapes: Circle can be adjusted and folded corner rectangle now supports a custom angle.\nInterface: Membership permissions and commercial icon visibility settings are now supported.\nOperation: A black background appeared when adding MOV videos.\nOperation: Some characters displayed abnormally after adding animations.\nOperation: Position offset caused by the grouping elements with a circle shape.\nInteraction: Animation was delayed and had no effect.\nAnimation: Gesture animations fail to output to EXE.\nOther: Fixed some known defects.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.8.541","site":"https://www.wonderidea.com/","source":"Mango PM Solution","license_or_tos":"Proprietary","resources":null,"verified":false}