{"appId":"winget_app_Bforartists.Bforartists","appShortcutName":"Winget Application","appDisplayName":"Bforartists 4","authorId":"winget","releaseTagName":"winget-4.3.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Bforartists is a fork of the popular 3D software Blender, with the goal to improve the UI.\n\n\nCumulative Hotfix for Colored Collection Rows Release\nBforartists 4 3 2 - Splash Large\nBforartists 4 3 2 Screenshot\nThis is a hotfix and commulative stability release with 37 bug fixes, features and updates - including a few critical showstopper bugs.\nThis is part of an exciting release with all the latest from Blender 4.3 and 4.4 to the date - with a chunk of 139 pieces of love from us this cycle\nNew:\n- Horizontal walk navigation lock\n- Smarter Smart delete in Mesh Edit mode (removes isolated geometry now)\nWhat's new with the 4.3 series!\nAdditionally includes:\n- New Colored Collection Rows highlights\n- New Grease Pencil Nodegroups in the Default Library\n- New Silhouette toggle for the 3D View with the Power User Tools\n- New Asset Shelf category defaults and tag filtering, with additional thumbnail quick size buttons\n- Refined Grease Pencil 3 interface and UX\n- General maintenance, details, tooltips and refinement to everything new coming in from Blender\nIncluded new features from Blender are:\n- New editing of Text Strips in the Preview of the Sequencer editor\n- New Geometry Nodes: Find in String, Collection and Object Input\n- New Geometry Nodes \"For Each\" zone, Grease Pencil nodes, and much more\n- New method to swap and resize areas\n- New Metal BSDF\n- Videos can now render in 10bit\n- New Animation Slots to assign multiple objects to the same Action Clip\n- And much more\n- And much more.\nDownloads available from both Github, the official Website, Windows store and Blender Launcher v2\n📥 Download Free\n🌍 Official Website\n🪟 Windows App\n🧡 Blender Launcher\n📝 Release Notes\nhttps://www.bforartists.de/release-notes/\n🧰 Source Code\nhttps://github.com/Bforartists/Bforartists\nSplashscreen is kindly provided by Ethan Avila, an honorable runner up up of the last Splashscreen competition hosted in the Discord server.\nThanks again for all your artwork, feedback and love! And a very special thanks to the community and developers for working this project.\nDraise, Reiner, Blenux (Juso), Eyad, Znight (Trung Pham), Quackers, Sean and all you arty supporters\nWhat's Changed\n37 Tasks\nFile Browser - Folder icons are offset and too transparent #4882\nSequencer - strip tag update #4904\nUser Preferences - Turn off Load UI as a default #4902\n3D View - Interactive Light Track should be in Object Context Menu #4213\nPreferences - Turn on Developer Extras and Python Tooltips per a default for discoverability #4903\nDopesheet - Action Editor mode - Improve Tooltip about slots #4769\nSmart Delete - Add feature to know when to delete single vertices or edges #4900\nHotkey overriding modal key in loop cut operation #4840\nHotkeys - Sequencer - Text Object - Double click to edit + ESC to exit #4890\nOfficial Release - Bforartists 4.3.1 #4846\nAddon - Default Library - Register default asset shelf categories to use the Default Library categories #4582\nSequencer - Text strips can now edit, update operators and hotkeys #4889\nHotkeys - Sequencer Preview - Add hotkeys to use the Edit text #4891\nOutliner - Exclude checkbox tooltip could be more explicit #4843\nGeometry Nodes - Utilities - Text - New Find in String node #4892\n3D View - Panel Right Click menu - Expose the \"reset zoom\" operator #4855\n3D View - Set Parent Menu context missing labels and icons #4897\nNode Groups - Sidebar - Boolean default float left #4894\n3D View - Rename 'Frame Selected' Menu operator to 'Frame Last Stroke' to be more explicit #4893\nTopbar - Creating torus doesn't use Cursor position when triggered from another editor #4841\nNode Editors - Nodegroups now have two header icons #4883\nGeometry Nodes - New Collection and Object input nodes #4886\nGrease Pencil - Edit Mode - New Set Start Point #4885\nSequencer - Add \"Remove Gaps (All)\" to sidebar #4884\nUpdate Windows Github actions script to be relative #4848\nTopbar - Toolbar primitive images are greyed out and don't work #4844\nError in space_node.py #4876\nNavigation - Add horizontally locked game like navigation as an opt-in #4849\nmacOS build missing icon #4874\nCycles - Point Light has missing shadow properties #4864\n3D View - Grease Pencil - Draw mode - Vertex Color mode - Wrong sized swap and pin operatorsion header #4866\nTimeline Editor - Autokey on frame has wrong icon #4865\nBforartists About shows wrong version number #4863\n3D View - Header overlays - Toggle ground grid only toggles ortho grid #4854\nAnimation Tab does not Obey Tool Shelf Tabs Toggle when Armature is in scene #4856\n3D View - Drawing primitives from the toolbar fails #4850\nLaunching Bforartists from the provided command scripts are only for Blender #4842","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.3.2","site":"https://www.bforartists.de/","source":"Bforartists","license_or_tos":"GPL-2.0","resources":null,"verified":false}