{"appId":"winget_app_leezer3.OpenBVE","appShortcutName":"Winget Application","appDisplayName":"openBVE","authorId":"winget","releaseTagName":"winget-1.11.1.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/leezer3/OpenBVE/releases/download/1.11.1.1/openBVE-1.11.1.1-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A license-free, open source, free of charge train driving simulator.\n\nOpenBVE is a license-free, open source, free of charge train driving simulator.\nThis program includes detailed per-car simulation of the brake systems, friction, air resistance, toppling and more. In 3D cabs, the driving experience is augmented with forces that shake your simulated body upon acceleration and braking, as well as in curves. Besides that, OpenBVE features a 3D positional sound system best enjoyed with surround speakers, train exteriors and timetables for the current run. Finally, via the main menu, routes and trains be easily selected to start a new session, the controls can be configured to keyboard or joystick devices, and a variety of options can be selected.\nCompared to other simulators of the genre, especially compared to commercial games, OpenBVE has its main focus on realism, not necessarily on user-friendliness. You should be willing to study operational manuals for the routes and trains you want to drive, and will in many cases not get along by just memorizing a few keystrokes. If you can identify with this focus, OpenBVE might be the right simulator for you.\nThis release hopefully replaces the broken v1.11.1.0 Rather than 'fixing' the error in the old animated parser, it has rather been migrated to the new format. Two additional small bugs have been squashed.\nSignificant Changes:\n- Change: Move animated parser to the new CFG based format.\n- Fix: Don't crash if a zero length train is encountered.\n- Fix: Missing 'view log' string in GL menu.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.11.1.1","site":"https://openbve-project.net/","source":"The OpenBVE Project","license_or_tos":"BSD-2-Clause","resources":null,"verified":false}