{"appId":"winget_app_Lenovo.LenovoVoice","appShortcutName":"Winget Application","appDisplayName":"联想语音助手","authorId":"winget","releaseTagName":"winget-3.4.11.1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://filedownload.lenovo.com/dtsw/LVA/Packages/LenovoVoice_3.4.11.1.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Voice/translation specialists on computers\n\nLenovo Voice Assistant is an intelligent voice assistant for Windows, featuring various AI functions such as simultaneous translation, voice input, video subtitle translation, etc.\n- Voice Assistant: On PCs that support voice wakeup, after waking up the voice assistant using voice, the PC will follow the user's voice commands to adjust hardware settings, retrieve life news, watch on-demand entertainment content, etc. With a single voice command, it can complete complex operations rather than clicking on traditional PCs.\n- Translation Assistant: During meetings or chatting, it can help translate the user's speeches into other languages in real-time and display them through text.\n- Voice Input: Through voice input, when you are writing emails or trying to use text input across software, it can automatically transcribe/translate the user's voice into the required text information.\n- Subtitle Assistant: When watching a video in another language without subtitles, it can assist the user in displaying the translated subtitles.\n- Audio to Text: Assist users to convert audio/video files to text files and provide downloads for uses on PC.\n- Local Search: Search for local files rapidly. You can search by file keywords, file types and other patterns. After matching the search results, the searched files will be displayed. You can quickly open the file and the path to the file.\n- Please use this program under the network service provided by ISP (China Mobile, China Unicom, China Telecom, etc.) in mainland China.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.4.11.1","site":"https://lva.lenovo.com.cn/","source":"Lenovo Group Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}