{"appId":"winget_app_AltSnap.AltSnap","appShortcutName":"Winget Application","appDisplayName":"AltSnap","authorId":"winget","releaseTagName":"winget-1.63","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/RamonUnch/AltSnap/releases/download/1.63/AltSnap1.63-x64-inst.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Easily drag windows when pressing the alt key.\n\nMaintained fork of AltDrag for Windows which allows you to move and resize windows by using the Alt key and clicking wherever on the window instead of relying on very precise clicking.\nThis behavior is very common on Linux distributions and is not actually hard to implement on Windows.\nIt is oriented towards all Windows users from Windows NT 4 to Windows 11, even though it is mostly tested on Windows XP and Windows 10.\nMain differences: To simplify the code greatly the Hooks windows feature was removed; it allowed you have windows snapping while dragging them normally. It required however to inject a dll in every application and induced thus an obvious security risk. The amount of mess added to the code just for this feature was substantial and in addition forced to have both a 32bits and a 64bits version of the program running at the same time.\nThis version injects nothing into other applications. This means you do not have to worry whether you have a 32 or a 64bit operating system.\nAnother feature that was disabled is focus on typing, that was too much unusable for me to even start testing, so I removed it.\nOtherwise this has a much simpler source code, added a few extra options, such as transparent windows dragging, Maximize action, pause process options, more blacklists for finer control of AltSnap etc.\n- Snap Layout preview #511, #359, #464.\nConfigure via the folowing options:\n   in the [Zones] section\n\n   ShowZonesPrevw=1\n   ; Enable/Disables Layout preview (default 1)\n\n   ZonesPrevwOpacity=160\n   ; Opacity from 0-255 of the Zone preview (default 160).\n   ; Use 0 if you disabled Desktop composition.\n\n   ZonesPrevwBGCol=FF FF FF\n   ZonesPrevwBDCol=00 00 00\n   ; Color of the Snap Layout preview, ZonesPrevwBGCol for background color\n   ; and ZonesPrevwBDCol for the border color. default are white and black.\n   ; Use a dark beckground and a light border if you use dark theme.\n\n- Fixed: Titlebar action now has precedence over Hotclick. #503\n- Fixed Scheduled task script #505, thanks to @VladKappa\n- Updated Polish translation, thanks to @xeophyte\n- Updated Chinese translation, thanks to @yatli\n- Updated Korean translation, thanks to @1kko","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.63","site":"https://github.com/RamonUnch","source":"Raymond Gillibert","license_or_tos":"GPL-3.0","resources":null,"verified":false}