{"appId":"winget_app_EdrawSoft.EdrawMind","appShortcutName":"Winget Application","appDisplayName":"EdrawMind","authorId":"winget","releaseTagName":"winget-12.2.2.1053","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.edrawsoft.com/cbs_down/edrawmind_12.2.2_full5370.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A versatile mind mapping tool for collaborative brainstorming.\n\nEdrawMind is designed for creating fresh new visual innovations, integrating your bullet points to structure an overall mind map. It is convenient and helpful for you to use EdrawMind to sort out your thoughts or ideas in order to find solutions to problems.\nUpgraded Mind Map to Slides feature\n    (1) Added 200 high-quality templates, including: Thesis/Work Summary/Business Proposal etc.\n    (2) Filter Slides templates by scenario/style/color.\n    (3) Added Slides generation progress bar. Improved single-page generation efficiency for Slides outlines.\n    (4) Optimized Slides content generation accuracy. The text size of the generated content will be automatically adjusted.\nUpdated Kanban Mode aesthetic and features\n    A settings panel has been added to the right side of the screen in Kanban Mode, making it easier to customize kanban styles:\n    (1) Supports one-click switching of kanban color schemes and styles, including: Monochrome/Gradient/Alternating/Rainbow etc.\n    (2) You can now set kanban backgrounds, set custom images as backgrounds, and adjust card transparency.\n    (3) Supports additional color presets and custom color settings for cards.\n    (4) You can also set card styles, including: “Card,” “Postcard,” and “Note.”\n    (5) Optimized drag and drop feature for cards. Filter cards by interaction status.\nPaste Special\n    (1) When copying and pasting text/multiple nodes to a theme, Paste Special can be used to quickly replace the format of the pasted content, greatly improving note organization efficiency.\n    (2) Paste Special’s default paste mode can be set in “Options.”\n    (3) When pasting an image, you can set it to not attach the words “subtopic” by default.\nNew Bracket Diagram Tool\n    The Bracket Diagram layout has been added. Support free switching between multiple layouts. Use a variety of bracket styles to distinguish relationships and organize your thoughts more clearly.\nCustomizable Right-click Menu\n    Is the right-click menu looking too cluttered? You can now customize the menu options to suit your needs!\n    Method: You can customize the right-click menu theme ‍in “Options” > “Right-click Menu.” Infrequently used features can be hidden from the right-click menu for a more refined appearance and increased efficiency.\nAI batch processing for theme content\n    (1) Newly upgraded AI Assistant! Supports AI processing of multiple themes in Mind Map View.\n    (2) Added features such as Batch Text Polishing, Batch Adjust Tone, Batch Translate, and One-click Translate.\nNavigation Outline: Replace feature and Ctrl + F shortcut\n    Click the “Navigation” button in the lower left corner to expand the Navigation Outline on the left.\n    (1) Added Replace feature to the Navigation Outline.\n    (2) Open the Navigation Outline by pressing Ctrl + F.\nQuickly upload local files to the cloud\n    (1) Added “Upload to Cloud File” button to Recent Files list to support one-click synchronization of local files to the cloud.\n    (2) Optimized local file identification to make it easier to distinguish between cloud files and local files.\nOne-click Translate\n    Supports one-click translation of all mind map text into specified languages.\n Added animation effect for mind map nodes\n    (1) A smooth animation effect is now available when you add topic nodes, switch global layouts, or switch branch layouts.\n    (2) The animation effect can be turned on or off in \"Settings\" - \"Advanced\".\n Added support for superscripts and subscripts\n    You can now format text as superscript or subscript:\n    (1) Select any text and click \"Superscript\" or \"Subscript\" in the right side panel to format it as superscript or subscript.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"12.2.2.1053","site":"https://www.edrawsoft.com/","source":"EdrawSoft Co.,Ltd.","license_or_tos":"Proprietary","resources":null,"verified":false}