{"appId":"winget_app_Uniconta.Uniconta","appShortcutName":"Winget Application","appDisplayName":"Uniconta","authorId":"winget","releaseTagName":"winget-93.6.0000","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.uniconta.com/download/uniconta-setup-msi/?wpdmdl=17651&masterkey=59ae3221bb580"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Uniconta is a modern cloud-based ERP system that keeps track of finances, inventory, projects, production and logistics, and helps your business become digital. So you can run your business on a solid foundation.\n\nUniconta is a modern cloud-based ERP system that keeps track of finances, inventory, projects, production and logistics, and helps your business become digital. So you can run your business on a solid foundation. All small and medium-sized businesses are deeply dependent on a sound ERP system. A system that can help manage both operation and development. It is about much more than having a place to register and invoice. It’s about being able to make the right decisions. And you can only do this if you have a good overview of figures from across the company. You get that with Uniconta. Uniconta provides time savings on daily routines, searches, document retrieval and documentation. Your data and documents are safely stored in the cloud – always accessible. Everything is all in one place, giving you a unique and complete overview of your entire business. Although it is a standard ERP system, it is structured flexibly so that you can customize the solution with your own fields, tables and screens. This means that you do not have to depend on your desire for change to fit in with other companies.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"93.6.0000","site":"https://www.uniconta.com/","source":"Uniconta A/S","license_or_tos":"Proprietary","resources":null,"verified":false}