{"appId":"winget_app_calibre.calibre","appShortcutName":"Winget Application","appDisplayName":"calibre","authorId":"winget","releaseTagName":"winget-7.26.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/7.26.0/calibre-64bit-7.26.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- Allow specifying web search links that are used when clicking on item names in the Book details panel for custom columns via Preferences->Add your own columns\n- Content server: When clicking on author names in the book details page perform the same action as clicking it in the calibre program's Book details panel\nBug fixes\n- Fix a regression in 7.17 that caused various minor problems with editing metadata directly in the book list\n  Closes tickets: 2097677\n- Fix a regression in the previous release that broke conversion using Heuristics and TXT input documents\n- E-book viewer: Fix header/footer text size too small when using multiple monitors and the primary monitors DPI is much less than secondary monitor DPI\n  Closes tickets: 2097563\n- Fix series mapping rules in the metadata preferences not working\n  Closes tickets: 2097947\n- Fix setting custom icon for category doesn't work\n  Closes tickets: 2098133\n- Kobo driver: Fix a regression that broke working with very old Kobo devices\n  Closes tickets: 2092732\nImproved news sources\n- Science Journals\n- Barrons","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.26.0","site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}