{"appId":"winget_app_gileli121.windowtop","appShortcutName":"Winget Application","appDisplayName":"WindowTop","authorId":"winget","releaseTagName":"winget-5.22.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/WindowTop/WindowTop-App/releases/download/v5.22.5/WindowTop.5.22.5.-.setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Set window on top, make it dark, transparent and more\n\n\n- You can even interact with the crop view using your mouse and keyboard. :)\n- You can update and modify the crop region on the fly via the native window or directly from the PiP view\n- You can also use a shortcut key to toggle crop and modify it (not shown in the video)\nNew features\n- Ability to crop window directly without setting it first in PIP mode (#313)\n- Ability to adjust the crop from the original window\nImprovements\n- Anchors will also appear for PIP windows with an additional icon that indicates their state\n- Added option to configure the hidden behavior when you crop a window - you can configure it not to hide the window or to hide it.\n- The toolbar settings now include an easy way to set up hotkeys per each button\nBugfixes\n- Fixed bug that some windows with empty titles are ignored (e.g., Discord window) (#320)\n- Fixed bug when enabling PiP mode on Discord shared screen window, that the content of the window in the PiP view may become black (#320)\n- Fixed DPI bug in the always-on-top border that sometimes the border position is wrong\n- DPI bugfixes for PiP and Crop\n- Improved app stability by removing almost all thread-locking mechanisms and replacing them with a less drastic approach.\n  Freezing is now a very rare case\n- Added recovery logic that triggers in case the app is unable to exit (frozen in exit); in the worst-case scenario - after 30 seconds the app will kill itself\n- Fixed bug in PIP that when you minimize the PIP window (directly from PIP mode), the window was not minimized correctly (#314)\n- Fixed bug that when having an anchor of a PIP view of an elevated window, the anchor shows the icon of WindowTop with the wrong title\n- Fixed bug with PIP crop selector and anchors that sometimes, while dragging the selected crop region, it may drag the anchor\n- Fixed hotkey bug for PIP that the hotkey did not work for PIP view owned by elevated window\n- Fixed bug in PIP + Interact mode that the mouse scroll working only after the mouse entered the PIP window a second time\n- Fixed PIP recovery logic when the program crashes while having PIP view to an elevated window.\n  In such case, when you open the program again, it will able to recover that window\n- Code optimization that may improve performance\n- Fixed a few bugs in the hotkeys settings UI\n- Fixed bug in PiP with the mouse-hover-preview when live preview is disabled\n- Improve and stabilize the core logic of the window-manager system in WindowTop (make it more stable and optimized)\n- Improve, stabilize, and optimize part of the core logic of the anchors system.\n  This may fix some bugs and improve behavior.\n- Fixed bug in Anchors that after moving the window to another screen, the anchor was still located on the previous screen\n- Fixed UI bug in the crop selector toolbar when the Windows theme is in light mode\nChanges\n- [PiP - Picture-in-Picture] Added \"Spotify.exe\" and \"Slack.exe\" to the default list of applications where the mouse interaction is enabled by default when activating PIP mode (these apps work perfectly with the mode)\n- [Toolbar] Removed the \"Disable when maximized\" option when showing it on PIP view (PIP can't be maximized)\n- [Settings - Quick Start / Wizard] Set on top tab renamed to \"Always on Top\"\n- [Settings - Quick Start / Wizard] The PiP tab was reorganized from the most useful feature to the least useful\n- [Settings - Quick Start / Wizard] The PiP tab name was renamed to \"PiP & Crop\"\n- [Settings - Hotkeys] Page adjusted for the Crop hotkey (now possible to run it on a native window instead of having to go to PIP mode first. so now the hotkey page reflects it)\n- [Settings - Quick Start / Wizard - Anchors tab] Rename the \"None\" option to \"Minimum Movement\" in Anchor auto-move configuration\n- [Logs] Remove unused logs from the Anchors feature\n- Updated Swedish translation (Thanks to Göran!)\n- Update French translation (Thanks to Ralfou!)\n- Updated Chinese translation (Thanks to Dwhite!)\n5.22.1\n- Fixed #326\n- Fixed bug in toolbar settings that when disabling the toolbar, the hotkeys controls also disabled\n- Fixed bug that the app freezing for 25 seconds when enabling the toolbar\n- Fixed slow performance issue in the settings window\n5.22.2\n- Fixed regression from 5.22.1 that the settings UI freezes after the computer wakes up from sleep.\n  The regression was caused by the fix Fixed slow performance issue in the settings window\n5.22.3\n- Improve logs by adding more information that is needed to troubleshoot errors reported by users\n5.22.4\n- Fixed DwmRegisterThumbnail exception\n5.22.5\n- Fixed error NullReferenceException that may happen when changing monitor or resolution\n- Fixed duplicate description for the dark mode feature\n- Optimized few notification texts and removed redundant texts\n- Added Japanese translation (thanks to daisuke !!)\n- Added Turkish translation (thanks to Turkish !!)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.22.5","site":"https://github.com/BiGilSoft/WindowTop","source":"github.com/BiGilSoft","license_or_tos":"Copyright (c) 2019, gileli121@gmail.com","resources":null,"verified":false}