{"appId":"winget_app_Sandboxie.Classic","appShortcutName":"Winget Application","appDisplayName":"Sandboxie","authorId":"winget","releaseTagName":"winget-5.70.7","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/sandboxie-plus/Sandboxie/releases/download/v1.15.7/Sandboxie-Classic-x64-v5.70.7.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\n\nSandboxie is a sandbox-based isolation software for 32- and 64-bit Windows NT-based operating systems.\nIt is developed by David Xanatos since it became open source, before that it was developed by Sophos (which acquired it from Invincea, which acquired it earlier from the original author Ronen Tzur).\nIt creates a sandbox-like isolated operating environment in which applications can be run or installed without permanently modifying the local or mapped drive.\nSuch an isolated virtual environment allows controlled testing of untrusted programs and web surfing.\n0 5 5\nRelease Notes\nIn this update, several improvements and fixes have been introduced to enhance the stability and functionality of Sandboxie Plus.\nA new capability has been added to the service, allowing it to log monitor events, providing users with additional insights and diagnostics.\nThe Notepad++ template has been updated to ensure compatibility with Sandboxie Classic, improving usability for users of the legacy version. Additionally, MiscHelpers.dll has been updated with enhancements to the finder, contributing to improved performance and reliability.\nSeveral issues have been resolved in this release. Obsolete entries in the Sandboxie Plus installer have been removed, ensuring a cleaner installation process. An issue where pinned shortcuts created via the 'Run from Start Menu' option were non-functional has been fixed, addressing reported concerns (#4502). A potential Blue Screen of Death (BSoD) issue with the driver under low-resource conditions has been resolved, improving overall system stability.\nFurther refinements include fixing a crash occurring in NsiAllocateAndGetTable, thanks to a report from tzf-omkey (#4511). Additionally, two memory leaks have been addressed: one occurring when a sandboxed process received a device change notification, and another affecting the NtQueryDirectoryFile hook, which previously manifested in privacy-enhanced sandboxes (#4509).\nThis update ensures a more robust and efficient experience for Sandboxie Plus users. As always, feedback and reports from the community are invaluable in maintaining and improving the software.\nFor a full list of changes please review the change log.\nAnouncement\nAdditionally, I am pleased to announce that TaskExplorer, a powerful system exploration tool first launched in 2019, has been revitalized and is now production-ready thanks to its fully signed driver. With a host of new features and enhancements, including advanced security options, expanded data columns, and improved usability, TaskExplorer is an ideal choice for both casual users and IT professionals. For more details and to download the latest release, visit: TaskExplorer on GitHub.\nYou can support the project through donations, any help will be greatly appreciated.\nIf you have issues with an update installation, just uninstall the previous version keeping the sandboxie.ini and reinstall the new build.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.70.7","site":"https://xanasoft.com/","source":"sandboxie-plus.com","license_or_tos":"GPL-3.0","resources":null,"verified":false}