{"appId":"winget_app_Axosoft.GitKraken","appShortcutName":"Winget Application","appDisplayName":"GitKraken","authorId":"winget","releaseTagName":"winget-10.6.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://release.axocdn.com/windows/GitKrakenSetup-10.6.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The legendary Git client with an ultra-intuitive GUI, a powerful terminal, and offers a seamless experience for Windows, Mac and Linux.\n\n\nNew ✨\n- Automatic Conflict Detection: GitKraken will monitor your base branch for conflicts and alert you with an icon in the toolbar when conflicts are detected, providing options to resolve your conflicts sooner rather than later.\n  - When a conflict is detected, click on the icon in the toolbar to view details about the conflict and choose to rebase your current branch onto the base branch or merge changes from the base branch into your current branch.\n  - You can limit which branches GitKraken may consider as “base branches” when scanning for conflicts. Navigate to Preferences > Conflict Detection to set the preffered branches for a repository.\n  - This feature is currently in preview and may undergo significant updates based on feedback. Share your thoughts with us to help shape its future direction!\n- Custom External Editors\n  - You can now set any external editor for GitKraken to use when opening files or repositories.\n  - Navigate to Preferences > External Tools to set the default external editor to <Custom> and enter the path for the editor you want to use. If needed, you can configure the arguments to pass when opening repos or files in your selected editor.\n\nImprovements 🙌\n- Worktrees:\n  - The Commit Graph now displays a worktree icon when the branch is associated with a linked worktree.\n  - Worktrees in the left panel will show WIP summary and ahead/behind status.\n  - Selecting a branch in the breadcrumb that is checked out in a worktree will now open that worktree.\n  - Added a context menu option to Pull Requests in the Left Panel to check out the Pull Request in a new worktree.\n  - When a worktree is opened in a repository tab, the tab icon will change to a worktree icon.\n- You can now edit custom Launchpad views.\n- Added an option to relocate a workspace repo in your filesystem if the repo was not found.\n- Added an option to locate workspace repo in filesystem if the repo has multiple possible paths.\n- When auto-fetch fails silently, a warning icon will show on the REMOTES left panel section header.\n- Updated Git to 2.47.0.\n- We periodically remove features with low usage in order to focus our maintenance efforts on areas that impact users the most.\n  - Removed the dedicated Terminal tab. (We found that users overwhelmingly prefer to use the terminal panel which is embedded in repository tabs.)\n  - Removed a rarely-used feature where the Commit Detail Panel could be pinned to the bottom of the screen.\n\nBug Fixes 🐛\n- Custom GitLab Self-Managed avatars should now load properly in Launchpad.\n- Opening a linked worktree in the file manager now opens to the correct working directory.\n- Submodules should now remain intact when switching between worktrees.\n- Fixed an error involving labels that could occur when loading GitLab Self-Managed items in Launchpad.\n- Fixed an issue on Windows where custom hooks path in git config was not respected in some cases.\n- Fixed an issue where the GPG program was not found.\n- Fixed an issue where stash messages would not save properly if the branch contained a period.\n- Fixed an issue where a deleted custom Launchpad view would not be removed if it was deleted outside the client or in another client.\n- Fixed an issue creating Launchpad custom views with a sprint filter.\n- Fixed an issue when creating a Cloud Patch in Launchpad when the repo was in review mode.\n- Fixed an issue cloning Bitbucket Server Workspace repos when SSH is disabled for the Bitbucket Server instance.\n- Fixed an issue where both pull requests and issues would be loaded for custom Launchpad views.\n- Fixed an issue where Launchpad issues would not load when opening the client on a custom view.\n- Fixed an issue where Launchpad would not load if quickly switching views on app startup.\n- Fixed an issue with copying and pasting text within the diff view when switching back and forth between the different view modes (Hunk/Inline/Split).\n- Fixed an issue where hooks where not being executed from worktrees.\n- Fixed an issue where URLs and paths in WSL may not open in Windows correctly.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"10.6.0","site":"https://www.axosoft.com/","source":"GitKraken","license_or_tos":"Proprietary","resources":null,"verified":false}