{"appId":"winget_app_f3d_app.f3d","appShortcutName":"Winget Application","appDisplayName":"f3d","authorId":"winget","releaseTagName":"winget-3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/f3d-app/f3d/releases/download/v3.0.0/F3D-3.0.0-Windows-x86_64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"F3D is a fast and minimalist 3D viewer desktop application\n\nF3D is a fast and minimalist 3D viewer desktop application. It supports many file formats, from digital content to scientific datasets (including glTF, USD, STL, STEP, PLY, OBJ, FBX, Alembic), can show animations and support thumbnails and many rendering and texturing options including real time physically based rendering and raytracing.\nImage\n🗣 Join our community:\nF3D Community is welcoming to users and developers alike!\nAsk questions, gets involved and starts contributing in a beginner-friendly environment.\nDiscord\n❤️ Sponsor F3D:\nF3D is looking for sponsors!\nWe have some expenses mainly related to github and web hosting bills, any help to cover the cost would be highly appreciated.\nTo thank you, we'll offer preferential support and vote on next feature and bugfix as soon as you start sponsoring.\nSponsors\nMuch love to our sponsors for this release @Saijin-Naib @CriticalPoint @kidharb @Ramalama2 ❤️\n🤸 Armature Display Support\nYou can now display armature from glTF files in F3D!\nJust press \"Shift+A\" and it will appear, of course, animation is supported.\nImage\n📂 Open file dialog\nLoad a file in a pinch by using the native file dialog!\nPress \"Ctrl+O\" to open it and select a file to load.\nImage\n🖥️ Interactive Console\nF3D now has an interactive console!\nPress \"Esc\" to display it. You will find the log there and you will be able to input commands.\nIt replaces the log output window on Windows.\nYou can add_files, set_camera, print_mesh_info, set` any libf3d options and much more:\nImage\n📝 Complete changelog\nNote:\nThis is a major release, API and workflow have changed.\nPlease find, if needed, the migration guide in the dedicated issue.\nFor F3D users:\n- BREAKING CHANGE: Configuration files have changed syntax\n- BREAKING CHANGE: Removed all deprecated options\n- BREAKING CHANGE: --scalars have been split into --scalar-coloring and --coloring-array CLI options\n- BREAKING CHANGE: = must be used for CLI Options, --option value is not supported anymore\n- BREAKING CHANGE: Removed geometry-only and group-geometries and added multi-file-mode option for more flexible loading of multiple files\n- BREAKING CHANGE: There is no headless specific binary release anymore, just use the standard binary with --rendering-backend=egl\n- BREAKING CHANGE: --dry-run has been renamed --no-config (Thanks @t-h2o !)\n- BREAKING CHANGE: Esc to quit the app has been changed to Ctrl+Q\n- BREAKING CHANGE: --animation-frame-rate has been replaced by --frame-rate\n- BREAKING CHANGE: Renamed --bg-color into --background-color\n- BREAKING CHANGE: Renamed --comp into --coloring-component\n- BREAKING CHANGE: Removed the ? interaction to dump info, use commands instead\n- BREAKING CHANGE: Renamed --progress into --loading-progress\n- BREAKING CHANGE: Renamed --cells into --coloring-by-cells\n- BREAKING CHANGE: Renamed --range into --coloring-range\n- BREAKING CHANGE: Renamed --bar into --coloring-scalar-bar\n- BREAKING CHANGE: Renamed --inverse into --volume-inverse\n- BREAKING CHANGE: Renamed --samples into --raytracing-samples\n- BREAKING CHANGE: Renamed --denoise into --raytracing-denoise\n- BREAKING CHANGE: Renamed --ref into --reference and --ref-threshold into --reference-threshold\n- BREAKING CHANGE: Renamed --readers-list into --list-readers\n- BREAKING CHANGE: F3D binary release is now built with GCC9\n- Changed the logo! (Thanks @snoyer @lknknm @mariami-zedginidze !)\n- Reworked the UI using ImGui\n- Added support for specifying interactions in config files, see doc\n- Added a --command-script CLI option\n- Added a tiny file dialog, just press Ctrl+O (Thanks @hant-hub !)\n- Added support for armature visualization with --armature CLI option (glTF only)\n- Added support for keeping camera position when switching files, just press Ctrl+Arrow (thanks @jia-kai !)\n- Added a ImGui based console to input commands by pressing Esc\n- Added a \"Save minimal screenshot\" interaction by pressing Shift+F12 (Thanks @snoyer !)\n- Added error reporting when loading a file failed for some reason\n- Added missing config file for .brep files (Thanks @NWc0de !)\n- Added support for .xbf files (Thanks @snoyer !)\n- Added --input CLI option\n- Added support for libf3d option in configuration files\n- Added support for parsing option based on their type, see the doc (Thanks @snoyer !)\n- Added a --rendering-backend option to select the rendering backend, including headless\n- Added an interaction to rotate camera 90 degrees by pressing 4/6 (Thanks @dk1242 !)\n- Added an interaction to drop only HDRI (Shift+Drop) and an interaction to drop only 3D files (Ctrl+Drop)\n- Added a --list-bindings CLI option\n- Added a --list-rendering-backends CLI option\n- Added compatibility with VFX CY2025\n- Added commands to print info about scene, coloring, mesh and options (Thanks @samoncrief !)\n- Added command to clear the console (Thanks @0xfedcafe !)\n- Added support for expanding tilda (~) into HOME when inputting any path\n- Reworked CLI option parsing to avoid parsing issues\n- Improved --list-readers CLI option output (Thanks @snoyer !)\n- Improved image comparison algorithm\n- Improved options suggestion in the command line (Thanks @snoyer !)\n- Improved many features in F3DWeb as well as adding OCCT and Draco support (Thanks @jo-chemla !)\n- Improved the webassembly bindings\n- Improved the documentation (Thanks @spevnev @stepperpig @Aarav-07 @t-h2o !)\n- Improved python bindings (Thanks @snoyer @Nokse22 !)\n- Improved startup performance (Thanks @Yogesh9000 !)\n- Improved scalar range handling with animation\n- Fixed a crash when opening a glTF file with no textures\n- Fixed an option priority issue with --help (Thanks @brown-eric !)\n- Fixed a crash with invalid --animation-index and assimp\n- Fixed an issue where the window displayed an empty filename (Thanks @snoyer !)\n- Fixed an issue where the window resolution was reset when changing file\n- Fixed an issue when resetting the camera and using --camera-index\n- Fixed an issue with --camera-index being overridden by other camera options (Thanks @dk1242 !)\n- Fixed an issue when loading a time value outside of the range (Thanks @snoyer !)\n- Fixed issues with screenshot templating (Thanks @snoyer !)\n- Fixed an issue with grid rendering on main axes (Thanks @rhysaelliott !)\n- Fixed an issue where color-bar would show when not needed\n- Fixed an issue with glTF file using URI\n- Fixed --help invalid output (Thanks @Schwarzemann !)\n- Fixed a small issue with F3D dialog being incorrectly named on macOS\n- Fixed an issue where file where open two times on macOS\nFor libf3d users:\n- BREAKING CHANGE: All deprecated methods have been removed\n- BREAKING CHANGE: engine::libInformation members have been changed\n- BREAKING CHANGE: options API has been rewritten from scratch, see the doc (Thanks for the help @Yogesh9000 !)\n- BREAKING CHANGE: options many options are now optional\n- BREAKING CHANGE: loader API has been replaced by a new class: scene\n- BREAKING CHANGE: engine creation API has been rewritten from scratch and a context class has been added.\n- BREAKING CHANGE: interactor: setKeyPressCallBack, setDropFilesCallBack and timerCallback have been removed\n- BREAKING CHANGE: camera API has been reworked\n- BREAKING CHANGE: image::compare API has been changed\n- BREAKING CHANGE: libf3d API is now using C++17, nodiscard, std::filesystem and std::string_view are now used whenever it makes sense\n- BREAKING CHANGE: Removed support for python 3.8\n- Added an interactor::command* API that lets user control the libf3d behavior more finely\n- Added an interactor::binding* API that lets user control how the libf3d respond to interactions\n- Added an scene::loadAnimationTime API to select animation time to load\n- Added interactor::start arg to control an event loop time and a event loop callback\n- Added python stubs for autocompletion and IDE integration (Thanks @snoyer !)\n- Added support for python 3.13\n- Fixed an issue with instanciang multiple engines (Thanks @hant-hub !)\n- Added an utils::collapsePath\n- Fixed an issue with HiDPI when using the libf3d on Windows\nFor F3D packagers:\n- BREAKING CHANGE: Removed compatibility with older version of VTK. VTK v9.2.6 is now required.\n- Added a new CMake options to build python stubs: F3D_BINDINGS_PYTHON_GENERATE_STUBS\n- Added a new optional but internally provided dependency: tinyfiledialogs\n- Modified dmon dependency to be optional\n- F3D_LINUX_APPLICATION_LINK_FILESYSTEM has been renamed F3D_LINUX_LINK_FILESYSTEM and is now OFF by default\nFor F3D plugin developers:\n- Added a vtkF3DImporter and vtkF3DGLTFImporter for easier subclassing\nThanks to all our packagers that help F3D reach a wider audience: AndnoVember @kylosus @kevinsmia1939 @yurivict @bcdarwin @svenstaro @mzf-guest @papoteur-mga @berolinux @topazus @thierry-FreeBSD @xiota @alerque @chenrui333 daviddavid @kazzarin @StarsbySea @cho-m @adisbladis @Aleksanaa @pbsds @DimStar77 @AngryPenguinPL\nThanks to all our contributors for this release: @t-h2o @snoyer @lknknm @mariami-zedginidze @hant-hub @jia-kai @NWc0de @dk1242 @samoncrief @0xfedcafe @jo-chemla @spevnev @stepperpig @Aarav-07 @Nokse22 @Yogesh9000 @brown-eric @rhysaelliott @Schwarzemann\nCredits\n- kgirls01 model by nullbee\n- bristleback model by Nikolay_Tsys\n- pretoria garden HDRI by Dimitros Savva and Jarod Guest\n- herkulessaulen HDRI by Andreas Mischok","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.0.0","site":"https://f3d.app/","source":"f3d-app","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}