{"appId":"winget_app_Logtalk.Logtalk","appShortcutName":"Winget Application","appDisplayName":"Logtalk","authorId":"winget","releaseTagName":"winget-3.89.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nDocumentation\n- ADDED: Glossary definitions for \"before\", \"after\", and \"around\" methods.\n- ADDED: Alternative installation instructions for the developer tools Python dependencies.\n- FIXED: Missing developer tools dependency requirements for Ubuntu.\nTools\n- IMPROVED: The packs tool describe/1-2 predicates now also inform if a pack archive is cached.\n- IMPROVED: The packs tool to discard an existing pack archive and try to download it again in case of a checksum error while installing.\n- UPDATED: The diagrams tool for the new d2 0.6.9 release, which is now the minimum version required.\nExamples\n- ADDED: New jupyter example illustrating how to write source files that can be interpreted as scripts and open as Jupyter notebooks using the Jupytext package.\n- IMPROVED: Instructions on how to run the examples documentation as Jupyter notebooks.\n- IMPROVED: The NOTES.md files of several examples for a better experience when open as notebooks.\n- IMPROVED: The coinduction example to allow running with the XVM backend when the unify_applies_occurs_check flag is only set to true after startup.\n- FIXED: Typos in the NOTES.md files of several examples that caused errors when open and run as notebooks.\n- FIXED: Skip the interactive queries in the birds and lpa/faults examples if opening their documentation as notebooks.\n- FIXED: The lambdas example benchmarks can also be run with Trealla Prolog and XVM.\n- FIXED: The localizations example to not depend for its expected output on the report flag value.\nInstallers and installation scripts\n- ADDED: Portable Docker image support for configuring the default Prolog backend to be used for Jupyter notebooks.\n- IMPROVED: The Portable Docker image Dockerfile for smaller images.\n- FIXED: Portable Docker image to install the Jupytext dependency required for opening examples documentation as Jupyter notebooks.\n- FIXED: Portable Docker image to install d2 for use with the diagrams tool.\n- FIXED: The Handbook and the release build scripts to work with both BSD and GNU versions of the sed command.\n- FIXED: The embedding scripts to work with both BSD and GNU versions of the sed command.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.89.0","site":"https://logtalk.org/","source":"Logtalk.org","license_or_tos":"Apache-2.0","resources":null,"verified":false}