{"appId":"winget_app_PuTTY.PuTTY","appShortcutName":"Winget Application","appDisplayName":"PuTTY","authorId":"winget","releaseTagName":"winget-0.82.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://the.earth.li/~sgtatham/putty/0.82/wa64/putty-arm64-0.82-installer.msi"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://the.earth.li/~sgtatham/putty/0.82/w64/putty-64bit-0.82-installer.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free implementation of SSH and Telnet for Windows and Unix platforms, along with an xterm terminal emulator.\n\nPuTTY is a client program for the SSH, Telnet, Rlogin, and SUPDUP network protocols.\nThese protocols are all used to run a remote session on a computer, over a network. PuTTY implements the client end of that session: the end at which the session is displayed, rather than the end at which it runs.\nIn really simple terms: you run PuTTY on a Windows machine, and tell it to connect to (for example) a Unix machine. PuTTY opens a window. Then, anything you type into that window is sent straight to the Unix machine, and everything the Unix machine sends back is displayed in the window. So you can work on the Unix machine as if you were sitting at its console, while actually sitting somewhere else.\n- Major refactoring of Unicode handling to allow the use of 'foreign' Unicode characters, i.e. outside the system's configured default character set / code page. Not yet complete, but the following things work:\n  - Windows console: usernames and passwords entered interactively into PSCP, PSFTP and Plink can use foreign characters.\n  - Windows command line: usernames, remote commands, and filenames entered via command-line options can use foreign characters.\n  - PuTTY's own terminal (on Windows and Unix): even if it's not configured into UTF-8 mode for the main session, interactive usernames and passwords can use foreign characters.\n- Unicode version update: all character analysis is updated to Unicode 16.0.0.\n- Unicode terminal rendering: national and regional flags are now understood by PuTTY's terminal emulator. (However, correct display of those flags will depend on fonts and operating system.)\n- The Event Log mentions the local address and port number of the outgoing connection socket.\n- Bracketed paste mode can now be turned off in the Terminal > Features panel.\n- Unix Pageant: new --foreground mode for running as a subprocess.\n- Bug fix: the 'border width' configuration option is now honoured even when the window is maximised.\n- Bug fix: SHA-2 based RSA signatures are now sent with correct zero padding.\n- Bug fix: terminal wrap mishandling caused occasional incorrect redraws in curses-based applications.\n- Bug fix: Alt + function key in \"Xterm 216+\" mode sent a spurious extra escape character.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.82.0.0","site":"https://www.chiark.greenend.org.uk/","source":"Simon Tatham","license_or_tos":"MIT","resources":null,"verified":false}