{"appId":"winget_app_OpenShopChannel.Downloader","appShortcutName":"Winget Application","appDisplayName":"Open Shop Channel Downloader","authorId":"winget","releaseTagName":"winget-1.4.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/dhtdht020/osc-dl/releases/download/1.4.0/oscdl-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Desktop utility for obtaining homebrew contents from the Open Shop Channel, by dhtdht020.\n\n\nimageAdditions & Changes:\nNew download dialog! d169500\nA new download dialog has been added, making saving applications to SD card easier.imageUSB Gecko Support (#81 by @techydude0713)\nA new option was added to Send to Wii, introducing support for sending through USB Gecko.image- Added status icons, now in the bottom right corner to indicate program status. 118d6e7\n- Added tooltip for short description when doesn't fit on single line. 069a62f\n- Added tooltip clarifying the file sizes shown in the File Size box. 1b6410a\n- Added status icons, now in the bottom right corner to indicate program status. 118d6e7\n- Added about dialog. c13a125\n- Removed \"Output file name\" option. ded61c1\n- App metadata is now referred to as \"app information\". 0e0fd8a\n- Re-enabled native macOS platform theme\n- Removed time from release date field, as it is usually random and not that useful\n- Removed redundant repository name label\n- App birthdays now celebrated 🎈\n- Updated OSCDL to API v3 (Repository Manager API) (This breaks support for the HBC themes repo)\nimage\n- Removed support for switching repositories, will be readded in the future\n- Completely removed announcement banner system, which impacted performance\n- Added warning banner to apps writing to nand\nimage\n- Removed clients menu, as Homebrew Browser is now available inside of the repository\n- Renamed \"Peripherals\" tab to \"Compatibility\", added list of supported platforms.\nimage\n- Added dark theme support to Windows!\n- Current sidebar tab is now kept when selecting a different app.\n- Removed experimental themes implementation, including the legacy dark theme.\nFixes:\n- Fixed potential unhandled errors as a result of destination drive permissions. cf23497\n- Several fixes for new Python versions. 9729704\n- Major code refactorings.\n- Removed unused resources and merged duplicate code.\n- The chunk size was lowered to have a stable transmission. (When too high, the content fails to send.) #81\n- Fixed unsendable Wii applications having the \"Send to Wii\" toggle on after pressing the Download button. #81\n- CLI: If no arguments, display the help message. #81\n- If OSCDL is doing something important, the users is now blocked from exiting the application, until everything is complete. #81\n- Applications which previously could not be sent due to having extra directories, can now properly be sent, with a warning. #85\n- Miscellaneous visual improvements.\nThis release adds the following dependencies: pyserial, func-timeout, darkdetect.Linux and macOS users:\nDownload source code for this release below, and run pip install -r requirements.txt to install dependencies.Windows users: It is recommended to use the installer. Get oscdl-installer.exe below.\nIf you already have an older version of OSCDL installed, the installer will update it.\nko-fiDownloads Downloads","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.4.0","site":"https://github.com/dhtdht020","source":"dhtdht020","license_or_tos":"GPL-3.0","resources":null,"verified":false}