{"appId":"winget_app_Wagnardsoft.DisplayDriverUninstaller","appShortcutName":"Winget Application","appDisplayName":"Display Driver Uninstaller","authorId":"winget","releaseTagName":"winget-18.0.9.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.wagnardsoft.com/DDU/download/DDU%20v18.0.9.3_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Display Driver Uninstaller is a driver removal utility that can help you completely uninstall AMD/NVIDIA/INTEL graphics card drivers and packages from your system, trying to remove all leftovers (including registry keys, folders and files, driver store).\n\nDisplay Driver Uninstaller (DDU) is a driver removal utility that can help you completely uninstall AMD/NVIDIA/INTEL graphics card drivers and packages from your system, trying to remove all leftovers (including registry keys, folders and files, driver store).\n\nThe AMD/NVIDIA/INTEL video drivers can normally be uninstalled from the Windows Control panel, this driver uninstaller program was designed to be used in cases where the standard driver uninstall fails, or when you need to thoroughly delete NVIDIA and ATI video card drivers.\n\nThe current effect after you use this driver removal tool will be similar as if its the first time you install a new driver just like a fresh, clean install of Windows. As with any tool of this kind, we recommend creating a new system restore point before using it, so that you can revert your system at any time if you run into problems.\n- Intel: Fixed Removal of Media Driver Framework (MDF) registry entry that was not being removed on the wow6432 registry location.\n- Intel: WINEVT additional cleanup.\n- AMD: Optimized the removal of the \"AMDKMPFD\" driver.\n- Nvidia: Made cleanup tweaks when \"Remove GFE / NVIDIA App\" is not ticked.\n- Nvidia: \"gfnruntimesdk\" folder removal from the \"ProgramData\\NVIDIA Corporation\"\n- All: Fixed an issue that prevented some registry keys to be removed.\n- Translation update: German, Japanese, Polish, Russian","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"18.0.9.3","site":"https://www.wagnardsoft.com/","source":"Wagnardsoft","license_or_tos":"Freeware","resources":null,"verified":false}