{"appId":"winget_app_OBSProject.OBSStudio","appShortcutName":"Winget Application","appDisplayName":"OBS Studio","authorId":"winget","releaseTagName":"winget-31.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/obsproject/obs-studio/releases/download/31.0.0/OBS-Studio-31.0.0-Windows-Installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free and open source software for video recording and live streaming.\n\n\n[!IMPORTANT]\nNVIDIA Kepler (600 and 700 series) GPUs are no longer supported for NVENC.\n[!NOTE]\nNVIDIA users may need to update their GPU drivers to 551.76 (Windows) / 550.54.14 (Linux) or newer.\n[!IMPORTANT]\nThe code signing certificate for OBS has been updated. This may impact game capture compatibility with some anti-cheat solutions with this OBS update. If you are a game or anti-cheat developer please see https://obsproject.com/kb/capture-hook-certificate-update for more information.\n31.0 New Features\n- Added NVIDIA Blur Filter and Background Blur [pkviet]\n- Added preview scrollbars and zoom/scale indicator [cg2121/Warchamp7]\n- Added v210 format support for AJA device capture [paulh-aja]\n- Added Amazon IVS service integration [palana]\n- Added QSV AV1 Screen Content Coding [thyintel]\n- Enabled first-party YouTube Chat features [msuman-google]\n31.0 Changes\n- Updated the browser source/docks CEF (Chromium) to version 127 (6533) on all platforms [reitowo/WizardCM/PatTheMav/tytan652/pkviet/kkartaltepe/Lain-B]\n- Changed scene items to use relative coordinates [derrod]\n    - Existing scene collections will be automatically converted to use relative coordinates if the scene collection has a known output resolution set.\n- Split NVIDIA Audio Effects from Noise Suppression [pkviet]\n    - Existing filters will be automatically migrated.\n- Changed the Image Slideshow's Playback Mode property from radio buttons to a dropdown [derrod]\n- Disabled the (currently unsupported) built-in Automatic Scene Switcher when using Wayland on Linux [tytan652]\n- Improved error messages for macOS Virtual Camera [jcm93]\n- Changed Display and Window capture on Windows to not capture the first found display or window [Lain-B]\n- Changed display and window capture on Linux to not capture implicitly [Lain-B]\n- Added a warning to Window Capture when trying to capture WinUI 3 applications with BitBlt [qhy040404]\n- Refactored the NVENC implementation with various improvements [derrod]\n    - SDK 12.2 features, such as split encoding, are now supported.\n    - Additional features from old SDKs are supported:\n        - B-Frames as reference\n        - Target Quality VBR mode (CQVBR)\n    - A custom options field has been added to allow setting more options that don't warrant their own UI elements.\n- Improved screensaver inhibit functions on Linux in Flatpak\n- Changed scripts to correctly pass settings to modified callbacks on reload [Penwy]\n- Removed legacy QSV code for old devices (Haswell or older) [RytoEX]\n- Removed legacy QSV code for Windows 7 [RytoEX]\n- Removed default desktop audio device on macOS 13+ [jcm93]\n- Removed NVIDIA Kepler GPU support for NVENC [derrod]\n- Removed FTL support [derrod]\n- Removed legacy migrations from OBS Studio 28.1 and earlier [derrod]\n    - If updating from these older versions, you may wish to update to OBS Studio 30.2 first, and then update to OBS Studio 31.\n- Removed support for Ubuntu 22.04 [derrod]\n- Removed legacy YouTube chat [gxalpha]\n- Blocked TikTok Virtual Camera from loading in OBS due to known issues [notr1ch]\n- Application settings have been split into \"app\" configuration and \"user\" configuration, rather than storing everything in global.ini [PatTheMav]\n31.0 Bug Fixes\n- Fixed two crashes with the QSV encoder on Linux [kkartaltepe]\n- Fixed a crash with a race condition involving multitrack video output reconnect [dsaedtler]\n- Fixed two potential crashes in Linux Window Capture [Lain-B]\n- Fixed a crash on macOS that could occur if an audio device was disconnected [jcm93]\n- Fixed a crash on Windows when capturing D3D12 games [confusionattack/Lain-B]\n- Fixed a crash on Linux when importing a scene collection created on Windows [SarenDev]\n- Fixed a crash on Windows when capturing a Vulkan application [Charlese2]\n- Fixed a deadlock in MP4 muxer [derrod/notr1ch]\n- Fixed a deadlock when shutting down muxer [exeldro]\n- Fixed a potential deadlock when stopping an encoder [derrod]\n- Fixed a potential memory error and crash in text parser [fzwoch]\n- Fixed a couple minor memory leaks [pkviet]\n- Fixed a memory leak in PipeWire plugin [dimtpap]\n- Fixed a memory leak when playing an HDR media file [tt2468]\n- Fixed an issue on FreeBSD with handling SSL certificates [emaste]\n- Fixed an issue with pressed button color in the Rachni theme [shiina424]\n- Fixed an issue with some missing icons in the System theme [shiina424]\n- Fixed an SRT listener bug where the socket was not closed properly [pkviet]\n- Fixed an issue where the current scene collection could be erased to default when trying to switch to a different scene collection that's corrupted or invalid [derrod]\n- Fixed a buffer overrun in UTF-8 text conversion [derrod]\n- Fixed an issue that could cause bitrate spikes in QSV CBR [thyintel]\n    - Note: This fix only applies to Lunar Lake or newer except Alder Lake N.\n- Fixed an issue where the Auto Configuration Wizard could unintentionally enable Enhanced Broadcasting [lexano-ivs]\n- Fixed issues with the audio clipping indicators displaying incorrectly on volume meters [norihiro]\n- Fixed an issue causing hotkeys to register inconsistently on macOS [jcm93]\n- Fixed an issue causing multitrack video output to fail if color format was set to I444 [dsaedtler]\n- Fixed an issue where Custom CSS in browser sources no longer worked with certain websites (namely YouTube chat) [vvto33]\n- Restored STUN support for WHIP output [mondain]\nChecksums\nOBS-Studio-31.0.0-Sources.tar.gz: 23d45d8ffdf9e673aa0ef4ee7b8d030a63f21151c709b6e4657d20bc230db178\nOBS-Studio-31.0.0-Ubuntu-24.04-x86_64-dbsym.ddeb: 532f3e69b773216e195a0d093d9feeda538a58371cec605862a6f19bf0fa0115\nOBS-Studio-31.0.0-Ubuntu-24.04-x86_64.deb: a5675ce7635a7b5f2a52cf4263ac3ca3c28ca338168900a018e41071189ceed5\nOBS-Studio-31.0.0-Windows-Installer.exe: 786dbf97f558a9190a30d6c86d7215dfbdcb9d2aaabb8000e3610b2be19f3f89\nOBS-Studio-31.0.0-Windows-PDBs.zip: a84a649eef6ccfec441433efe9089f819846c72a9c2d87c7d01b8ba511db8f43\nOBS-Studio-31.0.0-Windows.zip: 0ea3f71bd4d8a611ef763d2591aaf12b61e6f563284a3a14ddff485621fe4c41\nOBS-Studio-31.0.0-macOS-Apple-dSYMs.tar.xz: e306fcab8995b8d6ea436d3ac19b482fe487d5f3c324090cf4a1e1c8f91aff22\nOBS-Studio-31.0.0-macOS-Apple.dmg: e6719d8f67e47d7672094aca15e27d03d2cf1662130616b46299ee1555735a52\nOBS-Studio-31.0.0-macOS-Intel-dSYMs.tar.xz: 593811edd0619835e1ff18aea4b6e4bd60069bfe53ecbd4db4fa944232578eae\nOBS-Studio-31.0.0-macOS-Intel.dmg: 029ae118f8c02d9319cdb29880c65edb674932e2ef2331237091416b50a5f1ba","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"31.0.0","site":"https://obsproject.com/","source":"OBS Project","license_or_tos":"GPL-2.0","resources":null,"verified":false}