{"appId":"winget_app_OBSProject.obs_amd_encoder","appShortcutName":"Winget Application","appDisplayName":"AMD Encoder for OBS Studio","authorId":"winget","releaseTagName":"winget-2.6.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/obsproject/obs-amd-encoder/releases/download/2.6.0/obs-amd-encoder-2.6.0.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"AMD Advanced Media Framework Encoder Plugin for Open Broadcaster Studio\n\nobs-amd-encoder is a plugin for Open Broadcaster Software Studio which adds support for native AMD Hardware encoding through the use of AMD's Advanced Media Framework.\nWith their new Navi GPU series AMD added a new feature to the hardware encoders: High Motion Quality Boost.\nThis option should allow you to get higher quality streams at the exact same bitrate, resolution and framerate,\ngiven that you own and use an AMD RX 5700 (XT/XT Anniversary).\n\nHowever due to that the new feature, the plugin now finally dropped support for ancient drivers. You will now need\nto have an up-to-date driver, at minimum 19.7.1 though the recommended minimum is 19.9.2, otherwise the plugin will\nrefuse to load and does not add any encoders for use.\n\nAdditionally jpark37/rcdrone also fixed the VBV Buffer Strictness option. The incorrect behavior before was that all\nvalues above 50% would act like 50%. With the fix applied, values above 50% correctly approach the strictest possible\nbuffer size again, allowing tighter control over bitrate.\n\nChangelog:\n* Removed support for older drivers that ship an AMF Runtime older than version 1.4.14. You will now need a minimum\n  Driver version of 19.7.1, however the recommended minimum is 19.9.2 which contains a lot of fixes compared to 19.7.1.\n  This also includes dropping support for unmodified Windows 8 systems as AMD has stopped providing driver updates to Windows 8.\n* Added the new \"High Motion Quality Boost\" option which seems to be exclusive to the Navi (RDNA) series of AMD GPUs.\n* Fixed automatic VBV Buffer calculation with values close or above 50%.\n* The Video API option will now only show the most modern supported API on the platform, which is Direct3D 11 on Windows 10\n  and Direct3D 9 on Windows 7. Users on Windows 8 are urged to upgrade to Windows 10.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.6.0.0","site":"https://www.xaymar.com/","source":"Xaymars Technology Workshop","license_or_tos":"GPL-2.0","resources":null,"verified":false}