{"appId":"winget_app_IDRIX.VeraCrypt","appShortcutName":"Winget Application","appDisplayName":"VeraCrypt","authorId":"winget","releaseTagName":"winget-1.26.15","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://launchpad.net/veracrypt/trunk/1.26.15/+download/VeraCrypt_Setup_x64_1.26.15.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"VeraCrypt is a free open source disk encryption software for Windows, Mac OSX and Linux.\n\nVeraCrypt is a software for establishing and maintaining an on-the-fly-encrypted volume (data storage device). On-the-fly encryption means that data is automatically\nencrypted right before it is saved and decrypted right after it is loaded, without any user intervention. No data stored on an encrypted volume can be read (decrypted)\nwithout using the correct password/keyfile(s) or correct encryption keys. Entire file system is encrypted (e.g., file names, folder names, contents of every file,\nfree space, meta data, etc). Files can be copied to and from a mounted VeraCrypt volume just like they are copied to/from any normal disk (for example, by simple\ndrag-and-drop operations). Files are automatically being decrypted on the fly (in memory/RAM) while they are being read or copied from an encrypted VeraCrypt volume.\nSimilarly, files that are being written or copied to the VeraCrypt volume are automatically being encrypted on the fly (right before they are written to the disk) in RAM.\nNote that this does not mean that the whole file that is to be encrypted/decrypted must be stored in RAM before it can be encrypted/decrypted. There are no extra memory\n(RAM) requirements for VeraCrypt.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.26.15","site":"https://www.idrix.fr/","source":"IDRIX","license_or_tos":"Apache 2.0","resources":null,"verified":false}