{"appId":"winget_app_BinaryMark.BatchImageEnhancer","appShortcutName":"Winget Application","appDisplayName":"Batch Image Enhancer Free Edition","authorId":"winget","releaseTagName":"winget-5.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0040506t.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Turn those average photos into stunning images with 120+ adjustments, actions, effects, and filters. Improve brightness, contrast, saturation, temperature, tint, color balance. Resize, crop, sharpen, watermark, and convert to/from 30+ image formats!\n\nTurn average pictures and photos into great images with 120+ adjustments, actions, effects, and filters. Make HSL and RGB color corrections, adjust brightness, gamma, exposure, contrast, saturation, and 30+ other characteristics. Improve image quality by sharpening, noise reduction, and auto-levels filters. Apply creative effects to dramatically enhance your photos. Resize, crop, watermark, and convert between / save in 30+ image formats! Some additional key features include:  - Built-in image preview with interactive histograms - Layers with 40+ blending modes and pixel filtering - Convert to/from and save results in any of 30+ formats: jpg, png, gif, tiff, bmp, j2k - Conditional processing based on image orientation, size, and other attributes - 4 operation modes: Manual, Background, Scheduled, and Console - 20 scaling modes: Lanczos, Bilinear, Bicubic, Box, HqX - Rotate and flip manually or using EXIF orientation tag - Fit to fixed size or rectangle; fit to aspect ratio - Perform lossless JPEG crops, flips, and rotations - Automatic crop, crop to fixed size, crop from edges, crop to W:H ratio - Change width and height independently or proportionately - Automatically shrink images to fit a desired file size in Kilobytes - Per-channel processing: extract, mix, replace, adjust values, etc... - 8 Color Models: RGB, HSB/HSV, HSL, HSI, HWB, YCbCr, Lab, LCH - Add static and dynamic text and image watermarks with visual effects - Use multiline text watermarks with various fonts and styles - Dynamically generate text watermarks with EXIF and file info - 12 compositing modes: source-over, source-in, source-out... - 40+ Blend Modes: lighten, darken, contrast, inversion... - Work with metadata: EXIF, IPTC, GPS, XMP. - Customize output file names with dynamic tags - Save images to multiple locations and using different settings - Fast parallel processing on multi-core CPUs - Rename image files based on image or file properties and EXIF/IPTC metadata\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.6","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}