{"appId":"winget_app_Elgato.CameraHub","appShortcutName":"Winget Application","appDisplayName":"Elgato Camera Hub","authorId":"winget","releaseTagName":"winget-1.11.0.4066","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://edge.elgato.com/egc/windows/echw/1.11.0/CameraHub_1.11.0.4066_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Dial in your Facecam settings like a pro.\n\n\nWhat’s new in Camera Hub 1.11?\n\n🗣️ Voice Sync - Intelligent script scrolling\nPowered by AI and machine learning, Voice Sync* ensures your script moves only when you speak. It adapts to your reading pace—whether you speed up, slow down, or pause, the text follows your lead. Skip a line? Voice Sync adjusts seamlessly. Go off-topic? It waits for you to resume.\nVoice Sync supports English, German, Spanish, French, Dutch, Danish, Italian, and Portuguese, with more languages on the way.\nAdditionally, a new optional reading line setting dims already-read text and highlights upcoming text, making it easier to follow along.\nLearn more about Voice Sync.\n\n*Requires NVIDIA RTX 2060 or M1 Apple Silicon or better and a microphone\n\n↩️ Camera Preview Quick look\nQuickly access your camera preview in Prompter to check your lighting and framing, ensuring everything is perfect before going live or starting an important meeting.\nOr tap a key on Stream Deck with the new Preview To Prompter action.\nGet the Camera Hub plugin for Stream Deck\n\n⌨️ Global Hotkeys for Prompter control\nYou can now control various Prompter functions using hotkeys.\n- Play/Pause:\n  - Windows: Ctrl + Alt + P\n  - macOS: Ctrl + Command + P\n- Next Chapter:\n  - Windows: Ctrl + Alt + Page Down\n  - macOS: Ctrl + Command + Page Down\n- Previous Chapter:\n  - Windows: Ctrl + Alt + Page Up\n  - macOS: Ctrl + Command + Page Up\n\n🛠️ Bug fixes & performance improvements\n- Fixed a bug where Camera Hub could crash when connecting an iPhone and using EpocCam\n- Improved support for Arabic text and right-to-left processing in Prompter text mode\n- Text mode is now always the top layer on Prompter’s display when active\n- Improved firmware update stability by temporarily disabling Stream Deck actions when an update is in progress\n- Fixed a bug where constant scroll mode was not working when coming back from Chat\n- Fixed a bug where colors for Cam Link 4K were incorrect\n- Fixed a bug where shutter speed was disabled after turning off Automatic Exposure for Facecam Pro\n\nWant to share feedback on Camera Hub 1.11? Connect with us:\n- Leave a comment on our Subreddit\n- Chat with fellow community members on Discord\n- Hit up @elgato on Twitter\n- Contact our Support Team","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.11.0.4066","site":"https://www.elgato.com/","source":"Corsair Memory, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}