{"appId":"winget_app_BinaryMark.TextToMp3Converter","appShortcutName":"Winget Application","appDisplayName":"Text to MP3 Converter Free Edition","authorId":"winget","releaseTagName":"winget-2.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0440200t.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Quickly convert text, word, pdf, or other documents in most languages to speech and save results to MP3 files using OS Text-to-Speech voice synthesizer. Control speaker's voice, gender, speed, emphasis. Adjust sound quality, bit rate, other options.\n\nQuickly convert text, word, pdf, and other documents to speech and save results to MP3 files using Windows Text-to-Speech Engine and voice synthesizer.  - Supports multiple languages* - Synthesizes speech using configurable voice* - Voice control options include speaker's gender, tempo, speed, emphasis, and volume - Records and outputs either wav or mp3 files - One or two audio channels: mono / stereo output - Control recorded sound quality using effective bit rate: bits per sample and samples per second settings - Can open and read most text documents in most encodings - Can read documents in doc, rtf, and pdf formats** - Automatically improves and fixes text to make it compatible with speech synthesis (for example it can remove hyphenation) - Can use any of the installed Text-to-Speech voices - Uses Microsoft Speech Synthesizer available with Windows - Text-to-Speech (TTS) engine supports Speech Synthesis Markup Language (SSML)  * Voices and language support varies depending on your version of Windows and installed speech languages. ** Word, pdf, rtf, and other documents may need to be opened in their respective programs depending on the exact format version and features used.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.0","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}