{"appId":"winget_app_GeoDa.GeoDa","appShortcutName":"Winget Application","appDisplayName":"GeoDa","authorId":"winget","releaseTagName":"winget-1.22","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Spatial Data Science\n\nGeoDa is a free and open source software tool that serves as an introduction to spatial data science. It is designed to facilitate new insights from data analysis by exploring and modeling spatial patterns.\nGeoDa was developed by Dr. Luc Anselin and his team. The program provides a user-friendly and graphical interface to methods of exploratory spatial data analysis (ESDA), such as spatial autocorrelation statistics for aggregate data (several thousand records), and basic spatial regression analysis for point and polygon data (tens of thousands of records). To work with big data in GeoDa it should first be aggregated to areal units.\nSince its initial release in February 2003, GeoDa's user numbers have increased exponentially to over 520,000 (June 2022). This includes lab users at universities such as Harvard, MIT, and Cornell. The user community and press embraced the program enthusiastically, calling it a \"hugely important analytic tool,\" a \"very fine piece of software,\" and an \"exciting development.\"\nWhat's Changed\n- [Fix] Build for Ubuntu 24.04 by @lixun910 in https://github.com/GeoDaCenter/geoda/pull/2494\n- [Fix] reprojection not working when adding basemap layer by @lixun910 in https://github.com/GeoDaCenter/geoda/pull/2500\n- [Bug] the sample list items are overflow the notebook container by @lixun910 in https://github.com/GeoDaCenter/geoda/pull/2502\nFull Changelog: https://github.com/GeoDaCenter/geoda/compare/v1.22.0.8...v1.22.0.10","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.22","site":"https://geodacenter.github.io/","source":"GeoDa Center","license_or_tos":"GPL-3.0","resources":null,"verified":false}