{"appId":"winget_app_BinaryMark.BatchWordReplace","appShortcutName":"Winget Application","appDisplayName":"Batch Word Replace Free Edition","authorId":"winget","releaseTagName":"winget-5.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.binarymark.com/packages/pid0340506t.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Replace, insert new content, remove existing text, change text style and formatting in 1000s of Word and text documents in bulk. Save results and convert between various document formats: docx, doc, pdf, odt, rtf, wpd, txt, xps, html, and others.\n\nReplace text in, add or remove content, and edit thousands of Word documents in doc and docx formats, PDFs, RTF documents, and other text documents.  - Search and replace in 1000s of text documents - Use Regular Expressions and RegEx patterns in searches - Add new text content to hundreds of Word documents - Remove certain words, phrases, or other text from multiple documents - Apply new text formatting and styles to specific paragraphs and phrases in word documents in bulk - Change existing formatting and styles in multiple documents - Change page layout and size in multiple text documents - Batch edit document properties like Author, Title, and Subject - Supports Word documents: docx, doc - Supports Open Office Documents: odt - Supports Adobe PDFs - Supports other text file formats: rtf, txt, wpd, html, xps - 4 operation modes: Manual, Background, Scheduled, and Console - Find documents and add them to processing queue depending on their content - Conditional processing based on document contents, file size, and other attributes - Rename document files based on file properties document metadata - Fast parallel processing on multi-core CPUs - Much more!\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.6","site":"https://www.binarymark.com/?ref=winget","source":"BinaryMark","license_or_tos":"EULA","resources":null,"verified":false}