{"appId":"winget_app_Hyperion.Hyperion","appShortcutName":"Winget Application","appDisplayName":"Hyperion Ambient Light","authorId":"winget","releaseTagName":"winget-2.0.16","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/hyperion-project/hyperion.ng/releases/download/2.0.16/Hyperion-2.0.16-Windows-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The successor to Hyperion aka Hyperion Next Generation\n\nHyperion is an opensource Bias or Ambient Lighting implementation which you might know from TV manufacturers. It supports many LED devices and video grabbers.\nThe release has been in the works for almost 12 months covering bug fixes and it includes a good number of new features/improvements.\nYou can get the executables from GitHub or even better via our official repositories for Debian, Ubuntu and Fedora (new). All latest versions are supported (Bookworm, Mantic Minotaur, Fedora 39), as well as the upcoming ones (Trixie, Noble Numbat, Fedora 40).\nInstallation/update instructions, as well as even an easy one command way you find in the comprehensive instructions page, just select the way you would like to go for.\nAdded\n- New languages: Hebrew, Indonesian, Ukrainian\nEvent Services\n- Newly introduced Event Service configuration and consistent handling across all components\n- Suspend/Resume & Screen Locking support for MacOS\n- Allow to enable/disable suspend & lock on operating system events (#1633, #1632)\n- Scheduled events allowing to suspend,resume, etc. (#1088)\n- Configurable CEC event handling\nLED-Devices\nPhilips Hue\n- APIv2 support, incl. full https security and certificate validation\n- Multi-Segment device support, e.g. Gradient light\n- Use Entertainment area device location for Hyperion layout in addition to manual locations\n- Option to layout by focussing on full- or only center of entertainment area\n- Wizard supports multiple Hue-Bridge discovery\n- Support of DIYHue specifics. DIYHue bridge's name must start with \"DIYHue\"\n- Backward compatibility for bridges not supporting APIv2 and/or Entertainment API Note: The wizard will configure an APIv2 capable bridge always with Entertainment to ensure the best experience.\nNanoleaf\n- Wizard to generate user authorization token allowing users to configure the device via a single window\n- Generation of a default layout per device's configuration, including orientation\n- Lines support\nChanged\n- Updated misleading error messages in case Hyperion is not able to support the suspend/lock feature (#1622)\n- Restart Serial Device, if write error occurred\n- ws281x - Update logic to identify is user is admin and disable device configuration if not (#1621)\n- Hide Hyperion from the Dock on macOS, as all features can be accessed from the menubar - Thanks @Rastafabisch\nFixed\n- Correctly display local language characters in log, e.g. Umlauts\n- Fixed that Audio Capture is enabled after reboot automatically (#1581)\n- Fixed that Audio Capture is not shown when there is no screen nor video grabber\n- Audio Capture settings are no longer ignored (#1630)\n- Fixed that the Matrix effect finds its image - Thanks @lsellens\n- MDNSBrower - Fixed, if timeout while resolving host occurs\n- Non image updates ignored blacklisted LEDs (#1634)\n- Fixed that Windows OsEvents failed in non-GUI mode (#1671)\n- Addressed serious (#1425) and some smaller memory leaks\nLED-Devices\nWLED\n- Fixed UI handling, if segment streaming is not supported\nNanoleaf\n- \"Panel numbering sequence\" was not configurable any longer\n- Number of panels increased during retries (#1643)\nRemoved\nLED-Devices\nPhilips Hue\n- \"Switch Off On Black\" for APIv2, as the original bridge will switch off LEDs itself.\n- \"Candy Gamma\" for APIv2, as the bridge maps the RGB values best per device.\nNanoleaf\n- Removed \"Start Position\" in favour of the general Blacklist feature provided\nTechnical\n- Changed default build from Stretch to Buster\n- Support Qt 6.7, Update to Protobuf 25.1, Update mbedTLS to v3.4.0, Update flatbuffers to v23.5.26\n- Use C++17 standard as default\n- Added Pull Request (PR) installation script, allowing users to test development builds savely on Linux\n- Fixed missing include limits in QJsonSchemaChecker - Thanks @Portisch\n- Fixed dependencies for deb packages in Debian Bookworm (#1579) - Thanks @hg42, @Psirus\n- Fixed git version identification when run in docker and local code\n- Address cmake deprecation warnings, cmake 3.5 is required at minimum now\n- Address some build warnings\n- Removed UniqueConnections from Lambdas, as not supported","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.0.16","site":"https://github.com/hyperion-project/hyperion.ng","source":"hyperion-project","license_or_tos":"MIT","resources":null,"verified":false}