{"appId":"winget_app_AntibodySoftware.WizFile","appShortcutName":"Winget Application","appDisplayName":"WizFile","authorId":"winget","releaseTagName":"winget-3.10","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://antibody-software.com/files/wizfile_3_10_setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Find files by name on your hard drives almost instantly.\n\n\n• Added global \"include\" and \"exclude\" filters - go to Options->Filters to configure them.\n  The \"Include Filter\" is applied to all searches automatically, as if it had already been typed into the search field.\n  The \"Exclude Filter\" will automatically exclude any matching items from the search results. It is also applied during the initial scanning process. This can greatly speed up scans by preventing certain folders from being scanned at all, and can also greatly reduce memory use.\n\n  For example, if you use Synology NAS, you can get WizFile to ignore snapshot and recycle folders by setting the \"exclude filter\" to:\n  #snapshot|#recycle|@recycle\n\n  Note that there should not be any spaces between the vertical pipes (vertical pipes are interpreted as \"OR\" and spaces interpreted as \"AND\"). The example above will exclude any file or folder name that contains \"#snapshot\" OR \"#recycle\" OR \"@recycle\".\n\n  Another example:\n  To exclude the \"C:\\Windows\\WinSxS\" and \"C:\\Program Files\" folders from being scanned, you would set the exclude filter to\n  C:\\Windows\\WinSxS\\|\"C:\\Program Files\\\"\n  Note that double quotes are required around filter items that contain spaces.\n• UI tweaked to look like Windows 11 style. To use WizFile classic theme edit the WizFile.ini file (located in %appdata%\\WizFile\\WizFile.ini or exe folder for portable) and set: UseWizFileClassicTheme=1\n• Fixed rare bug that might cause some folders not to be detected by WizFile when parsing MFT file due to unusual MFT record ordering\n• Unicode characters were not being saved to search drop down history correctly - fixed\n• Emojis were not being displayed correctly in file search and filter fields - fixed\n• When configured to start with Windows, WizFile will now pause for 60 seconds before starting. This it to allow time for virtual drive letters to become available (like Google Drive G:), and to not slow down other important startup tasks due to disk scanning. If WizFile is already configured to start with Windows and you want to enable this delay, toggle the Options->Start With Windows option off and back on. You can edit the delay time by editing the Action in Windows Task Scheduler for the \"WizFile\" item and changing the value in the /delaysecs=xx parameter\n• WizFile can now be configured to not run as admin - to do this, edit the WizFile.ini file (located in %appdata%\\WizFile\\WizFile.ini or exe folder for portable) and set\n  RunAsAdmin=FALSE\n• new Indonesian translation (thanks to Marcellinus Ferdinand Suciadi)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.10","site":"https://antibody-software.com/","source":"Antibody Software","license_or_tos":"Freeware","resources":null,"verified":false}