{"appId":"winget_app_NickGasson.NVC","appShortcutName":"Winget Application","appDisplayName":"NVC VHDL Simulator","authorId":"winget","releaseTagName":"winget-1.15.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/nickg/nvc/releases/download/r1.15.0/nvc-1.15.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free software VHDL compiler and simulator implementing almost all of IEEE 1076-2008.\n\n\nThis is a major new release with the following changes:\n-  --load is now a global option and should be placed before the -r command. This allows VHPI foreign subprograms to be called during elaboration (#988).\n- The --per-file coverage report option outputs code coverage reports for each source file instead of each instance (#823).\n- The new --check-synthesis analysis option warns when signals are missing from process sensitivity lists.\n- Fixed a crash when a generic subprogram is associated with open (#1025).\n- Added a functional coverage API in nvc.cover_pkg that can be used by external frameworks such as OSVVM to define cover points.\n- Added threshold-<value> option for coverage to set minimal count a coverage bin must reach to be reported as covered.\n- Added a warning for potential infinite loops in processes without sensitivity and lacking any wait statements (from @NikLeberg).\n- Selected names can now be to register value change callbacks with vhpi_register_cb (#1045).\n- Removed the limit on the maximum number of parameters that can be passed to a VHDL subprogram (#1036).\n- The new --no-save analysis option parses and checks the input files but does not save the working library to disk. This is a replacement for the --syntax top-level command which is now deprecated.\n- The coverage database file name has changed to <toplevel>.ncdb in the current working directory and this can now be customised with the new --cover-file= elaboration option. Attempts to access the old file name inside the library directory will be redirected to the new location, with a warning.\n- Partial association of ports with interface views now works correctly (#1074).\n- Added support for PSL suffix implication, SERE repetition, and SERE fusion.\n- Nested arrays more than two levels deep can now be dumped in FST format (#1071).\n- Added support for package external names (#1072).\n- Fixed parser hang for bit string literals (from @NikLeberg).\n- Fixed a crash on an illegal package definition inside an interface.\n- Comping the Vivado vendor libraries with nvc --install vivado is now around 2x faster and analysing files with many dependencies is up to an order of magnitude faster (#1098).\n- The --jit elaboration mode now works on Windows-on-Arm systems.\n- vhpi_assert now behaves the same as VHDL assert for the purposes of determining the simulation exit code and early termination (#1060).\n- The 'driving_value attribute now works correctly with record types.\n- Added basic support for 'instance_name, 'path_name and 'simple_name attributes of generate block labels (from @NikLeberg) (#1125).\n- Comments are now parsed correctly inside PSL directives (#1129).\n- Updated to OSVVM 2024.11 and UVVM 2024.10.08 for nvc --install.\n- Several other minor bugs were resolved (#1038, #1057, #1067. #1124).\nSpecial thank you to @bpadalino, @tmeissner, @Blebowski, @amb5l, @m42uko, @a-panella, @cmarqu, @albydnc, @johonkanen, and @augustofg for sponsoring me!","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.15.0","site":null,"source":"Nick Gasson","license_or_tos":"GPL-3.0","resources":null,"verified":false}