{"appId":"winget_app_ZhornSoftware.Stickies","appShortcutName":"Winget Application","appDisplayName":"Stickies","authorId":"winget","releaseTagName":"winget-10.1d","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Stickies is a PC utility I wrote to try to cut down on the number of yellow notes I was leaving stuck to my monitor. It is a computerised version of those notes.\n\nThe design goal behind Stickies is that the program is small and simple. Stickies will not mess with your system files, or write to the registry. Stickies stores information in a single SQLITE database file.\n\nFeatures\n* Once on screen, notes will remain where placed until closed, even through reboots\n* Stickies appearance can be customised; fonts, colours and buttons may be changed, and styles saved. Notes can be resized.\n* Stickies can store text or images\n* Stickies can be hidden for a certain period, until a specified date and time, or to wake every day, week or month, to act as reminders.\n* Stickies can have alarms set to ensure you notice them at a point you choose\n* International language, Unicode and RTL text support\n* Stickies can snap to each other and to the sides of the screen to keep them neatly lined up\n* Stickies can be attached to an application, web site, document or folder so they only show when it's on screen\n* Stickies can be transferred from one machine to another either over a TCP/IP network connection, or by using an SMTP mail server or MAPI client\n* Hierarchical friends list, which may be automatically transferred from other friends\n* Stickies is small and simple, it writes to a database file, and does not alter the registry\n* AD network administrators can use Group Policy to control settings\n* API to allow integration with other applications\n* ...and Stickies is completely free!\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"10.1d","site":"https://www.zhornsoftware.co.uk/","source":"Zhorn Software","license_or_tos":"Proprietary","resources":null,"verified":false}