{"appId":"winget_app_AhoyLabs.BackyardAI","appShortcutName":"Winget Application","appDisplayName":"Backyard AI","authorId":"winget","releaseTagName":"winget-0.34.1.55302","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://update.backyard.ai/download/win32"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Run AI models locally. One-click install w/ zero configuration.\n\n\n●\nChat Page Improvements\n●\nLore Items are now displayed in the sidebar\n●\nCharacter, Model, and Chat Settings are now individual overlays on desktop to make editing easier and faster\n●\nBetter spacing for full-width mode\n●\nChat messages now only display one empty line between paragraphs\n●\nImproved spacing for full-width mode on desktop & web\n●\nOther Improvements\n●\nAdded support for importing chat logs from JSON files on Web & Mobile\n●\nAdded linked external accounts to the Accounts Settings page\n●\nDiscord accounts can now be linked to your Backyard.ai account, regardless of your sign-in method\n●\nBug Fixes\n●\nDue to an issue with the X API, new accounts can no longer be created with X (Twitter). We will still support existing accounts but will phase out the ability to sign in with X in the future\n●\nFixed issue where Desktop apps would have UI rendering issues on the chat page\n●\nFixed issue where chat dropdown menu was partially obscured on some mobile devices\n●\nFixed issue preventing uploading characters to the Hub on some mobile devices\n●\nFixed issue where regen buttons would sometimes be hidden after loading older messages\n●\nFixed issue where the \"Upgrade\" button failed to redirect to the subscription management page\n●\nFixed issue where copy/system menu was disabled on the chat items on Desktop App & Web\nUpdates from 1 beta releases included","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.34.1.55302","site":"https://backyard.ai/","source":"Ahoy Labs, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}