{"appId":"winget_app_AltSnap.AltSnap","appShortcutName":"Winget Application","appDisplayName":"AltSnap","authorId":"winget","releaseTagName":"winget-1.64","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Easily drag windows when pressing the alt key.\n\nMaintained fork of AltDrag for Windows which allows you to move and resize windows by using the Alt key and clicking wherever on the window instead of relying on very precise clicking.\nThis behavior is very common on Linux distributions and is not actually hard to implement on Windows.\nIt is oriented towards all Windows users from Windows NT 4 to Windows 11, even though it is mostly tested on Windows XP and Windows 10.\nMain differences: To simplify the code greatly the Hooks windows feature was removed; it allowed you have windows snapping while dragging them normally. It required however to inject a dll in every application and induced thus an obvious security risk. The amount of mess added to the code just for this feature was substantial and in addition forced to have both a 32bits and a 64bits version of the program running at the same time.\nThis version injects nothing into other applications. This means you do not have to worry whether you have a 32 or a 64bit operating system.\nAnother feature that was disabled is focus on typing, that was too much unusable for me to even start testing, so I removed it.\nOtherwise this has a much simpler source code, added a few extra options, such as transparent windows dragging, Maximize action, pause process options, more blacklists for finer control of AltSnap etc.\nQuick release with mostly bug fixes,\n- Multi-user is now supported. Portable mode is still automatic if\n  AltSnap.ini is located next to AltSnap.exe. Otherwise the AltSnap.ini\n  file will be written to %APPDATA%\\AltSnap\\ and it will be copied from\n  the AltSnap.dni file if present in altsnap's folder.\n- uiAccess flag was added to the .manifest file, see #538 for more details.\n  Basically you can install AltSnap to the Program Files directorry,\n  run an AHK script that changes the uiAccess to true and self-sign\n  AltSnap.exe, to be able to move elevated windows without elevation.\n- Fix Compatibility with Komorebi #535 and other accessibility softwares,\n  Huge thanks to @alex-ds13 for the fix! #564\n- Fixed crash caused by zero-size window, Thanks to @gizabit #560\n- Account for the borders in CenterWindow thanks to @mbartlett21 #555\n- Fixed bad offset when restoring MDI window.\n- Add League of Legends to blacklist (not a joke). #533\n- Improve move to top/left/right/bottom. #534\n- Ignore Ctrl if simulated (vai Alt Gr for exmple). #518","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.64","site":"https://github.com/RamonUnch","source":"Raymond Gillibert","license_or_tos":"GPL-3.0","resources":null,"verified":false}