{"appId":"winget_app_Elgato.StreamDeck","appShortcutName":"Winget Application","appDisplayName":"Elgato Stream Deck","authorId":"winget","releaseTagName":"winget-6.8.1.21263","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://edge.elgato.com/egc/windows/sd/Stream_Deck_6.8.1.21263.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"With Stream Deck, unleash your creative genius and make waves across Twitch and YouTube. All while focusing on what matters most your audience. As a broadcaster that likes to produce on the fly and have high quality production.\n\n\nWhat’s new in Stream Deck 6.8.1?\n\nThis update enhances Elgato Marketplace connectivity and requires you to sign in again. After updating to Stream Deck 6.8, please log in to Marketplace to continue automatic plugin updates.\n\n🆕 Action Sharing\nHave you ever wanted to share a single action with a friend or colleague? Well, now you can. With Action Sharing, you can export an action from Stream Deck and share it like any other file. You can share key and dial actions, folders, Multi Actions, and more.\nExporting an action is easy—drag an action from a key or dial onto your desktop or into a folder, or right-click and select “Export”.\nWhen someone sends you an action, drag the action from your file manager directly onto a key, or right-click on a key and select “Import”.\n\nLearn more about Action Sharing.\n\n🆕 Action Trigger for Stream Deck +\nTurn up the power of your dials to 11! See what we did there? Put simply, Action Triggers enable you to assign key actions to dials, and trigger those actions with a clockwise turn, counterclockwise turn, or dial press. So any plugin and action can work with the dials, even if they don’t have built-in dial support!\n\nLearn more about Action Trigger.\n\n🛠️ Performance improvements & bug fixes\n- Reworked Open Action: Improved handling of opening windows in the foreground (Windows). Note: Behavior may vary depending on the app and system.\n- Added Traditional Chinese localization\n- The update window text now appears correctly in inverted color when the operating system is set to dark mode\n- The Auto Folder Exit time appears correctly\n- Fixed an issue where opening Marketplace displayed a false error message about network connectivity\n- Improved the YouTube account connection and reliability\n- Improved the Twitch account connection and reliability\n- Fixed an issue that messed up text colors when in dark mode\n- Fixed a bug that could cause Stream Deck to crash when copying and pasting pages (Windows).\n- Resolved an issue where plugins were unable to display images from certain file paths.\n- Improved crash reporting on macOS to better diagnose crash-related issues.\n\nWant to share feedback on Stream Deck 6.8.1? Connect with us:\n- Leave a comment on our Subreddit\n- Chat with fellow community members on Discord\n- Hit up @elgato on Twitter\n- Contact our Support Team","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.8.1.21263","site":"https://www.elgato.com/","source":"Corsair Memory, Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}