{"appId":"winget_app_commercialhaskell.stack","appShortcutName":"Winget Application","appDisplayName":"Haskell Stack","authorId":"winget","releaseTagName":"winget-3.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/commercialhaskell/stack/releases/download/v3.3.1/stack-3.3.1-windows-x86_64-installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Stack is a cross-platform program for developing Haskell projects. It is aimed at Haskellers both new and experienced.\n\n\nSee https://haskellstack.org/ for installation and upgrade instructions.Changes since v3.1.1:Behavior changes:\n- Stack interprets consecutive line ends in the value of the user-message project-specific configuration option as a single blank line. Previously all line ends were interpreted as white space.\n- Stack no longer supports Docker versions before Docker 1.9.1 and, consequently, if a Docker container is not being run 'detached', its standard input channel will always be kept open. (Before Docker 1.9.1 the use of an interactive container could hang in certain circumstances.)\n- On Windows, Stack will always warn (message S-8432) if there is a space character in Stack's 'programs' path, as GHC 9.4.1 and later do not work if there is a space in the path to the ghc executable. S-8432 now presents as a warning and not an error.\n- Stack respects the --no-run-tests and --no-run-benchmarks flags when determining build actions. Previously Stack respected the flags when executing the run test suites or run benchmarks actions for each targeted project package.\nOther enhancements:\n- Consider GHC 9.10 to be a tested compiler and remove warnings.\n- Consider Cabal 3.12 to be a tested library and remove warnings.\n- Add flags --run-tests and --run-benchmarks (the existing defaults) to Stack's build command, which take precedence over the existing no-run-tests and no-run-benchmarks configuration options, respectively.\n- In configuration files, the notify-if-no-run-tests and notify-if-no-run-benchmarks keys are introduced, to allow the exisitng notification to be muted if unwanted.\nBug fixes:\n- Stack's in-app messages refer to https://haskellstack.org as currently structured. (Most URLs in older Stack versions are redirected.)\n- Stack's upgrade command only treats the current running Stack executable as 'stack' if the executable file is named stack or, on Windows, stack.exe. Previously only how it was invoked was considered.\n- stack test --no-run-tests --dry-run no longer reports that Stack would test project packages with test suites and stack bench --no-run-benchmarks --dry-run no longer reports that Stack would benchmark project packages with benchmarks.\n- StackSetupShim compiles with Cabal >= 3.14.0.0.\nThanks to all our contributors for this release:\n- Andrew Nguyen\n- Luka Leer\n- Mike Pilgrem\n- Olivier Benz","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.3.1","site":"https://haskellstack.org/","source":"commercialhaskell","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}