{"appId":"winget_app_Bopsoft.Listary","appShortcutName":"Winget Application","appDisplayName":"Listary","authorId":"winget","releaseTagName":"winget-6.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The revolutionary file search tool for Windows.\n\nListary is a revolutionary search utility for Windows that makes finding your files and launching apps blazing fast, for casual and power users alike.\nHello everyone, Listary has received a brand-new update, bringing many exciting features and improvements! 🎊\n- Discussions: https://discussion.listary.com/t/v6-3-1-79-beta-released-major-custom-index-and-stability-enhancements/9405\n- 中文更新日志及讨论：https://discussion.listary.com/t/v6-3-1-79-beta/9404\nMain Updates​\n- New: refactored custom indexing to provide a more stable and superior user experience:\n  - New: You can now search while creating or updating a custom index.\n\n- New: Non-Pro users can now also create custom indexes.\n\n- New: View the indexing status at any time (including the number of files and the last update time).\n- New: Index updates now use incremental updates, making the process faster.\n- New: Support for manually updating custom indexes.\n\nOther Updates​\n- New: Added setting in Options > Hotkeys > Show Listary. Double-clicking Ctrl again in the launcher can now hide it or switch to file search.\n- New: Added setting in Options > General > Use Software Render (default off). Intel integrated graphics users with memory issues can enable this option.\n- Improved: If a search result icon fails to load, a default icon will be displayed instead.\n- Improved: The installer now disables support for Windows 7, with the minimum supported version being Windows 8.\n- Improved: Adopted WPF software rendering to enhance compatibility and prevent memory leaks caused by driver issues with some Intel integrated graphics cards.\n- Improved: Implemented periodic retry for custom index target folders that are inaccessible.\n- Fixed: Resolved machine code changes causing extra activation count usage.\n- Fixed: Addressed an issue where mapped network drives might not be indexed.\n- Fixed: Resolved an issue where custom indexing failed to index some files in certain scenarios.\n- Fixed: Addressed a crash in the search engine that occurred when canceling a foreground search under specific conditions.\n- Fixed: Resolved known crashes and improved search engine stability.\n- Fixed: High CPU usage when there are a large number of file changes.\n- Fixed: The possibility of a crash when rapidly clicking “Rebuild Index” in the settings interface.\n- Fixed: When typing too quickly during a web search, the opened page may not match the user’s input.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.3","site":"https://www.listary.com/","source":"Bopsoft","license_or_tos":"Proprietary","resources":null,"verified":false}