{"appId":"winget_app_XBMCFoundation.Kodi","appShortcutName":"Winget Application","appDisplayName":"Kodi","authorId":"winget","releaseTagName":"winget-21.2.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://mirrors.kodi.tv/releases/windows/win64/kodi-21.2-Omega-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kodi is a free and feature-rich media center for various operating systems, consoles and TVs. With Kodi you can manage and play movies, photos and music.\n\nKodi is a free and open source media player application developed by the Kodi Foundation, a non-profit technology consortium. Kodi is available for multiple operating-systems and hardware platforms, featuring a 10-foot user interface for use with televisions and remote controls. It allows users to play and view most videos, music, podcasts, and other digital media files from local and network storage media and the internet.\n*UPDATE FOR WINDOWS USERS: If you're experiencing crashes since this update was released, please read the note at the end of this post about updating your Visual C++ runtime.*\nNew Year, New Kodi? Not quite, but here we go with the next point release of the 21.x \"Omega\" series.\nThe usual story: bugfixes, not features. The full changelog can be found on GitHub, as usual.\nRelease Summary\nMajor user-facing changes include:\nLibrary/Sources and Management\n- Fixed a bug that ignored images in the ...\\season\\.actors folder. The \\season\\.actors folders have been deprecated and all actors are saved in the \\TV Show\\.actors folder. (forum, PR)\n- Restore performance of movie addition to the library to v20 (Nexus) level (PR)\n- Fixed/improved playback from some UPnP server software (at least UMS and Gerbera. Some NAS UPnP servers are based on UMS under the covers). Playback starts faster and multiple videos can be played consecutively. (PR)\n- Preserve special characters in names of scanned or added movie extras (PR)\n- Replace context menu items 'Set actor/artist thumb' with 'Choose art' to make it possible again to add/and set other artwork, not only thumbnails (PR)\n- Fixed mark watched/unwatched operations missing in certain context menus (PR)\n- Honour importwatchedstate and importresumepoint settings from advancedsettings.xml (PR)\nVideo\n- Fixed HDR passthrough on video sources with partial or missing display metadata (only GL/GLES platforms) (PR)\n- Fixed HDR to SDR tone mapping on video sources with partial or missing display metadata (only GL/GLES platforms) (PR)\n- Fixed possible incorrect picture metadata if playing different HDR videos without stopping the previous one and the videos had different HDR metadata (all platforms) (PR)\n- Fixed on Blu-Ray discs some BD-j menu items not displaying correctly due to multi-thread timing issues (PR)\n- Fixed deletion of bookmarks in video if the video has also chapters (PR)\nMusic\n- Fixed an issue with the last track duration of some albums stored in mka containers (PR)\nPlugins\n- Fixed missing context menu entries for plugin-provided items (PR)\nFilesystem\n- Restored the ability of enter credentials when browsing SMB shares (only POSIX platforms) (PR)\n- Updated cURL to 8.10.0 to fix issues with FTP TLS sources (PR)\nPVR\n- EPG search fixes (PR)\n- Fixed resume points for recordings not honoured (PR)\n- Fixed 'User has no access / server' error if broadcasts have been shifted (PR)\n- Fixed default select action 'show info' for PVR items (PR)\nSkin/GUI\n- Added Donation tab in System Settings (PR)\n- In preparation for our next major release, we've been updating the translation strings in all 78 of our binary add-ons (audio, inputstream, peripheral, screensaver, vfs, visualisation...). These updates have now all been backported to this release, so there's a bonus of a year's worth of fixes and improvements here.\nAndroid\n- Greatly improved joystick support on Android (PR)\n- Fixed possible crash when getInterfaceName method returns null (PR)\n- Fixed resuming paused media playback not working via play/pause media key press (PR)\n- Fixed black screen when resuming app from minimised state (PR)\nLinux\n- Fixed memory corruption when high quality video scalers are used (PR)\n- Fixed possible infinite loop when using GBM and a DRM Atomic Commit fails (PR)\n- Fixed windowed Kodi becoming larger on every start when running on Wayland with a scale factor (PR)\nOSX\n- Fixed crash when trying to detect optical media (PR)\nWindows\n- Fixed the crash issue that occurred when accessing the computer using Remote Desktop Protocol (PR)\n- Fixed the ability of the built-in WOL feature to wake up servers (PR)\n- Fixed the potential crash occurred when the system contained environment variables name with a length of more than 64 characters (PR)\n- Fixed HDR feature did not work on Windows 11 24H2 under some circumstances (PR)\n- Improved support for WCG displays on Windows 11 24H2 (PR)\nWe always want to thank everyone who has helped us track down and fix any issues. We endeavour to minimise the issues everyone experiences, but with such a large project, and the fact everyone contributing to Kodi is a volunteer, issues and bugs are a part of life. If you happen to experience any bugs/issues, don't hesitate to reach out on the forums, or raise an issue on GitHub.\nAs this is a point release, there are no major changes since the previous version, and you should be fine to install this straight over the top of any existing Kodi 21.x installation - indeed, this will happen automatically on many platforms. However, as for all software installations, back up your userdata beforehand if you've any doubts or have anything you can't afford to lose (and definitely do this if you're going for a major version upgrade).\nA list of all changes for this version can be found at GitHub. If you want to read back on the full history of v21 itself, or of previous versions, you can find the corresponding articles in the relevant blog posts.\nApplication deployment on different platforms (notably the Microsoft Store) can vary considerably due to circumstances outside of our control, so just be patient, and the update will inevitably find its way through.\nWindows Store/Android Deployment\nDue to the internal and external hoops we need to jump through, it might be a little while before the update appears for you, and that's before our usual staged approach to deployment. Sit tight, and it will be with you in due course (maybe the next week or two).\nNote for Windows Users\nBecause we're updating binary add-ons with this release, you're likely to experience crashes due to version issues if you don't also update the Visual C++ runtime. This is particularly likely if you stay on 21.1 (i.e. the add-ons get updated, but Kodi doesn't).\nThe solution is to upgrade to 21.2 and thus install the Visual C++ runtime that comes with the 21.2 installer or, if you really want stay on 21.1, update the Visual C++ runtime externally from https://aka.ms/vs/17/release/vc_redist.x64.exe.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"21.2.0.0","site":"https://kodi.tv/","source":"XBMC Foundation","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}