{"appId":"winget_app_Picorims.wav2bar","appShortcutName":"Winget Application","appDisplayName":"Wav2Bar","authorId":"winget","releaseTagName":"winget-0.3.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/Picorims/wav2bar/releases/download/v0.3.0-beta/Wav2Bar-win32-x64-0.3.0-beta.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Wav2Bar is a tool to make custom audio visualization and export production videos for the audio and music industry.\n\n\nAdded\n• Particle flow's containers can now be rotated.\n• Added logs folder shortcut to settings tab.\n• The user interface is now locked behind a loading screen while big operations are performed and the user interface shouldn't be touched.\n\nChanged\n• Changed license from MIT to GPL-3.0-or-later\n• Changed how saves and objects are handled internally.\n• Improved particle flows performances when using a big amount of particles.\n• Optimized bar visualizers when changing their parameters.\n• Improved visual updates of particle flows and visualizers while audio is paused or stopped.\n• Changing an object's name is now done using a dedicated field in the rack (less clicks!).\n• Changed rules for timers positioning. (The converter should reajust timers when opening a project from an older version.)\n• Changed some default values (it only affects newly created objects and new object parameters).\n• The default color is now randomized.\n• Irrelevant options (i.e that have no effect) in some objects are no longer available (timers, visualizers). In consequence they are no longer stored as well with these objects (as they are useless).\n• Made top user interface for audio and zoom control more compact.\n• Split audio control block in half in the top user interface for better display in a smaller window.\n• Improved help on object creation.\n• Improved responsiveness on window resize.\n\nRemoved\n• Removed background visual object that duplicates image/shape visual object. Existing background visual objects in older saves will be converted to image visual objects.\n\nFixed\n• Video export via CLI works again.\n• Particle flow's flow type parameter provides help again.\n• When opening a new save, existing user interface from old visual objects are now effectively removed.\n• Interacting with control panel's top tabs no longer moves the rest of the user interface.\n• The top of the screen was hard to see, and hidden no matter what behind the top user interface (in some zoom and window size scenarios). There is now a minimum of padding above the screen.\n• The window no longer flashes to white when being first opened.\n• Changing the color of a waves visualizer while audio is paused now updates the color visually. Same for particle flows.\n• About section no longer have the text centered.\n\nSecurity\n• Updated Electron from v12 to v16.\n• Updated dependencies in general\n• \nKnown issues\n• Using audio extensions that have capital letters in it can cause issues at export. To avoid this bug, use extensions without any capital letters (like .wav instead of .Wav or .WAV).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.3.0","site":"https://github.com/Picorims","source":"Picorims","license_or_tos":"GNU General Public License v3.0","resources":null,"verified":false}