{"appId":"winget_app_flxzt.rnote","appShortcutName":"Winget Application","appDisplayName":"Rnote","authorId":"winget","releaseTagName":"winget-0.11.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/flxzt/rnote/releases/download/v0.11.0/rnote-win-installer-0.11.0-x86_64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Sketch and take handwritten notes.\n\nRnote is an open-source vector-based drawing app for sketching, handwritten notes and to annotate documents and pictures.\nTargeted at students, teachers and those who own a drawing tablet, it provides features like PDF and picture import and export,\nan infinite canvas and an adaptive UI for big and small screens.\n\nWritten in Rust and GTK4.\nthis release changes:\n- feat: add disable option for pen shortcuts (thanks to @Doublonmousse)\n- feat: add respect-borders option, improving size logic when pasting content (thanks to @Doublonmousse)\n- feat: add improve-for-E-Paper option, showing current selected color as a string\n- improv: migrate to libadwaita based dialogs (thanks to @zefr0x)\n- improv: stroke modeler entirely rewritten in Rust! (thanks to @Doublonmousse)\n- improv: zoom tool following the pointer (thanks to @JonathanGodar)\n- improv: developers list in about window (thanks to @zefr0x)\n- improv: native file dialogs on Windows, macOS (thanks to @Doublonmousse)\n- improv: gzip (de)compression optimizations, reducing file save/load times (thanks to @anesthetice)\n- improv: prevent accidental resizes/moves when interacting with buttons in the titlebar\n- improv: inhibit app close while saves are in progress\n- improv: ability to change text selection colors inside a single text box\n- fix: pen state becoming incorrect on windows (thanks to @Doublonmousse)\n- fix: file extension filters in dialogs (thanks to @Doublonmousse)\n- fix: force the gtk renderer to gl for now, fixing recurring crashes for some users (thanks to @Doublonmousse)\n- fix: two-finger long-press gesture causing crashes for some users\n- fix: single element stroke not generating hitboxes\n- fix: scrolls being captured by unit-entries in settings, causing accidental value changes\n- fix: hover state for typewriter move/resize nodes","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.11.0","site":"https://rnote.flxzt.net/","source":"Felix Zwettler","license_or_tos":"GPL-3.0","resources":null,"verified":false}