{"appId":"w:Winlink.WinlinkExpress","appShortcutName":"Winlink Express","appDisplayName":"Winlink Express","authorId":"w:winget","releaseTagName":"winget-1.7.29.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The ultimate radio email client designed for seamless communication\n\nWinlink Express is the ultimate radio email client designed for seamless communication. With its extensive features and support for the Winlink Hybrid Network, it stands out as the top choice by users. Whether you're operating with or without an internet connection, Winlink Express ensures reliable email delivery.\nThis user-friendly client is perfect for individuals with a single call sign or those needing to manage multiple addresses simultaneously. It offers compatibility with most transceivers, TNCs, and controllers, supporting a wide range of modes such as ARDOP, VARA HF and FM, Pactor, SCS Robust Packet, VHF/UHF AX.25 packet radio, WiFi, and any TCP/IP RF link. With Winlink Express, you can also connect directly to CMS servers or RMS Relay via internet/telnet, enabling high-speed communication across different networks.\nDeveloped by the Winlink Development Team, Winlink Express prioritizes simplicity while leveraging advanced features. It employs the B2F extension radio transfer protocol, allowing attachments, multiple addresses, and tactical addresses. The client also features peer-to-peer connectivity, enabling direct RF connections to other Winlink Express or Airmail clients.\nWinlink Express goes beyond email functionality, offering additional capabilities for emergency communications (EmComm). It supports HTML form creation, compact content transport, and a growing library of up-to-date forms. If you're considering using Winlink Express for EmComm, it's recommended to consult your local EmComm group for guidance and support.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.7.29.0","version":0,"site":"https://www.winlink.org/","source":"ARSFi - Winlink Development, Copyright (c)","license_or_tos":"Proprietary","resources":null,"verified":false}