{"appId":"w:WiresharkFoundation.Wireshark","appShortcutName":"Wireshark","appDisplayName":"Wireshark","authorId":"w:winget","releaseTagName":"winget-4.6.4","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://2.na.dl.wireshark.org/win64/all-versions/Wireshark-4.6.4-arm64.exe"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://2.na.dl.wireshark.org/win64/all-versions/Wireshark-4.6.4-x64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The world's most popular network protocol analyzer\n\nWireshark is the world's foremost network protocol analyzer. It lets you see what's happening on your network at a microscopic level. It is the de facto (and often de jure) standard across many industries and educational institutions.\nWireshark development thrives thanks to the contributions of networking experts across the globe. It is the continuation of a project that started in 1998.\nBug Fixes\n- wnpa-sec-2026-05 USB HID dissector memory exhaustion. Issue 20972. CVE-2026-3201.\n- wnpa-sec-2026-06 NTS-KE dissector crash. Issue 21000. CVE-2026-3202.\n- wnpa-sec-2026-07 RF4CE Profile dissector crash. Issue 21009. CVE-2026-3203.\nThe following bugs have been fixed:\n- Wireshark doesn’t start if Npcap is configured with \"Restrict Npcap driver’s Access to Administrators only\" Issue 20828.\n- PQC signature algorithm not reported in signature_algorithms. Issue 20953.\n- Unexpected JA4 ALPN values when space characters sent. Issue 20966.\n- Expert Info seems to have quadratic performance (gets slower and slower) Issue 20970.\n- IKEv2 EMERGENCY_CALL_NUMBERS Notify payload cannot be decoded. Issue 20974.\n- TShark and editcap fails with segmentation fault when output format (-F) set to blf. Issue 20976.\n- Fuzz job crash: fuzz-2026-02-01-12944805400.pcap [Zigbee Direct Tunneling Zigbee NWK PDUs NULL hash table] Issue 20977.\n- Wiretap writes pcapng custom options with string values invalidly. Issue 20978.\n- RDM status in Output Status (GoodOutputB) field incorrectly decoded in Art-Net PollReply dissector. Issue 20980.\n- Wiretap writes invalid pcapng Darwin option blocks. Issue 20991.\n- TDS dissector desynchronizes on RPC DATENTYPE (0x28) due to incorrect expectation of TYPE_VARLEN (MaxLen) Issue 21001.\n- Only first HTTP POST is parsed inside SOCKS with \"Decode As\". Issue 21006.\n- TShark: Bogus \"Dissector bug\" messages generated in pipelines where something after tshark exits before reading all its input. Issue 21011.\n- New Diameter RAT-Types in TS 29.212 not decoded. Issue 21012.\n- Malformed packet error on Trigger HE Basic frames. Issue 21032.\nNew Protocol Support\nThere are no new protocols in this release.\nUpdated Protocol Support\nArt-Net, AT, BGP, GSM DTAP, GSM SIM, IEEE 802.11, IPv6, ISAKMP, MBIM, MySQL, NAS-5GS, NTS-KE, SGP.22, Silabs DCH, Socks, TDS, TECMP, USB HID, ZB TLV, and ZBD\nNew and Updated Capture File Support\nBLF, pcapng, and TTL\nNew and Updated File Format Decoding Support\nThere is no new or updated file format support in this release.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"4.6.4","version":0,"site":"https://wiresharkfoundation.org/","source":"The Wireshark developer community, https://www.wireshark.org","license_or_tos":"GPL-2.0","resources":null,"verified":false}