{"appId":"w:WonderIdea.MangoAnimationMaker","appShortcutName":"Mango AM","appDisplayName":"Mango AM","authorId":"w:winget","releaseTagName":"winget-3.0.803","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://online.mangoanimate.com/software/Mango%20Animate%20Animation%20Maker%203.0.803%20windows%20x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Animation Video Maker\n\n\nEbook: Upload images or PDFs to instantly create an ebook with realistic page turning effects. Support auto-play and bookself storage.\nSlide show component: Add new templates to offer more creative ways for content display.\nGraphic Text Effects: Create a variety of graphic and text effects like Text floofing the screen, Text floating to make your content visually striking.\nVideo: Add green screen keying feature with one-click keying. Support red-green and yellow-blue tone values.\nAnimation: Optimize the entrance effect – Unfold Scroll. Support the selection of scroll style.\nMask: Scene mark supports setting the mask entrance motion from small to large.\nOperation: Text format brush supports double-click to apply multiple times.\nAnimation effect: Custom entrance/emphasis/exit animation effects can be saved for easy one-click reuse.\nOperation: Optimize the timeline insert/delete time operation to improve the user experience.\nScene: Optimize the scene insert operation and drag-and-drop .sc files into the app.\nTool: Add new chart templates and optimize chart operations for a smoother experience.\nShapes: Optimize the editing of lines and rectangles for a smoother experience.\nOperation: Add shortcut keys. Use Alt + drag for quick copy and Shift + Alt + drag for vertical/horizontal copy after selecting elements.\nOperation: Optimize the operation of group/upgroup elements for a smoother experience.\nAnimation: Optimize the emphasis effect – LieFlatMD to make any element fall down.\nShapes: Add FlowLineShape for one-click flowing line effects.\nSlide: Upgrade the transition animation setting window. Add new transition animations.\nAnimation: Add Text Fill animation effect. Select the text fill-in position, and the text will be filled in word by word according to the animation effect.\nAnimation: Add 8 entrance, 5 emphasis, 6 exit, 10 transition animation effects.\nText: Fixed issue where text would disapper after applying text effects.\nRoles: Fixed issue where the add action button failed on the timeline after adding a custom role.\nOthers: Known bugs fixed.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.0.803","version":0,"site":"https://www.wonderidea.com/","source":"Mango Animate Animation Maker Solution","license_or_tos":"Proprietary","resources":null,"verified":false}