{"appId":"w:WonderIdea.MangoPresentationMaker","appShortcutName":"Winget Application","appDisplayName":"Mango PM","authorId":"w:winget","releaseTagName":"winget-4.8.560","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://online.mangoanimate.com/software/Mango%20PM_4.8.560_x64_setup-global.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Animated Presentation Maker\n\n\n【NEW】Link: Support linking local HTML files. Can instantly open local web content like DeepSeek-generated mini-games within the software for immediate play and smoother creative experience!\n【NEW】 Interactive Roles: Added voice call mode! Enable real-time voice communication with characters for more natural interactions.\n【NEW】 Enhanced TTS System : Page upgraded, added Azure and ElevenLabs categorized voice packs.\nSlide Show: 3D slide show function updated, optimized performance lag issues.\nRoles: Added filter function in official character window for quick role searching.\nSubtitles&Record: Optimized new recording insertion method (defaults to appending at timeline end).\nOptions: Optimized frame copy operation, added option to preserve nested frames.\nOperations: Optimized asset movement/rotation on canvas.\nOperations: Optimized top toolbar display on small screens, now supports mouse wheel scrolling.\nOperations: Improved top toolbar layout and presentation for better user experience.\nText: Now supports Tab key for first-line paragraph indentation.\nBubbles: Adjusted default bubble size and font scaling, added adaptive height function.\nPreview: Added virtual keyboard function, allows text input without physical keyboard.\nPreview: Support page number jumps or use [Number Key + Enter] shortcut to locate preview pages.\nRoles: Added multiple new character assets.\nAnimations: Fixed decimal time value setting issue when editing multiple animations simultaneously.\nAnimations: Restored original default settings for smudge effect.\nGeneral: Fixed other known issues.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.8.560","site":"https://www.wonderidea.com/","source":"Mango PM Solution","license_or_tos":"Proprietary","resources":null,"verified":false}