{"appId":"w:Xanashi.Icaros","appShortcutName":"Icaros","appDisplayName":"Icaros","authorId":"w:winget","releaseTagName":"winget-3.3.3.301","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Xanashi/Icaros/releases/download/v3.3.4b1/Icaros_v3.3.4_b1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A collection of lightweight, high quality, Windows Shell Extensions\n\nIcaros is a collection of lightweight, high quality, Windows Shell Extensions.\nIcaros can provide Windows Explorer thumbnails, for essentially any video media format supported by FFmpeg, this includes popular filetypes such as: Mkv, Flv, Avi, Mp4, Mov, Rmvb, M2ts, Ogm etc.\nBesides the FFmpeg supported filetypes, Icaros also contains custom parsers, which can produce Cover Art thumbnails for Mkv, Flac, Ape, Mpc and several other filetypes.\nIcaros also provides Windows Explorer properties for the following popular filetypes: Mkv, Mk3d, Mp4, Mov, Webm, Ogm, Ogg, Flv, Avi, Rm, Rmvb, Flac, Opus, Spx, Ape, Mp3, Mpc, Mka, Tak, Tta, Ofr, Wav and more.\nProperties refer to the info shown for each file in Explorer, such as length, width, height, title, channels and so on.\nGood Afternoon Everyone,\nI have a slightly smaller release for you today.\nIt mainly focuses on updating libraries and fixing a number a bugs, that was reported on the issue tracker.\nI consider the release completely stable, however I'm currently replacing the motherboard of my main\ndevelopment machine (it was unfortunately faulty), so I couldn't run all the usual tests before this release.\nSo just to be on the safe side, I'm making todays release a Beta release.\nI also just counted up the donations from 2024, so I could share the final amount with all of you as I like to do,\nand I was honestly blown away. Icaros has never had this many donations over the span of a year.\nI am so grateful for all your support, and I can't thank all of you enough for helping me with\ndonations, feedback, translations and troubleshooting.\nTotal donation amount in 2024:\n$636\nThank you all so incredibly much! ❤️\nI hope you all enjoy the new release!\n\nIcaros v.3.3.4 Beta 1\n- Added more MKV tags and improved handling of Title, Artist and Part Number tags\n- Added TGA and HDR to the presets\n- Fixed thumbnailing of AVIF files with auxiliary data layers\n- Fixed thumbnailing of certain HEIC files\n- Fixed thumbnailing of MOV/MP4 files with encrypted streams\n- Updated German localization (Thank you Klaus Luppert! __)\n- Updated Dav1d to 1.5.1\n- Updated FFmpeg","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.3.3.301","version":0,"site":"https://github.com/Xanashi","source":"Tabibito Technology","license_or_tos":"Freeware","resources":null,"verified":false}