{"appId":"w:xanderfrangos.twinkletray","appShortcutName":"Twinkle Tray","appDisplayName":"Twinkle Tray","authorId":"w:winget","releaseTagName":"winget-1.17.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/xanderfrangos/twinkle-tray/releases/download/v1.17.1/Twinkle.Tray.v1.17.1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Easily manage the brightness of your monitors in Windows from the system tray\n\nTwinkle Tray lets you easily manage the brightness levels of multiple monitors.\nEven though Windows 10 is capable of adjusting the backlight on most monitors, it typically doesn't support external monitors.\nWindows 10 also lacks any ability to manage the brightness of multiple monitors.\nThis app inserts a new icon into your system tray, where you can click to have instant access to the brightness levels of all compatible monitors.\nNew in v1.17.1\nImprovements:\n- Added support for switching monitor inputs from the flyout. (Thanks @pie-potato!)\n- Added Troubleshooting toggles for theme updates and power states.\n- Added support for launching Twinkle Tray's CLI/GUI from the \"Twinkle-Tray.exe\" alias. (Microsoft Store version only.)\n- Added several missing strings to localization. (Thanks @kwiateusz!)\n- Updated localizations.\nFixes:\n- Fixed multiple HDR monitors with the same name causing only one SDR sliders to display. (Thanks @Auxx!)\n- Fixed Twinkle Tray throwing an error at startup if the user's directory path included periods and spaces.\n- Fixed long VCP code lists breaking the settings UI. (Thanks @EKl40!)\n- Fixed multiple issues with monitor thread error handling.\n- Fixed window focus tracking being active when the user has set up no profiles.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.17.1","version":0,"site":"https://twinkletray.com/","source":"Xander Frangos","license_or_tos":"MIT","resources":null,"verified":false}