{"appId":"w:XKaguya.LenovoLegionToolkit","appShortcutName":"Lenovo Legion Toolkit","appDisplayName":"Lenovo Legion Toolkit","authorId":"w:winget","releaseTagName":"winget-2.27.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/XKaguya/LenovoLegionToolkit/releases/download/v2.27.0.0/LenovoLegionToolkitSetup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Lightweight replacement of Lenovo Vantage for Lenovo Legion laptops.\n\nLenovo Legion Toolkit (LLT) is a utility created for Lenovo Legion laptops, that allows changing a couple of features that are only available in Lenovo Vantage or Legion Zone.\nRelease Notes\nGeneral\n- Fixed an issue where resuming from hibernation caused LLT to crash.\n- Fixed an issue where GodModeController raised errors. (#91, #90, #96)\n- Fixed an issue where Extreme Performance Mode was displayed on unsupported devices.\n- Fixed an issue where the Extreme default preset was shown on unsupported devices.\n- Fixed an issue where hiding GPU VRAM temperature on the dashboard did not take effect.\n- Fixed an intermittent issue where CPU power readings would freeze.\n- Fixed an issue where the Status Window would not refresh sensor data.\n- Fixed an issue where Custom Mode was incorrectly displayed while running on battery.\n- Fixed an issue where accessing deleted driver links caused an exception on the Downloads page.\n- Fixed an issue where navigating away from the RGB page would cause an error.\n- Fixed an issue that caused Custom Mode to appear while on battery power.\n- Fixed an issue where the Extreme default preset appeared on unsupported devices.\n- Fixed an issue where AMD devices displayed \"PCH\" instead of \"Motherboard.\"\n- Fixed an issue where Extreme Mode was shown on unsupported devices.\n- Fixed an issue involving a mismatch in CPU utilization calculation.\n- Re-enabled the warranty feature for Chinese models.\n- Added an ITS Mode pop-up in the Notifications panel.\n- Added an ITS Mode notification to the Status Window.\n- Updated the PresentMonFps library; invalid data will no longer be captured.\n- Moved the Dashboard Customize options to the Settings page and improved the related logic.\n- Improved overall performance.\nFeature\n- Added Precision Boost Overdrive (PBO2) adjustments for AMD Laptops.\nNotes:\n- Disable the Enable Overclocking option in third-party utilities (e.g., Hydra or UXTU) or disable this feature to prevent configuration override.\n- LLT cannot read the real-time overclocking value. Like Legion Space/Legion Zone, it displays the value from the configuration file.\n- Legion Optimize must be enabled for this feature to function for safe.\n\n- Added Power Mode / Plan for different Custom Mode presets.\n  For this feature, Disable Power Mode Sync Feature in Legion Zone or Legion Space is needed to prevent issues.\n\n- Added Performance / Efficient Core frequency to Floating Gadget.\n- Added Spectrum support for Legion 5 24 Zone Keyboards.\n- Added warning to Custom Mode while first start.\n\nFull Changelog: https://github.com/XKaguya/LenovoLegionToolkit/compare/v2.26.9.8...v2.27.0.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"2.27.0.0","version":0,"site":"https://github.com/XKaguya","source":"Bartosz Cichecki","license_or_tos":"GPL-3.0","resources":null,"verified":false}