{"appId":"w:Xmind.Xmind","appShortcutName":"Xmind","appDisplayName":"Xmind","authorId":"w:winget","releaseTagName":"winget-26.2.2052","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://www.xmind.app/xmind/downloads/Xmind-for-Windows-x64bit-26.02.02052-202601211810.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A full-featured Swiss Army Knife for your brain.\n\nThe full-featured mind mapping and brainstorming app. Like a Swiss Army Knife, Xmind offers a complete toolset for thinking and creativity.\nImportant Updates\n1. Zone: Organize map content. Group related floating topics for easier layout, selection, and export.\n2. Skip Non-working Days: Plan by working days. Automatically skip non-working days when calculating project timelines.\n3. Gantt Enhancements: More efficient large-scale scheduling. Link tasks in bulk, adjust timelines with fewer actions.\nImprovements\n1. Added support for British English.\n2. Gantt chart supports multi-selecting tasks to quickly add dependencies.\n3. Gantt chart supports exporting to PNG, JPEG, and PDF.\n4. Gantt chart supports printing.\n5. Gantt chart supports quick editing of start date and duration.\n6. Adding dependencies no longer requires setting start and end dates.\n7. Supports customizing the start day of the week.\n8. Optimized display logic when pasting externally copied content into mind maps.\n9. Fixed an issue with line breaks in main topics in logic charts.\n10. Fixed an issue with abnormal branch export.\n11. Fixed an issue where English punctuation marks displayed in the wrong position in Arabic text.\n12. Fixed an issue where exporting Markdown tasks showed a failure message.\n13. Fixed other known issues.Claude is AI and can make mistakes. Please double-check responses.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"26.2.2052","version":0,"site":"https://xmind.app/","source":"XMIND LTD.","license_or_tos":"Proprietary","resources":null,"verified":false}