{"appId":"w:Zandronum.Zandronum","appShortcutName":"Zandronum","appDisplayName":"Zandronum","authorId":"w:winget","releaseTagName":"winget-3.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://zandronum.com/downloads/zandronum3.2-win64-installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Zandronum is a Doom source port focused on offering a modernized multiplayer experience, offering new game modes such as capture the flag, invasion or domination\n\nZandronum is a multiplayer oriented port, based off Skulltag, for Doom and Doom II by id Software.\nZandronum brings classic Doom into the 21st century, maintaining the essence of what has made Doom great for so many years and, at the same time, adding new features to modernize it, creating a fresh, fun new experience.\n\nHere's why you should kill your time with Zandronum, versus vanilla Doom:\n\n- Excellent online play\n  - Client/server architecture: play and switch between games with ease\n  - Supports up to 64 players\n    - Wide array of gameplay modes\n    - Competitive: Team DM, Duel, CTF, Possession, LMS, Terminator, Skulltag\n    - Cooperative: Survival, Invasion (or both!)\n    - Modifiers, like Instagib and Buckshot, can be used to spice up any game\n\n- Modern and beautiful\n - Support for large number of ZDoom and GZDoom mods from 2014 and earlier\n - Choose between the OpenGL renderer, or the Software renderer\n - Useful features like a console, Quake-style key bindings, freelooking, and jumping\n - Support for many Doom engine based games including Heretic, Hexen, and Strife\n - Supports modern versions of Windows, Mac OS X, and Linux\n\n- Compatible with Skulltag mods\n  - Supports announcers and skins for online play\n  - Runes, new weapons, and new monsters for modders\n  - Bots, and support for custom bots\n\n- Open Source\n  - Doesn't run on your flavor of operating system?\n  - The source code is available on Heptapod and all new code is licensed under a modified Sleepycat license.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"3.2","version":0,"site":"https://zandronum.com/","source":"Zandronum","license_or_tos":"Modified Sleepycat License","resources":null,"verified":false}