{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.222.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.222.2/Zed-x86_64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.222.2/Zed-aarch64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\nThis week's release includes support for multiple edit prediction providers (GitHub Copilot's Next Edit Suggestions, Ollama, Codestral, Sweep, and Mercury Coder), zooming and panning in the image viewer, Windows as a supported target for SSH remoting, significantly reduced resource usage when watching filesystem changes on macOS, and the ability to rename terminal tabs via right-click or double-click.\nFeatures\nAI\n- Edit Prediction: Added support for multiple edit prediction providers, including GitHub Copilot's Next Edit Suggestions, Ollama, Codestral, Sweep, and Mercury Coder. To configure, open the Edit Prediction menu and select Configure Providers.\n- Agent: Made the message queue feature available for external agents as well. (#47379)\n- Agent: Added a menu for inserting context more easily with the mouse in the agent panel. (#47768)\n- Agent: Improved @ file completions in agent panel to be more accurate. (#47466)\n- Agent: Improved double-click word selection in Agent Panel to respect punctuation and language-specific word characters. (#47844)\n- Agent: Added a setting for controlling the behavior of the stop button in the terminal tool call card (between cancelling the command to run and the thread, or just the command). (#47521)\n- Improved memory usage of large ACP thread diff multibuffers. (#47526)\nGit\n- Improved the project picker in the Git panel by also displaying the Git status icon on them, to clearly indicate which repos have changes. (#47752; thanks tartarughina)\nLanguages\n- C/C++: Added highlights for #elifdef, #elifndef directives and document comments. (#45672; thanks hokein, #47556; thanks ozacod)\n- C++: Added first-line language detection for extensionless libc++ headers. (#47443; thanks ozacod)\n- C: Updated tree-sitter-c for highlighting attribute specifier. (#47156; thanks ozacod)\n- Go: Improved support to run table-test subtests, handling tests without explicitly declaring variables for test scenarios. (#46645; thanks lzakharov)\n- Nim: Updated file aliases so icon is shown for .nims/.nimble files. (#47616; thanks ire4ever1190)\n- TypeScript: Improved keyword syntax highlighting for declarations (const, let, var, function, class, enum, interface, type) and imports/exports (export, from, import). (#47435; thanks ahcurrier)\nTerminal\n- Added ability to rename terminal tabs via right-click context menu and double-click. (#45800; thanks tacshi)\nVim / Helix\n- Added relative line jump support to go-to-line action via +/-/f/b/F/B. (#46932; thanks KalaayPT)\n- Added a vim.gdefault setting to make /g (replace all matches in a line) the default for substitutions, along with :set gdefault and :set nogdefault commands (short forms: gd, nogd). (#47664; thanks bluetech)\nRemote Development\n- Added configurable remote server cache retention (default 5). (#47202; thanks cppcoffee)\n- Improved error handling in the dev container crate to prevent panics. (#47513; thanks KyleBarton)\n- Improved parsing of devcontainer CLI output when using earlier versions. (#47403; thanks KyleBarton)\n- Improved error messaging to guide user away from opening a dev container from within a remote project. (#47816; thanks KyleBarton)\nWindows\n- Added support for Windows as a target platform for SSH remoting. (#47460)\n- Added \"Reveal in File Manager\" to the project panel context menu on WSL. (#47288)\nLinux\n- Relaxed the checks on xdg_wm_base to ensure compatibility with Weston 9. (#47185; thanks linghengqian)\nmacOS\n- Zed now uses significantly fewer resources when watching filesystem changes. (#47322; thanks marcocondrache)\nOther\n- Added zooming and panning support in the image viewer with zoom in/out, reset, fit-to-view, zoom-to-actual actions, scroll-wheel zoom with modifier, click-and-drag panning, zoom percentage overlay, and toolbar controls. (#43944; thanks MostlyKIGuess)\n- Added a menu item in the buffer and tab right-click menu for opening Markdown and SVG files in the preview tab. (#47821)\n- Added commands for extending selections to syntax node boundaries, i.e., editor: select to start of larger syntax node and editor: select to end of larger syntax node. (#47571; thanks alexispurslane)\n- Added support for specifying multiple snippets paths in extensions. (#45829)\n- Added project_panel.bold_folder_labels to show folder names with bold text in the project panel (defaults to false). (#47631; thanks zertosh)\n- Added a menu item to close the current project, going back to a clean window state. (#47365)\n- Added support for installing a specific Zed version via the ZED_VERSION environment variable in the install script (defaults to latest when unspecified). (#45522; thanks mikelneonedwin)\n- Added \"Reopen with Encoding\" feature (currently supported for local files). (#46553; thanks tomopumipumi)\n- Improved empty workspaces with unsaved files to now restore on startup (hot-exit). (#46557; thanks shfc)\n- Improved performance when a large number of files were open by making background diagnostics more efficient. (#47510)\n- Improved project search loading UI. (#47620; thanks zertosh)\n- Improved memory usage of large git diff multibuffers. (#47524)\n- Changed bold UI text to render using Plex SemiBold instead of Bold. (#47725)\n- Changed the auto signature popover — \"auto_signature_help\": true — to respect hover_popover_delay. (#46745; thanks TheSalarKhan)\n- Added server notifications auto-dismiss with \"global_lsp_settings\": { \"notifications\": { \"dismiss_timeout_ms\": 5000 } } setting. (#46708; thanks tomatitito)\n- Added support for importing VS Code Insiders and VSCodium Insiders user settings (settings.json). (#47247; thanks maj113)\n- Block cursor no longer reveals characters within redacted ranges. (#45549; thanks tacshi)\nBug Fixes\n- Agent: Fixed old AI text thread sessions failing to open from History when they contain icons that were removed in previous updates. (#47624; thanks lex00)\n- Agent: Fixed a bug where the inline assistant feedback buttons were being displayed despite the setting \"Enable Feedback\" was turned off. (#47382)\n- Agent: Fixed cut-off mention creases in the inline assistant. (#47772)\n- Agent: Fixed message editor stealing focus from other panels. (#47321; thanks fabianszabo)\n- Settings UI: Fixed a bug with the number field rendering of the font weight setting. (#47384)\n- Vim/Helix: Fixed bug causing normal-mode vim/helix selections to get expanded during vim::Scroll commands. (#47024; thanks jrobsonchase)\n- Rust: Fixed enum variants with no lower-case being highlighted as constants instead of types. (#45546; thanks tacshi)\n- Fixed typing emoji using the macOS system palette (cmd-ctrl-space). (#47835)\n- Fixed issue where user .ssh/config file would not parse if global ssh config file was not present. (#47310; thanks Gaff)\n- Fixed a bug where workspace::SendKeystrokes would not allow remapping keys in different keyboard layouts. (#47061; thanks everdrone)\n- Fixed a small issue where highlights of the syntax tree view would persist after the view was closed. (#47638)\n- Fixed a visual glitch with sticky scroll headers in markdown. (#47314; thanks KyleBarton)\n- Fixed alignment of folded directory names in project panel. (#47648)\n- Fixed an issue where deleted rules from the rules library were getting restored after a restart. (#47323)\n- Fixed an issue where the terminal would sometimes fail to write shell history. (#47408)\n- Fixed bracket color not updating when system theme changes. (#47505; thanks smitchaudhary)\n- Fixed clearing hovered link when no target found. (#47134; thanks cppcoffee)\n- Fixed Conda showing up in terminal on Windows. (#47261)\n- Fixed extension uninstall button not working when an upgrade is available. (#47745; thanks eureka928)\n- Fixed language servers unnecessarily restarting when changing lsp.<server>.settings configuration. Dynamic settings are now properly updated via workspace/didChangeConfiguration without requiring a server restart. (#47376; thanks aviatesk)\n- Fixed project-less workspaces not persisting their dock state. (#45966; thanks ppfmagno)\n- Fixed remote server binaries accumulating on WSL over time. (#47839)\n- Fixed \"Reveal in File Manager\" not working for WSL remote connections on Windows. (#47288)\n- Fixed some instances of authentication errors with the Zed API that could be resolved automatically by refreshing the token. (#47512)\n- Fixed struct union enum outline issues for C. (#46125; thanks ozacod)\n- Fixed terminal hanging when a child process is killed by a signal (e.g., SIGSEGV from null pointer dereference). (#47420)\n- Fixed user-defined tasks with unresolved ZED_* variables being silently omitted. (#45621; thanks playdohface)\n- Fixed vim mode incorrectly switching to Visual mode on first project search. (#44284; thanks MostlyKIGuess)\n- Fixed vim mode paragraph motions (} and {) to correctly ignore whitespace-only lines. (#47734; thanks lex00)\n- Fixed a crash in LoadingLabel's loading animation when displaying CJK or emoji text. (#45632; thanks MomentDerek)\n- Fixed uninitialized var declaration not being shown in outline. (#46499; thanks hokein)\n- Fixed LSP integrations to send language server shutdown requests with correct parameters. (#46027; thanks Spirrwell)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.222.2","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}