{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.217.1","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.217.1/Zed-aarch64.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.217.1/Zed-x86_64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\nThis week's release includes command palette history, git remotes support, branch names on git conflict buttons, automatic file context detection when pasting code into the agent panel, Grok 4.1 Fast models with 2M token context windows and vision support, and new RotateSelectionsForward/RotateSelectionsBackward actions for rotating content across multiple cursors.\nFeatures\nAI\n- Agent: Added automatic file context detection when pasting code into the AI agent panel. Pasted code now displays as collapsible badges showing the file path and line numbers (e.g., \"app/layout.tsx (18-25)\"). (#42982; thanks ddoemonn)\n- Agent: Added support for Grok 4.1 Fast (reasoning and non-reasoning) models in the xAI provider, with 2M token context windows and full vision capabilities. (#43419; thanks mInrOz)\n- Agent: Extended 2M token context to existing Grok 4 Fast variants (from 128K) for consistency with xAI updates. (#43419; thanks mInrOz)\n- Agent: Enabled image/vision support for all Grok 4 family models. (#43419; thanks mInrOz)\n- Agent: Added support for displaying the human-readable names of extension-provided agents in the agent menu. (#44496)\n- Agent: Added fallback to locally installed Codex version if update fails. (#44419)\n- Agent: UI now shows the checked state of a list item. (#43567; thanks RemcoSmitsDev)\n- Edit Prediction: Improved cursor movement performance when edit predictions are enabled. (#44161)\n- Bedrock: Added opt-in allow_global which enables global endpoints. (#44103; thanks 5herlocked)\n- Bedrock: Updated cross-region-inference endpoint and model list. (#44103; thanks 5herlocked)\nGit\nLet's Git Together status - week 7 of 9\nCurrent Progress: 108 of 182 issues closed, with 54 PRs shipped by the community. And 18 PRs in progress by the community!\nCheck out our git board and tackle an issue with the team.\nAlso, this Thursday is our final Git demo day of the year. Share what you've shipped and see what others have built.\n⭐ = Shipped via Let's Git Together\n- Changed git conflict buttons to use branch names instead of HEAD and ORIGIN. (#44421)\n- Changed project diff to now focus on merge conflicts for files that have them. (#44263)\n- ⭐Added support for git remotes. (#42819; thanks bnjjj)\n- ⭐Improved self-hosted git provider support and Bitbucket integration. (#42343; thanks amtoaer)\n- ⭐Improved commit view to not show breakpoints on hover. (#44484; thanks cppcoffee)\n- ⭐Fixed an issue where the context menu in the Git Blame view would be frequently overlapped by the commit information tooltip. (#42764; thanks amustaque97)\n- ⭐Fixed editor blame hover not working when inline git blame is disabled. (#42992; thanks errmayank)\n- Commit View: Fixed layout shift that occurred while loading commit. (#44548)\n- Fixed font feature application for inline git blame, inline diagnostics, markdown popovers and diagnostics popovers. (#44219)\n- Fixed git ignored directories appearing as empty when their content changes on Windows. (#44143)\n- Fixed commit diff multibuffers to now open real project files whenever possible, restoring navigation and annotations inside those excerpts. (#42558; thanks xipeng-jin)\n- Fixed a bug where not all branches were being shown in the branch selector when the search field was empty. (#44742)\nLanguages\n- Markdown Preview: Changed markdown tables to scale based on their content size. (#43555; thanks RemcoSmitsDev)\n- Python: Improved sorting order of toolchains in monorepos with multiple local virtual environments. (#44141)\n- Improved JSONC trailing comma handling. (#44250)\n- Greatly improved the quality of comment-directed language injections in Go. (#43775; thanks jeffbrennan)\n- Improved Proto support to work better out of the box. (#44440)\nOther\n- Added history to the command palette (up will now show recently executed commands). This is particularly helpful in vim mode when you may mistype a complicated command and want to re-run a slightly different version thereof. (#44517)\n- Added RotateSelectionsForward and RotateSelectionsBackward actions that rotate content in a circular fashion across multiple cursors. (#41236; thanks scorphus)\n- Added editor::InsertSnippet action. (#44428)\n- Improved Recent Projects picker to now display SSH hostname with remotes. (#44349; thanks wln)\n- Improved visibility of the currently active match when browsing results in buffer or project search. (#44098)\n- Remote Dev: Added 10s connect timeout for server download. (#44216)\n- Remote Dev: Improved resiliency when initialization scripts output text. (#44165)\n- Overhauled preview tabs settings. (#43921)\n  - Added setting preview_tabs.enable_preview_from_project_panel (default true)\n  - Kept setting preview_tabs.enable_preview_from_file_finder (default false)\n  - Added setting preview_tabs.enable_preview_from_multibuffer (default true)\n  - Added setting preview_tabs.enable_preview_multibuffer_from_code_navigation (default false)\n  - Added setting preview_tabs.enable_preview_file_from_code_navigation (default true)\n  - Renamed setting preview_tabs.enable_preview_from_code_navigation to preview_tabs.enable_keep_preview_on_code_navigation (default false)\n- Suppressed warning for trailing commas in builtin JSON files (settings.json, keymap.json, etc.). (#43854; thanks ian-h-chamberlain)\n- Improved GPU initialization error reporting to be more reliable. (#44487)\nBug Fixes\n- macOS: Fixed an issue where LSPs could fail to start when shell plugins spawn background processes during environment capture. (#44193; thanks RemiKalbe)\n- macOS: Fixed a bug where the integrated terminal could not access external drives or user-selected files. (#43609; thanks aeroxy)\n- Linux: Cleaned up noisy logs from zbus. (#44296)\n- Linux (Wayland): Fixed a crash that could occur when characters_per_second was zero. (#44151; thanks rawandahmad698)\n- Windows: Fixed some wasm language extensions failing to spawn. (#44477)\n- Windows: Fixed left click not allowing to follow in collab title bar. (#44364)\n- Agent: Fixed an issue where clicking on the agent notification buttons would sometimes not trigger their actions. (#44280)\n- Agent: Fixed tool-call errors when using DeepSeek's reasoning mode. (#44301; thanks Peter-Koenig)\n- Agent: Fixed an issue where pasting code into the agent panel from another window would show an error. (#44633)\n- ACP: Fixed codex-acp download path for ARM Windows targets. (#44395)\n- Debugger: Fixed a bug where the stack frame filter state wouldn't persist between sessions. (#44352)\n- Debugger: Fixed evaluate selection not behaving as if the highlighted text was not typed verbatim into the console. (#44205)\n- Terminal: Fixed performance regression when handling long lines. (#44407)\n- Terminal: Fixed inconsistent font weight step size in settings. (#44243; thanks errmayank)\n- Fixed an issue where the scrollbar would become stale in the code completions menu after the items were updated. (#44536)\n- Fixed editor paste not using clipboard when in Vim visual mode. (#44347; thanks errmayank)\n- Fixed buffer navigation in Vim mode with non-Editor items. (#44350; thanks errmayank)\n- Fixed login fallbacks on Linux. (#44502)\n- Fixed a bug that led to Zed sometimes starting an excessive amount of language servers. (#44469)\n- Fixed a bug where the --user-data-dir flag did not work on Windows and Linux, and on macOS required passing --foreground to function properly. (#44235)\n- Fixed a warning indicating the deprecation of tailwindCSS.userLanguages by initializing the options with tailwindCSS.includeLanguages. (#43978; thanks mafiefa02)\n- Fixed a performance bottleneck that could delay Zed's processing of FS events for a long time in some cases. (#44444)\n- Fixed the TypeScript language server falling out of date. (#44343; thanks tidely)\n- Fixed a panic that occurred when searching through text that has casing-dependent length. (#44338; thanks Nereuxofficial)\n- Fixed issue where toggling buffer fold focuses first buffer in multi-buffer instead of the toggled one. (#44394)\n- Fixed incorrect keybindings for open folder and open files actions on Windows' default keymap. (#44406)\n- Fixed new windows to properly cascade from the active window instead of opening at the exact same position. (#44358; thanks notnotjake)\n- Fixed restoring window location for single-file worktrees. (#44257)\n- Fixed an issue where memory usage would not go down after closing a window. (#44237)\n- Fixed an issue where inserting text with multiple cursors inside a nested Markdown list would cause it to lose its indentation. (#40794; thanks vipexv)\n- Fixed Codex web login not working on WSL remotes if no browser is installed. (#44136)\n- Fixed SSH remoting hang when connecting to 1 vCPU servers. (#44109)\n- Fixed brackets not re-colorizing on theme change. (#44130)\n- Fixed all-panes tab switcher not updating in response to changes in other panes. (#44101)\n- Fixed a bug with the tab switcher where, after closing a tab, the selected entry would not match the pane's active item. (#44006)\n- Fixed linewise text object operations (yap, cap, etc.) omitting trailing blank line in vim mode. (#43583; thanks van-sprundel)\n- Fixed an issue where creating a file through the project panel with a trailing dot in its name would duplicate the entries with and without the dot. (#44524)\n- Python: Fixed toolchain selector not having an active toolchain selected on open. (#44141)\n- Fixed Select Next Match in project search results misbehaving when some of the buffers within the search results were open before search was run. (#44135)\n- Fixed project search results being scrolled to the last file active prior to running the search. (#44135)\n- Fixed a bug where search regexes with look-around or backreferences could hang the CPU. They will now abort after a certain number of match attempts. (#44120)\n- Fixed styling of <code> HTML tags in Markdown popovers. (#43513; thanks artschur)\n- Fixed Opus 4.5 access on Bedrock, now only accessible through the allow_global. (#44103; thanks 5herlocked)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.217.1","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}