{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.219.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.219.4/Zed-x86_64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.219.4/Zed-aarch64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\nThis week's release includes most of December's quality week items and is packed!\nHighlights include subpixel (ClearType-style) text rendering on Windows and Linux to improve text clarity on standard DPI displays, the ability to favorite/pin Agent models, cycle them via alt-tab, and queue messages in the agent panel, a git: create pull request command, UI controls to restart/stop individual language servers, a which-key-like modal (enable with {\"which_key\": {\"enabled\": true}}), improved Markdown list editing via extend_list_on_newline and indent_list_on_tab, many performance boosts — and much much more!\nFeatures\nAI\n- Agent: Added the ability to mark language models as favorites and pin them to the top of the list. This feature is available in the native Zed agent (including text threads and the inline assistant), and in external agents. (#44297, #45528; thanks aqrln)\n- Agent: Added the ability to cycle through favorited models using the alt-tab keybinding. (#45032)\n- Agent: Added the ability to queue messages in the agent panel. (#46019)\n- Agent: Added a right-click context menu for the thread view. (#45440; thanks zchira)\n- Agent: Added the ability to regenerate the auto-summarized title of threads via the \"Regenerate Thread Title\" button, available in the ellipsis menu of the agent panel. (#43859; thanks aeroxy)\n- Agent: Added the ability to configure timeouts for context server tool calls. The new global context_server_timeout setting controls the default timeout (default is 60s, max: 10min). Additionally, per-server timeouts can be configured using the timeout field within servers defined in the \"context_servers\" setting. (#45378)\n- Agent: Added MCP prompt support to agent threads. Prompts from MCP servers now appear in the slash command menu when typing / in agent threads. (#43523; thanks mdliss)\n- Agent: Show tool call parameters when the agent asks for confirmation to run a tool. (#45931)\n- Agent: Made tool calls' raw input visible in the agent UI. (#45097; thanks tsoernes)\n- Agent: Use up-to-date token counts from LLM responses when reporting tokens used per thread. (#44943)\n- Agent: Added OpenAI gpt-5-codex model to the assistant. (#39989; thanks mstallone)\n- Agent: Added support for OpenAI's /responses endpoint for models that don't support the /chat/completions API. (#39989; thanks mstallone)\n- Agent: Improved Agent Panel performance when terminals are scrolled offscreen. (#45537)\n- Agent: Updated context lengths for several Mistral models to match Mistral’s recommended values. (#45194; thanks guiopen)\n- Agent: Added support for authenticating Amazon Bedrock with API keys (bearer tokens), including via environment variable or the UI. (#41393; thanks 5herlocked)\n- Agent: Improved: MCP tools are now automatically reloaded when a context server sends a tools/list_changed notification, eliminating the need to restart the server to discover new tools. (#42453; thanks tsoernes)\n- Copilot now supports Next Edit Suggestions. (#44486)\nGit\n- Added git: create pull request command to open a pull request for the current branch. (#42959; thanks tommyming)\n- Added the ability to copy a commit's SHA in the commit view. (#45478; thanks cppcoffee)\n- Added support for collapsing/expanding entries with your keyboard while in the git panel (tree view). (#45002; thanks RemcoSmitsDev)\n- Added a Restore File action in the project panel context menu to discard uncommitted file changes. (#42490; thanks korbindeman)\n- Added git clone open listeners using zed://git/clone?repo=<git-url>. (#41669; thanks AlvaroParker)\n- Added support for zed://git/commit/<sha>?repo=<path> URI scheme to access the git commit view. (#43341; thanks schpet)\n- Added optimistic staged hunk updating. (#43434; thanks van-sprundel)\n- Added support for Git repository excludes file .git/info/exclude. (#42082; thanks errmayank)\n- Display all branches and remotes by default in the branch picker. (#45041)\n- Git panel now truncates long file paths from the left, showing \"…path/filename\" when space is limited, keeping filenames always visible. (#43462; thanks ddoemonn)\n- Added global Git settings to enable/disable git status and git diff. (#43326; thanks leoliu0605)\nDebugger\n- Conditionally display the debugger panel icon based on the debugger.button setting to avoid too many error logs. (#45544; thanks tacshi)\nLanguages\n- C++: Include namespace symbol in the outline view. (#45794; thanks hokein)\n- C/C++: Added highlighting for escape sequences. (#46116; thanks ozacod)\n- C/C++: Added union declarations to the list of text objects. (#45308; thanks hokein)\n- Python: Added support for uv run in the shebang line to be interpreted as a Python script. (#45881; thanks flou)\n- Python: Allow using locally installed ty for Python. (#45193; thanks henryhchchc)\n- Markdown: Lists now continue automatically when you press Enter (unordered, ordered, and task lists). This can be configured with extend_list_on_newline (default: true). (#42800, #45561; thanks 0xRaduan)\n- Markdown: You can now indent list markers with Tab to quickly create nested lists. This can be configured with indent_list_on_tab (default: true). (#42800; thanks 0xRaduan)\n- TS/JS: Files with updated imports now open in a multibuffer when renaming or moving TypeScript or JavaScript files. (#45110)\n- TS/JS: Improved syntax highlighting consistency for builtins in JavaScript and TypeScript. (#46068)\n- TS/JS: When renaming a TypeScript or JavaScript file, the selected option to automatically update imports will now be remembered across editor sessions. (#45105)\n- Proto: Added the extend keyword. (#45413; thanks Zachiah)\n- Added Tailwind CSS Mode support, for Tailwind-specific CSS rules like @apply, @layer, and @theme. (#45352)\n- Added recognition for .bst files as yaml. (#45015; thanks vixalien)\nREPL\n- Added an inline display of execution results (as opposed to the large execution view) for simple REPL cells. (#44523; thanks auriium2)\n- Added gutter execution display. (#44523; thanks auriium2)\n- Improved how execution of empty lines is handled. (#44523; thanks auriium2)\nVim / Helix\n- Added a which-key like modal with a compact, single-column panel anchored to the bottom-right. You can enable with {\"which_key\": {\"enabled\": true}} in your settings. (#43618; thanks xipeng-jin)\n- Vim: Added the :r[ead] [name] Vim command. (#45332; thanks AidanV)\n- Added simple g g, G, j, and k motions for the file history view in Vim mode. (#45412; thanks AlvaroParker)\n- Added Helix match surround operations. (#44317; thanks leonqadirie)\nOther\n- Added support for subpixel (ClearType-style) text rendering. This improves the legibility of text on standard DPI displays. Subpixel rendering is enabled by default on Windows and Linux and can be configured using the text_rendering_mode setting. (#45423)\n- Added the ability to restart and stop individual language servers from the UI as opposed to just them all. (#45882)\n- Added the language server version in a tooltip on language server hover. (#45302)\n- macOS: Bundle a placeholder Document.icns so Finder can display Zed’s file icons (instead of a generic icon). (#44833)\n- Added support for remote connections over IPv6. (#43591; thanks marcocondrache)\n- Added a status bar item to display the active file's character encoding (e.g. UTF-8) and BOM status. (#45476; thanks tomopumipumi)\n- Added a button to clear the search query for the collab and outline panels' search bars. (#46210)\n- Added a button to copy diagnostic messages from the hover popover. (#45625; thanks tacshi)\n- Added a notification with a link to view release notes online when Zed can’t load them locally. (#45900; thanks CodingDoll)\n- Settings UI: Added support to edit the existing proxy setting. (#45684; thanks cppcoffee)\n- Added read_only_files setting to allow specifying glob patterns of files that should not be editable by default. (#44376)\n- Added pane::Split mode ({ClonePane,EmptyPane,MovePane}) to allow creating an empty buffer. (#40245; thanks iff)\n- Added ellipsis to truncated code actions and an aside showing the full action description. (#45268)\n- Added support for opening and saving files with legacy encodings (Shift-JIS, Big5, etc.). (#44819; thanks tomopumipumi)\n- macOS: Mark metal layers opaque for non-transparent windows to allow direct-to-display when supported. (#44334, #45434; thanks marcocondrache)\n- macOS: Buffer search now syncs with the system find pasteboard, allowing ⌘E and ⌘G to work seamlessly across Zed and other apps. (#45311)\n- Settings: Added Sapling directory to default file_scan_exclusions. (#45837; thanks corywilhite)\n- Settings UI: Improved the UX of editing font size fields, as you can now type the desired value as opposed to just using the decrement/increment buttons. (#45875)\n- Added persistence for window size when no projects are open. (#44937; thanks mchisolm0)\n- Keymap editor: Added the ability to open the keymap.json file with a keybinding. (#45987; thanks smitchaudhary)\n- Keymap editor: Added a keybinding creation modal to make it easier to assign an action to a keystroke. (#46030)\n- Added hover feedback to folded path folders to indicate which folder will be targeted. (#45876; thanks andre-eriksson)\n- Added autocomplete for LSP initialization_options. (#43104; thanks Nereuxofficial)\n- Keybindings: Made the extension key context case-insensitive. This e.g. enables the markdown: Open Preview action to also handle files where the extension is capitalized as MD (case-sensitive file system). (#45961; thanks krisfur)\n- Improved rendering of the border on number field inputs to ensure it's only rendered when the field is focused. (#46165)\n- Improved readability of long paths in the remote project picker. (#46151)\n- Improved responsiveness when editing very large language files. (#45347)\n- Improved editor: add selection above and editor: add selection below to select at the same text column when skipping soft-wrapped lines, instead of the same visual position. (#45594)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.219.4","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}