{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.211.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.211.4/Zed-x86_64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\nThis week's release includes a new Windows Arm64 build, a git: branch diff action to diff the current branch against main, many quality-of-life rendering improvements to markdown preview, the ability to quickly jump to the keymap editor from the command palette to set / change keybindings, and improved inlay hints stability.\nFeatures\nAI\n- Agent: Added the ability to install ACP agents via extensions. There will be a blog post covering this soon! (#40663)\n- Agent: Added file names and line numbers to symbol completions. (#40508; thanks pkondzior)\n- Agent: Added support for changing the Codestral endpoint for Edit Prediction. (#41116; thanks pedrxd)\n  \"edit_predictions\": {\n    \"codestral\": {\n      \"api_url\": \"https://codestral.mistral.ai\",\n      \"model\": \"codestral-latest\",\n      \"max_tokens\": 150\n    }\n  }\n- Agent: Improved the editing previous messages UX by focusing in the agent panel's message editor after regenerating a prompt, instead of moving focus to the nearest regular buffer. (#40938)\n- Added experimental terminal-based authentication to ACP support. (#41954)\n- Added support for GitHub Copilot /responses endpoint. (#40762; thanks somtooo)\nGit\n- Added the ability to view the diff of the current branch since main with git: branch diff from the command palette. (#40188)\nDebugger\n- Added a horizontal scrollbar for frame item and tooltip for variables. (#41261; thanks bnjjj)\n- Added inline variable value display during debugging for JavaScript, TypeScript, and TSX. Variable values now appear inline in the editor while debugging, matching the experience available for Rust, Python, and Go. (#40914; thanks taciclei)\nSettings UI\n- Added a warning banner when the settings file you are looking at is out of date and needs to be migrated. (#41112)\n- Enabled editing project settings for worktrees that don't have a project setting file. (#40971)\nLanguages\n- Markdown Preview:\n  - Added support for HTML lists. (#39553; thanks RemcoSmitsDev)\n  - Added support for HTML table column align attribute. (#41163; thanks RemcoSmitsDev)\n  - Added support for colspan and rowspan for HTML tables. (#39898; thanks RemcoSmitsDev)\n  - Improved nested list item prefix style. (#39606; thanks huacnlee)\n- Go: Added comment injections for go.mod and go.work. (#40842; thanks thedadams)\nVim\n- Added Vim motions on settings navigation menu. (#39988; thanks AlvaroParker)\n- Helix: Added alt-o & alt-i to editor: select {larger,smaller} syntax node respectively. (#40527; thanks atahrijouti)\n- Helix: Added alt-p & alt-n to editor: select {next,previous} syntax node respectively. (#40527; thanks atahrijouti)\nWindows\n- Added builds for Arm64 architecture. (#40855)\nCollaboration\n- Added a Copy Channel Notes Link action to right-click menu of Zed channels. (#41298)\n- Added a prevent_sharing_in_public_channels project setting for preventing projects from being shared in public channels. (#41395)\nOther\n- Added a footer to the command palette with buttons to add or change the selected action's keybinding. Both open the keymap editor, though the add button takes you directly to the modal for recording a new keybind. (#40825)\n- Added support for counting wrapped lines as relative lines and for displaying line numbers for wrapped segments. Changed relative_line_numbers from a boolean to an enum: enabled, disabled, or wrapped. (#39268; thanks thomasheartman)\n- Added editor: go to next reference and editor: go to previous reference editor actions. (#41078)\n- Added a Toggle All Docks editor action and updated the keymaps to use it. (#40567; thanks Adir-Shemesh)\n- Added the ResetAllZoom and ResetAgentZoom actions, allowing to return the zoom level across the whole app and/or just in the agent panel to its default/original value. (#41124)\n- Improved the --wait flag in Zed's CLI so as to always open the provided file in the currently focused window. (#41051)\n- Improved hover popover respecting settings delay correctly. (#41149; thanks deltamaya)\n- Improved handling of unsplittable panes. (#41215)\n- Increased the initial connection timeout to 60 seconds for remote dev. (#41339; thanks versecafe)\n- Allowed About Zed menu entry to work when all Zed windows are closed. (#41272)\n- Keybinding: Pane key context now includes buffer_search_deployed identifier. (#41193; thanks FloppyDisco)\n- Surfaced Jupyter client errors in the UI. (#40886; thanks lionel-)\n- Reduced selection opacity when the editor is out of focus to make inactive states clearer. (#40925)\n- Reworked inlay hints to be less error-prone. (#40183)\nBug Fixes\n- Agent: Fixed an issue where all tools would be presented as available even when using the Minimal profile. (#40413; thanks NotSpooky)\n- Agent: Fixed an issue where the agent panel's buffer and UI font size wouldn't scale proportionally. (#41121)\n- Agent: Fixed an issue where the web search tool would show up in the profile selector even when not using a model via Zed Pro. (#40917)\n- Agent: Fixed an issue where agent: Chat with follow was not working anymore (#41581)\n- Codex: Fixed an issue where downloading a new version would not delete older versions. (#41191)\n- Debugger: Fixed a panic that could occur when minimizing Zed. (#41352)\n- Debugger: Fixed debug scenario picker not showing language subtitles. (#40977)\n- Vim: Fixed Editor: wrap selection in tags when in visual line mode. (#41030; thanks Trombach)\n- REPL: Fixed a bug where the copy button was not working for error output. (#40669; thanks h-michaelson20)\n- Settings UI: Fixed an issue where the user settings file would not appear as an available settings file if it failed to parse or didn't exist. (#41112)\n- Settings UI: Fixed wrongly-focused previous element on number_field decrement. (#41095; thanks ToBinio)\n- Settings UI: Fixed memory leak. (#41036)\n- Settings UI: Fixed a bug where project setting files wouldn't be detected if they were created or opened after while an active settings window is open. (#40968)\n- Settings UI: Fixed a bug where duplicate file names showed in the header files. (#40943)\n- Settings UI: Fixed an issue where some dropdown menus would show options from a different dropdown when clicked\n- Settings UI: Fixed an issue where attempting to change a setting in a dropdown back to it's original value after changing it would do nothing (#41930)\n- Settings UI: Fixed an integer underflow panic when attempting to hit the - sign on settings item that take delays in milliseconds. (#41898)\n- Keymap Editor: Fixed an issue where attempting to add or update a key binding with an empty keymap.json file would fail. (#40909)\n- Keymap Editor: Fixed an issue where showing matching keystrokes in the modal would not clear an active text query. (#41296)\n- Git: Fixed an issue where git would save clean files when staging, causing unnecessary rebuilds in external file watchers like vite. (#41047)\n- Git: Fixed some cases where the project diff would fail to update in response to git events. (#40662)\n- Vim: Fixed vim::NormalBefore not entering helix_normal mode correctly. (#40528; thanks paneutral)\n- macOS: Fixed some fonts rendering with absurd spacing. (#41043)\n- Helix: Fixed Ctrl+P and Ctrl+N navigation in Helix mode when using \"Search project files\". Ctrl+P now correctly moves to the previous result and Ctrl+N moves to the next result, matching standard Helix behavior. (#40877; thanks virajbhartiya)\n- Emacs Keymap: Fixed a problem where keys would fall back to their default keymap binding on certain conditions. (#40631; thanks Affonso-Gui)\n- Emacs Keymap: Fixed a bug where alt-f and alt-b didn't operate on full words, like they do in the Emacs default. (#40631; thanks Affonso-Gui)\n- Fixed document diagnostics with Ty language server. (#41947)\n- Fixed extension panics crashing Zed. (#40883, #40936)\n- Fixed stack overflows when constructing large ropes. (#41397)\n- Fixed diagnostics for Ruff and Biome. (#41386)\n- Fixed a bug where the initial window title was incorrect on startup in Wayland. (#36844; thanks Sushants-Git)\n- Fixed an issue where the scrollbar track color would not update in case the theme was changed. (#41354)\n- Fixed ESLint linebreak-style errors by preserving line endings in LSP communication. (#38773; thanks devdattatalele)\n- Fixed Java language servers' completion defaults handling on Zed's side. (#41187; thanks playdohface)\n- Fixed duplicate process entries in WSL debug attach list. (#40591; thanks feeiyu)\n- Fixed issue where using workspace: save as would prevent users from opening the original file from which the new file was created. (#41012)\n- Fixed a bug where the cursor would not move to the duplicated line when duplicating a line upwards. (#41004; thanks TomPlanche)\n- Fixed panic in editor: copy highlight json action. (#40981)\n- Fixed Zed failing to run the HTML language server in some cases. (#40832)\n- Fixed an issue where the project panel's sticky entry could appear transparent on hover with certain themes. (#40944)\n- Fixed some cases where keybinds would appear with a slight delay, causing a flicker in the process. (#40927)\n- Fixed a rare issue where the extension page would stutter while scrolling. (#40899)\n- Fixed title overrides of singleton buffers not being replicated. (#40896)\n- Fixed outline panel panicking when rendering certain search matches (#41859)\n- Fixed a panic in file finder when deleting characters (#41808)\n- Fixed panic in refresh_linked_ranges (#41657)\n- Fixed an issue where Zed would try to install extensions specified under auto_install_extensions which were moved into core. (#41551)\nBreaking Changes and Notices\n- Agent: Improved discoverability of the previously called agent: quote selection action—which allows adding a text selection in a buffer as context within the agent panel—by renaming it to agent: add selection to thread and making it available from the right-click editor context menu as well as the Selection app menu. (#40897)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.211.4","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}