{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.214.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.214.5/Zed-x86_64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\nThis week's release includes agent server extensions over SSH remoting, pretty TypeScript errors with language-aware Markdown, Vim range write commands, improved search performance in local projects, and new project_panel.sort_mode and terminal.scrollbar.scroll_multiplier settings.\nFeatures\nAI\n- Agent: Added automatic retries for OpenAI-compatible LLM providers. (#37891; thanks timmclean)\n- Agent: When @mention-ing large files with no outline, their first 1KB is now added to context. (#42543)\n- Agent: Improved the modal to add LLM providers by making it responsive and keyboard navigable. (#42983)\n- Agent: Improved discoverability of the cmd-n keybinding to create a new thread with the currently selected agent. (#42939)\n- Agent: Improved the interaction with errors by allowing links to be clickable. (#42732)\n- Agent: Improved table rendering in the agent panel, ensuring cell text wraps, not going off-screen. (#42674)\n- Agent: Made agent file edits error if the file has changed since last read, allowing the agent to read changes and avoid overwriting changes made outside Zed. (#42895)\n- Agent: Added support for per-target environment variables on Agent Server Extensions. (#42683)\n- Agent: Made Agent Server Extensions available when doing SSH remoting. (#42683)\n- Added support for configuring MCP servers that connect over HTTP in your settings file. These are not yet available in the extensions API. (#39021; thanks AhegaoBurger)\n  {\n    \"context_servers\": {\n      \"my-remote-server\": {\n        \"enabled\": true,\n        \"url\": \"http://localhost:3000/mcp\"\n      }\n    }\n  }\n- Signing out now clears the local cache containing the plan and usage information. (#42678)\nGit\nLet's Git Together status - we are entering week 4 of 9\nCurrent Progress: 76 of 153 issues closed, with 23 PRs shipped by the community. And 15 PRs in progress by the community!\nGoal: Close out 153 git issues by December 31, 2025.\nThe git PRs are rolling in. We're shipping the features you've been asking for, side-by-side with our open source contributors.\nIt's not too late to join! Check out our git board and tackle an issue with the team.\n⭐ = Shipped via Let's Git Together\n- ⭐Changed opening a file via Open File in the context menu of a git panel entry to automatically expand the diff hunks. (#40616; thanks FloppyDisco)\n- ⭐Fixed a bug where Git renames were appearing as deleted + untracked files instead of showing as renamed files in the git panel. (#42352; thanks ddoemonn)\n- ⭐Fixed a bug where pickers would automatically close upon the window becoming inactive. (#41320; thanks v1narth)\n- ⭐Fixed Git panel not showing any branches when repository contains refs with missing fields. (#42523; thanks errmayank)\n- ⭐Fixed focus issues in the git panel when the repository has no entries. (#42553; thanks xipeng-jin)\n- Fixed staging checkbox flickering sporadically in the Git panel. (#43061)\nLanguages\n- Markdown Preview: Added support for HTML href elements. (#42265; thanks RemcoSmitsDev)\n- TypeScript: Added pretty errors with language-aware Markdown. (#42494; thanks KyleBarton)\nVim / Helix\n- Vim: Added support for :[range]w to replace the current file with the selected lines. (#41256; thanks AidanV)\n- Vim: Added support for :[range]w {file} to write the lines in the range to the specified file. (#41256; thanks AidanV)\nOther\n- Improved project search performance in local projects. (#40835)\n- Settings UI: Changed Project Settings action to open settings UI instead of a file. (#42669)\n- Keymap Editor: Made the \"toggle exact match mode\" the default keystroke search mode so that whatever you search for matches exactly to results. (#42883)\n- Clicking the multi-buffer header file name or the \"Open file\" button now jumps to the most recent selection in that buffer, if one exists. (#42613)\n- Added project_panel.sort_mode option to control explorer file sort (directories first, mixed, files first). (#40160; thanks lparry)\n- Added tilde expansion support for LSP binary path in settings.json. (#41715; thanks errmayank)\n- The Editor key context now includes 'diffs_expanded' when diff changes are visible. (#40617; thanks FloppyDisco)\n- Improved pane: reopen closed item to not reopen closed preview tabs. (#42568)\n- Added a terminal.scrollbar.scroll_multiplier option. (#39463; thanks marcocondrache)\nBug Fixes\n- macOS: Fixed title bar not fully draggable. (#41839; thanks ivanpasq)\n- macOS: Fixed not being able to maximize or restore the window with double click on the whole title bar. (#41839; thanks ivanpasq)\n- Windows: Fixed Zed only finding pwsh, but not powershell. (#43526)\n- Collab: Fixed a regression where search matches wouldn't expand the parent channel if that happened to be collapsed. (#42743)\n- Agent: Fixed a bug where the label for model names wouldn't use all the available space in the model picker. (#42921)\n- Agent: Fixed a bug where hitting the NewThread keybinding when focused inside a terminal within the agent panel would create a new terminal tab instead of a new thread. (#42898)\n- Agent: Fixed a bug where images copied from Windows Explorer were not pastable in the agent panel. (#42858)\n- Agent: Fixed a bug where agent commands and edit predictions would show up in the command palette even when the agent feature was disabled. (#42579)\n- Agent: Fixed an issue where the source property of MCP settings would show up as unrecognized. (#43417)\n- Debugger: Fixed CodeLLDB installation getting malformed due to ZIP unpacking bug. (#42714; thanks vasyl-protsiv)\n- Debugger: Fixed a bug where breakpoints were being created inside the breakpoint editor. (#42475; thanks RemcoSmitsDev)\n- Settings UI: Fixed a bug where the \"Edit in settings.json\" option wouldn't work for subpages like all the Language pages. (#42886)\n- Vim: Fixed a bug where pressing u after multiple . in rapid succession would undo all repeats instead of only the latest repeat. (#41735; thanks AidanV)\n- Fixed a bug where Zed sometimes experienced freezing while working with inline diagnostics. (#42896)\n- Fixed a bug where Zed did not respect the on_last_window_closed setting on macOS. (#43058)\n- Fixed a bug where PowerShell discovery disregarded admin requirements. (#43044)\n- Fixed a bug where extension panics crashed Zed on Linux. (#43005)\n- Fixed a bug where the terminal would open in the root directory when editing single files from the command line. (#42953; thanks canack)\n- Fixed a bug where the for keyword in Rust was highlighted incorrectly outside of for loops. (#42924; thanks aleanon)\n- Fixed a bug where the await keyword in Rust was not highlighted. (#42924; thanks aleanon)\n- Fixed a bug where remote LSPs were not being queried. (#42723)\n- Fixed improper UI focus behavior in the project panel when preview tabs are disabled. (#42836; thanks Serophots)\n- Fixed a bug where temporary mode would exit when using $ to move to the end of the line. (#42742)\n- Fixed indentation for if/else statements in C/C++ without braces. (#41670; thanks errmayank)\n- Fixed a bug where MoveToEnclosingBracket didn't work correctly inside Markdown code blocks. (#42813)\n- Fixed a bug where unmatched forward/backward Vim motions didn't work correctly inside Markdown code blocks. (#42813)\n- Fixed a bug in the Project Panel where duplicating or creating an entry sometimes didn't focus the rename editing field. (#42739)\n- Fixed a bug with the command used to run Go subtests to ensure that escaped characters don't lead to a failure in finding tests to run. (#42734)\n- Fixed a bug where pinned tab caused resize loop on adjacent tab. (#41884; thanks abulgit)\n- Fixed a bug with the outline panel where pressing space would cause an open selected entry to collapse and cause a closed selected entry to open. (#42214; thanks kevinru2023)\n- Fixed a bug that prevented the Ark kernel from working in Zed. (#40889; thanks lionel-)\n- Fixed a bug where logging into Gemini CLI and Claude Code didn't work when remoting and authenticating via CLI. (#42647)\n- Fixed a bug where the scale factor and drawable size weren't updated when a macOS window changed screens. (#38269; thanks rlueder)\n- Fixed a bug where pane's tab buttons flickered when using right-click on the editor. (#42549)\n- Fixed a bug with scrolling in the extension configuration modal when installation instructions overflow the viewport. (#42502; thanks Amogh-2404)\n- Fixed a bug where the amount of newlines between copied lines from a multi-cursor selection of multiple full-line copies was incorrect. (#41204; thanks seanstrom)\n- Fixed a bug with scoop installations of mise/volta. (#42587)\n- Fixed a bug with sorting in the project panel. (#41080; thanks lparry)\n- Fixed long running pre-commit hooks causing committing from Zed to fail. (#43286)\n- Fixed modals not getting focus on window reopen. (#43451)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.214.5","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}