{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.218.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.218.5/Zed-x86_64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.218.5/Zed-aarch64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\nThis week's release includes initial support for Dev Containers, a new worktree trust mechanism, a new Tree view for the Git panel, SQL syntax highlighting in Python files, AI-generated commit messages that respect rules files (e.g. AGENTS.md), improved terminal scrolling and link detection, and a set of Helix mode keymap improvements.\nFeatures\nAI\n- Agent: Added save_file and restore_file_from_disk agent tools to handle dirty buffers when editing files. (#45005)\n- Agent: Added a button to the agent thread view that scrolls to the most recent prompt. (#44961)\n- Agent: Added the ability to use shift-tab to cycle through profiles for the built-in Zed agent. (#44979)\n- Agent: Added the ability to delete a profile through the \"Manage Profiles\" modal. (#44977)\n- Agent: Improved agent panel performance when rendering large diffs. (#44995)\n- Agent: Improved the model search quality in the model picker. (#44984)\n- Agent: Added optional timeout_ms parameter to the terminal tool, allowing the agent to bound command runtime and prevent indefinite hangs. (#44895)\n- Edit Prediction: Improved self-hosted zeta UX. Users no longer have to log into Zed to use custom or self-hosted zeta backends. (#43236; thanks DominicBurkart)\n- Copilot: Improved GitHub Enterprise Copilot sign-in. (#44085; thanks madmo)\n- Ollama: Added auto_discover setting to optionally limit visible models to only those manually configured in available_models. (#42207; thanks xfbs)\nGit\n⭐ = Shipped via Let's Git Together\n- ⭐Added a tree view for the Git panel. Users are able to switch between Flat and Tree view in the Git panel. (#44089; thanks xipeng-jin)\n- ⭐Improved the file history view by making it keyboard navigable. (#44328; thanks feeiyu)\n- Improved stability of excerpts when editing in the project diff. (#44312)\n- AI-generated commit messages now respect rules files (e.g. AGENTS.md) if present. (#44921)\n- The branch name in the title bar now includes the name of the current repository when needed to disambiguate. (#44793)\n- ⭐Changed clicking the changes button in the Git panel to reset the project diff to the beginning. (#43579; thanks marcocondrache)\n- ⭐Improved permalinks to account for current diffs. (#41915; thanks siame)\n- ⭐Fixed Git panel color for staged new files. (#44071; thanks cppcoffee)\n- ⭐Fixed double slash in commit URLs. (#44996; thanks cppcoffee)\n- Fixed partially-staged files not being represented accurately in the Git panel. (#44837)\nLanguages\n- Improved Markdown Preview with scrolling actions: markdown::ScrollUp, markdown::ScrollDown, markdown::ScrollUpByItem, and markdown::ScrollDownByItem. (#44585; thanks KyleBarton)\n- Rust: Changed cwd of tasks that spawn a binary target to the root of a current package (which used to be a directory of the current source file). (#44672)\n- Added rainbow bracket coloring for C++ angle brackets (< / >). (#44735; thanks hokein)\n- Added language injections for string and tagged template literals in JS/TS(X). (#44180; thanks vitallium)\n- Improved JavaScript and TypeScript syntax highlighting to better distinguish types, parameters, punctuation, and JSDoc elements. (#44532)\n- Added SQL syntax highlighting support in Python files. (#43756; thanks jeffbrennan)\n- Improved Proto support to work better out of the box. (#44440)\nTerminal\n- Improved scroll performance. (#44714; thanks davewa)\n- Improved URL link detection in terminals. (#43559; thanks marcocondrache)\n- Improved performance of terminal link matching even more. (#44679)\nVim / Helix\n- Added Helix's space / keybinding to open a global search menu to Zed's Helix mode. (#43363; thanks godalming123)\n- Changed Helix keybinds to use visual line movement for j, Down, k, and Up, and textual line movement for g j, g Down, g k, and g Up. (#42676; thanks probablykasper)\n- Added custom mappings for Zed-specific diff and git-related actions to Helix's goto mode. (#45006)\n- g o - toggle selected diff hunks\n- g O - toggle staged\n- g R - restore change\n- g u - stage and goto next diff hunk\n- g U - unstage and goto next diff hunk\n- Improved Helix mode keymaps by adding a Search category and clarifying non-Helix bindings. (#43735; thanks atahrijouti)\nOther\n- Added ability to open a project in a DevContainer, provided a .devcontainer/devcontainer.json is present. (#44442; thanks KyleBarton)\n- Introduced worktree trust mechanism, can be turned off with \"session\": { \"session\": { \"trust_all_worktrees\": true }}.\n  - Read the Secure by Default blog post.\n- Improved link parsing for cases when a link is embedded in parentheses, e.g. Markdown. (#44733; thanks KyleBarton)\n- Improved path and rendering performance. (#44655; thanks marcocondrache)\n- Settings UI: Added an \"Open Keymap Editor\" item under the Keymap section. (#44914)\n- Settings UI: Added a section for configuring edit prediction providers under AI > Edit Predictions, including Codestral and GitHub Copilot. Once you've updated you can use the following link to open it: zed://settings/edit_predictions.providers. (#44505)\n- Added support for on-type formatting with newlines. (#44882)\n- Implemented the zed --wait flag so that it works when opening a directory. The command will block until the window is closed. (#44936)\n- Added scroll keybindings for the OutlinePanel. (#42438; thanks 0x2CA)\n- Added the actions: workspace::ZoomIn and workspace::ZoomOut that complement the existing workspace::ToggleZoom action. (#44587; thanks pedroni)\n- Added a connection_timeout setting to specify the SSH connection timeout. (#44823; thanks marcocondrache)\n- Standardized cmd-o = open file, cmd-k, cmd-o = open folder across operating systems. (#44598; thanks Zachiah)\n- Added a show_user_menu setting (defaulting to true) which shows or hides the user menu (the one with the user avatar) in the title bar. (#44466; thanks notnotjake)\n- macOS: Added Force Touch support for go-to-definition. (#40399; thanks aarol)\n- Improved the UI for keymap error messages. (#42037; thanks johnklucinec)\n- Improved LSP notification messages by adding Markdown rendering with clickable URLs, inline code, etc. (#44215; thanks errmayank)\n- Improved new windows spawned from maximized or fullscreen windows by preserving maximized and fullscreen state. (#44605)\n- Improved minimap performance when using custom fonts. (#46024)\n- Suppressed warnings for trailing commas in built-in JSON files (settings.json, keymap.json, etc.). (#43854; thanks ian-h-chamberlain)\n- Added a new value to the restore_on_startup setting called launchpad. This value makes Zed open with a variant of the welcome screen (\"the launchpad\") upon startup. Additionally, this same page variant is now also what is displayed if you close all tabs in an existing window that doesn't contain any folders open. The launchpad page shows you up to 5 recent projects, making it easy to open something you were working on recently. (#44048; thanks simonpham)\nBug Fixes\n- Windows: Fixed the folder picker inserting wrong slashes when remoting from Windows to WSL. (#44886)\n- Windows: Fixed terminal hyperlinking not working for file:// schemes with Windows drive letters. (#44847)\n- Windows: Fixed double hover state. (#44711)\n- Windows: Fixed SendKeystrokes mapping. (#44707)\n- Windows: Fixed shell environment fetching on Windows discarding specified arguments in settings. (#44615)\n- Windows: Fixed a bug where custom MCP and ACP servers installed through did not launch correctly. (#42382)\n- Windows: Fixed new windows underflowing the taskbar. (#44605)\n- Windows: Fixed terminal not switching to project directory when opening remote project. (#45390)\n- Linux: Fixed a race condition where the macros containing modifier + key would sometimes be processed without the modifier. (#44234; thanks AndreRoelofs)\n- Terminal: Fixed an issue where ctrl|cmd+click on links was very sensitive to mouse movement. Clicking links now tolerates mouse movement within the same clickable element, making link navigation more reliable. (#42526; thanks nihalxkumar)\n- Vim: Fixed bug where overwriting global Vim marks was inconsistent. (#44765; thanks AidanV)\n- Git: Fixed a bug where not all branches were being shown in the branch selector when the search field was empty. (#44742)\n- Git: Fixed a bug where the git: amend command would not load the latest head commit message, and any previously entered text in the commit message editor would be lost after the amend completed. (#44553)\n- Fixed a case where an incorrect match could be generated in label_for_completion. (#44925; thanks Nereuxofficial)\n- Fixed an issue where Markdown tables would sometimes show double borders. (#44991)\n- Fixed an issue where Markdown tables wouldn't render in the hover popover. (#44712)\n- Fixed percent-encoded filenames appearing in agent message file mentions. (#44983; thanks Suzushiro-radish)\n- Fixed tab preview not showing up on initial ctrl-shift-tab press. (#44959; thanks errmayank)\n- Fixed editor context menu triggering format on save. (#44073; thanks flappyBug)\n- Fixed file_finder::Toggle action sometimes not working in JetBrains keymap. (#44951)\n- Fixed a bug where screen-share tabs would persist after the sender (or receiver) had left the call. (#44945)\n- Fixed a bug when expanding a diff hunk at the beginning of a file, where the deleted portion of the hunk would remain outside of the viewport. (#44932)\n- Fixed -or- divider rendering incorrectly in the project panel of an empty workspace. (#44920; thanks ti0ma)\n- Fixed quote autoclose incorrectly counting quotes inside strings. (#44281; thanks errmayank)\n- Fixed a bug where git pager configurations could cause agent and terminal git commands to hang by forcing PAGER and GIT_PAGER environment variables off. (#43277; thanks odvcencio)\n- Fixed a bug where double- and triple-click selection would not correctly expand by word and by line within Markdown elements (diagnostics, agent panel, etc.), instead requiring manual adjustment. (#43813; thanks RMcGhee)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.218.5","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}