{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.215.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.215.3/Zed-x86_64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.215.3/Zed-aarch64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\nThis week's release brings rainbow brackets 🌈 (addressing a feature request with 1100 👍s), automatic detection of uv workspaces in the toolchain selector, the ability to set a default model for built-in external agents (Claude Code, Codex CLI, Gemini CLI), and support for OpenAI's GPT-5.1 model for BYOK users.\nFeatures\nAI\n- Added support for OpenAI's GPT-5.1 model to BYOK. (#43492)\n- Agent: Added the ability to set a model as the default for a given built-in external agent (Claude Code, Codex CLI, or Gemini CLI). (#43122)\n- Agent: Added support for specifying settings for ACP extensions (default_mode, default_model). (#43177)\n- Agent: Improved the \"reject\"/\"keep\" behavior when regenerating older prompts by auto-keeping pending edits that don't originate from the prompt to-be-regenerated. (#43347)\n- Agent: Made the thread markdown editable. (#43377)\nGit\nLet's Git Together status - we are entering week 5 of 9\nCurrent Progress: 91 of 182 issues closed, with 33 PRs shipped by the community. And 15 PRs in progress by the community!\nGoal: Close out 182 git issues by December 31, 2025.\nThe git PRs are rolling in. We're shipping the features you've been asking for, side-by-side with our open source contributors.\nIt's not too late to join! Check out our git board and tackle an issue with the team.\n⭐ = Shipped via Let's Git Together\n- ⭐Improved readability of files in the git changes panel. (#41857; thanks alphathekiwi)\n- ⭐Compressed large diffs for commit message generation. (#42835; thanks 11happy)\n- ⭐Fixed git not preserving file mode when committing. Executable files now retain their permissions when committed with Zed. (#41900; thanks 11happy)\n- ⭐Fixed highlighting for addition and deletion for diff language. (#38384; thanks tidefield)\n- Fixed displaying auto-commit suggestions for single staged entries. (#43470)\n🎉 Big shoutout to our most active Git contributors: @amtoaer, @errmayank, @11happy, @ddoemonn, and @xipeng-jin\nDebugger\n- Added $ZED_PICK_PID variable for debug configurations, allowing users to select which process to attach the debugger to at runtime. (#42913)\nLanguages\n- Python: Added support for detecting uv workspaces as toolchains. (#43496)\n- C++: Added support for treating .h++ files as C++. (#42802; thanks bnjmnjrk)\n- Markdown: Added LaTeX highlighting for inline and display equations. (#41110; thanks lnay)\n- Added support for identifying .clangd and .clang-format files as YAML by default. (#43557; #43469; thanks notpeter)\n- Improved the sorting of semver completions in package.json so the latest versions appear at the top. (#43473)\nTerminal\n- Added terminal.path_hyperlink_regexes and terminal.path_hyperlink_timeout_ms settings to customize path hyperlink detection in the terminal. (#40305; thanks davewa)\n- Improved terminal hyperlink performance, especially for terminals with a lot of content visible. (#40305; thanks davewa)\nCollaboration\n- Improved rendering of avatars that failed to load by rendering a fallback icon. (#43183)\nOther\n- Added bracket colorization (rainbow brackets) support. Use colorize_brackets language setting to enable. (#43172)\n- Onboarding: Added ability to zoom in/out on onboarding pages with the same keybindings you'd use to zoom in/out a regular buffer. (#43244)\n- Added the possibility to open a non-existing path using zed CLI. (#43250; thanks BuonOmo)\n- Added various missing keybindings and fixed several incorrectly mapped keybindings for the JetBrains keymap. (#43042; thanks carstonhernke)\n- Added project_panel::CollapseAllEntries keybinding (cmd-left on macOS, ctrl-left on Linux/Windows) to collapse all entries in the project panel. (#43112)\n- Improved language server updates for slow connections. Zed now launches the existing server if the update is taking too long. (#43164)\n- Improved project search performance with \"Also search files ignored by configuration\" combined with file inclusion/exclusion queries. (#42968)\n- Improved performance of multibuffers by spawning git blame processes on the background threads. (#43918)\n- Enabled environment passthrough for npm subcommands. (#43102; thanks yjoer)\n- Ensured Zed reuses GITHUB_TOKEN env variable when querying GitHub. (#42623; thanks Binlogo)\nBug Fixes\n- macOS: Fixed a bug where Zed would fail to start on some Apple Silicon machines when Metal device enumeration returned no devices. Zed now falls back to the system default device in this case. (#38164; thanks cacaosteve)\n- Windows: Fixed askpass execution sometimes failing. (#43542)\n- Windows: Fixed Zed only finding pwsh, but not powershell. (#43526)\n- Windows: Fixed bash detection when Git is installed via package managers like Scoop. (#43455; thanks qystishere)\n- Windows: Fixed console windows sometimes appearing when opening Python files. (#43496)\n- Windows: Fixed maximized window size when DPI scale changes. (#40053; thanks cppcoffee)\n- Linux: Fixed window control buttons not showing in GNOME Wayland when SSD requested. (#39313; thanks Be-ing)\n- Linux: Fixed ./script/install-Linux for installing a development version of Zed on Linux. (#43205)\n- Agent: Fixed an issue where ACP agents would start MCP servers that were disabled in Zed. (#43467)\n- Agent: Fixed AI assistant edits being scrambled when file was modified while it was open. (#43103)\n- Terminal: Fixed a bug where search match highlights wouldn't update their position when resizing the terminal. (#43507)\n- Terminal: Fixed terminal path hyperlinks for paths containing unicode punctuation and emoji, e.g. mojo.🔥. (#40305; thanks davewa)\n- Terminal: Fixed path hyperlinks for Windows verbatim paths, for example, \\\\?\\C:\\Over\\here.rs. (#40305; thanks davewa)\n- Vim: Fixed bug where pressing d . . would freeze the editor. (#42145; thanks AidanV)\n- Vim: Fixed the cursor shape reset in vim mode deactivation, ensuring that the user's cursor_shape setting is used. (#42834; thanks lennartkloock)\n- Vim: Fixed paste not working correctly in vim visual modes. (#43031; thanks adriandlam)\n- Helix: Fixed bug where Vim::NextWordEnd in HelixSelect would not select whole word. (#43234; thanks AidanV)\n- Helix: Fixed a bug where <g-l> in Helix mode would not move the cursor to the last character of the line. (#41575; thanks HuaGu-Dragon)\n- Debugger: Fixed input elements within the launch tab in the new session modal to be keyboard navigable. (#43344)\n- Extensions UI: Improved the feedback message for when extensions are not being displayed due to a fetch error caused by lack of connection. (#43197)\n- Fixed settings UI being forced larger than small screens. (#43556)\n- Fixed an issue in the settings UI where changing the terminal shell would set the default shell to sh on Windows. (#43276)\n- Fixed a small issue where a scrollbar would sometimes show in the editor although the content fit exactly on screen. (#43548)\n- Fixed an unnecessary error being logged on startup when SWEEP_AI_TOKEN environment variable is not set. (#43504; thanks oscarvarto)\n- Fixed an issue where accepting a completion for a semver version in package.json would append the suggestion to the existing text instead of replacing it. (#43473)\n- Fixed displaying auto-commit suggestions for single staged entries. (#43470)\n- Fixed a bug where expanding excerpts would fail when the cursor was at the excerpt start. (#42324; thanks olejorgenb)\n- Fixed the following three editor actions not working in remote environments. (#43362; thanks errmayank)\n  - editor: copy file name\n  - editor: copy file location\n  - editor: copy file name without extension\n- Fixed a bug where language server info was not available in remote projects. (#42831; thanks errmayank)\n- Fixed shell env sourcing not working with powershell on unix systems. (#43390)\n- Fixed editor tab tooltips not showing file path for remote files. (#43359; thanks errmayank)\n- Fixed a bug where invalid values in settings files would prevent the rest of the file from being parsed. (#42938)\n- Fixed a bug where a sent agent message would be lost after successful authentication. (#43245)\n- Fixed connect.host setting being ignored by debugpy. (#43190)\n- Fixed a bug where multi-stroke keybindings (like cmd-k cmd-s, or g d in vim mode) would time out waiting for input. Previously, Zed would wait at most 1s for the second keystroke before timing out. In cases where the start of the multi-stroke binding is itself a valid key action (or input text), the 1s timeout still applies. (#42659; thanks xipeng-jin)\n- Fixed issue with popups and menus not being dismissed while using auto_signature_help in Helix Mode. (#43169)\n- Fixed a panic when using vim increment on a multibyte character. (#43101)\n- Fixed an issue where the padding on info popovers would overlay text when the content was scrollable. (#43107)\n- Fixed LSP status list containing zombie entries for LSPs in other windows. (#42733)\n- Fixed encoding error in terms & conditions displayed when installing. (#42906)\n- Fixed ligatures forming between different text kinds. (#43080)\n- Fixed command path not being correctly encoded in context server config modal. (#42693; thanks adam-huganir)\nBreaking Changes and Notices\n- Linux: Added window_decorations setting to control whether Zed or the compositor draws window decorations. This replaces the undocumented ZED_WINDOW_DECORATIONS environment variable, which still works but is deprecated. Set to \"server\" for system titlebars or \"client\" (default) for Zed's custom titlebar. Requires restart. (#39250; thanks Be-ing)\n- Removed the default cmd-opt-. binding for toggling hidden files in the Project Panel so it's harder to hide them by accident. (#43091)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.215.3","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}