{"appId":"w:ZedIndustries.Zed","appShortcutName":"Zed","appDisplayName":"Zed","authorId":"w:winget","releaseTagName":"winget-0.219.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.219.5/Zed-x86_64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zed-industries/zed/releases/download/v0.219.5/Zed-aarch64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"High-performance, multiplayer code editor from the creators of Atom and Tree-sitter.\n\nZed is a next-generation code editor designed for high-performance collaboration with humans and AI.\n- Written from scratch in Rust to efficiently leverage multiple CPU cores and your GPU.\n- Integrate upcoming LLMs into your workflow to generate, transform, and analyze code.\n- Chat with teammates, write notes together, and share your screen and project. All included.\n- Zed now speaks WSL. You can open a Linux distro as a first-class “remote” target, edit projects that live inside it.\n- All of Zed’s AI features, including edit predictions and ACP-powered agents, are fully supported on Windows.\n- All Zed extensions now work seamlessly on Windows; no special steps, no caveats.\n- To run on almost all Windows versions, including VMs, we created a new rendering backend based on DirectX 11.\n- Fixed a crash that could occur when trying to edit edit prediction providers in the settings UI. (#47162)\n- Fixed images in agent threads being converted to PNG but retaining old format, causing some API errors in the process. (#45978)\n- Fixed an issue where JSX components were highlighted too broadly, causing normal HTML tags to be highlighted as such (#47132)\n- Fixed an issue where relative line numbering would break with nested folds. (#47108)\n- Add support for GPT-5.2-Codex via OpenAI API Key (#47031)\n- Fixed a panic in the git panel when utf8 multibyte character filenames got truncated (#46917)\n- Fixed emoji being too small on Linux when using High DPI (#46860)\n- Agent: Fixed a bug where the button to delete a thread stopped showing up. (#46831)","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"0.219.5","version":0,"site":"https://zed.dev/","source":"Zed Industries","license_or_tos":"GPL-3.0","resources":null,"verified":false}