{"appId":"w:Zen_Team.Zen_Browser","appShortcutName":"Zen Browser","appDisplayName":"Zen Browser","authorId":"w:winget","releaseTagName":"winget-1.19b","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zen-browser/desktop/releases/download/1.19b/zen.installer-arm64.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/zen-browser/desktop/releases/download/1.19b/zen.installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Zen is the best way to browse the web. Beautifully designed, privacy-focused, and packed with features. We care about your experience, not your data.\n\n\nZen Stable Release\nThis update includes a new feature that allows you to automatically fill your folders with opened GitHub issues, pull requests or RSS feeds. To add a live folder, click the + button in the sidebar and select 'Live Folder'.\nLet us know what other live folder types you would like to see in the future!\nSecurity\nVarious security fixes\nNew Features\n- Updated to Firefox 148.0\n- Added live folders. Automatically fill your folders with opened GitHub issues, pull requests or RSS feeds. To add a live folder, click the + button in the sidebar and select 'Live Folder'.\n- Dragging a tab on top of another tab for one second will now allow the option to split those tabs.\n- MacOS users now get to use native popover UI, making the experience more consistent with the rest of the operating system.\n- Improved the icon picker for folders, tabs, etc. It now let you select icons without closing the picker.\n- Pressing the \"Un-split\" button while holding shift will not focus the un-split tab, allowing you to stay in the current split view.\nFixes\n- Fixed private mode windows having dark text on dark background in the sidebar.\n- Fixed popup windows not showing at all on certain occasions.\n- Other bug fixes and performance improvements.\nTheme Changes\n- Removed the -zen-window-transform-origin CSS attribute as it is not needed anymore\nChanges\n- Bluring the window will no longer close the urlbar if its open.\n- Emojis at the space switcher will now be larger and more visible.","repo":{"author":"microsoft","repo":"winget-pkgs"},"usrVersion":"1.19b","version":0,"site":"https://zen-browser.app/","source":"Zen OSS Team","license_or_tos":"MPL-2.0","resources":null,"verified":false}